{
    "id": 2706,
    "shortName": "synbioethics",
    "name": "Engineering Life: Synbio, Bioethics & Public Policy",
    "language": "en",
    "shortDescription": "Learn about the ethics and policy issues that arise in the science and application of synthetic biology, from bioremediation to medicine. ",
    "aboutTheCourse": "<p>Synbio is a diverse field with diverse applications, and the different contexts (e.g., gain-of-function research, biofuels) raise different ethical and governance challenges.&nbsp;The objective\nof this course is to increase participants’ awareness and understanding of\nethical and policy\/governance issues that arise in the design, conduct and\napplication of synthetic biology. The course will begin with a short history of\nrecombinant DNA technology and how governance of that science developed and\nevolved, and progress through a series of areas of application of synbio.&nbsp;<\/p>\n\n<p>Content will\nbe presented in many forms, including not only reading and lectures, but also recorded\nand live interviews and discussions with scientists, ethicists and policy\nmakers. Learners will have the opportunity to think, write and talk about the\nissues and challenges in their own work and in real-life case examples. A final\nproject will engage students in the development of governance models for synbio.<\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<p>Optional Pre-work: Synthetic\nBiology Primer<\/p>\n\n<p>Week 1: History\nof Recombinant DNA<\/p>\n\n<p>Week 2: Gain-of-Function\nResearch<\/p>\n\n<p>Week 3: Biofuels<\/p>\n\n<p>Week 4: Environmental\nRemediation<\/p>\n\n<p>Week 5: Human\nHealth<\/p>\n\n<p>Week 6: Governance<\/p>",
    "estimatedClassWorkload": "2-4 hours\/week",
    "recommendedBackground": "<p>This course is\ntargeted to trainees and professionals in synthetic biology, though others\nfamiliar with the science may also find the course interesting, accessible and\nuseful. All materials are in English, so English reading and speaking\nproficiency is necessary.<\/p>",
    "links": {

    }
}