{
    "id": 327,
    "shortName": "composition",
    "name": "English Composition I",
    "language": "en",
    "shortDescription": "You will gain a foundation for college-level writing valuable for nearly any field. Students will learn how to read carefully, write effective arguments, understand the writing process, engage with others' ideas, cite accurately, and craft powerful prose. We will create a workshop environment. ",
    "aboutTheCourse": "<p>English Composition I provides an introduction to and foundation for the academic reading and writing characteristic of college. Attending explicitly to disciplinary context, you will learn to read critically, write effective arguments, understand the\n    writing process, and craft powerful prose that meets readers’ expectations. You will gain writing expertise by exploring an area or topic in which you would like to gain expertise (a hobby, trade, profession, discipline, etc.). Your major writing projects will be about your own selected topic and will be drafted and revised in sequenced stages: a visual analysis (600-800 words); a case study (1000-1250 words) and an Op-Ed (500-750 words). Your writing will be central to the course as we create a seminar\/workshop\n    structure with peer response and selected instructor feedback.&nbsp;<\/p>\n<p>Two overarching assumptions about academic writing will shape our work:&nbsp; 1) it is transferable; 2) it is learnable. Being an effective academic writer involves asking meaningful questions and engaging in complex dialogue with texts and ideas. These\n    skills are useful across virtually all academic disciplines and they provide a valuable means for making sense of non-academic experiences as well. Perhaps even more important, though, is that learning how to write effectively does not require inspiration\n    or genius, but hard work, reflection, and feedback. This means that, with practice, dedication, and working with others,<i> you<\/i> can be an effective academic writer and contribute your ideas to important, ongoing conversations. <br><\/p><p><span>**English Composition I has earned a <a href=\"https:\/\/d396qusza40orc.cloudfront.net\/composition%2Fquality%20matters%20certificate%5B2%5D.pdf\">Certificate of Recognition<\/a> from Quality Matters, a non-profit dedicated to quality in online education.**\n<\/span><br><\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<b>Foundational Writing Project: Reading Critically (Weeks 1 - 2)<\/b><br>How do we become experts? In the first week, you will prepare a brief \nfoundational writing exercise designed to help you build central skills \nfor the course. I will ask you to write a critical review of an article \nabout expertise. Specifically, we will focus on how to: <br><ul><li>read critically;<\/li><li>summarize, question, analyze, and evaluate written text;<\/li><li>engage with the work of others;<\/li><li>understand the stages of the writing process;<\/li><li>workshop writing;<\/li><li>incorporate reader feedback;<\/li><li>integrate quotes\/evidence;<\/li><li>cite the work of others.<br><\/li><\/ul><b>Project One: Visual Analysis (Weeks 2 - 5):<\/b><br>What can we learn about your topic from a visual image? What arguments do visual images make? I will ask you to select a visual image related to a chosen area of inquiry\/topic and then analyze that image in order to make an argument about your topic. Specifically, we will continue to work on the writing elements we learned from the critical review, as well as build on them by focusing on how to:<br><ul><li>summarize, question, analyze, and evaluate visual texts;<\/li><li>argue and support a position;<\/li><li>use evidence;<\/li><li>respond toward revision;<br><\/li><li>achieve cohesion;<\/li><li>develop paragraph unity;<\/li><li>revise; and<\/li><li>edit<\/li><\/ul><b>Project Two: Case Study (Weeks 3 - 6)<\/b><br>What questions or arguments can a case study reveal about your topic? I will ask you to research a particular person, event, entity, or concept&nbsp;in your selected topic and, drawing on multiple resources, make an argument about your topic through that case study.&nbsp;We'll also be working together to collaboratively crowdsource a bibliography of potential resources.&nbsp;&nbsp;Specifically, we will continue to work with the elements we learned from your critical review and Project 1, as well as build on them by focusing on how to: <br><ul><li>conduct research;<\/li><li>write an extended argument;<\/li><li>examine disciplinary expectations;<\/li><li>develop an intertextual conversation;<\/li><li>understand popular sources and scholarly sources;<\/li><li>craft effective titles;<br><\/li><li>create effective introductions; and<\/li><li>write strong conclusions.<\/li><\/ul><b>Project Three: Op-Ed (Weeks 6 - 9)<\/b><br>What do you think people need to know about your selected topic? In this third and final unit, we will turn to a more public form of writing as I ask you to write an op-ed (opposite the editorial page) about your selected topic for a publication of your choosing (you do not actually have to submit it to that publication). Specifically, we will continue to work with the elements we learned in the previous projects, as well as build on them by focusing on how to:<br><ul><li>write for publics;<\/li><li>write concisely;<\/li><li>edit and proofread thoroughly;<\/li><li>decide whether to use active or passive voice; and<\/li><li>transfer writing skills to new writing contexts.<\/li><\/ul><br>",
    "estimatedClassWorkload": "6-8 hours\/week",
    "recommendedBackground": "<p>Students should have basic English proficiency and exposure\nto secondary-level (high-school level) English or composition&nbsp;<\/p>",
    "links": {

    }
}