{
    "id": 642,
    "shortName": "teach6",
    "name": "Foundations of Teaching for Learning 6: Introduction to Student Assessment",
    "language": "en",
    "shortDescription": "At various points in the education cycle you will need to provide information which can be used to determine the extent to which your teaching is helping or has helped to achieve learning goals. This course prepares you to use assessment as part of the teaching and learning process.  ",
    "aboutTheCourse": "<span>You will consider various\ntechniques which help to assess student learning. The course also will help you\nto acquire the skills to develop and use appropriate assessment procedures.&nbsp;<br><\/span><br>This course is part of the\nFoundations of Teaching for Learning program which is designed to assist people\nwho are currently teaching but have had no formal teacher education improve\ntheir understanding of their role and work as a teacher.&nbsp;&nbsp;This set of courses will enhance your\nknowledge and understanding about learning and teaching and what makes a\nteacher a professional. &nbsp;<br>\n\n<p>Practical activities are provided to assist you in using what\nyou have learned to improve your teaching practice.&nbsp;&nbsp;While these are optional, it is\nstrongly recommended that you undertake them if at all possible.<\/p>\n\nOf particular importance is a guide to the development of a\nportfolio to help you organize and document your thinking about what you have\nlearned. In addition, you may be able to use the portfolio to access other\nopportunities in the future.<br><br><p><b>Announcement for US based teachers:<\/b><\/p>\n\n<p>Coursera and its\npartners are proud to offer eligible teachers&nbsp;in the US&nbsp;free Verified Certificates&nbsp;for\nthis course and other high-quality teacher professional development courses,\nthrough the ConnectED effort announced by President Obama.<\/p>\n\n<p>To\nparticipate in this opportunity,&nbsp;US&nbsp;district leaders simply need to\napprove Coursera teacher professional development by completing a brief form\nat:&nbsp;<a href=\"http:\/\/www.coursera.org\/tpd\" target=\"_blank\">www.coursera.org\/tpd<\/a><u>.<\/u><\/p>\n\n<p>US&nbsp;Teachers\ninterested in this opportunity are also encouraged to follow the link to learn\nmore and <a href=\"http:\/\/www.coursera.org\/tpd\" target=\"_blank\">www.coursera.org\/tpd<\/a><u>.<\/u><\/p>\n\n<p>Once a\ndistrict’s form has been verified, the district leader will be notified and\nteachers in the district will receive access to free verified certificates for\nCoursera professional development.<\/p>\n\n<p>Coursera and the\nCommonwealth Education Trust thank educators for the hard work they do every\nday and hope this opportunity will assist US teachers&nbsp;to continue\ndeveloping their craft in a meaningful and flexible way.<\/p>",
    "targetAudience": 0,
    "courseSyllabus": "In this course you will consider:<br><p><\/p><ul><li>concepts\nand types of assessment in teaching and learning: formal, informal, diagnostic,\nformative, and summative;<br><\/li><li>the nature of feedback\nin improving teaching and learning;<br><\/li><li>guidelines\nfor developing and using assessment procedures; and<br><\/li><li>reporting\nstudent achievement.  <br><\/li><\/ul><p><\/p>",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": "<p>This program is for\nanyone who is teaching, or who would like to teach, in any subject\nand any context - be it at school, at home or in the workplace. No prior\nknowledge of teaching is required. However we recommend that you take the\nintroductory course first.  <\/p>",
    "links": {

    }
}