{"id":30,"shortName":"calcsing","name":"Calculus: Single Variable","language":"en","previewLink":"https:\/\/class.coursera.org\/calcsing-005\/lecture\/preview","shortDescription":"This course provides a brisk, challenging, and dynamic treatment of differential and integral calculus, with an emphasis on conceptual understanding and applications to the engineering, physical, and social sciences.","aboutTheCourse":"<p>Calculus is one of the grandest achievements of human thought, explaining everything from planetary orbits to the optimal size of a city to the periodicity of a heartbeat. This brisk course covers the core ideas of single-variable Calculus with emphases\n    on conceptual understanding and applications. The course is ideal for students beginning in the engineering, physical, and social sciences. Distinguishing features of the course include:<\/p>\n<ul>\n    <li>the introduction and use of Taylor series and approximations from the beginning;\n    <\/li>\n    <li>a novel synthesis of discrete and continuous forms of Calculus;<\/li>\n    <li>an emphasis on the conceptual over the computational; and<\/li>\n    <li>a clear, dynamic, unified approach.<\/li>\n<\/ul>\n<br>THE COURSE CERTIFICATE OPTION\n<p>By signing up and paying a nominal fee (financial aid can be provided), you'll be eligible to earn a Course Certificate in this course, including a higher level of identity verification to your Coursera coursework. For each assignment, your identity is confirmed through your photo and unique typing pattern. If you earn a Course Certificate, you will also be given a\n    personal URL through which your course records can be shared with employers and educational institutions.<\/p>\n<br>THE COLLEGE CREDIT RECOMMENDATION OPTION\n<p>Note: The following only applies to sessions starting on September 8th, 2014, and prior. This Calculus course has been evaluated and recommended by the American Council on Education’s College Credit Recommendation Service (ACE CREDIT) for college credit so you can get a head start on your college education. More than 2,000 higher education institutions consider ACE credit recommendations for transfer to degree programs. If you add this option to sessions starting on or prior to September 8th, 2014, towards the end of the course, you will take an online proctored exam which will be combined with your coursework to determine your eligibility for college credit recommendation.<\/p>","targetAudience":0,"courseSyllabus":"The course is divided into five \"chapters\":\n<br>\n<br><b>CHAPTER 1: Functions<\/b>\n\n<br>After a brief review of the basics, we will dive into Taylor series as a way of working with and approximating complicated functions. The chapter will use a series-based approach to understanding limits and asymptotics.\n<br>\n<br><b>CHAPTER 2: Differentiation<\/b>\n\n<br>Though you already know how to differentiate some functions, you may not know what differentiation means. This chapter will emphasize conceptual understanding and applications of derivatives.\n<br>\n<br><b>CHAPTER 3: Integration<\/b>\n\n<br>We will use the indefinite integral (an anti-derivative) as a motivation to look at differential equations in applications ranging from population models to linguistics to coupled oscillators. Techniques of integration up to and including computer-assisted\nmethods will lead to Riemann sums and the definite integral.\n<br>\n<br><b>CHAPTER 4: Applications<\/b>\n\n<br>We will get busy in this chapter with applications of the definite integral to problems in geometry, physics, economics, biology, probability,&nbsp;and more. You will learn how to solve a wide array of problems using a consistent conceptual approach.\n<br>\n<br><b>CHAPTER 5: Discretization<\/b>\n\n<br>Having covered Calculus for functions with a single real input and a single real output, we turn to functions with a <i>discrete<\/i> input and a real output: sequences. We will re-develop all of Calculus (limits, derivatives, integrals, differential equations)\nin this new context, and return to the beginning of the course with a deeper consideration of Taylor series.\n<br>","courseFormat":"The class will consist of nearly 60 animated&nbsp;lecture videos, each about 15 minutes in length. The schedule will be approximately 5 quarter-hour lectures per week over 13 weeks. Occasional \"bonus\" lectures will provide more advanced or off-the-syllabus\nperspectives. You will get to practice your skills with lots of homework problems. These will not count towards your grade for the course, but, because of this, there will be open forums for discussing how to solve the homework problems.&nbsp;Grading\nwill be based on graded chapter quizzes (5),&nbsp;and a final exam.","suggestedReadings":"There is a fun picture-book available that gives the main ideas of the course:\n<br>\n<br>R. Ghrist [2012],\n<a href=\"http:\/\/books.google.com\/books?id=HbbeRHUozJcC&amp;printsec=frontcover#v=onepage&amp;q&amp;f=false\">FLCT: the Funny Little Calculus Text<\/a>\n\n<br>\n<br>You can preview the entire book for free or download a copy&nbsp;through&nbsp;\n<a href=\"https:\/\/play.google.com\/store\/books\/details?id=HbbeRHUozJcC\">google play<\/a>. This is a supplemental text only and is not required for the course...but it might make you laugh.","instructor":"Robert Ghrist","estimatedClassWorkload":"10-12 hours\/week","recommendedBackground":"<p>Students are expected to have prior exposure to Calculus at the high-school (e.g., AP Calculus AB)&nbsp;level. It will be assumed that students:<\/p>\n<ul>\n    <li>are familiar with transcendental functions (exp, ln, sin, cos, tan, etc.);<\/li>\n    <li>are able to compute very simple limits, derivatives, and integrals;<\/li>\n    <li>have seen slope and area interpretations of derivatives and integrals respectively.\n    <\/li>\n<\/ul>\n<p>This material will be reviewed; however, it is important to begin the course with some background. A diagnostic exam will be made available to help you gauge your preparedness.&nbsp;<\/p>\n<p>The course will serve equally well as a first university-level course in Calculus or as a review from a novel perspective.<\/p>\n<p>If you've never seen Calculus before, this is likely not the course for you. Please see, e.g., the more introductory course from Ohio State University:&nbsp;\n    <a href=\"https:\/\/www.coursera.org\/course\/calc1\">https:\/\/www.coursera.org\/course\/calc1<\/a>\n<\/p>\n<p>If you are looking for the background needed to begin a study of Calculus, please see, e.g., the pre-Calculus course by UC Irvine:&nbsp;<a href=\"https:\/\/www.coursera.org\/course\/precalculus\">https:\/\/www.coursera.org\/course\/precalculus<\/a>\n<\/p>","links":{}}