{
    "id": 1080,
    "shortName": "latinmigration",
    "name": "Latin American Migration",
    "language": "en",
    "shortDescription": "This course is about the historical, sociocultural, and economic causes of Latin American migration, and the economic, political, and cultural impact that the Latino\/a population has in the physiognomy of this country. It situates the Latin American migration in the global scenario and the Latino\/a population in the national arena.",
    "aboutTheCourse": "This six-week-long graduate level course is targeted primarily to in-service teachers in US schools. Its main purpose is to give P-12 teachers opportunities to develop new knowledge and understanding of Latin America in the context of migration, and of the historical, sociocultural, and economic forces that cause Latin Americans to leave home for the United States.&nbsp;Six specialists from several disciplines will discuss these topics from different perspectives.<span><br><br>Students will develop strategies to enhance the educational experience of their students by incorporating content and new insights on Latin America into their teaching.<br><\/span><br><br><br>All lectures and instructional materials developed for this course by the Ohio State University are licensed under the Creative Commons AttributionNonCommercial-ShareAlike 4.0 International License. To view a copy of this license, visit&nbsp;<a href=\"http:\/\/creativecommons.org\/licenses\/by-nc-sa\/4.0\/\">http:\/\/creativecommons.org\/licenses\/by-nc-sa\/4.0\/<\/a><br>",
    "targetAudience": 1,
    "courseSyllabus": "<span><b>Week One: Transnational Migration and Global Diasporas<\/b><br><i><\/i><i>Instructor - Abril Trigo<\/i><\/span><span><br><b>Week Two: US Immigration Policies and Latin American Immigration<\/b><br><i>Instructor - <\/i><\/span><i>Lilia Fernández<\/i><br><b>Week Three: Contemporary Latin American Migration<\/b>\n<br><i>Instructor - Jeff Cohen<\/i><br><b>Week Four: Latino\/a Cultures in the USA <\/b>\n<br><i>Instructor - Frederick Aldama<\/i><br><b>Week Five: Immigrant Health<\/b>\n<br><i>Instructor - Reanne Frank<\/i><br><b>Week Six: <\/b><b>Language and Literacy: Multilingualism and Education <\/b>\n<br><i>Instructor - Marcia Farr<\/i>",
    "estimatedClassWorkload": "3-6 hours\/week",
    "recommendedBackground": "<span>There are no prerequisites to taking this course. All you need is an interest in the subject and a commitment to engage in all instructional activities.<\/span><br>",
    "links": {}
}