{"id":433,"shortName":"pcd","name":"Programmed cell death","language":"en","shortDescription":"Billions of cells in the body die every day. How and why do these cells die? If you want to know the answers to these questions and if you also would like to know how scientists figured them out, this course might interest you.","aboutTheCourse":"<p>In this\ncourse, you will learn about the conserved, molecular machinery that eliminates\ncells through programmed cell death type I, also referred to as ‘apoptosis’.\nThrough apoptosis many cells are eliminated from our body during development\nand throughout adult life, and deregulated apoptosis can lead to various\ndiseases such as cancer and auto-immune diseases. Rather than just telling you\nabout the molecular machinery of apoptosis and how it works to kill cells, I\nwill walk you through and discuss with you the critical experiments that led to\nthe discovery of the key components of this molecular machinery and the\nmechanisms through which they function.&nbsp;I will also\ndiscuss how apoptosis research can help to develop novel&nbsp;therapeutics\nand consider the questions that remain open in\nthe field.<\/p><p>The course\nwill cover the following topics:<\/p>\n\n<p>1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nIntroduction\nto programmed cell death and apoptosis<\/p>\n\n<p>2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nThe\nBCL-2 family of proteins<\/p>\n\n<p>3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nApaf\nproteins<\/p>\n\n<p>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nCaspases<\/p>\n\n<p>5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nMechanisms\nthat regulate apoptosis<\/p>\n\n<p>6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nNon-apoptotic\nfunctions of components of the central apoptosis machinery<\/p>\n\n<p>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nDiseases\ncaused by deregulated apoptosis<\/p>","targetAudience":1,"courseSyllabus":"","courseFormat":"This course will consist of weekly video lectures, which will contain 2-3 integrated quiz questions per video. At the conclusion of every second week, there will be a graded quiz on the course material:<br><br>- Week 2: Quiz on Weeks 1 and 2 (30%)<br>- Week 4: Quiz on Weeks 3 and 4&nbsp;(30%)<br>- Week 6: Cumulative exam covering all material (40%)","suggestedReadings":"","instructor":"Barbara Conradt","estimatedClassWorkload":"2-4 hours\/week","recommendedBackground":"A basic understanding of genetics and molecular\nand cell biology would be advantageous.<br>","links":{}}