{"id":1081,"shortName":"virtualassessment","name":"Performance Assessment in the Virtual Classroom","language":"en","shortDescription":"Performance and Assessment in the Virtual Classroom explores the myths and challenges of assessing performance virtually. Topics include effective measures of assessing students, compliance issues, feedback models for students, online gradebook functions, and data analysis.","aboutTheCourse":"<p>Effective measures of performance and assessment are a crucial\ncomponent of any virtual program. Teachers and administrators must\nunderstand both the myths and challenges of assessing performance virtually,\nadministering standardized testing with geographical challenges, and complying\nwith state and local requirements to make sure students are meeting\nrequirements. This course will discuss student performance in a virtual\nclassroom, formats of virtual assessments, assessing special populations,\nincluding at-risk, gifted, and special needs students, data analysis of virtual\ncourse gradebooks, and learning management systems as related to performance\nand assessment. <\/p>\n\n<p>This course will enable teachers to see the importance of\ncommunication and organization in managing virtual caseloads, and monitoring\nstudent learning remotely through the effective use of learning management\nsystem features. Students will also create virtual instructional feedback tools\nfor students assessment and learn the important competencies needed to be an\nexcellent virtual teacher. <\/p>","targetAudience":1,"courseSyllabus":"This course is made up of five modules (see below). All modules will be available at the start of the course.&nbsp;<b><br>Module 1:<\/b> Importance of Performance and Assessment in the Virtual Classroom<br><b>Module 2: <\/b>Assessing Students Virtually, Academic Integrity, and Administering High Stakes Testing at a Distance<br><b>Module 3:<\/b> Data Analysis and Gradebook Management in the Virtual Classroom<br><strong>Module 4:<\/strong> Performance and Assessment for Special Populations: Gifted, At-Risk, and Special Needs Students<br><b>Module 5<\/b>: Instructional Feedback, Monitoring Performance and Assessment Using Technology","courseFormat":"This class will consist of short weekly lecture videos (with embedded quiz questions), totaling 1 to 2 hours of viewing. There will also be weekly quizzes (4 total), 1 assignment, and a final exam.","suggestedReadings":"","estimatedClassWorkload":"2-4 hours\/week","recommendedBackground":"<p>The course is primarily for:<\/p><ul><li>Teachers working with children ages 5 - 18<\/li><li>Faculty working with further education, community college, or vocational students<\/li><li>Continuing education or in-service facilitators supporting teachers and faculty<\/li><li>Educators interested in educational technology and\/or online instruction<\/li><li>Please note that although this program is offered to participants from around the world, many of the examples and experiences shared will be based on the education structure and processes of the United States. Participants will be encouraged to discuss their own country-based experiences in the forums. <\/li><\/ul>","links":{}}