{
    "id": 114,
    "shortName": "criticalthinking",
    "name": "Critical Thinking in Global Challenges",
    "language": "en",
    "shortDescription": "In this course you will develop and enhance your ability to think critically, assess information and develop reasoned arguments in the context of the global challenges facing society today.",
    "aboutTheCourse": "Critical thinking is the ability to gather and assess information and evidence in a balanced and reflective way to reach conclusions that are justified by reasoned argument based on the available evidence. Critical thinking is a key skill in the information age, valuable in all disciplines and professions. <br><br> This introductory course will give you the opportunity to better understand what critical thinking is, and to practice and enhance your critical thinking skills. To do so, we will use the context of some important global challenges that affect us all, and to which we have no clear “correct” solutions: for example, the risk and spread of serious infectious diseases in epidemics in modern societies, the implications of increasing human population on global resources, energy, environment and climate, and the challenges of human health and wellbeing in the modern world. Possible solutions to global issues such as these are hotly debated, and give the perfect setting to practice recognizing and evaluating facts, ideas, opinions and arguments. <br><br> The relevant background information for each global challenge will be provided to ensure that you can complete the exercises. Note, however, this course is not a course on these global challenges themselves; instead it uses the context of these thought-provoking challenges to practice critical thinking.<br><br><b>Subtitles for all video lectures available<\/b>:&nbsp;Portuguese (provided by the&nbsp;<a href=\"http:\/\/www.fundacaolemann.org.br\/\" target=\"_blank\">Lemann Foundation<\/a>), English<br>",
    "targetAudience": 0,
    "courseSyllabus": "<ul>\n<li>Week 1: What is Critical thinking, and why is it important?<\/li>\n<li>Week 2: ‘Credibility and Relevance’: Understanding where information comes from and the nature of evidence<\/li>\n<li>Week 3: ‘Assessing arguments’ 1\/2&nbsp;<\/li>\n<li>Week 4: ‘Assessing arguments’ 2\/2&nbsp;<\/li>\n<li>Week 5: Developing arguments<\/li>\n<\/ul>\nThe course will provide ‘Global Challenge’ themes for students to work on for the purpose of ‘Assessing arguments’ in weeks 3 &amp; 4. We recommend that students normally select only one of the themes to focus on.",
    "estimatedClassWorkload": "1-2 hours\/week",
    "recommendedBackground": "There is no prerequisite to take this course. No prior knowledge in the four ‘Global challenge’ themes is required.",
    "links": {

    }
}