{
    "id": 147,
    "shortName": "organalysis",
    "name": "Organizational Analysis (Self-Paced)",
    "language": "en",
    "shortDescription": "In this introductory, self-paced course, you will learn multiple theories of organizational behavior and apply them to actual cases of organizational change. ",
    "aboutTheCourse": "<strong>Best MBA Mooc in 2013 as per review in the <\/strong><a href=\"http:\/\/www.ft.com\/cms\/s\/0\/2bfeed6a-5cf0-11e3-a558-00144feabdc0.html#axzz3DWCPIZwt\" target=\"_blank\"><strong>Financial Times<\/strong><\/a><strong>!&nbsp;\"The best [MBA Mooc] was Organizational Analysis taught by Stanford's Dan McFarland\" - Philip D. Broughton MBA<\/strong><br><br><br>It is hard to imagine living in modern society without participating in or interacting with organizations. The ubiquity and variability of organizations means there is ample room for complexity and confusion in the organizational challenges we regularly\nface. Through this course, students will consider cases describing various organizational struggles: school systems and politicians attempting to implement education reforms; government administrators dealing with an international crisis; technology firms\ntrying to create a company ethos that sustains worker commitment; and even two universities trying to gain international standing by performing a merger.\n<br>\n<br>Each case is full of details and complexity. So how do we make sense of organizations and the challenges they face, let alone develop means of managing them in desired directions? While every detail can matter, some matter more than others. This is why\nwe rely on organizational theories -- to focus our attention and draw out relevant features in a sensible way.\n<br>\n<br>Through this self-paced course you will come to see that there is nothing more practical than a good theory. In every module, you’ll learn a different organizational theory, and it will become a lens through which you can interpret concrete organizational situations.\nArmed with a toolset of theories, you will then be able to systematically identify important features of an organization and the events transforming it – and use the theories to predict which actions will best redirect the organization in a desired direction.<br><br>Join your future classmates and course alumni on&nbsp;<a href=\"https:\/\/www.facebook.com\/groups\/219602578167354\/\" target=\"_blank\">Facebook<\/a>!<br><br>",
    "targetAudience": 0,
    "courseSyllabus": "<strong>Module 1<\/strong>: Introduction\n<br><strong>Module 2<\/strong>: Decisions by rational and rule-based procedures\n<br><strong>Module 3<\/strong>: Decisions by dominant coalitions\n<br><strong>Module 4<\/strong>: Decisions in organized anarchies\n<br><strong>Module 5<\/strong>: Developing organizational learning and intelligence\n<br><strong>Module 6<\/strong>: Developing an organizational culture\n<br><strong>Module 7<\/strong>: Managing resource dependencies\n<br><strong>Module 8<\/strong>: Network forms of organization\n<br><strong>Module 9<\/strong>: Institutions and organizational legitimacy\n<br><strong>Module 10<\/strong>: Summary<br>",
    "estimatedClassWorkload": "",
    "recommendedBackground": "None; all are welcome.",
    "links": {

    }
}