{"id":2613,"shortName":"appliedregression","name":"Applied Regression Analysis","language":"en","shortDescription":"Regression modeling is the standard method for analysis of continuous\nresponse data. This course provides theoretical and practical training in statistical\nmodeling with particular emphasis on linear and multiple regression.","aboutTheCourse":"Statistical modeling is a fundamental element of analysis for statisticians, epidemiologists, biostatisticians and other professionals of related disciplines. People in the health sciences profession rely on regression modeling to gain insight on make decisions based on a continuous flow of response data.<br><br>Focusing on linear and multiple regression, this course will provide theoretical and practical training&nbsp;in statistical modeling.<br><br>This is a hands-on, applied course where students will become proficient at using computer software to analyze data drawn primarily from the fields of medicine, epidemiology and public health.<br><br>There will be many practical examples and homework exercises in this class to help you learn.&nbsp;If you fully apply yourself in this course and complete all of the homework, you will have the opportunity to master methods of statistical modeling when the response variable is continuous and you will become a confident user of the Stata* package for computing linear, polynomial and multiple\nregression.<br><br>*Access to Stata will be provided at no cost for the duration of this course.<br><br>\n<hr>\n<img src=\"https:\/\/d396qusza40orc.cloudfront.net\/appliedregression\/CVV-logo-1.png\" style=\"float:middle\" alt=\"Centre Virchow-Villermé logo\"><br><br>This course was developed in partnership with the <a href=\"http:\/\/virchowvillerme.eu\/\" target=\"_blank\">Centre Virchow-Villermé for Public Health Paris-Berlin<\/a>, a bi-national centre of the <a href=\"http:\/\/www.sorbonne-paris-cite.fr\/\" target=\"_blank\">Université Sorbonne Paris Cité<\/a> and <a href=\"http:\/\/www.charite.de\/en\/charite\/\" target=\"_blank\">Charité – Universitätsmedizin Berlin<\/a>. Special support was contributed from the <a href=\"https:\/\/www.univ-paris5.fr\/eng\" target=\"_blank\">Université Paris Descartes<\/a> that also belongs to the community of Université Sorbonne Paris Cité.<p><\/p><p><br><\/p><p><br><\/p>","targetAudience":1,"courseSyllabus":"<div><strong>Week One<\/strong><br><ul><li>Review of basic statistical concepts<\/li><li>Regression and correlation<br><\/li><\/ul><\/div><div><strong>Week Two<\/strong><br><ul><li>Linear regression<\/li><li>Assumptions for linear regression<br><\/li><li>Hypothesis test and confidence intervals for model parameters<\/li><\/ul><\/div><div><strong>Week Three<\/strong><br><ul><li>The correlation coefficient<\/li><li>The ANOVA table for straight line regression<\/li><\/ul><\/div><div><strong>Week Four<\/strong><br><ul><li>Polynomial regression<\/li><\/ul><\/div><div><strong>Week Five<\/strong><br><ul><li>Multiple regression<\/li><li>The partial F-test<\/li><\/ul><strong>Week Six<\/strong><br><ul><li>Dummy (or indicator) variables<\/li><li>Statistical interaction<\/li><li>Comparing two straight line regression equations<\/li><\/ul><\/div>","courseFormat":"<div>The class will consist of lecture videos, quiz questions and homework exercises.<br><br><\/div><div>The homework exercises are ungraded and students are expected to complete them using the statistical package Stata&nbsp;(Available to all course students during&nbsp;the six week period of this course).&nbsp;<br><br>Solutions to all homework problems will be provided to help students with the necessary Stata commands. (This process will be carefully explained in the course)<\/div><div><br>Discussion boards will be used in this class for conversation with your peers, the faculty and the course team.<\/div><div><br>The course slides will be provided to all students. If printed, these slides would serve as the course textbook and could serve as a useful reference for the future.<\/div>","suggestedReadings":"All core materials for this course will be provided within the course at no cost to the student.<br><br>Although this course is designed to be self-contained, you may supplement your learning experience in this course by purchasing this optional and excellent textbook – <a href=\"http:\/\/www.amazon.com\/Applied-Regression-Analysis-Multivariable-Methods\/dp\/0495384968\" target=\"_blank\">Applied Regression Analysis and Multivariable Methods (4th Edition)<\/a> by Kleinbaum, Kupper, Muller, and Nizam<br><br><br><br>","estimatedClassWorkload":"1-5 hours\/week","recommendedBackground":"<p>Students interested in this course should have taken a solid introductory statistical methods course. While not absolutely necessary, familiarity with some statistical software package (such as SPSS, SAS or R) would definitely be an advantage.&nbsp;<\/p><p>We will be making exclusive use of Stata for the course lectures and homework solutions. However, students who are proficient in other packages could use those packages in place of Stata.&nbsp;<\/p><p>Based on past experience we strongly encourage students to use Stata for this course as it will facilitate communications with the professor, the teaching assistants, as well as other students in the course.<\/p>","links":{}}