{"id":223,"shortName":"linearopt","name":"Linear and Discrete Optimization","language":"en","previewLink":"https:\/\/class.coursera.org\/linearopt-002\/lecture\/preview","shortDescription":"The course is an introduction to linear and discrete optimization - an important part of computational mathematics with a wide range of applications in many areas of everyday life.","aboutTheCourse":"This\n course serves as an introduction to linear and discrete \noptimization from the viewpoint of a mathematician or computer \nscientist.  Besides learning how linear and discrete optimization can be applied, we focus on \nunderstanding methods that solve linear programs and discrete optimization problems in a mathematically \nrigorous way. <br><br>We will answer  questions like:<br><br><ul><li>Does a particular method work correctly?<\/li><li>Does it terminate and, if yes, in what time?<\/li><li>Can we prove that a solution is optimal?<\/li><\/ul>The\n course starts by discussing what a linear program is and how linear programming can be \napplied. Then, we will treat the simplex method and the theory of \nduality. We will then discuss some combinatorial optimization problems like maximum weight bipartite matching and maximum flows. <br><br>The\n course constitutes about half of the material on linear and discrete optimization \nthat is taught for mathematics and computer science undergraduates at \nEPFL and will feature video lectures, quizzes, programming assignments, \nand a final exam. <br>","targetAudience":1,"courseSyllabus":"<ul><li>Linear programming, modeling, equivalence of standard forms <\/li><li>Basic solutions, primal and dual feasible basic solutions, pivoting and the simplex method<\/li><li>Termination and complexity of the simplex method <\/li><li>Integer programming, bipartite matching and flows<\/li><li>Models of computation, bit-complexity<\/li><\/ul><br>","courseFormat":"The\n class consists of lecture videos punctuated by quizzes. There will \nalso be standalone homeworks that are not part of the video lectures, programming assignments, and a final exam.<br>","suggestedReadings":"Although\n the course is self-contained and  the lecture notes will be available on-line, it will be useful to consult further literature. There are many \nexcellent texts on discrete optimization. Among our favorites are the \nbooks <a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=linearopt&isbn_ean=9781886529199\">Introduction to Linear Optimization<\/a> by Bertsimas and Tsitsiklis, <a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=linearopt&isbn_ean=9783540306979\">Understanding and Using Linear Programming<\/a>, by Matousek and Gärtner, and <a href=\"http:\/\/www.wiley-vch.de\/publish\/dt\/books\/bySubjectMA00\/ISBN0-471-98232-6\">Theory of Linear and Integer Programming<\/a>  by Schrijver.<br>","instructor":"Friedrich Eisenbrand","estimatedClassWorkload":"3-6 hours\/week","recommendedBackground":"The\n most important prerequisite is familiarity with linear algebra. It will\n be useful to have some programming proficiency in a higher level \nprogramming language such as Java or Python. <br>","links":{}}