{
    "id": 2988,
    "shortName": "gbv",
    "name": "Confronting Gender Based Violence: Global Lessons with Case Studies from India",
    "language": "en",
    "shortDescription": "This course introduces participants from the health care sector to gender based violence (GBV), including global epidemiology of GBV, health outcomes, seminal research, policy and ethical guidelines, and clinical best practices for GBV prevention, support and management.",
    "aboutTheCourse": "<p>This course is planned to be the first of several focusing on gender based violence. We will provide a core curriculum and then, given the wide variability in local circumstances among countries, both in regard to the organization of their health systems and the availability of resources to deliver the recommended interventions, contextualize that content to specific geographical regions of the world. This first offering provides a case study on India and is guided towards participants working in the health care sector.&nbsp; A core curriculum introduces a global perspective on gender based violence (GBV), including global epidemiology of GBV, health outcomes, relevant research, policy and ethical guidelines, and clinical best practices for GBV prevention, support and management, including review of the new World Health Organization guidelines on responding to violence with Dr. Claudia García-Moreno.&nbsp; Our colleagues who work in India, Dr. Bushra Sabri, Prof. Anuradha Kapoor, Dr. Ravi Verma, Dr. Anita Raj and Dr. Suneeta Krishnan, and Padma Bhate-Deosthali will provide expertise around these issues in the context of India. &nbsp;<\/p>\n<p><b>Instructors<\/b>\n<\/p><ul>\n<li>Course Director: Michele Decker, ScD, MPH, Johns Hopkins University\n<\/li><li>Content provided by leading global experts in the field.\n<\/li><\/ul>\n<p>This is an in-depth course with 2 components: \n<\/p><ol><li><b>Core curriculum<\/b> focused on introduction to gender based violence (GBV) from a global perspective, with competencies for social workers, physicians, nurses, midwives, community health workers, counselors and other health care workers and an emphasis on ensuring a strong health sector response to GBV.<\/li>\n<li><b>India-specific curriculum<\/b> addressed by India GBV experts in prevention and the health care response.<\/li><\/ol>\n<p><b>The core curriculum<\/b> outlines existing data on the global epidemiology of leading forms of GBV and the evidence linking GBV to poor health, with a focus on sexual\/reproductive health including HIV. &nbsp;You will learn the state of the science for integrating GBV response within the health sector, including screening, its challenges, strategies, and guidelines for implementation in a wide range of health delivery settings. &nbsp;You will learn the components of a comprehensive clinical assessment, treatment and management of a GBV survivor. We will also discuss strategies for psychosocial support and safety planning. &nbsp;In addition, we will provide a review of the challenges, ethics and best practices in GBV-related research as well as&nbsp;of the policy context of GBV including laws and practices that enable (or undermine) access to justice for survivors. &nbsp;&nbsp; This course will provide a strong grounding in both&nbsp;epidemiology and clinical application of current evidence on GBV to allow participants to develop an evidence-based\nresponse to GBV in their local communities and clinic settings.&nbsp;\n<\/p><p><b>The India case study will provide context-specific curriculum<\/b> to showcase the context of GBV, and the innovation and GBV response in this setting:&nbsp;PadmaBhate-Deosthali will describe the work of Dilaasa, an innovative a hospital-based crisis response program; Dr. Bushra Sabri will provide an in-depth discussion on policy and social contextual influences in India; Prof. Anuradha Kapoor will describe the community response to violence; Dr. Anita Raj will discuss child marriage; Dr. Suneeta Krishnan discusses integration of violence response within primary care, &nbsp;and Dr. Ravi Verma will describe strategies to engage men and boys in GBV prevention.\n<\/p><p>With additional optional material, you can learn more about specific GBV topics, cutting edge research, and unique populations impacted by GBV including adolescents, women who trade sex or are trafficked for exploitation, and those in humanitarian\/conflict settings.<\/p><p><br><\/p>\nDeveloped in collaboration with <a href=\"http:\/\/www.jhsph.edu\/offices-and-services\/center-for-teaching-and-learning\/our-services\/open-education-lab\/index.html\">Johns Hopkins Open Education Lab<\/a>.",
    "targetAudience": 1,
    "courseSyllabus": "<p>After taking the course, students will be able to:<\/p>\n<ol>\n <li>Describe the global epidemiology of leading forms of GBV and the evidence linking GBV to poor health.<\/li>\n<li>Articulate the challenges, strategies, and WHO guidelines for integrating GBV response within the health sector.<\/li>\n<li>Describe the components of a comprehensive clinical assessment, treatment and management of a GBV survivor.<\/li>\n<li>Describe the appropriate psychosocial support and management of a GBV survivor.<\/li>\n <li>Articulate the necessary ethical protections for GBV-related research.<\/li>\n <li>Consider both the policy and practical context of GBV in a given community.<\/li>\n<\/ol>\n<p><b>Module&nbsp;1– Epidemiology and Health Impact<\/b><\/p>\n<p>GBV comes in a variety of forms, each with health consequences for the survivor. &nbsp;An understanding of these issues helps inform a comprehensive and multisectorial response in preventing and responding to GBV. &nbsp;A case study will provide an in-depth view of these issues in India.<\/p>\n<p><b>Module&nbsp;2 – Integrating GBV in the health sector: Screening &amp; Support<\/b><\/p>\n<p>Recognition of the health impact of GBV has led to calls to address GBV within the health sector. &nbsp;What is the evidence? What are international best practices? &nbsp;What challenges must be addressed to sustain a GBV response in clinical settings?&nbsp; Case study provides an in-depth look at the implementation of a hospital-based intervention program in India.<\/p>\n<p><b>Module&nbsp;3 – Clinical Care for GBV Survivors<\/b><\/p>\n<p>Caring for GBV survivors requires patient-centered, compassionate, confidential and non-discriminatory clinical assessment. &nbsp;Competent medical and forensic examination along with appropriate documentation is essential.<\/p>\n<p><b>Module&nbsp;4 – Psychosocial Support for GBV Survivors<\/b><\/p>\n<p>Support for GBV survivors extends beyond clinical exam and assessment. &nbsp;Safety planning, harm reduction and access to psychosocial or mental health support must be established. &nbsp;Case study describes a promising approach for community-based prevention and support in India.<\/p>\n<p><b>Module 5 – Research, Policy, Practice and Prevention<\/b><\/p>\n<p>GBV research has unique challenges. &nbsp;Ethical considerations are inherent. &nbsp;&nbsp;Policy plays a role in both practice and prevention. &nbsp;What community-based strategies exist for GBV prevention and intervention, and what evidence exists to support these?<\/p>\n<p><b>Supplemental Case Studies:<\/b>\n<\/p><p>In this section, special populations and programs are highlighted.&nbsp; These include violence in humanitarian settings, adolescents, sex workers, and human trafficking.&nbsp; Child marriage in India and an integrated GBV\/HIV intervention program in Uganda will be examined.&nbsp; We’ll highlight the work from the innovative Pigs for Peace program in Democratic Republic of Congo, and the CEHAT Dilaasa Crisis Centre of Mumbai, India.<\/p>",
    "estimatedClassWorkload": "2-4 hours\/week",
    "recommendedBackground": "This course is appropriate for medical and public health practitioners, policy-makers, and researchers who want to better address GBV in their patient and client populations, who need to understand more about GBV and its health impact, and who suspect their patient populations may have need for GBV related services.  A case study will describe the unique challenges and strategies for harm reduction for Indian women.",
    "links": {

    }
}