{"id":1344,"shortName":"mecanique2","name":"Mécanique II","language":"fr","shortDescription":"À l’École Polytechnique Fédérale de Lausanne, un cours de physique générale fait partie de la formation de tous les futurs ingénieurs et scientifiques. Le présent cours de mécanique en fait partie. Il a pour but de leur apprendre à transcrire sous forme mathématique un phénomène physique, afin de pouvoir en formuler une analyse raisonnée.","aboutTheCourse":"<p>La mécanique classique est l’un\ndes piliers d’une formation polytechnique car elle permet de développer un\nsavoir-faire en traitant une variété de problèmes du point matériel et du\nsolide indéformable. On aborde les sujets classiques de la mécanique, comme le\nphénomène de résonance, la balistique, le mouvement des planètes autour du\nSoleil, et les effets associés aux référentiels accélérés. On cherche à\ndévelopper l’habitude de discerner&nbsp; les\nlimites des modèles&nbsp; qu’on utilise. Dans\ncet esprit, on examinera aussi quels étaient les problèmes conceptuels qui ont\nconduit à la théorie de la relativité restreinte.<\/p>\n\n<p>L’accent sera mis sur la\nméthodologie&nbsp;: l’étudiant apprendra à traiter rigoureusement un problème\ndonné, en choisissant judicieusement repère et référentiel et en appliquant la\nou les lois physiques adéquates afin d’obtenir les équations du mouvement.\nPuis, il sera amené à discuter ces équations afin d’en tirer une solution\nqualitative et\/ou quantitative.<\/p><p>Afin de permettre à l'étudiant de choisir de suivre l'intégralité du cursus de mécanique, ou de se concentrer uniquement sur une partie de la matière, le cours de mécanique est divisé en deux parties consécutives. La <b>première<\/b>\n (<a href=\"https:\/\/www.coursera.org\/course\/mecanique\" target=\"_blank\">Mécanique I<\/a>) couvre la mécanique newtonienne du point matériel, depuis\n la description de la cinématique du point matériel jusqu'à celle des \nréférentiels accélérés. La <b>seconde<\/b> (Mécanique II) traite de la dynamique du solide indéformable, la méthode de Lagrange ainsi que de la relativité restreinte. De plus, grâce à une collaboration avec l'Ecole Nationale Supérieure Polytechnique (ENSP) de Yaoundé, Cameroun, le formalisme des torseurs sera introduit par deux leçons facultatives et illustré en complément des leçons de dynamique du solide. La première partie du cours est à considérer comme prérequis.&nbsp;<br><\/p><p>\n\n<\/p><br>","targetAudience":0,"courseSyllabus":"Cette <b>seconde partie<\/b> du cours de mécanique utilisera les bases de la mécanique newtonienne du point matériel vu lors de la première partie, et couvrira la dynamique du solide indéformable. les principes fondamentaux de la relativité restreinte et le formalisme lagrangien.\nElle contient les 14 dernières &nbsp;leçons&nbsp;(dont 2 facultatives, sur les torseurs) couvrant la matière suivante :\n<br><ol><\/ol><ul><li>17. Systèmes de points matériels. Fusée.<br><\/li><li>17A. Torseurs : définitions (facultatif)<\/li><li>17b. Torseurs en mécanique&nbsp;(facultatif)<\/li><li>18. Cinématique du solide. Mouvement particuliers des solides.<br><\/li><li>19. Dynamique du solide. Point de référence du moment cinétique.<br><\/li><li>20. Solide avec un axe fixe. moments d’inertie.<br><\/li><li>21. Équations d’Euler. Effets gyroscopiques.<br><\/li><li>22. Principe de relativité. Simultanéité.<br><\/li><li>23. Cinématique relativiste. Transformation de Lorentz.<br><\/li><li>24. Aperçu de dynamique relativiste. Le photon.<br><\/li><li>25. Méthode de Lagrange. Applications.<br><\/li><li>26. Symétries et conservations. Principe de moindre action.<br><\/li><li>27. Systèmes vibratoires discrets, linéaires. Pendules couplés.<br><\/li><li>28. Résonance paramétrique. Pendule paramétrique.<br><\/li><\/ul><ol><\/ol><ol><\/ol><ol><\/ol><ol><\/ol><ol><\/ol><ol><\/ol><ol><\/ol><ol><\/ol><ol><\/ol><ol><\/ol><ol><\/ol>","courseFormat":"La seconde partie du cours de mécanique contient 12 leçons plus 2 facultatives introduisant le formalisme des torseurs. Chaque leçon est structurée en\nplusieurs modules. Le premier module comprend une vidéo d’une dizaine de\nminutes exposant les principes physiques fondamentaux et les \ndéfinitions. Le second module comprend une (parfois deux) vidéos de 10 à\n 20\nminutes présentant des applications de ces principes à des cas concrets.\n Des\nvidéos d’expériences illustrent les concepts de la leçon et sont \nrassemblées\ndans un module complémentaire. De plus, les leçons de dynamique du solide comportent un module d'application des torseurs.&nbsp;<br>\n\n<p>Chaque leçon\nproposera un quiz afin de vous permettre de tester votre compréhension\ndes concepts de base, ainsi qu'une série de 2 à 3 exercices qui se présenteront sous la forme de QCMs, afin de bénéficier d'une correction immédiate et automatisée. Les exercices de mécanique du solide sont offert en format standard et &nbsp;dans un format alternatif proposant une résolution faisant appel aux torseurs.<br><\/p>","suggestedReadings":"Traité de Physique : La Mécanique.\nJ.-Ph. Ansermet, <a target=\"_blank\" href=\"http:\/\/www.ppur.org\/produit\/478\/9782889150243\/Mecanique%20?search_text=ansermet\">PPUR 2013<\/a><br>","estimatedClassWorkload":"4-4 hours\/week","recommendedBackground":"<p>Ce cours étant la suite du cours <a href=\"https:\/\/www.coursera.org\/course\/mecanique\" target=\"_blank\">Mécanique I<\/a>, il est fortement conseillé de suivre ces deux cours dans l'ordre, la notation et de nombreux concepts et notions abordés dans la première partie du cours étant repris dans la seconde.<br><\/p>\n\n<p>Il est par ailleurs recommandé de\nposséder des connaissances de base en mathématiques correspondant au niveau\nrenforcé de la maturité fédérale suisse. Des outils comme la manipulation de\nvecteurs et de matrices, le calcul intégral et différentiel, ainsi que la\ntrigonométrie sont régulièrement utilisés tout au long de ce cours.<br><\/p>\n\n<p>Pour ceux n’étant pas familier\navec ces notions mathématiques, nous vous recommandons de visionner les vidéos\ndu Prof. Rolf Gruetter de <a href=\"http:\/\/www.youtube.com\/playlist?list=PLC09041B1E636CCEB\" target=\"_blank\" title=\"Link: http:\/\/www.youtube.com\/playlist?list=PLC09041B1E636CCEB\">cette chaîne youtube<\/a>.<\/p><br>","links":{}}