{"id":3438,"shortName":"ckt","name":"Clinical Kidney Transplantation ","language":"en","shortDescription":"Learn about various aspects of clinical kidney and pancreas transplantation.","aboutTheCourse":"<p>Kidney transplantation is a major advance of modern medicine which provides high-quality of life for patients with end-stage renal disease. What used to be an experimental, risky, and very limited treatment option more than 50 years ago is now routinely performed in many countries worldwide. The number of renal transplants is expected to rise sharply in the next decade since the proportion of patients with end stage renal disease is increasing. Transplant recipients are living longer due to better medical care and immunosuppressive medication. Many medical professionals will thus come in contact with patients who received a transplant. <\/p>\n\n<p>Are you interested in the various aspects on clinical kidney and pancreas transplantation? This might be the course for you. This course will give you the state of the art updates and is divided in 4 modules: \n <img width=\"533\" src=\"https:\/\/d396qusza40orc.cloudfront.net\/ckt\/modules_overview.jpg\" height=\"300\" alt=\"overview of the 4 modules.\"><\/p>\n\nImportant questions which will be answered in the course include: \n<br>\n<p><\/p><ul><li>Which factors are of importance before renal transplantation, including knowledge on renal disease (with a special focus on diabetes), immunology, immunogenetics and patient selection of low and high risk patients?<p><\/p><\/li>\n<li>\n<p>What are the options for the elderly, patients with diabetes and immunologically challenged patients?<\/p><\/li><p><\/p>\n\n<p><\/p><li>What are the important surgical aspects of kidney, pancreas and islet transplantation?<\/li><p><\/p>\n\n<p><\/p><li>What are challenges in the early period after transplantation including ischemia reperfusion injury, allograft rejection and choice of optimal immune suppression?<\/li><p><\/p>\n\n<p><\/p><li>What are challenges in the late period after transplantation, including, infections, (skin) malignancies and cardiovascular complications? We will also look into patient and allograft outcomes, tolerance, and novel developments <\/li><\/ul><p>\nA multidisciplinary team of professionals with different expertise is paramount in the success of transplantation. We have chosen to ask the experts from our team to give the different lectures: <\/p> \n\n<ul><li>Dr Marlies Reinders (Department of Nephrology and Transplantation)<\/li>\n<li>Prof Hans de Fijter (Department of Nephrology and Transplantation)<\/li>\n<li>Prof Ton Rabelink (Department of Nephrology and Transplantation)<\/li>\n<li>Dr Aiko de Vries (Department of Nephrology and Transplantation)<\/li>\n<li>Prof Cees van Kooten (Department of Nephrology and Transplantation)<\/li>\n<li>Prof Eelco de Koning (Department of Nephrology and Transplantation and Endocrinology and Metabolism)<\/li>\n<li>Prof Frans Claas (Department of Immunohaematology and Blood Transfusion)<\/li> \n<li>Dr Sebastiaan Heidt (Department of Immunohaematology and Blood Transfusion)<\/li>\n<li>Dr Volkert Huurman(Department of Transplant Surgery)<\/li>\n<li>Dr Andre Baranski (Department of Transplant Surgery)<\/li>\n<li>Dr Ingeborg Bajema (Department of Pathology)<\/li>\n<li>Dr Jan Nico Bouwes Bavinck (Department of Dermatology)<\/li>\n<li>Prof Leo Visser (Department of Infectious Diseases)<\/li><\/ul>\n\nFor those who are interested in clinical kidney transplantation, we offer an introduction to the various aspects of transplantation. For medical professions who wish to obtain advanced knowledge on transplantation, we offer in-depth insight into specialist subjects with extra assignments.","targetAudience":1,"courseSyllabus":"<p><b>Week One<\/b>: Basic knowledge that is necessary to understand the process of transplantation will be discussed. This includes functions of the kidney in health and disease, transplant immunology, immunogenetics and histocompatibility. Also, the process of patient selection will be shown.<\/p>\n\n<p><b>Week Two<\/b>: Patient and procedure are central during this week. How do you cope with challenged patients? And what are the treatment options? The actual procedure of transplant surgery will be visualized.<\/p>\n\n<p><b>Week Three<\/b>: Early challenges arise quickly after transplantation. Both immune and non-immune challenges are discussed, as well as the options for suppressive therapy. Several patient cases will show how these challenges are dealt with in real life.<\/p>\n\n<p><b>Week Four<\/b>: You also have to be aware of late challenges that may occur. There is the danger of over or under immune suppression. It is also shown which complications and have to be taken into account after pancreas and islet transplantation. Theory is again linked to clinical patient cases.<\/p>","courseFormat":"<p><\/p>The offered modules will include lectures, interactive patient cases, 3D animations of a kidney, pancreas and islet transplantation and of different aspects of the immune system, interviews with well-known experts in the field, and serious games to increase knowledge of the field. The impact of the transplant process for the patient and the kidney donor will become clear through interviews with patients. <br> <br>A multidisciplinary team of professionals with different expertise is paramount in the success of transplantation. We have chosen to ask the experts from our team to give the different lectures. <p><\/p>","suggestedReadings":"","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"To follow the course, you’ll need an advanced undergraduate or beginning graduate level with a background in biology, medicine or life sciences.  It will also be valuable for experienced health care providers and others interested in the research and knowledge on clinical transplantation. <br><br>","links":{}}