{"id":137,"shortName":"earth","name":"Planet Earth...and You!","language":"en","shortDescription":"Planet Earth, an overview of selected geological topics, discusses how earthquakes, volcanoes, minerals and rocks, energy, and plate tectonics have interacted over deep time to produce our dynamic island in space, and its unique resources.","aboutTheCourse":"Earthquakes, volcanoes, mountain building, ice ages, landslides, floods, life evolution, plate motions—all of these phenomena have interacted over the vast expanses of deep time to sculpt the dynamic planet that we live on today. &nbsp;Planet Earth presents an overview of several aspects of our home, from a geological perspective. &nbsp;We begin with earthquakes—what they are, what causes them, what effects they have, and what we can do about them. We will emphasize that plate tectonics—the grand unifying theory of geology—explains how the map of our planet's surface has changed radically over geologic time, and why present-day geologic activity—including a variety of devastating natural disasters such as earthquakes—occur where they do. &nbsp;We consider volcanoes, types of eruptions, and typical rocks found there. Finally, we will delve into the processes that produce the energy and mineral resources that modern society depends on, to help understand the context of the environment and sustainability challenges that we will face in the future.","targetAudience":0,"courseSyllabus":"<div>WEEK 1: &nbsp;Earthquakes!<br><\/div><ul><li>Just what is an earthquake?<br><\/li><li>Recording and measuring shakes<\/li><li>Consequences of quakes<\/li><li>Prediction and preparation<\/li><\/ul>\n<div>WEEK 2: &nbsp;Plate Tectonics<\/div><ul><li>Continental drift and sea-floor spreading<\/li><li>What is a plate?<\/li><li>Plate boundaries<\/li><li>Earthquakes and plate tectonics<\/li><\/ul>\n<div>WEEK 3: &nbsp;Volcanoes!<\/div><ul><li>Where does molten rock come from?<\/li><li>Introduction to igneous rocks<\/li><li>Types of eruptions<\/li><li>Volcanic hazards&nbsp;<\/li><\/ul>\n<div>WEEK 4: &nbsp;Riches in Rocks<\/div><ul><li>What is the \"stuff\" of modern life?<\/li><li>Where do the elements come from?<\/li><li>Soil: the base for life<\/li><li>Mining metals and quarrying rocks<\/li><\/ul>\n<div>WEEK 5: &nbsp;The Sources of Power<\/div><ul><li>What's the \"fossil\" in fossil fuel?<\/li><li>How do we find oil?<\/li><li>Nuclear power<\/li><li>Energy challenges in the future<\/li><\/ul>\n","courseFormat":"<div>The class includes a series of lecture videos, totaling 75-90 minutes per week. These are integrated with quizzes, readings, discussions, and lab exercises. &nbsp;Students will also be able to take virtual field trips to spectacular sites using Google Earth™ and to share information about their own geological surroundings with their classmates.<\/div>\n<div><\/div>","suggestedReadings":"<div>Marshak, S., 2013, <a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&amp;AFID=301076&amp;ADID=1088031&amp;SID=earth&amp;isbn_ean=9780393919394\">Essentials of Geology (Fourth Edition)<\/a><img width=\"1\" src=\"http:\/\/www.assoc-amazon.com\/e\/ir?t=coursera-20&amp;l=as2&amp;o=1&amp;a=0393919390\" height=\"1\" style=\"border: none !important; margin: 0px !important;\">, W.W. Norton &amp; Co., New York, 550 p.; available either in print or electronic form (Mac, PC, or iPad formats).<br><br>Online readings will also be provided, from a variety of sources including the US Geological Survey, state geological surveys, and other professional and governmental agencies.<\/div>\n<div><\/div>","instructor":"Stephen Marshak","estimatedClassWorkload":"8-10 hours\/week","recommendedBackground":"None; all are welcome!","links":{}}