{
    "id": 2255,
    "shortName": "media",
    "name": "История и теория медиа (History and theory of media)",
    "language": "ru",
    "shortDescription": "Знакомит с теоретическим наследием в области медиа, обучает основным подходам к теоретическому анализу медиа и прослеживает логику развития медиасистем в современных обществах.\n",
    "aboutTheCourse": "<p>Курс рассматривает развитие медиасистем в контексте развития\nобществ преимущественно с момента появления национальных государств в середине\n2 тысячелетия н.э. до настоящего момента и демонстрирует роль, которую играют\nмедиа в формировании национальных государств, капиталистической экономики и\nучастия населения в политике. <\/p><p>Вторая часть курса посвящена рассмотрению теоретических\nподходов к изучению медиа и коммуникаций. Рассматриваются макросоциальные и\nмикросоциальные теории медиа с точки зрения изучения медиаинститутов, сообщений\nмедиа (материалов), каналов коммуникации и медиаэффектов. Разбираются различные\nметодологии, используемые теориями медиа, демонстрируются способы применения\nэтих методов.<\/p><p><br><\/p><p>This course examines\ndevelopment of media systems and the way it interact with development of\nsocieties. Such changes are examined mainly in period of the second half of the\nsecond millennium and demonstrate the role that media play in building of\nnational states, capitalist economy and political participation of population.<\/p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSecond\npart of the course explores different theoretical approaches to media and\ncommunications. Macro social and micro social theories examining media\ninstitutions, media messages, media channels and media effects are presented. The\ncourse also presents different methodologies used by different theories and\nshows ways of use them.&nbsp;&nbsp;<br><\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<p><strong>Неделя\nпервая:<\/strong> Представляются основные понятия сферы медиа: медиа, коммуникация,\nинформация, масс-медиа, СМИ и СМК&nbsp;<\/p><p><strong>Неделя\nвторая:<\/strong> Представлена основная логика развития обществ через изменения\nкоммуникативных систем, медианосителей, методов контроля медиа<\/p><p><strong>Неделя\nтретья:<\/strong> На этой неделе мы совершим исторический экскурс в механизмы контроля и\nрегулирования содержания массовых коммуникаций, начиная от средневековых\nцензурных уставов и статутов и заканчивая преимущественно конституционными\nпринципами, регулирующими свободу слова.<\/p><p><strong>Неделя\nчетвертая: <\/strong>Эта неделя посвящена изучению социальной истории основных\nмедианосителей и средств коммуникации. Мы рассмотрим различные системы\nписьменности, материальные формы книги, электрические системы передачи\nинформации (телеграф и телефон) и то, как это повлияло на социальные практики.<\/p><p><strong>Неделя пятая:<\/strong>\nНа этой неделе мы будем заниматься классификацией теорий медиа и обзором\nпредметов исследования в различных теориях. После этого мы начнем разбирать три\nсамых ранних группы теорий. Начнем с эмпирико-функционалистской группы теорий,\nкоторая занималась изучением эффектов и функций медиа в общественной жизни.<\/p><p><strong>Неделя\nшестая:<\/strong> Второй основополагающей группой теорий была «Критическая теория»,\nрассматривающая медиа как институты, воспроизводящие капитализм и социальную\nиерархию.<\/p><p><strong>Неделя седьмая:<\/strong>\nТретьей основополагающей группой теорий является лингвистическая группа теорий,\nрассматривающая медиа через призму сообщений и текстов, которые они\nпродуцируют.<\/p><p><strong>Неделя восьмая:\n<\/strong>На этой неделе мы начнем рассматривать современные социальные теории медиа. И\nначнем с теории информационного и сетевого общества, а также идей\nмедиадетерминизма Маклюэна и Инниса.<\/p><p><strong>Неделя\nдевятая:<\/strong> Здесь мы рассмотрим социальные теории, рассматривающие как\nмедиапроцесс распространение и внедрение инноваций<\/p><p><strong>Неделя десятая:<\/strong>\nВ этой части курса будут рассмотрены микросоциальные теории, связанные с\nкоммуникациями. Сюда относится этнометодология медиа, символический\nинтеракционизм и т.д.<\/p><p><strong>Неделя\nодиннадцатая:<\/strong> Здесь мы разберем социальные теории медиапотребления и Cultural Studies.<\/p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<strong>Неделя двенадцатая:<\/strong> В данном компоненте курса мы\nрассмотрим политэкономические современные медиатеории. В первую очередь\nпроблему медиакапитала. Затем мы коснемся темы культурных и креативных\nиндустрий с позиций представителей политической экономии массовых коммуникаций.<br><\/p>",
    "estimatedClassWorkload": "3-4 hours\/week",
    "recommendedBackground": "<span>Для изучения данного курса\nжелательно иметь базовые знания в сфере культуры и социологии.&nbsp;<\/span>",
    "links": {

    }
}