{
    "id": 1838,
    "shortName": "gpslab",
    "name": "GPS: An Introduction to Satellite Navigation, with an interactive Worldwide Laboratory using Smartphones",
    "language": "en",
    "shortDescription": "Explore the fundamentals of the Global Positioning System (GPS) and how it works by conducting \"backyard\" laboratory experiments on your own mobile device. Learn the basics of satellite navigation and witness the power of a network with planet-wide coverage. Gain a deeper understanding of GPS and its role in our lives, while interacting with a worldwide community of learners and backyard scientists.",
    "aboutTheCourse": "Today, the Global Positioning System (GPS) is deployed in over three billion devices across the world. This course will teach you the fundamentals of how GPS works and introduce you to the diverse range of uses of satellite navigation—in all aspects of our lives.<br><br>Through vivid online lectures and a set of \"backyard experiments\" enabled by the widespread availability of GPS-enabled smart phones and tablets, students will be able to connect online learning to real-­world experience. Even those who do not own laptop or desktop computers can take part; they will be able to view lectures and completing labs via mobile device only.<br><br>We hope students will enjoy the interactive nature of the course, while gaining knowledge that benefits their personal and professional lives. Please visit <a href=\"http:\/\/www.gps-lab.org\">www.gps-lab.org<\/a> for up-to-date details!<br><br>",
    "targetAudience": 1,
    "courseSyllabus": "<strong>Part I. Fundamentals of GPS Introduction<\/strong><br><br><strong>Introduction<\/strong><br>·&nbsp;How GPS works and what it does for us (Enge)<br>·&nbsp;Course objectives &amp; schedule (Enge, van Diggelen)<br>·&nbsp;The Joy of GPS (van Diggelen)<br>&nbsp;<br><strong>Module 1: How GPS Works <\/strong>(Enge)<br>·&nbsp;How GPS works<br>·&nbsp;Navigation in Our Lives: The Exxon Valdez<br><br><strong>Module 2: Pseudoranges <\/strong>(Enge)<br>·&nbsp;Linearization &amp; error analysis<br>·&nbsp;Accuracy &amp; dilution of precision (DOP)<br>·&nbsp;Differential GPS<br>·&nbsp;Navigation in Our Lives: Landing Airplanes Using GPS<strong><\/strong><br>·&nbsp;Experiment A: Accuracy <strong><br><br>Module 3: Orbits and Signals<\/strong> (Enge)<strong><br><\/strong>·&nbsp;Satellite orbits<br>·&nbsp;Signals, codes<br>·&nbsp;Navigation in Our Lives: Maritime &amp; Air Surveillance<br>·&nbsp;Experiment B: Satellite Visibility<br><strong><br>Part II. Modern GPS receivers: cell phones, tablets and more!<br><br>Module 4: Receiver Design Basics<\/strong> (van Diggelen)<strong><br><\/strong>·&nbsp;Power, Receiver design<br>·&nbsp;Acquisition<br>·&nbsp;Navigation in Our Lives: GPS in sports<strong><\/strong><br>·&nbsp;Experiment C: GPS Signal Power<strong><br><br>Module 5: Assisted GPS<\/strong> (van Diggelen)<strong><br><\/strong>·&nbsp;Supplanting the Navigation Message<br>·&nbsp;Improving Sensitivity<br>·&nbsp;Navigation in Our Lives: “There’s an app for that”&nbsp;<br><br><strong>Module 6: The Future of GPS and Satellite Navigation <\/strong>(van Diggelen)<strong><br><\/strong>· GNSS, all Global Navigation Satellite Systems<br>· GLONASS, QZSS, Beidou, Galileo, IRNSS, and Future GPS (GPS III)<br>·&nbsp;Navigation in Our Lives: GPS everywhere<br><br><br><br>",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": "As this course will involve some mathematics and equations, we strongly recommend an undergraduate education in a technical discipline (engineering, mathematics or physics).",
    "links": {}
}