{
    "id": 29,
    "shortName": "mythology",
    "name": "Greek and Roman Mythology",
    "language": "en",
    "shortDescription": "This course will focus on the myths of ancient Greece and Rome, as a way of exploring the nature of myth and the function it plays for individuals, societies, and nations.",
    "aboutTheCourse": "Myths are traditional stories that have endured over a long time. Some\nof them have to do with events of great importance, such as the founding\nof a nation. Others tell the stories of great heroes and heroines and their\nexploits and courage in the face of adversity. Still others are simple\ntales about otherwise unremarkable people who get into trouble or do some\ngreat deed. What are we to make of all these tales, and why do people seem\nto like to hear them? This course will focus on the myths of ancient Greece\nand Rome, as a way of exploring the nature of myth and the function it\nplays for individuals, societies, and nations. We will also pay some attention\nto the way the Greeks and Romans themselves understood their own myths.\nAre myths subtle codes that contain some universal truth? Are they a window\non the deep recesses of a particular culture? Are they a set of blinders\nthat all of us wear, though we do not realize it? Or are they just entertaining\nstories that people like to tell over and over? This course will investigate\nthese questions through a variety of topics, including the creation of\nthe universe, the relationship between gods and mortals, human nature,\nreligion, the family, sex, love, madness, and death.",
    "targetAudience": 0,
    "courseSyllabus": "<ul>\n    <li><strong>Week 1:<\/strong> Homer, epic poetry, and Trojan legends<\/li>\n    <li><strong>Week 2:<\/strong> Heroes and suffering<\/li>\n    <li><strong>Week 3:<\/strong> This World and other ones<\/li>\n    <li><strong>Week 4:<\/strong> Identity and signs<\/li>\n    <li><strong>Week 5:<\/strong> Gods and humans<\/li>\n    <li><strong>Week 6:<\/strong> Religion and ritual<\/li>\n    <li><strong>Week 7:<\/strong> Justice<\/li>\n    <li><strong>Week 8:<\/strong> Unstable selves<\/li>\n    <li><strong>Week 9:<\/strong> Writing myth in history<\/li>\n    <li><strong>Week 10:<\/strong> From myths to mythology<\/li>\n<\/ul>",
    "estimatedClassWorkload": "8-10 hours\/week",
    "recommendedBackground": "No special background is needed other than the willingness and ability\nto synthesize complex texts and theoretical material. Due to some explicit\nsubject matter, however, the class is not suitable for students under 16\nyears old.",
    "links": {

    }
}