{"id":1895,"shortName":"adsoc","name":"Advertising and Society","language":"en","shortDescription":"This course examines the relation of advertising to society, culture, history, and the economy.  Using contemporary theories about visual communications, we learn to analyze the complex levels of meaning in both print advertisements and television commercials.","aboutTheCourse":"<p>The course covers a wide range of topics, including the origins of advertising, the creation of ads, the interpretation of ads, the depiction of race, class, gender, and sexuality in advertising, sex and selling, adverting and ethics, and the future of advertising. The lectures will discuss theoretical frameworks and apply them to specific advertisements.<\/p>","targetAudience":0,"courseSyllabus":"<p>Week 1: What is advertising and where did it come from?<br><\/p><p>Week 2: Am I being manipulated by advertising?<\/p><p>Week 3: What’s in an ad beyond that which meets the eye?<\/p><p>Week 4: How do ads get made?<\/p><p>Week 5: What do ads teach us about race, class, gender, and sexuality?<\/p><p>Week 6: Does sex sell?<\/p><div>Week 7: What is the future of advertising?<\/div>","courseFormat":"<p>Most videos will be lectures with instructor talking. Each lecture will be illustrated with PowerPoint slides, print advertisements, and TV commercials. The videos for each week will consist of 3 self-contained segments of 15-25 minutes each. Each week will have one quiz that will appear as stand-alone homework. All resources beyond lectures will be available online to students at no charge. Most of these will be from <a href=\"http:\/\/adtextonline.org\" target=\"_blank\" title=\"Link: http:\/\/adtextonline.org\">ADTextOnline.org<\/a>. Others will be visits to the sites of ad agencies in the US and abroad, open access websites that deal with course topics, and open-access journal articles.<\/p>","suggestedReadings":"Although the lectures are designed to be self-contained, we recommend that students refer to the free online textbook <a target=\"_blank\" href=\"http:\/\/adtextonline.org\">ADTextOnline.org.<\/a> Other free resources will be suggested for each week’s module.","estimatedClassWorkload":"3-4 hours\/week","recommendedBackground":"No background is required; everyone is welcome!","links":{}}