{"id":2546,"shortName":"structures2","name":"L'Art des Structures 2 : treillis, poutres, dalles et cadres","language":"fr","shortDescription":"L'Art des Structures 2 propose une découverte du fonctionnement des structures porteuses, telles que les bâtiments, les toitures ou les ponts. Ce cours, qui fait suite au cours l'Art des Structures 1, présente les principes du fonctionnement des structures en treillis, poutres, dalles et cadres.","aboutTheCourse":"En vous basant sur les connaissances acquises lors du premier cours, vous comprendrez le comportement des structures composées de treillis, de poutres, de dalles et de cadres.\n<br>\n<br>La détermination des efforts dans les structures s'effectue au moyen\n de la statique graphique, ce qui donne une approche très visuelle du \nprocessus et ne requiert que des connaissances mathématiques de base.\n<br>\n<br>Les exercices hebdomadaires permettent d'approfondir la connaissance\n de la matière et d'appliquer les concepts vus à des exemples de \nstructures réelles.\n<br>\n<br><b>ENGLISH subtitles will be available for all course videos !<\/b>\n<br>","targetAudience":0,"courseSyllabus":"<ul><li>Introduction, treillis<\/li><li>Analyse spécifique et typologie des treillis<br><\/li><li>Tours et consoles<br><\/li><li>Poutres<\/li><li>Poutres et treillis avec consoles<br><\/li><li>Poutes-cloisons et voiles<br><\/li><li>Grilles de poutres et dalles<\/li><li>Cadres et stabilité<br><\/li><\/ul>Le cours est annoncé sur 11 semaines. Certaines semaines sont groupées parce que la matière en est particulièrement abondante.","courseFormat":"Le cours consiste en une série de séquences vidéos, accompagnées par des\n notes de cours à compléter pendant que vous suivez les vidéos. La mise \nen pratique commence par une maîtrise des constructions graphiques \nfaites pendant les vidéos et se poursuit\npar un exercice hebdomadaire qui sera corrigé et noté.\n<br>","suggestedReadings":"Le livre <a target=\"_blank\" href=\"http:\/\/i-structures.epfl.ch\/livre.php\">L'art des structures<\/a> par Aurelio Muttoni sert de base à ce cours. Sa lecture constitue un complément très utile au cours en ligne.\n<br>\n<br>Le site <a target=\"_blank\" href=\"http:\/\/i-structures.epfl.ch\">i-structures.epfl.ch<\/a>\n sera utilisé pour les exercices. Vous pouvez être intéressé à le \nvisiter pour vous rendre compte du contenu du cours, qui en traitera\nla première partie. Une fois connecté à i-structures (en entrant votre \nidentifiant Coursera), Choisissez le lien en <a target=\"_blank\" href=\"http:\/\/i-structures.epfl.ch\">français<\/a> pour accéder\nau contenu du site.","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"Les notions vues dans le cours <a target=\"_blank\" href=\"https:\/\/www.coursera.org\/course\/structures\">L'Art des Structures I<\/a> sont essentielles pour pouvoir suivre ce cours. Il est donc fortement recommandé de l'avoir suivi pour commencer ce cours.<br>Sinon, un bon bagage général et une familiarité avec les mathématiques sont \nrecommandés. Dans la mesure où le cours y fera fréquemment référence, \nune bonne capacité à faire des dessins précis à la règle est requise.\n<br>Les aspects mathématiques ne sont pas primordiaux, mais des réponses\n nécessitant un certain calcul numérique seront fréquemment posées.","links":{}}