{
    "id": 2157,
    "shortName": "mhglobal",
    "name": "Mental Health: A Global Priority",
    "language": "en",
    "shortDescription": "This course is designed to help you develop a broader understanding of mental health and illness from a global perspective.  Over five weeks you will be guided in exploring how and why the current challenges faced in mental health care vary globally. ",
    "aboutTheCourse": "<p>Mental illness can affect anyone. It is an important cause of disability worldwide. However the pathways to receiving adequate and humane mental health care vary within countries and between countries. This mental health inequity is a challenge to be explored and overcome in order to attain better health for all nations. Participating in this course is a step towards overcoming this global challenge.<\/p><p>The 5-week course begins with an introduction to fundamental concepts related to mental health and illness and presents evidence for global mental health inequity. The course will consider how factors such as stigma, violations of human rights, culture, spirituality, partnerships and technology may affect the pathways to mental health care. We will also consider the effects of globalisation on mental illness and mental health care. The course concludes by looking at the opportunities we have in the 21st century to prioritise and improve mental health from a local and global perspective.<\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<p><strong>Week 1 - Mental health: a global priority?<\/strong><\/p><p>We begin the course with an introduction to concepts of mental health and mental illness and we recognise the reasons for global variations in common mental illnesses. At the end of this week you should be able to explain what level of priority you think mental health should be given in your country and other countries.<\/p><p><br><\/p>\n\n<p><strong>Week 2 - Pathways to mental health: suffering, stigma and human\nrights<\/strong><\/p><p>This week we consider how stigma and human rights affect people with mental illnesses in different countries and explore approaches to overcoming stigma.<\/p><p><br><\/p>\n\n<p><strong>Week 3 - Pathways to mental health health 2: culture and\nspirituality<\/strong><\/p><p>Continuing with our pathways to mental health approach, we seek a deeper understanding of the role of culture in mental health care with a focus on spirituality.<\/p><p><br><\/p>\n\n<p><strong>Week 4 - Pathways to mental health 3: people and\npartnerships<\/strong><\/p><p>This week we look at how different partnerships can be formed to improve mental health care services and we consider the care-giving roles of professionals and lay people.<\/p><p><br><\/p>\n\n<p><strong>Week 5 - 21st century challenges and\nopportunities in mental health<\/strong><\/p><p>We finish the course with a review of innovation opportunities in mental health care from the perspective of globalisation. At the end of this week you should be able to suggest how mental health might be improved in your own country as well as in other countries.<\/p><p><br><\/p>",
    "estimatedClassWorkload": "1-3 hours\/week",
    "recommendedBackground": "No background is required; all are welcome!",
    "links": {}
}