{
    "id": 467,
    "shortName": "renaissancearchitect",
    "name": "Early Renaissance Architecture in Italy: from Alberti to Bramante",
    "language": "en",
    "shortDescription": "Through some of the most celebrated examples of the early Renaissance architecture and the most important statements of the early Renaissance theories, the course will examine problems of the architectural spaces, technology and forms looking to the antiquity in the XV century in Italy.",
    "aboutTheCourse": "<p><b>Early Renaissance Architecture in Italy: from Alberti\nto Bramante<\/b>\n\n<\/p>\n<p><span>When\nLeon Battista Alberti completed<i> <\/i>his\ntreatise about architecture around 1452, his initial study of texts and\nmonuments of Antiquity was based on mathematics and geometry as a reflection of\nnature, with a belief that architecture was a part of a man's civil duty.<\/span>\n\n<\/p>\n<p>This<span> attitude would\ncondition the architectural principles of the early Renaissance and architects\ndid not apply themselves to textual imitations of individual antique monuments.\nIn Florence, they preferred to accept and articulate the rational “system” of\nBrunelleschi, either transforming it, like Alberti, or breaking with<b> <\/b>it in a return to tradition, like\nMichelozzo. In north and south Italy, the battle between innovation and resistance\nwas increasing in strength and substance because it not only encompassed\nimmediate questions of decorative language \n(antique forms and architectural orders) but also the problems of\nconceiving and constructing an architecture that could replace the gothic\nstructural membering with the continuous masonry of the Antiquity. At first,\nthe new decoration was frequently adapted to the existing architectural system,\nand only later did it find a partner in the different spatial and structural\nconceptions that descended from Florentine exempla. The tendency to see norms\nand models in antique architecture, which must be rigidly replicated, first\naffirmed itself at the beginning of the XVI century in Rome.<\/span>\n\n<\/p>\n<p>Through some of the most celebrated examples of the early Renaissance\n    architecture and the most important statements of the early Renaissance\n    theories, the course will examine problems of the architectural spaces,\n    technology and forms in the XV century in Italy, from Leon Battista Alberti’s\n    to Francesco di Giorgio’s and Bramante’s proposals.<br><\/p>",
    "targetAudience": 1,
    "courseSyllabus": "1. First week: Introduction<br>&nbsp;&nbsp;&nbsp; 1.1 About the course<br>&nbsp;&nbsp;&nbsp; 1.2 Florence in the early XV century<br>&nbsp;&nbsp;&nbsp; 1.3 Brunelleschi and the architectural order<br>&nbsp;&nbsp;&nbsp; 1.4 The sources of the Antiquity<br>2. Second week: Leon Battista Alberti (1404-1472)<br>&nbsp;&nbsp;&nbsp; 2.1 Rimini, Tempio Malatestiano<br>&nbsp;&nbsp;&nbsp; 2.2 Florence, the Rucellai Palace<br>&nbsp;&nbsp;&nbsp; 2.3 Florence, the façade of S. Maria Novella<br>&nbsp;&nbsp;&nbsp; 2.4 Mantua, the churches of S. Sebastiano and S. Andrea<br>3. Third week: Francesco di Giorgio Martini (1439-1501)<br>&nbsp;&nbsp;&nbsp; 3.1 Siena in the times of pope Pius II<br>&nbsp;&nbsp;&nbsp; 3.2 The Palazzo Ducale in Urbino <br>&nbsp;&nbsp;&nbsp; 3.3 Fortresses and treatises<br>&nbsp;&nbsp;&nbsp; 3.4 Churches and monasteries<br>4. Fourth week: Giuliano da Sangallo (1443-1516)<br>&nbsp;&nbsp;&nbsp; 4.1 The Villa of Poggio a Caiano<br>&nbsp;&nbsp;&nbsp; 4.2 Churches<br>&nbsp;&nbsp;&nbsp; 4.3 Palaces<br>&nbsp;&nbsp;&nbsp; 4.4 Fortresses<br>5. Fifth week: Other points of view<br>&nbsp;&nbsp;&nbsp; 5.1 Milan<br>&nbsp;&nbsp;&nbsp; 5.2 Venice<br>&nbsp;&nbsp;&nbsp; 5.3 Naples<br>&nbsp;&nbsp;&nbsp; 5.4 Rome<br>6. Sixth week: Bramante (1444-1514) in Milan<br>&nbsp;&nbsp;&nbsp; 6.1 Bramante from Urbino<br>&nbsp;&nbsp;&nbsp; 6.2 S. Maria presso S. Satiro<br>&nbsp;&nbsp;&nbsp; 6.3 The Pavia Cathedral and the Choir of S. Maria delle Grazie<br>&nbsp;&nbsp;&nbsp; 6.4 The Canonica and the Cloisters of S. Ambrogio<br>7. Seventh week: Bramante in Rome (I)  <br>&nbsp;&nbsp;&nbsp; 7.1 The Cloister of S. Maria della Pace<br>&nbsp;&nbsp;&nbsp; 7.2 The Belvedere Court of the Vatican<br>&nbsp;&nbsp;&nbsp; 7.3 New St. Peter’s<br>&nbsp;&nbsp;&nbsp; 7.4 The Tempietto of S. Pietro in Montorio<br>8. Eight week: Bramante in Rome (II)  <br>&nbsp;&nbsp;&nbsp; 8.1 Palaces<br>&nbsp;&nbsp;&nbsp; 8.2 Churches<br>&nbsp;&nbsp;&nbsp; 8.3 The Choir of S. Maria del Popolo and the Nympheum in Genazzano<br>&nbsp;&nbsp;&nbsp; 8.4 Conclusions<br>",
    "estimatedClassWorkload": "2-4 hours\/week",
    "recommendedBackground": "Interest in History of Architecture and general knowledge of history of the Renaissance",
    "links": {}
}