{"id":2600,"shortName":"androidpart2","name":"Programming Mobile Applications for Android Handheld Systems: Part 2","language":"en","shortDescription":"This course introduces you to the design and implementation of Android applications for mobile devices. You will build upon concepts from the prior course, including handling notifications, using multimedia and graphics and incorporating touch and gestures into your apps.","aboutTheCourse":"<p>If you're taking this course, you've already learned the basics in&nbsp;<a href=\"https:\/\/www.coursera.org\/course\/androidpart1\">Part 1<\/a>, have a basic background in Java and&nbsp;and are ready to focus on more&nbsp;advanced components:<\/p><ul><li>notifying users about important events<br><\/li><li>handling concurrency<\/li><li>acquiring data over the network&nbsp;<br><\/li><li>leveraging multimedia and graphics<br><\/li><li>incorporating touch and gestures<\/li><li>working with sensors<\/li><\/ul>We'll work on a project together to help you apply these skills and,&nbsp;by the end of this course, you'll have the skills to create your own app!&nbsp;<br><br><b>A Comprehensive Program for Android Developers<br><\/b>\n<p>The&nbsp;<strong><a href=\"https:\/\/www.coursera.org\/specialization\/mobilecloudcomputing2\/36?utm_medium=listingPage\" target=\"_blank\">Mobile Cloud Computing with Android Specialization<\/a>&nbsp;<\/strong>is&nbsp;comprehensive program in which you will learn to create&nbsp;create&nbsp;complex, cloud-based Android applications, applying what you've learned through hands-on activities and a final project designed with industry partners.<\/p><p>\n\n<\/p><p><i>\"This is an excellent resource for any developer wishing to enter the growing mobile app industry. We’ve seen lots of great apps come out of this program.\"<\/i><\/p>\n<p>&nbsp; &nbsp;- Ankur Prasad, Amazon Appstore team\n\n<\/p><p><i>\"The professors provided high-quality course materials and the forums and my fellow students were extremely helpful. To top it all off, being able to participate in the Capstone project and then voted into the top 30 apps was an absolutely amazing experience.&nbsp; I have now achieved my goal of working as a professional Android developer primarily due to the skills I obtained in this specialization.\"<\/i><\/p>\n\n<p>&nbsp; &nbsp;- Daun Davids, program graduate<\/p>\n<p>Join our growing community of over 600,000 learners and get started with Android app development today!<\/p>","targetAudience":0,"courseSyllabus":"<strong>Objective 1:<\/strong>&nbsp;In this lesson I discuss how to handle concurrency with Threads, AsyncTask &amp; Handlers. There is also a lecture explaining how to access and process data over the network.<ul><li>Threads, AsyncTask &amp; Handlers<br><\/li><li>Networking<br><\/li><li>Display Tweet Data: Students build an app that downloads and displays Tweet data. The app uses an AsyncTask for downloading data over the network.<br><\/li><\/ul><strong>Objective 2: <\/strong>In this lesson I discuss using User Notifications to interact with the user, listening for and responding to events using the BroadcastReceiver class. There is also a lecture dealing with using Alarms to run code at pre-scheduled times.<ul><li>User Notifications<\/li><li>The BroadcastReceiver Class<br><\/li><li>Alarms<br><\/li><li>Tweet app: Students build an app that displays Twitter data. The app will use BroadcastReceivers and User Notifications to apprise the user of the app’s behavior and state.<\/li><\/ul><strong>Objective 3: <\/strong>In this lesson I present a number of technologies related to presenting and interacting with dynamic content. This includes graphics and animation, handling touch input from the user, and recording and playing multimedia.<ul><li>Graphics &amp; Animation<\/li><li>Multi-touch &amp; Gestures<br><\/li><li>MultiMedia<\/li><li>Bubble Popper: Students write an application to display and animate bubbles on the device's screen. When users touch the screen where a bubble is displayed, the bubble pops. The app will also accept gesture input, allowing the user to change the direction and speed of the bubble, using a fling gesture.<\/li><\/ul><strong>Objective 4: <\/strong>In this lesson I go over the many sensors that now come standard on most mobile devices. I also provide a focused discussion of using sensors to capture location information and using maps to display that information. Finally, I discuss some options for storing structured data.<ul><li>Sensors<br><\/li><li>Location &amp; Maps<br><\/li><li>DataManagement<br><\/li><li>Place Badge Collector: Students build an application that uses location information to collect Badges for the places they visit.<\/li><\/ul><p><strong>Mini-project - DailySelfie: <\/strong>Students will build a complete app from scratch. This app will remind users to take a picture of themselves once a day. The app will collect and display the resulting set of photos.<\/p>","courseFormat":"<p dir=\"ltr\"><strong>Videos<\/strong><\/p><p dir=\"ltr\">Each lesson will consist of video presentations, logically divided roughly into 5-10 minute sections.<\/p><p dir=\"ltr\"><strong>In-Video Questions<\/strong><\/p><p dir=\"ltr\">Throughout the lecture video there are ungraded \"in-video\" questions to help ensure that students are understanding the material. &nbsp;The in-video questions are related to the current video section, and provide supplementary information, “Food For Thought” discussion, and \"FLASHBACK\" questions, which challenge the students to think about something we have discussed in a previous lesson.<\/p><p dir=\"ltr\"><strong>Quizzes<\/strong><\/p><p dir=\"ltr\">Each week there is also a short quiz containing questions\/tasks to help ensure that the students have understood that week's lectures.<\/p><p dir=\"ltr\"><strong>Lab Exercises<\/strong><\/p><p dir=\"ltr\">Each week's videos will be accompanied by a lab exercise consisting of an assignment write-up, partially completed source code, and executable test cases. The students will run the test cases on their own computers to determine whether they've successfully completed the lab. For some labs, we will also require students to examine and grade the submissions of other students.<\/p><p dir=\"ltr\">Each lesson covers multiple Android source code examples. I strongly encourage students to download all the examples and to consult them both while watching the lecture and afterwards. The source code is publicly available on github:<\/p><p dir=\"ltr\"><a href=\"https:\/\/github.com\/aporter\/coursera-android\">https:\/\/github.com\/aporter\/coursera-android<\/a><\/p><p dir=\"ltr\"><strong>Mini-Project<\/strong><\/p><p>The course will also have a final mini-project, which asks learners to put together what they’ve learned into an application that is responsive and elegantly designed.&nbsp;<\/p><p><\/p>","suggestedReadings":"<p dir=\"ltr\">There is no textbook for this course, but I strongly encourage students to explore the wide range of freely-available Android-related resources.<\/p><ul><li>Keep up with changes and improvements in the Android ecosystem by reading the&nbsp;<a href=\"http:\/\/android-developers.blogspot.com\/\">Android Developer's Blog<\/a>.<br><\/li><li>Watch tutorials and other presentations from the&nbsp;<a href=\"https:\/\/developers.google.com\/events\/io\/\">Google I\/O<\/a>&nbsp;conference.<br><\/li><li>Instructors and learners share additional resources as the course progresses.<\/li><\/ul>","estimatedClassWorkload":"5-10 hours\/week","recommendedBackground":"<div><p dir=\"ltr\">This course is created for students who already know how to program in Java, but are not expected to have studied mobile application development. This corresponds roughly to Sophomore- or Junior-level undergraduate students in a computer science related discipline or the equivalent.<\/p><p dir=\"ltr\">If you don't already know Java, but have strong familiarity with other programming languages, you can improve your Java knowledge by taking one of the many Java tutorials and online courses available on the web.<\/p><p dir=\"ltr\"><strong>As discussed above, this course assumes previous programming knowledge. It also assumes that you are willing to search for, read and learn from Android's developer documentation. This is both a necessary skill for success in the class, and, in our experience, a necessary skill for successful Android developers at all levels.<\/strong><\/p>In short, this course is not designed for truly novice programmers. If your background is not appropriate for this class, consider first taking a less programming-intensive introduction to Android such as \"<a href=\"https:\/\/www.coursera.org\/course\/androidapps101\">Creative, Serious and Playful Science of Android Apps<\/a>\", by Lawrence Angrave of the University of Illinois and Urbana-Champaign.<br><\/div>","links":{}}