{"id":1830,"shortName":"sjtumia","name":"医学图像处理技术 Medical Image Analysis","language":"zh-cn","shortDescription":"本课程针对医学图像的特征，结合临床需求，由浅入深地讲解医学图像的种类、特征、应用领域、数字化存储形式，并分类讲解图像处理的理论和算法，结合应用案例和课程实践使学生熟练掌握祥光领域的知识和技能，并具备一定的动手能力。","aboutTheCourse":"<div>随着信息技术及医学影像成像技术的发展，医学图像处理在医学临床、教学和科研中发挥着越来越重要的作用，有力地推动着医学科学研究和临床医疗的进步。如何有效地应用图像增强、分割、配准、融合以及三维重建等数字图像分析与处理技术，对人体解剖结构和病变区域进行定位、提取、三维再现并量化分析是使得医学影像数据应用价值最大化的前提和保证。本课程针对医学图像的特征，结合临床需求，由浅入深地讲解医学图像的种类、特征、应用领域、数字化存储形式，并分类讲解图像处理的理论和算法，结合应用案例和课程实践使学生熟练掌握祥光领域的知识和技能，并具备一定的动手能力，为进一步学习医学图像领域的其他课程奠定基础。<\/div><div>The medical image analysis plays an important role in clinical application. The people who want to learn advance theory, algorithms and its applications on the digital image processing area is most suitable. The contents may include image acquiring, image filtering, image segmentation, image understanding and visualization. It could help students to review the history, current status and development of the research area, and could help them to apply them to their own research field. The students are required to understand the basic theory, algorithms and its applications on the digital image processing area.<\/div><div><br><\/div>","targetAudience":0,"courseSyllabus":"<p>第一周 绪论<\/p>\n\n<p>第二周 医学图像基础算法（上）<\/p>\n\n<p>第三周 医学图像基础算法（下）<\/p>\n\n<p>第四章 二值数学形态学 <\/p>\n\n<p>第五章 灰度数学形态学<\/p>\n\n<p>第六周 彩色图像和三维图像&nbsp; <\/p>\n\n<p>第七周 图像分割与形状轮廓模型 <\/p>\n\n第八周 医学图像配准","courseFormat":"利用微视频课程进行翻转课堂模式教学，要求学生在课前观看课程视频，并进行文献阅读。论坛上以小组和班级讨论的形式对相应课程内容进行讨论。<br><p>本课程仅提供认证证书。而<u>不<\/u>提供完成声明。您可以免费对作业进行身份认证，并在课程最后一周前任意时间支付费用。由于经济困难无法支付费用的学生可以申请<a href=\"https:\/\/www.coursera.org\/signature\/guidebook\/aid\">Coursera助学金<\/a>。<\/p><p>如果您完成了课程，但没有对作业进行身份认证，可以在课程记录页面查看自己的课程成绩。&nbsp;&nbsp; &nbsp;<\/p>","suggestedReadings":"<p>“Digital Image Processing”, Kenneth\nR. Castleman, Prentice Hall International, Inc. 2002.4<\/p>\n\n<p>“Computer and Robot Vision”,\nR.M.Haralick &amp; L.G.Shapiro，Addison-Wesly\nPublishing,1992<\/p>\n\n“Morphological Image\nAnalysis”, Pierre Soille，Springer出版社","estimatedClassWorkload":"6-8 hours\/week","recommendedBackground":"本课程面对有一定计算机基础知识和生物医学基础知识的本科三、四年级，以及研究生学生。","links":{}}