{"id":960,"shortName":"cyhfisica","name":"Conceptos y Herramientas para la Física Universitaria","language":"es","shortDescription":"Este curso provee al estudiante con conceptos y herramientas matemáticas para modelar problemas en física, que al aplicar podrá enfrentar con éxito los cursos de física universitarios.","aboutTheCourse":"<p>Este curso te provee de herramientas matemáticas que te serán de utilidad para modelar problemas en Física necesarios&nbsp; en tu preparación universitaria.<\/p>\n\n<p>Así pues, la filosofía de este curso consiste en cubrir temas conceptuales relativos a la Física y desarrollar tu capacidad de aprender y aplicarlos en tu vida profesional.\n<\/p>\n\n<p>El curso se aborda en dos fases a través de las cuales el alumno:\n<\/p>\n<ul>\n    <li>aprenderá a aplicar el cálculo diferencial e integral para interpretar y modelar la cinemática de una partícula en una dimensión,<\/li>\n    <li>aprenderá el manejo de cantidades físicas vectoriales en forma gráfica y analítica en dos y tres dimensiones.<\/li>\n<\/ul>","targetAudience":0,"courseSyllabus":"<p>&nbsp; &nbsp; &nbsp;<b>I.<\/b>\nIntroducción al movimiento<br>&nbsp; &nbsp;&nbsp;<b>II.<\/b> Velocidad\ninstantánea y derivadas<br><b>&nbsp; &nbsp;III.<\/b> Teorema\ndel valor promedio e integrales<br><b>&nbsp; IV.<\/b>\nInterpretación de gráficas<br><b>&nbsp; &nbsp;V.<\/b>\nIntroducción a vectores<br><b>&nbsp; VI.<\/b> Vectores\nen el plano cartesiano<br><b>&nbsp;VII.<\/b> Vectores\nen el espacio<br><b>VIII.<\/b>\nProducto punto<br><b>&nbsp; IX.<\/b> Producto cruz<\/p>","courseFormat":"<p>Esta clase consiste en un tema semanal segmentado en 5 sesiones de\nvideo que duran entre 10 y 15 minutos. Cada video se evaluará con un\ndiagnóstico. Al terminar el tema el alumno presentará un examen para evaluar su\naprendizaje y poder avanzar en el curso. Durante cada fase el alumno\ndesarrollará un proyecto que se evaluará para conformar junto con los exámenes\nla calificación final del curso.<\/p>\n\nDurante todo el curso se tendrá un foro abierto\nque estará segmentado por rubros\/temas.","suggestedReadings":"No se requieren lecturas previas","estimatedClassWorkload":"4-5 hours\/week","recommendedBackground":"El alumno debe tener conocimientos de álgebra\nbásica, trigonometría, proporciones, manejo de unidades.","links":{}}