{
    "id": 328,
    "shortName": "intropsych",
    "name": "Introduction to Psychology",
    "language": "en",
    "shortDescription": "This course is all about you ... your mind, your behavior, and what underlies them both.  It will be a fast paced tour of the most important experiments in psychology, one that is intended to fascinate, inform, and provoke deep thought.  Come learn about yourself with us!",
    "aboutTheCourse": "This course highlights the most interesting experiments within the\nfield of psychology, discussing the implications of those studies for our\nunderstanding of the human mind and human behavior. &nbsp;We will explore\nthe brain and some of the cognitive abilities it supports like memory,\nlearning, attention, perception and consciousness. &nbsp;We will examine\nhuman development - both in terms of growing up and growing old - and will\ndiscuss the manner in which the behavior of others affect our own thoughts\nand behavior. &nbsp;Finally we will discuss various forms of mental illness\nand the treatments that are used to help those who suffer from them. &nbsp;\n<br>\n<br>The fact of the matter is that humans routinely do amazing things without\nappreciating how interesting they are. &nbsp;However, we are also routinely\ninfluenced by people and events without always being aware of those influences.\n&nbsp;By the end of this course you will have gained a much better understanding\nand appreciation of who you are and how you work. &nbsp;And I can guarantee\nyou that you'll learn things that you'll be telling your friends and family\nabout, things that will fundamentally change the way you think of yourself\nand others. &nbsp;How can you resist that?!",
    "targetAudience": 0,
    "courseSyllabus": "The course will be 8 weeks long in total, with topics varying as follows.\n<br>\n<br>Week 1: A Brief History and Introduction to the Science of Psychology\n<br>Week 2: The Matter of the Mind\n<br>Week 3: Sensation, Perception, Attention and Awareness\n<br>Week 4: Learning\n<br>Week 5: Memory&nbsp;<br>Week 6: The Social Mind\n<br>Week 7: Mental Illness<br>Week 8: Your Requested Extra Lectures!",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": "No specific background is required. &nbsp;If you have a hungry mind ...\na mind that wants to learn more about itself, then you are most welcome\nin my course!",
    "links": {

    }
}