{"id":2805,"shortName":"bajemostemperatura","name":"Bajemos la temperatura - Por qué se debe evitar un planeta 4°C más cálido","language":"es","shortDescription":"Es evidente que si no tomamos medidas para combatir el cambio climático el mundo será 4 grados centígrados más cálido a finales de siglo. Este incremento de temperatura amenaza nuestra sociedad tras décadas de desarrollo y nos encontramos actualmente en un punto de inflexión decisivo para el futuro de la humanidad. Este curso presenta las últimas evidencias científicas sobre el cambio climático y algunas de las alternativas e iniciativas que debemos empezar a implementar lo antes posible para poder revertir la situación.","aboutTheCourse":"Dados los compromisos existentes, es probable que el mundo se vea abocado a un calentamiento de 4 grados centígrados para finales de este siglo y de 2 grados centígrados para el 2040. Este curso en línea masivo y abierto, MOOC (por sus siglas en inglés), reúne a científicos de renombre con el fin de proporcionar un resumen de las pruebas científicas más recientes y presentar un análisis de los posibles futuros impactos y riesgos, centrándose en los países en vías de desarrollo. El curso ofrece una crónica histórica de los cambios observados en el sistema climático y sus impactos, su relación con el aumento de las emisiones de dióxido de carbono, las correspondientes subidas de la temperatura, el deshielo de los glaciares y los cambios en los patrones de precipitación. Este curso también ofrece diferentes proyecciones que vaticinan un aumento de las sequías, olas de calor y subidas del nivel del mar a lo largo del siglo XXI, con sus implicaciones para la seguridad alimentaria y la seguridad del agua, así como los posibles impactos en la agricultura, la disponibilidad de agua, los ecosistemas y la salud humana.\n<br>\n<br>Este MOOC presenta un análisis de los impactos derivados del eventual calentamiento del planeta de 4 grados centígrados y hace hincapié en la necesidad de que tanto los responsables políticos como las comunidades se planteen seriamente sus opciones de adaptación al cambio climático, recalcando la necesidad de tomar medidas de mitigación de forma urgente. Los participantes también tendrán la oportunidad de comprender los riesgos que implica alcanzar puntos de inflexión irreversibles, como la desintegración del manto de hielo de la Antártica occidental o la muerte y retroceso a gran escala de la selva Amazónica. El curso termina con un debate sobre las principales opciones y alternativas políticas existentes y necesarias para prevenir un calentamiento superior a 2 grados centígrados.<br>\n<br>\nEn el caso de Latinoamérica, las temperaturas extremadamente elevadas y los patrones cambiantes de las precipitaciones tendrán efectos adversos en la productividad agrícola, los regímenes hidrológicos y la biodiversidad. En Brasil, un calentamiento de 2 grados centígrados podría disminuir el rendimiento de los cultivos hasta un 70 por ciento en el caso de la soja y hasta un 50 por ciento en el caso del trigo para el año 2050. La acidificación de los océanos, la subida del nivel del mar, los ciclones tropicales y los cambios de temperatura afectarán enormemente a los hábitats costeros, el turismo, la salud y la seguridad alimentaria e hídrica. Además, el deshielo de los glaciares supondría un peligro para las ciudades andinas. La economía podría verse duramente perjudicada a causa del cambio climático, afectando irremediablemente a la sociedad en general y a los más desfavorecidos en particular. Para el año 2050, si se produjera un calentamiento de 4 grados centígrados en la región de América Latina, las inundaciones costeras y las tormentas podrían causar pérdidas de unos 22 000 millones de dólares, relacionadas esencialmente con daños a las infraestructuras y con pérdidas en el sector turístico.","targetAudience":3,"courseSyllabus":"<div><p>  <strong>Resumen<\/strong>\n    <br>El siguiente resumen presenta los principales temas que cubrirá este curso y proporciona un compendio de los mayores impactos y retos de un planeta 4 grados centígrados más cálido. \n    <br>\n    <br>\n    <strong>1ª semana - Cambios climáticos observados y sus impactos a lo largo de la historia<\/strong>\n    <br>\n  Este módulo recapitula los cambios observados a lo largo de la historia en el sistema climático que nos han conducido a la situación presente y los impactos climáticosque hoy en día se atribuyen fundamentalmente a la mano del hombre. En este módulo, se examina el aumento de las emisiones de gases de efecto invernadero desde los tiempos preindustriales, se explica el vínculo entre las concentraciones de CO2 y la subida de la temperatura media mundial, la acumulación de calor en los océanos, la subida del nivel del mar y se plantean  algunas dudas relacionadas con ciertas evidencias científicas.Finalmente, se describe también la creciente pérdida de hielo en Groenlandia y la Antártida, el deshielo paulatinode los glaciares de montaña, la mayor frecuencia de oleadas de calor, el aumento de temperaturas extremas y la creciente propensión a padecer grandes sequías y extrema aridez.<br>\n    <br>\n    <strong>2ª semana - Posibles climas en el siglo XXI<\/strong>\n    <br>\n    Este módulo presenta una visión general de los cambios proyectados en el clima hasta finales del siglo XXI. Describe la probabilidad de un mundo 4 grados centígrados más cálido en 2100 y permite comprender más a fondo los diferentes modelos climáticos existentes, las diferentes proyecciones y la incertidumbre que existe en torno a ciertas áreas clave. También revisa posibles reacciones de los sistemas naturales, explicando cómo los cambios climáticos proyectados, al pasar de un calentamiento de 2 grados centígrados a un calentamiento de 4 grados centígrados, provocarían la subida del nivel del mar, olas de calor, temperaturas extremas y la acidificación de los océanos.\n\n    <br>\n    <br>\n    <strong>3ª semana - La vida en un mundo 4 grados centígrados más cálido<\/strong>\n    <br>\nEste módulo presenta una visión general de los impactos actuales del cambio climático y los proyectados en diferentes sistemas fundamentales de los que depende el ser humano, como por ejemplo la agricultura, la producción de alimentos, los recursos hídricos, los ecosistemas, la biodiversidad y la salud humana. Cada uno de estos sistemas se verá negativamente afectado por el cambio climático en un escenario con 4 grados centígrados más, lo que provocará consecuencias negativas para el desarrollo tales como la disminución del rendimiento de los cultivos (que a su vez amenaza la producción de alimentos y la salud humana), la pérdida de biodiversidad, la propagación de enfermedades transmitidas por vectores y la escasez de agua. Este módulo también destaca los riesgos de los impactos no lineales y los impactos en cadena, así como el riesgo de sobrepasar ciertos umbrales críticos que corresponden a puntos de inflexión irreversibles, lo cual aumentaría considerablemente la vulnerabilidad al cambio climático y sometería el desarrollo a múltiples presiones insostenibles.\n   \n    <br>\n    <br>\n    <strong>4ª semana - ¿Qué podemos hacer al respecto? La elección es suya (debate)<\/strong>\n    <br>\nDespués de haber presentado las últimas pruebas científicas en los módulos anteriores, este último módulo va más allá de los informes <i>Bajemos la temperatura y<\/i> abre un debate sobre qué medidas de mitigación y adaptación son necesarias para evitar un mundo 4 grados centígrados más cálido y cómo disminuir la vulnerabilidad a los impactos climáticos y desarrollar una resiliencia adecuada para el cambio climático. Puesto que no existe una sola política o alternativa que nos ayude a solucionar el problema climático, en este módulo se compartirán diferentes perspectivas sobre lo que se puede hacer a nivel mundial, nacional y subnacional, así como a nivel individual, para converger hacia un  modelo de desarrollo con menos emisiones y una mayor capacidad de recuperación frente a los efectos del cambio climático. A través del debate y la exposición de los diferentes argumentos y los motivos para actuar ahora, actuar de común acuerdo y actuar de manera diferente, el módulo presenta ejemplos de políticas de mitigación y adaptación al cambio climático y los beneficios que se esperan obtener de ellas, considerando el impacto relacionado con la reducción de emisiones y las oportunidades de desarrollo local. <br>\n<br>\n <strong>5ª semana: Impactos regionales en América Latina y el Caribe y efectos en el desarrollo<\/strong>\n    <br>\nBasado en las conclusiones científicas del tercer informe de la serie<i> Bajemos la temperatura<\/i>, en este módulo se explorarán las tendencias y los impactos del clima en sectores claves para el desarrollo en la región de América Latina y el Caribe. En el módulo se examinarán los posibles impactos derivados del calentamiento actual (0,8 °C) y las proyecciones de 2 grados centígrados y de 4 grados centígrados por encima de las temperaturas preindustriales en la producción agrícola, en los recursos hídricos, los servicios ecosistémicos y la vulnerabilidad costera para las poblaciones de dicha región. En algunas regiones, estos riesgos podrían llegar a echar por tierra los progresos conseguidos con gran esfuerzo en materia de desarrollo, dejando atrapadas en la pobreza a millones de personas, lo que subraya la necesidad urgente de actuar en consecuencia.<br>\n<br>\n\n\nDependiendo de su interés particular y sus conocimientos, puede elegir entre una de estas dos alternativas.<br>\n<\/p><ul>\n  <li>Alternativa 1: Campeones climáticos<\/li>\n  <li>Alternativa 2: Liderazgo y políticas de cambio climático<\/li><\/ul>\n <strong>Alternativa 1: Campeones climáticos<\/strong><br><br>\n \n\n<ul>\n<strong>Destinatarios<\/strong><br>\nLa alternativa “campeones climáticos” es adecuada para cualquier persona que tenga interés en el cambio climático. Proporciona información sobre las evidencias y los resultados científicos existentes que explican el cambio climático y provee una oportunidad única para ampliar aún más sus conocimientos sobre la materia.<br>\n <br>\n<strong>Objetivo común<\/strong><br>\nEntender los cambios observados en el sistema climático, sus causas y consecuencias inmediatas, así como los impactos proyectados a medio y largo plazo en el desarrollo.<br>\n<br>\n\n<strong>Objetivos específicos de cada trayectoria<\/strong><br>\nDescribir el contexto climático con el nivel actual de calentamiento de 0,8 °C y mostrar cómo los cambios de temperatura proyectados (con un calentamiento de 2 °C a 4 °C) podrían afectar a sistemas como la agricultura, los recursos hídricos, los ecosistemas y la salud.<br>\n<br>\n\n\nConcienciar cómo el estilo de vida personal y diario contribuye a cambios en el sistema climático y compartir las medidas que cada uno puede tomar para reducir su impacto en el clima o su huella de carbono.<br>\n<br>\n<strong>Tareas<\/strong>\n<ul>\n      <li>Las tareas se centran en facilitar una comprensión básica de los últimos resultados científicos.<\/li><li>Aprenderá a aplicar los conocimientos adquiridos a su vida diaria y tener un impacto positivo en la lucha contra el cambio climático.<\/li>\n<\/ul>\n<\/ul>\n<br>\n<strong>Alternativa 2: Liderazgo y políticas de cambio climático<\/strong><br>\n<br>\n \n\n<ul>\n  <strong>Destinatarios<\/strong><br>\nLa alternativa “liderazgo y políticas de cambio climático” le permitirá establecer contacto con otras personas en posiciones similares alrededor del  mundo (ej. legisladores, personal de Gobiernos provinciales y nacionales, representantes de la sociedad civil y académicos) y  crear nuevas redes de cooperación mutua y buenas prácticas  relacionadas con el cambio climático.<br>\n <br>\n<strong>Objetivo común<\/strong><br>\nEntender los cambios observados en el sistema climático, sus causas y consecuencias inmediatas, así como los impactos proyectados a medio y largo plazo en el desarrollo.<br>\n<br>\n\n<strong>Objetivos específicos de cada trayectoria<\/strong><br>\nInterpretar críticamente diferentes proyecciones climáticas y mostrar cómo estos cambios de temperatura proyectados (con un calentamiento de 2 °C a 4 °C) podrían afectar a sectores como la agricultura, los recursos hídricos, los ecosistemas y la salud humana.<br>\n<br>\nDebatir y distinguir las diferentes alternativas políticas adecuadas que los países y organizaciones pueden implementar para ayudar a mitigar el cambio climático y adaptarse a él.<br>\n<br>\n<strong>Tareas<\/strong>\n<ul>\n      <li>Las tareas se centran principalmente en las diferentes intervenciones políticas posibles en los diferentes sectores que necesitan urgentemente acciones para afrontar el cambio climático. El curso le ayudará también a establecer contacto con otras personas en posiciones similares a la suya.<\/li><li>Será capaz de aplicar los conocimientos adquiridos en su país, teniendo en cuenta su contexto político.<\/li><\/ul>\n\n\n\n\n<\/ul>\n<h2>Connect<\/h2>\nComuníquese y comparta recursos a través de Twitter utilizando el hashtag <a target=\"_blank\" href=\"https:\/\/twitter.com\/search?q=CambioClim%C3%A1tico\">#CambioClimático<\/a>. Regístrese para obtener una cuenta gratuita en <a target=\"_blank\" href=\"https:\/\/twitter.com\/\">http:\/\/twitter.com<\/a>.\n<p><\/p><\/div>","courseFormat":"Este MOOC está dividido en cinco partes que se desarrollan durante cinco semanas sucesivas, con recursos, actividades y ejercicios que le permitirán participar de manera activa durante cada una de ellas. Cada semana encontrará diversos materiales de estudio, a saber: \n<br><br>\n    <ul>\n\n                 <li><strong>Festival de Cine Climático<\/strong>: 22 vídeos con charlas de reconocidos climatólogos y profesionales del campo de la climatología<\/li>\n\n                 <li><strong>Recursos:<\/strong> divertidos recursos interactivos básicos y otros opcionales (inmersiones) para ahondar más sobre los temas de la semana<\/li>\n              <li><strong>Cuestionarios<\/strong> que sirven para comprobar sus conocimientos, reforzar el material  de la lección y proporcionar aclaraciones inmediatas<\/li>\n               <li><strong>Tareas<\/strong> que perfeccionarán sus aptitudes para el análisis, la reflexión y la comunicación<\/li>\n               <li><strong>Foros de debate y redes sociales<\/strong> que permiten la colaboración con otras personas de todo el mundo, enriqueciendo la interacción entre todos los participantes<\/li>\n               <li>\n             \tUnevento en directo con expertos internacionales que presentarán las últimasevidencias científicasy discutirán las diferentes medidas que pueden adoptarse para seguir combatiendo el cambio climático y mejorar la resiliencia de Latinoamérica y el Caribe. <\/li>\n               <li>\n               Como proyecto final, usted creará una <strong>presentación digital<\/strong>. <\/li>\n             <\/ul>\n\nSi satisface los requisitos del curso, recibirá un certificado de realización expedido por Coursera. Para finalizar el curso, se exige acumular una puntuación mínima de un 50 por ciento en las siguientes actividades obligatorias: cuatro cuestionarios, unejercicio evaluado por otros alumnos y el proyecto final. Recibirá una distinción especial si consigue un 80 por ciento o más. Para utilizar los recursos básicos necesarios y realizar las tareas mínimas requeridas para superar el curso necesitará dedicarle tres horas por semana.Una vez comience el curso se proporcionarán más detalles. Tendrá la posibilidad de profundizar más en la materia a través de ejercicios opcionales, redes, foros de debate y explorando en general en nuestra amplia selección de recursos adicionales.\nTambién se utilizarán debates digitales,  herramientas para facilitar el diálogo entre los alumnos y expertos y se hará un evento en directocon expertos internacionales en cambio climático.","suggestedReadings":"<p>›&nbsp;&nbsp;<a target=\"_blank\" href=\"http:\/\/www-wds.worldbank.org\/external\/default\/WDSContentServer\/WDSP\/IB\/2013\/06\/13\/000445729_20130613121114\/Rendered\/PDF\/632190v20SPANI00heat0report0Spanish.pdf\">Banco Mundial. Bajemos la temperatura -  Por qué se debe evitar un planeta 4 ºC &nbsp;&nbsp;&nbsp;más cálido. 2012.<\/a><br><br>\n\n\n›&nbsp;&nbsp;Banco Mundial. Bajemos la temperatura - Por qué se debe evitar un planeta 4 ºC &nbsp;&nbsp;&nbsp;más cálido.&nbsp;Resumen ejecutivo. 2012. Disponible en <a target=\"_blank\" href=\"http:\/\/www-wds.worldbank.org\/external\/default\/WDSContentServer\/WDSP\/IB\/2013\/03\/26\/000445729_20130326120429\/Rendered\/PDF\/632190WP0Turn000Box374367B00PUBLIC0.pdf\">inglés<\/a>, <a target=\"_blank\" href=\"http:\/\/www-wds.worldbank.org\/external\/default\/WDSContentServer\/WDSP\/IB\/2013\/03\/26\/000333037_20130326142304\/Rendered\/PDF\/632190WP0Turn000Box374367B00PUBLIC0.pdf\">español<\/a>, <a target=\"_blank\" href=\"http:\/\/www-wds.worldbank.org\/external\/default\/WDSContentServer\/WDSP\/IB\/2013\/03\/26\/000445729_20130326121410\/Rendered\/PDF\/632190WP0Turn000Box374367B00PUBLIC0.pdf\">francés<\/a>, &nbsp;&nbsp;&nbsp;<a target=\"_blank\" href=\"http:\/\/www-wds.worldbank.org\/external\/default\/WDSContentServer\/WDSP\/IB\/2013\/05\/22\/000356161_20130522114206\/Rendered\/PDF\/632190GERMAN0100Box377313B00PUBLIC0.pdf\">alemán<\/a>, <a target=\"_blank\" href=\"http:\/\/www-wds.worldbank.org\/external\/default\/WDSContentServer\/WDSP\/IB\/2013\/03\/26\/000445729_20130326122236\/Rendered\/PDF\/632190WP0Turn000Box374367B00PUBLIC0.pdf\">árabe<\/a> o <a target=\"_blank\" href=\"http:\/\/www-wds.worldbank.org\/external\/default\/WDSContentServer\/WDSP\/IB\/2013\/03\/26\/000333037_20130326141416\/Rendered\/PDF\/632190WP0Turn000Box374367B00PUBLIC0.pdf\">portugués<\/a><br><br>\n\n\n\n›&nbsp;&nbsp;<a target=\"_blank\" href=\"http:\/\/www-wds.worldbank.org\/external\/default\/WDSContentServer\/WDSP\/IB\/2013\/06\/14\/000445729_20130614145941\/Rendered\/PDF\/784240WP0Full00D0CONF0to0June19090L.pdf\">Banco Mundial. Bajemos la temperatura - Fenómenos climáticos extremos, &nbsp;&nbsp;&nbsp;impactos regionales, y posibilidades de adaptación, 2013.<\/a> El resumen ejecutivo está &nbsp;&nbsp;&nbsp;disponible en español.<br>\n<br>\n›&nbsp;&nbsp;Banco Mundial. <a target=\"_blank\" href=\"http:\/\/www-wds.worldbank.org\/external\/default\/WDSContentServer\/WDSP\/IB\/2014\/11\/20\/000406484_20141120090713\/Rendered\/PDF\/927040v20WP00O0ull0Report000English.pdf\">Bajemos la Temperatura -  Cómo hacer frente a la nueva realidad &nbsp;&nbsp;&nbsp;climática. 2014.<\/a> El resumen ejecutivo <br> &nbsp;&nbsp;&nbsp;está disponible en <a target=\"_blank\" href=\"http:\/\/www-wds.worldbank.org\/external\/default\/WDSContentServer\/WDSP\/IB\/2014\/11\/23\/000112742_20141123122743\/Rendered\/PDF\/927040v10Spani09SPAspa0010NOEmbargo.pdf\">español.<\/a><br><br>\n\n›&nbsp;&nbsp;Banco Mundial. <a target=\"_blank\" href=\"http:\/\/www-wds.worldbank.org\/external\/default\/WDSContentServer\/WDSP\/IB\/2014\/12\/01\/000456286_20141201140248\/Rendered\/PDF\/927040WP0v30SP0t0Box38537500PUBLIC0.pdf\">Bajemos la temperatura - Cómo hacer frente a la nueva realidad &nbsp;&nbsp;&nbsp;climática - América Latina y el Caribe - resumen regional<\/a>.<br><br>\n\n›&nbsp;&nbsp;<a target=\"_blank\" href=\"https:\/\/www.ipcc.ch\/pdf\/assessment-report\/ar5\/wg2\/ar5_wgII_spm_es.pdf\">Quinto Informe de Evaluación del IPCC  - Resumen para responsables de políticas. &nbsp;&nbsp;&nbsp;2014.<\/a><br><br>\n\n\n›&nbsp;&nbsp;<a target=\"_blank\" href=\"http:\/\/www.climatechange2013.org\/images\/uploads\/WGI_AR5_SPM_brochure.pdf\">Contribución del Grupo de trabajo I al Quinto Informe de Evaluación del IPCC: &nbsp;&nbsp;&nbsp;CAMBIO CLIMÁTICO 2013 - Bases físicas - Resumen para responsables <br>\n &nbsp;&nbsp;&nbsp;de políticas<\/a><br><br>\n\n›&nbsp;&nbsp;<a target=\"_blank\" href=\"http:\/\/report.mitigation2014.org\/spm\/ipcc_wg3_ar5_summary-for-policymakers_approved.pdf\">Contribución del Grupo de trabajo III al Quinto Informe de Evaluación del IPCC: &nbsp;&nbsp;&nbsp;CAMBIO CLIMÁTICO 2014 - Mitigación del cambio climático - Resumen para  <br> &nbsp;&nbsp;&nbsp;responsables de políticas<\/a><br>\n<br>\n›&nbsp;&nbsp;<a target=\"_blank\" href=\"http:\/\/ipcc-wg2.gov\/AR5\/images\/uploads\/WG2AR5_SPM_FINAL.pdf\">Contribución del Grupo de trabajo III al Quinto Informe de Evaluación del IPCC: &nbsp;&nbsp;&nbsp;CAMBIO CLIMÁTICO 2014 - Impactos, adaptación y vulnerabilidad<\/a><\/p>","estimatedClassWorkload":"3-5 hours\/week","recommendedBackground":"","links":{}}