{
    "id": 474,
    "shortName": "googlemedia",
    "name": "Understanding Media by Understanding Google",
    "language": "en",
    "shortDescription": "Few people who “just Google it” to find an answer to their every question understand just what the company does (and why). Through this course, you'll join the minority that really gets it.",
    "aboutTheCourse": "<p>Google Inc. is one of the key success stories of the Internet era. The\n    company has expanded beyond its original search business through innovation\n    and acquisition to touch the lives of nearly every person who lives life\n    online. For example, Americans spend more than 3,400 hours per year using consumer media,\n    the field where Google’s impact is most profound, and citizens around the world must\n    understand what the&nbsp;company has wrought&nbsp;not only to control their offline and online environments, but also to interact and engage successfully\n    with anyone in&nbsp;our&nbsp;professional and personal lives.<\/p>\n<p>Enrollees in this course learn how to understand the tactics that modern media companies,\n    journalists, marketers, politicians, technologists, and social networks\n    are using to reach them and affect their behavior. They learn how to\n    adopt strategies that put them on an even footing with these entities in\n    achieving their own communications goals. They&nbsp;<\/p>\n<ul>\n    <li>think about, react to, and write about excerpts from half a dozen important books;&nbsp;<\/li>\n    <li>read a sampling of newspaper and magazine reportage from Google’s entire\n        history;<\/li>\n    <li>monitor news sites and specialized blogs about the company and its competitors while the course is in session;<\/li>\n    <li>take note of their own usage of Google and other online resources;\n        and<\/li>\n    <li>learn how to anticipate the future impact of the company and its competitors\n        on aspects of the media such as information consumption, creation, and distribution.&nbsp;<\/li><\/ul>",
    "targetAudience": 1,
    "courseSyllabus": "<b>Weekly topics<br><\/b>\n<br>Week 1: The Age of Google\n<br><ul><li>Introduction: Why study Google and the media? &nbsp;&nbsp;<br><\/li><li>Search and Research<br><\/li><\/ul>\n\nWeek 2: Google and Publishing&nbsp;\n<br>\n<ul>\n    <li>Google and News<\/li>\n    <li>Google and Books<\/li>\n<\/ul>Week 3: Google and Advertising\n<br>\n<ul>\n    <li>How and Why the Magic Works<\/li>\n    <li>Advertising Personalization and Privacy<\/li>\n<\/ul>Week 4: Google and Video\n<br>\n<ul>\n    <li>Google, YouTube, and You<\/li>\n    <li>YouTube (and Google) and the News<\/li>\n<\/ul>Week 5: Google and Mobile\n<br>\n<ul>\n    <li>Google and Smartphones<\/li>\n    <li>Google and \"Wearable\"<\/li>\n<\/ul>Week 6: Google, Social Media, and Privacy\n<br>\n<ul>\n    <li>Google's Social Circle<\/li>\n    <li>The Private, The Public, and the Politic(s)<\/li>\n<\/ul>",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": "First and foremost, students should enjoy reading! They should also be curious about the companies, including but not limited to Google, whose products\nand services have come to define the Internet. Finally, students should also be willing to examine\ntheir own habits and behaviors in new contexts and be open to new ideas and opinions.",
    "links": {

    }
}