{
    "id": 1135,
    "shortName": "biomodeling",
    "name": "Моделирование биологических молекул на GPU (Biomolecular modeling on GPU)",
    "language": "ru",
    "shortDescription": "Моделирование биологических молекул - одна из бурно развивающихся областей современной науки. В курсе даются основы строения биомолекул, примеры применения программных пакетов для молекулярного моделирования, разъясняются подходы к математическому описанию молекулярных систем и разбирается программная реализация этих подходов на центральном и графическом процессорах.",
    "aboutTheCourse": "<div><div>С развитием компьютерной техники, вычислительный эксперимент стал неотъемлемой частью любого научного исследования. На сегодняшний день, компьютеры помогают решать целый спектр различных задач - от гидродинамики до макроэкономики. В исследованиях биологических молекул, вычислительный эксперимент закрепился сравнительно недавно. Виной тому - сложность структуры биомолекул, которые могут насчитывать сотни, тысячи или даже десятки, сотни тысяч атомов. Под словом \"моделирование\" в названии курса подразумевается как раз вычислительный эксперимент. В начале XXI века, благодаря появлению новой высокопараллельной аппаратной платформы - графических процессоров, вычислительный эксперимент получил новый виток развития. Решение множества вычислительных задач - хорошо параллелизуемо. То есть, различные части расчёта можно производить одновременно. Одной из таких задач является молекулярное моделирование.<\/div><div><br><\/div><div>Цель данного курса - обеспечить понимание основных принципов молекулярного моделирования. В первой части пособия дан обзор строения различных биологических молекул - от последовательности до трёхмерной структуры. Далее разъяснены методы молекулярной механики и динамики, а также рассмотрены предпосылки использования различных подходов к моделированию. В качестве первого практического примера рассмотрена простая задача моделирования с применением общедоступного бесплатного пакета NAMD, разъяснены основы метода молекулярной динамики и использования программного пакета VMD для визуализации и анализа результатов. В последней части курса детально разобраны методы реализации численных методов молекулярного моделирования - как на центральном процессоре, так и на графическом. В курсе даётся вводная информация об устройстве ГП и его использовании для численных расчётов. Курс расчитан на студентов технических специальностей.<\/div><div><br><\/div><div>В рамках курса, слушатели узнают основы строения биологических молекул, научатся искать и визуализировать их структуры. Навыки использования готовых программных пакетов для биомолекулярного моделирования позволят наблюдать за динамикой каждого атома биомолекулы. Знания используемого в молекулярном моделировании математического формализма помогут лучше понимать возможности и ограничения молекулярного моделирования. Основы языка CUDA для программирования на графических процессорах будут закреплены программная реализация простой задачи молекулярного моделирования.<\/div><div><br><\/div><div>Данный курс будет интересен студентам технических специальностей, которые научатся применять уже имеющиеся у них знания в новой области. Студенты биолгических специальностей получат необходимые знания для применения вычислительного эксперимента в их деятельности.<\/div><\/div>",
    "targetAudience": 1,
    "courseSyllabus": "<div><b>Неделя 1<\/b>. Введение. Вычислительный эксперимент в биологии. Эксперимент, теория и моделирование. Биологические молекулы. Вода. Аминокислоты и первичная структура белка. Типы вторичных структур. Третичная и четверичная структура белка.<\/div><div><b>Неделя 2<\/b>. Проблема фолдинга белков. Примеры белков и белковых комплексов. Эксперименты на единичных молекулах. Нуклеиновые кислоты. База данных белковых структур <a href=\"http:\/\/www.pdb.org\">www.pdb.org<\/a>. Пакет VMD для визуализации и анализа структуры биологических молекул.<\/div><div><b>Неделя 3<\/b>. Молекулярная механика. Три фундаментальных принципа молекулярной механики: аддитивность, гипотеза переносимости и термодинамическая гипотеза. Понятие силового поля. Потенциальная функция и её параметры. Молекулярная динамика и крупнозернистое моделирование.<\/div><div><b>Неделя 4<\/b>. Моделирование простой молекулы методами молекулярной динамики с использованием программного пакета NAMD2. Построение топологии системы: добавление недостающих атомов, молекул растворителя и ионов. Минимизация энергии, нагрев системы и равновесное моделирование.<\/div><div><b>Неделя 5<\/b>. Графические процессоры (ГП). Архитектура ГП. Программирование на графических процессорах. Технология CUDA. Вычислительные ядра, работа с памятью ГП, организация работы программы. Пример.<\/div><div><b>Неделя 6<\/b>. Численные методы молекулярной динамики и их реализация на центральном и графическом процессоре. Постановка задачи, реализация численного интегрирования уравнений движения.<\/div><div><b>Неделя 7<\/b>. Численные методы молекулярной динамики и их реализация на центральном и графическом процессоре (продолжение). Реализация потенциалов ковалентного взаимодействия атомов. Реализация невалентного потенциала. Методы оптимизации расчёта.<\/div>",
    "estimatedClassWorkload": "5-6 hours\/week",
    "recommendedBackground": "Знания основ программирования на языке C. Доступ к ПК, который можно не выключать в течении ~5 дней. Крайне рекомендуется наличие графической карты компании NVidia",
    "links": {

    }
}