{
    "id": 1136,
    "shortName": "latex",
    "name": "Документы и презентации в LaTeX (Introduction to LaTeX)",
    "language": "ru",
    "shortDescription": "LaTeX (читается «латех») — научная издательская система. На этом курсе вы узнаете, как оформить ваши идеи в виде красивого, профессионально сверстанного текста или слайдов презентации.\n\nLaTeX ('lay-tech') is a desktop publishing system for academic publications. Learn how to put your research into professionally looking form of a printed text or presentation slides.",
    "aboutTheCourse": "Система <b>LaTeX<\/b> — стандарт в научном мире. Лучшие математические, физические и экономические журналы издаются в LaTeX и рекомендуют авторам использовать его для подготовки рукописей. LaTeX не очень прост в освоении, но обладает массой преимуществ перед популярными текстовыми процессорами и редакторами презентаций:<br><ul><li>высококачественная верстка — текст выглядит «как в книжке»;<br><\/li><li>удобная работа со сложными математическими формулами;<br><\/li><li>отличная кросс-платформенная совместимость;<br><\/li><li>автоматизация многих рутинных процессов: нумерации формул, рисунков, таблиц, разделов документа, перекрестных ссылок, создания колонтитулов, оформления стилей заголовков и т. п.;<br><\/li><li>огромное сообщество пользователей и разработчиков, пакеты-расширения на все случаи жизни.<\/li><\/ul>LaTeX облегчает жизнь всем, кому приходится оформлять эссе, рефераты, курсовые и дипломные работы, диссертации, а также слайды презентаций на их основе. Пользователи, освоившие LaTeX, вспоминают верстку сложных документов в Word и создание больших презентаций в PowerPoint как страшный сон.<br><p>Если вы сомневаетесь, стоит ли вам изучать LaTeX, почитайте более подробно о его преимуществах (по-английски):<\/p><ul><li><a href=\"http:\/\/www.ctan.org\/tex\/\">http:\/\/www.ctan.org\/tex\/<\/a><\/li><li><a href=\"http:\/\/www.andy-roberts.net\/writing\/latex\/benefits\" title=\"Link: http:\/\/www.andy-roberts.net\/writing\/latex\/benefits\">http:\/\/www.andy-roberts.net\/writing\/latex\/benefits<\/a><\/li><li><a href=\"http:\/\/ricardo.ecn.wfu.edu\/~cottrell\/wp.html\">http:\/\/ricardo.ecn.wfu.edu\/~cottrell\/wp.html<\/a><\/li><li><a href=\"http:\/\/www.tug.org\/TUGboat\/tb22-1-2\/tb70heff.pdf\">http:\/\/www.tug.org\/TUGboat\/tb22-1-2\/tb70heff.pdf<\/a><\/li><\/ul>У курса есть официальная группа в социальной сети «ВКонтакте»: <a href=\"https:\/\/vk.com\/hse.latex\">https:\/\/vk.com\/hse.latex<\/a>.<br><br><p><b>LaTeX<\/b> is the standard in the scientific world. The best mathematical, physical and economic journals are published in LaTeX and authors are encouraged to use it for manuscripts. LaTeX is quite difficult to learn, but it<b> <\/b>has many advantages over the most popular word processors and presentation software:<\/p><ul><li>high-quality typography – text looks as it would in a well published book;<\/li><li>easy to typeset with complex mathematical formulas;<\/li><li>excellent cross-platform compatibility;<\/li><li>automation of many routine processes, i.e. to number formulas, figures, tables, document sections, to create cross references, headers, footers and design styles, etc.;<\/li><li>a worldwide community of users and developers; extension packages for any occasion.<\/li><\/ul><p>LaTeX is an excellent tool for everyone who is going to draw up an essay, term paper, thesis or dissertation, as well as the presentation slides based upon them. Users who have learned LaTeX, can not ever conceive that they were once creating complex documents in Word or presentations in PowerPoint.<\/p><p>If you are in doubt about whether you need to learn LaTeX or not, feel free to read more about its benefits (in English):<\/p><ul><li><a href=\"http:\/\/www.ctan.org\/tex\/\" target=\"_blank\">http:\/\/www.ctan.org\/tex\/<\/a><\/li><li><a href=\"http:\/\/www.andy-roberts.net\/writing\/latex\/benefits\" target=\"_blank\">http:\/\/www.andy-roberts.net\/writing\/latex\/benefits<\/a><\/li><li><a href=\"http:\/\/ricardo.ecn.wfu.edu\/~cottrell\/wp.html\" target=\"_blank\" title=\"Link: http:\/\/ricardo.ecn.wfu.edu\/~cottrell\/wp.html\">http:\/\/ricardo.ecn.wfu.edu\/~cottrell\/wp.html<\/a><\/li><li><a href=\"http:\/\/www.tug.org\/TUGboat\/tb22-1-2\/tb70heff.pdf\" target=\"_blank\" title=\"Link: http:\/\/www.tug.org\/TUGboat\/tb22-1-2\/tb70heff.pdf\">http:\/\/www.tug.org\/TUGboat\/tb22-1-2\/tb70heff.pdf<\/a><\/li><\/ul><p>This course offers a special page at the «VKontakte» social network (in Russian): <a href=\"https:\/\/vk.com\/hse.latex\" target=\"_blank\">https:\/\/vk.com\/hse.latex<\/a>.<\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<h2>Первая неделя<\/h2>\n<i><b>Введение.<\/b><\/i> Устройство издательской системы LaTeX. Программные средства и онлайн-ресурсы, полезные в обучении и дальнейшей работе с системой.\n<p><i><b>Базовые свойства документа.<\/b><\/i> Классы документа, подключение пакетов, деление на главы и параграфы. Команды языка LaTeX.&nbsp;Перекрестные ссылки внутри документа.<\/p>\n<p><i><b>Математика в LaTeX.<\/b><\/i>&nbsp;Набор простейших формул. Формулы в строке и выключные формулы, нумерация. Начертания символов, индексы, дроби, высота скобок, распространенные математические и экономические обозначения. Различные способы группировки формул,\n    многострочные формулы, системы уравнений, матрицы. Дополнительные пакеты для работы с формулами. &nbsp; &nbsp;\n<\/p>\n<h2>Вторая неделя<\/h2><i><b>Рисунки.<\/b><\/i>&nbsp;Растровый или векторный рисунок&nbsp;как объект в тексте. Окружение рисунков: заголовок, номер,&nbsp;перекрестные ссылки&nbsp; Масштабирование и другие модификации, рамки вокруг рисунков. Обтекаемые рисунки.&nbsp;<i><b><br>Таблицы.<\/b><\/i>&nbsp;Система единиц измерения в&nbsp;LaTeX.&nbsp;Таблица как объект в тексте. Окружение таблицы: заголовок, номер, перекрестные ссылки. Объединение ячеек, начертания линий сетки. Выравнивание в ячейках. Многостраничные таблицы. Обтекаемые таблицы. Оформление автоматических списков рисунков и таблиц.\n<h2>Третья неделя<\/h2><i><b>Оформление текста и отдельных абзацев.<\/b><\/i>&nbsp;Подробности о классах документа: выбор подходящего класса. Поля, колонтитулы,&nbsp;ориентация и размер листа, размер шрифта, междустрочный интервал. Разрыв страницы, вертикальные пробелы. Оформление аннотации (abstract). Оформление стандартного титульного листа (пример). Многоуровневая структура документа: главы, разделы, подразделы и т. д., приложения. Сноски. Оглавление, списки таблиц и иллюстраций. Гиперссылки на места документа и внешние источники. Оформление маркированных и нумерованных перечней. Оформление текста в несколько колонок. &nbsp; &nbsp;<br><br>\n<i><b>Счетчики и макрокоманды.<\/b><\/i>&nbsp;Объекты типа «теорема». Простейшее программирование: макрокоманды и их аргументы. Пакеты, расширяющие возможности программирования. Счетчики: использование и переподчинение стандартных (нумерация страниц, глав, разделов,\nтеорем и т. п.) и определение новых. Пример: создание команд для верстки объектов типа «задача» и «решение». &nbsp; &nbsp;<br><h2>Четвертая неделя<\/h2><i><b>Работа с библиографией.<\/b>&nbsp;<\/i>Оформление библиографического списка и ссылок на источники стандартным методом. Пакет BibTeX: создание коллекции источников и интеграция ее с документами LaTeX. Стандарты цитирования.<br><i><b><br>Графика в пакете TikZ.<\/b><\/i>&nbsp;Создание простейшей векторной графики средствами LaTeX и его расширений. Принципы работы с пакетом&nbsp;<i>TikZ<\/i>. Создание основных объектов: осей координат, геометрических фигур, графиков функций. Примеры использования <i>TikZ<\/i>&nbsp;для\nиллюстраций к экономическим моделям. Сторонние приложения, облегчающие создание графики <i>(GeoGebra)<\/i>.\n<h2>Пятая неделя<\/h2><p><b><i>Русский язык в LaTeX.<\/i><\/b>&nbsp;Особенности работы с документами, набранными с использованием русского языка. Кириллические шрифты.&nbsp;Особенности верстки русскоязычных документов.<b><i><\/i><\/b>&nbsp;<i><b><br><\/b><\/i><\/p><p><i><b>Презентации.<\/b>&nbsp;<\/i>Пакет <i>beamer<\/i>: общее устройство. Выбор стиля презентации, его настройка (вставка логотипов и др.). Оформление титульного слайда. Структура презентации: разделы, слайды, блоки. Специальные средства выделения текста на слайдах.\n    Режим <i>handout<\/i> для печати раздаточного материала. Постепенное появление объектов на слайдах, изменение их начертания между слайдами. Активные объекты: кнопки гиперссылок и перехода между слайдами. Пакет lecture для оформления циклов презентаций.<\/p><p><br><\/p>",
    "estimatedClassWorkload": "4-8 hours\/week",
    "recommendedBackground": "<p><\/p>Предварительная подготовка не требуется.<p><\/p>",
    "links": {

    }
}