{
    "id": 2288,
    "shortName": "scalingoperations",
    "name": "Scaling operations: Linking strategy and execution",
    "language": "en",
    "shortDescription": "Over the past several decades, operations strategy has played an increasingly important role in business’ success. In this course, we will equip you with concepts and tools to build operations in a way that not only supports your competitive strategy, but also allows you to create new opportunities in the market place.",
    "aboutTheCourse": "Scaling operations: Linking strategy and execution is a five-week course dedicated to making strategic decisions that are grounded in operational reality. Together, we will study how to build and evaluate the “operating system” of the firm to maximize value. This involves tailoring the firm’s operational competencies, assets, and processes to a specific business strategy.<br><br>Each week, we’ll explore case studies, engage in discussions and examine realistic data. Thanks to our data-driven approach, you’ll be able to implement your learning directly into practice. At the end of this course, you’ll be ready to build an effective, actionable plan to scale your department or organization.<br><br>This course will be part of a research study about learning and education. As part of this study, we will use student records, such as quiz scores, video consumptions, etc. All data will be de-identified and statistical procedures on the data are preformed at aggregated level. By participating in the course, you also agree to participate in the study. If students have any questions or any concerns, please contact our team through&nbsp;<a>j-zhang@kellogg.northwestern.edu<\/a>. &nbsp;Questions about your rights as a research&nbsp;participant may be directed to the Institutional Review Board (IRB) Office of Northwestern University through <a href=\"http:\/\/irb.northwestern.edu\/\">irb.northwestern.edu<\/a>.",
    "targetAudience": 1,
    "courseSyllabus": "The course will cover the following topics:<strong><br><br>Week 1<\/strong>: Framework for scaling operations.<br><br><strong>Week 2<\/strong>: Building a cross-functional dashboard. Using an external view of operations, linking operations, marketing and finance. <br><br><strong>Week 3<\/strong>: Competitive cost benchmarking. Cost containment using trade-off curves. <br><br><strong>Week 4<\/strong>: Resources investment: making expansion decisions when facing risks. <br><br><strong>Week 5<\/strong>: Outsourcing: make-or-buy decisions and supplier relationship management.",
    "estimatedClassWorkload": "2-4 hours\/week",
    "recommendedBackground": "Knowledge of and interest in operations strategy is helpful but not necessarily required. This course will appeal particularly to entrepreneurs and small business managers interested in scaling their firms.",
    "links": {

    }
}