{
    "id": 59,
    "shortName": "medicalneuro",
    "name": "Medical Neuroscience",
    "language": "en",
    "shortDescription": "Explore the structure and function of the human central nervous system. Learn why knowledge of human neuroanatomy, neurophysiology, neural plasticity, and new discovery in the brain sciences matters for clinical practice in the health professions.",
    "aboutTheCourse": "Medical Neuroscience explores the organization and physiology of the human central nervous system. This course is designed for first-year students in graduate-level health professions programs. It builds upon knowledge acquired in prior studies of cellular and molecular biology, general physiology, and human anatomy. The course provides students an understanding of the essential principles of neurological function, from cellular and molecular mechanisms of neural signaling and plasticity to the organization and function of sensory and motor systems. This course emphasizes the neural and vascular anatomy of the human brain and spinal cord, providing an anatomical framework for localizing lesions within the central nervous system. It also emphasizes the neurobiological foundation for understanding cognition, mental illness and disorders of human behavior. <br><br> The overall goal is to equip students in the health professions for interpreting impairments of sensation, action and cognition that accompany neurological injury, disease or dysfunction. Students currently pursuing advanced studies in the brain sciences will benefit from this course by learning the fundamentals of functional human neuroanatomy and how neuroscience discovery translates to clinical practice. &nbsp;Health professionals will benefit from the opportunity to review and update knowledge of foundational medical neuroscience.",
    "targetAudience": 1,
    "courseSyllabus": "This course comprises four units of content:<br><ul><li><strong>Unit 1 Neuroanatomy<\/strong>.\n This unit covers the surface anatomy of the human brain, its internal \nstructure, and the overall organization of sensory and motor systems in \nthe brainstem and spinal cord.<\/li><li><strong>Unit 2 Neural signaling<\/strong>.\n This unit addresses the fundamental mechanisms of neuronal \nexcitability, signal generation and propagation, synaptic transmission, \npost synaptic mechanisms of signal integration, and neural plasticity.<\/li><li><strong>Unit 3 Sensory systems<\/strong>.\n Here, you will learn the overall organization and function of the \nsensory systems that contribute to our sense of self relative to the \nworld around us: somatic sensory systems,&nbsp;proprioception,&nbsp;vision, \naudition, and balance senses.<\/li><li><strong>Unit 4 Motor systems<\/strong>.  In this unit, we will examine the organization and function of the brain and spinal mechanisms that govern bodily movement.<\/li><li><strong>Unit 5 Brain Development<\/strong>. Next, we turn our attention to the neurobiological mechanisms for building the nervous system in embryonic development and in early postnatal life; we will also consider how the brain changes across the lifespan.<\/li><li><strong>Unit 6 Cognition<\/strong>. The course concludes with a survey of the association systems of the cerebral hemispheres, with an emphasis on cortical networks that integrate perception, memory and emotion in organizing behavior and planning for the future; we will also consider brain systems for maintaining homeostasis and regulating brain state.<br><\/li><\/ul><div><\/div>",
    "estimatedClassWorkload": "16-20 hours\/week",
    "recommendedBackground": "To be successful in this course, a college-level background in cellular and molecular biology and general knowledge of systems physiology and human anatomy is strongly recommended.",
    "links": {

    }
}