{
    "id": 1262,
    "shortName": "chemprep",
    "name": "Preparation for General Chemistry",
    "language": "en",
    "shortDescription": "The course develops critical thinking and analytic problem solving skills within a chemistry context in order to prepare students for success in college-level General Chemistry—a key gateway class required for many undergraduate majors.",
    "aboutTheCourse": "Chemistry is about atoms and molecules and their transformations,\nand is referred to as the <i>Central Science<\/i> because it connects the\nphysical and life sciences. &nbsp;General Chemistry is your gateway into chemistry, and is\nrequired for majors in just about every field of science, technology and\nmedicine. &nbsp;General Chemistry trains students to think like scientists\nthrough the application of chemical principles to solve problems.<br><br>College-level general chemistry, however, is extremely\nfast-paced, and students are faced with challenges of absorbing new chemistry\nconcepts at the same time they are applied to complex problems. The goal of\nthis class is to prepare students for success in General Chemistry by honing\ntheir chemistry problem solving skills. <br><br>In this class, we will review fundamental mathematical\nskills, as well as provide strategies for general chemistry problem solving. &nbsp;Focus will be placed on selected conceptual areas of chemistry, and then delve deeply into application of these concepts to solve real-world problems. &nbsp;The class emphasizes critical thinking, solution strategies for complex chemical problems and foundational math skills. &nbsp;A goal of this course is to train students to think like scientists, and prepare them for success in university courses in science, technology engineering and mathematics.<br><br>I hope that you enjoy the class!",
    "targetAudience": 0,
    "courseSyllabus": "<b>Week 1 - Introduction and Warm Up: <\/b>Preliminary Assessment given to appraise current knowledge and help set goals; introductory material, including matter and energy, classification and properties of matter, scientific measurement and units, significant figures, dimensional analysis, and problem-solving strategies.<b><br><br>Week 2 - Boot-Camp I: &nbsp;<\/b>Understanding atomic structure and quantum theory, which includes properties of waves, wave-particle duality, the interaction of radiation and matter, the photoelectric effect and the Bohr atom model.<br><br><b>Week 3 - Boot-Camp II:<\/b> Introducing the concept of mole and understanding how compounds form, by differentiating ionic and covalent bonding, learning how to write molecular and empirical formulas and how to determine percent composition of compounds. Introducing solutions and how to measure their concentration.<br><br><b>Week 4 - Boot-Camp III:<\/b> Move on to chemical reactions, by understanding how to write balanced chemical equations, use them to perform various stoichiometric calculations and determine the yield of reactions; learning the different types of reactions, including combustion, precipitation, and acid-base reactions.<br><br><b>Week 5 - Boot-Camp IV:<\/b> Introduction to the thermodynamics of reactions, by discussing energy and energy changes, heat, work, enthalpy, calorimetry, and Hess's Law.<br><br><b>Week 6 - Final Exam Preparation:<\/b> Reviewing of concepts from Weeks 1-5, in preparation for the final examination. <br>",
    "estimatedClassWorkload": "6-8 hours\/week",
    "recommendedBackground": "Students are expected to have had an introductory chemistry course, for example in high school, as well as mathematics up to the level of precalculus (e.g., algebraic expressions, algebraic equations, inequalities, functions, and graphing).<br><br>",
    "links": {}
}