{
    "id": 207,
    "shortName": "secrets",
    "name": "Archaeology's Dirty Little Secrets",
    "language": "en",
    "shortDescription": "Admit it — you wanted to be an archaeologist when you grew up...  This course builds on that enthusiasm, while radically expanding your notions about just what archaeology is and just what archaeologists do. ",
    "aboutTheCourse": "<p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p><p>In this class, we will ask and answer a series of questions\nabout the role and practice of archaeology in the world today. If archaeologists\nare trained to investigate the past, what is left for us to study?&nbsp; Who gets to be an archaeologist?&nbsp; How and why do archaeologists hunt for\n“treasures”, and what do we do once we’ve discovered them?&nbsp; What can we know, and not know, about people\nin the past? &nbsp;What do archaeologists know\nabout the past that most people would never guess – and why aren’t we telling\nyou?&nbsp; Why are people entirely willing to\nmurder each other over the fate of archaeological sites? &nbsp;Are Real Men alone capable of discovering the\ntruth behind all this?<\/p>\n\nArchaeology famously involves getting dirty in\nthe line of duty.&nbsp; Students will\nexperience its hands-on nature, through the use of numerous exercises and archaeological\ncase studies.&nbsp; But there are other ‘dirty\nlittle secrets’ to learn about the field: not least how the stories\narchaeologists tell about the past have been used and abused, for purposes both\ngood and bad.&nbsp; Our goal by the end of the\ncourse is to have you ‘thinking like an archaeologist’ and fully aware of the often-fraught\npolitics of doing archaeology around the globe.&nbsp; &nbsp;&nbsp;<br><p><\/p>\n\n<p><\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p><p><b>Unit #1:<\/b>&nbsp; Just what are\nthese secrets anyway?<\/p>\n\n<p><b>Unit #2:&nbsp; <\/b>What\nhas survived for us to find?&nbsp; And what\nhave we lost?<\/p>\n\n<p><b>Unit #3:<\/b>&nbsp; So how do\nyou find things?&nbsp; Archaeology ≠\njust digging<\/p>\n\n<p><b>Unit #4:<\/b>&nbsp; How do you\nget a date? (And why are dates so important?)<\/p>\n\n<p><b>Unit #5:&nbsp; <\/b>What do you do with what you find?<\/p>\n\n<p><b>Unit #6:&nbsp; <\/b>What is involved in the archaeology of people?<\/p>\n\n<p><b>Unit #7:<\/b>&nbsp; Where does\narchaeology happen?&nbsp;&nbsp; Who can play?<\/p>\n\n<p><b>Unit #8:<\/b>&nbsp; Who owns\nthe past?<\/p>\n\n<p><\/p>",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": "<p>Absolutely no prerequisites.&nbsp; Just be curious.<\/p>",
    "links": {

    }
}