{"id":164,"shortName":"clinicalterminology","name":"Clinical Terminology for International and U.S. Students","language":"en","shortDescription":"Understanding the clinical terms and abbreviations commonly used in U.S. hospitals is challenging. Adaptation to clinical language is difficult for U.S. students entering the clinical area and even more difficult for international students whose primary language is not English. This course helps both groups of students understand many of the terms and abbreviations commonly encountered during the first three months of clinical work on a U.S. general hospital unit.","aboutTheCourse":"<p>The language of health care providers at U.S. clinical sites is heavily infused with abbreviations and technical terms. Frequently, there is little time to ask for explanations. This course focuses on terms and abbreviations that will be heard or seen\n    during early clinical work. Terms are presented according to the clinical context in which they will be experienced using print, audio and visual representations. A web-based clinical dictionary for beginners provides additional information about\n    terms presented in the course as well as definitions of many important terms that could not be covered in the six week course.<\/p>","targetAudience":0,"courseSyllabus":"<ul>\n    <li><b>Week 1:<\/b> Understanding the structure of clinical terms and abbreviations\n        <br><b>Clinical Focus:<\/b> Vital Signs\n        <br>\n        <br>\n    <\/li>\n    <li><b>Week 2:<\/b> Solving clinical word puzzles\n        <br><b>Clinical Focus:<\/b> The Clinical Unit and Bedside Environment\n        <br>\n        <br>\n    <\/li>\n    <li><b>Week 3:<\/b> Refining strategies for solving clinical word puzzles\n        <br><b>Clinical Focus: <\/b>Emergencies, Medication and IV fluid Administration\n        <br>\n        <br>\n    <\/li>\n    <li><b>Week 4: <\/b>Dealing with acronyms\n        <br><b>Clinical Focus<\/b>: Diseases and Related Abbreviations\n        <br>\n        <br>\n    <\/li>\n    <li><b>Week 5: <\/b>Using clinical language safely\n        <br><b>Clinical Focus: <\/b>Laboratory Tests and Diagnostic Procedures\n        <br>\n        <br>\n    <\/li>\n    <li><b>Week 6: <\/b>Assessing your ability to use what you have learned\n        <br><b>Clinical Conversations:<\/b> Practice hearing, seeing, and responding to true-to-life clinical situations<\/li>\n<\/ul>","courseFormat":"<p>This course consists of 6 modules introduced by a video presentation. Using a language-learning approach, definitions of terms and abbreviations are supplemented with audio, images, and video-recordings. Strategies for effective learning and opportunities\n    to use new terms and abbreviations are offered. Quiz questions accompany each module. A web-based clinical terminology dictionary at <a target=\"_blank\" href=\"http:\/\/www.clinicalterminology.org\/\">http:\/\/www.ClinicalTerminology.org<\/a> provides additional\n    information about the course content and definitions of many additional terms and abbreviations not included in the course. The web-based dictionary remains available to students after the course is completed.<\/p>","suggestedReadings":"<p>All references and materials will be offered within the course or found on the Internet.<\/p>","instructor":"Michael Gold and Valerie Swigart","estimatedClassWorkload":"2-4 hours\/week","recommendedBackground":"<p>This course is for International and U.S. students and health professionals who are beginning or will be experiencing clinical practice in the United States. Knowledge of anatomy and physiology and common disease states supports success.<\/p>","links":{}}