{
    "id": 1063,
    "shortName": "watershed",
    "name": "FLOW Education: Facilitating Learning through Outdoor Watershed Education",
    "language": "en",
    "shortDescription": "This course is designed for classroom teachers (grades 4-8) to learn about watersheds and outdoor education using the Chesapeake Bay watershed as an example. The course introduces engaging technologies for investigating watersheds and helps you plan and effectively implement outdoor experiences.",
    "aboutTheCourse": "<p>Watershed education is an excellent way to introduce students to rich, interdisciplinary studies of one of the most important resources located in students’ backyards—water!&nbsp;The goal of the course is to increase your content knowledge on watershed topics and to help you develop outdoor learning experiences for your students.<\/p><p>In this course you will:<\/p><ul><li>Increase literacy around watershed issues<\/li><li>Prepare to implement watershed content using engaging and effective instructional strategies in the classroom and on the school grounds<\/li><li>Share and reflect on your practice in a collaborative online environment<\/li><\/ul><p>The course is designed for science and social studies teachers in grades 4 through 8. No prior knowledge is required. Teaching experience and access to students in a classroom is recommended.<\/p><p>Montana pre-service and in-service classroom educators only<span> may apply for undergrad and graduate credits from the University of Montana. Check <a title=\"null\" target=\"_blank\" href=\"http:\/\/www.campusce.net\/umextended\/course\/course.aspx?C=390&amp;pc=25&amp;mc=13&amp;sc\">here<\/a> for more information.<\/span><\/p><br><br>",
    "targetAudience": 3,
    "courseSyllabus": "<strong>Session 1: Introduction to Geo-literacy<\/strong><br>Goal: Explain the importance of geo-literacy for science and social studies classrooms.<br><br><strong>Session 2: The Water Cycle and Watersheds<\/strong><br>Goal: Develop an understanding of the water cycle and how it operates within a watershed.<br><br><strong>Session 3: Mapping Watersheds<\/strong><br>Goal: Develop an understanding of how to use GIS and mapping in the classroom.<br><br><strong>Session 4: Water Quality and Watershed Health<\/strong><br>Goal: Develop an understanding of how to determine the health of a watershed based on water quality parameters.<br><br><strong>Session 5: Outdoor Learning Experiences<\/strong><br>Goal: Understand the importance of outdoor education to promote student connections with the environment and community.<br><br><strong>Session 6: Small Actions (local) Contribute to Big Solutions (global)<\/strong><br>Develop an understanding of how integration of watershed education, outdoor education, and geo-education in classroom instruction can help the learners prepare young people to become geo-literate.<br><br><strong>Course Project<\/strong><br><br>The course project consists of developing an action plan to incorporate watershed and outdoor education in their classroom. <br><br>In this action plan, learners will develop or adapt an outdoor activity that aligns to the curriculum they teach and the geo-literacy framework (the 3 I’s: interactions, interconnections, implications).<br><br><strong>In Sessions 1-4: <\/strong><br>Learners develop an action plan using Action Plan Template and the Action Plan Rubric.<br><br><strong>In Session 4:&nbsp; <\/strong><br>Learners submit a draft of this plan.<br><br><strong>In Session 5: <\/strong><br>Learners provide feedback, using the Action Plan Rubric, to two of their peers’ drafts and perform a self-assessment of their project.<br>&nbsp;<br><strong>In Session 6: <\/strong><br>Learners incorporate their peers’ feedback, and submit their final action plan for their peers to review in the “Course Project Gallery” discussion forum. Learners will also provide final feedback to at least three of their peers’ final plans. <br><br><br>",
    "estimatedClassWorkload": "5-6 hours\/week",
    "recommendedBackground": "",
    "links": {}
}