{
    "id": 464,
    "shortName": "abcemprendimiento",
    "name": "El ABC del emprendimiento esbelto ",
    "language": "es",
    "shortDescription": "A través de diferentes actividades de campo el participante vive personalmente el proceso emprendedor, aprendiendo los conceptos del curso principalmente con base en la experimentación. ",
    "aboutTheCourse": "<p>A pesar de que una gran parte de la literatura sobre emprendimiento prepara\n    al “candidato emprendedor” a cómo hacer planes de negocio para conseguir\n    financiamiento proveniente de supuestos inversionistas, tal y como lo hace\n    la tradición norteamericana de enseñanza del emprendimiento, la realidad\n    de negocios nos dice que inclusive en los países desarrollados los proyectos\n    emprendedores inician con sus recursos financieros propios y normalmente\n    muy escasos.<\/p>La principal herramienta para estos emprendimientos no\nes el plan de negocios ni el financiamiento, sino la creatividad empresarial.&nbsp;\nPor lo que, para una enseñanza efectiva del proceso emprendedor, hay que\npartir de esta realidad y no solo imitar lo que sucede en universidades,\nprincipalmente norteamericanas, con un contexto muy diferente al resto\ndel mundo. Por otro lado, pareciera un misterio el por qué solo muy pocos\nproyectos de empresa o de negocio tienen éxito, pareciera una combinación\nentre el “culto” a la personalidad del emprendedor y suerte; sin embargo\nla realidad nos demuestra que los proceso emprendedores que tienen éxito,\nsi bien tiene una influencia la importante motivación y la persona, siguen\nun proceso con etapas específicas, un patrón de acciones muy similar, aunque\nlos emprendedores no se hayan dado cuenta de este proceso.\n<br>\n<br>\n<p>Este curso invita al participante a tener la persistencia para seguir\n    este proceso emprendedor basado en la experimentación.<\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<p><\/p>\n<ol>\n    <li>Los mitos del emprendedor. (2 h)<\/li>\n    <li>Emprendiendo por necesidad y emprendiendo por oportunidad. (2 h)<\/li>\n    <li>La observación del mercado, en busca de oportunidades, descubriendo el\n        \"dolor de mercado\". (6 h)<\/li>\n    <li>¿Qué es lo que los clientes valoran? (4 h)<\/li>\n    <li>La creatividad, innovación empresarial y la primera aproximación de concepto\n        de negocio. (4 h)<\/li>\n    <li>Aprendiendo a escuchar el mercado. (2 h)<\/li>\n    <li>La experimentación y la observación de mercado como parte fundamental\n        del proceso emprendedor. (4 h)<\/li>\n    <li>La flexibilidad y el fracaso como herramientas fundamentales en el aprendizaje\n        emprendedor. (2 h)<\/li>\n    <li>El ajuste de la propuesta de negocios o&nbsp; propuesta de valor. (2 h)<\/li>\n    <li>El modelo de operación como parte esencial de la propuesta de valor. (8\n        h)<\/li>\n<\/ol>\n<p><\/p>",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": "No se requieren conocimientos previos.",
    "links": {

    }
}