{
    "id": 190,
    "shortName": "publichealth",
    "name": "Principles of Public Health",
    "language": "en",
    "shortDescription": "Principles of Public Health introduces the major concepts and principles of public health and the determinants of health status in communities. Emphasizes the ecological model that focuses on the linkages and relationships among multiple natural and social determinants affecting health.",
    "aboutTheCourse": "<p>Principles of Public Health&nbsp;introduces the major concepts of public health and the\ndeterminants of health status in communities. The course emphasizes the\necological model that focuses on the linkages and relationships among multiple\nnatural and social determinants affecting health. As a relative concept, the\nhealth of populations is assessed through comparisons of temporal, spatial, and\ndemographic dimensions of disease burden. The goal of public health is to\nunderstand why and how different populations carry different kinds and amounts\nof disease burden, and to use that knowledge for improving health by preventing\ndisease.&nbsp;<\/p>\n\n\n\n<p>Students in the course will explore successful examples in\npublic health, including how scientific discoveries and regulatory policies\nhave both contributed to mitigate risk factors and improve health outcomes. How\nsocioeconomic and cultural factors modify the effectiveness of risk\nintervention and disease prevention strategies. How individual actions and\ncollective initiatives play important roles in determining the status of\nhealth. In addition, how the various methodological approaches that guide\ndiscoveries in public health have been applied from the local scale to the\nglobal level.<\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<i><b>Week One<\/b><\/i><b>: <\/b>What is Public Health?<br><i><b>Week Two<\/b><\/i><b>: <\/b>The Role of Data in Public Health <br><i><b>Week Three<\/b><\/i><b>: <\/b>The Biomedical Basis of Public Health<br><i><b>Week Four<\/b><\/i><b> :<\/b> Do People Choose Their Own Health?<br><i><b>Week Five:<\/b><\/i><b>&nbsp; <\/b>The Future of Public Health",
    "estimatedClassWorkload": "6-8 hours\/week",
    "recommendedBackground": "Proficiency through college preparatory high school curriculum including two years of biology, a combination of natural science courses including one year each of mathematics and chemistry, and courses in health science and social sciences are recommended. <br>",
    "links": {

    }
}