{"id":65,"shortName":"clinprobsolv","name":"Clinical Problem Solving","language":"en","shortDescription":"Participants will learn how to move efficiently from patient signs and symptoms to a rational and prioritized set of diagnostic possibilities and will learn how to study and read to facilitate this process.","aboutTheCourse":"<div>Clinical problem solving or diagnostic reasoning is the skill that physicians use to understand a patient’s complaints and then to identify a short, prioritized list of possible diagnoses that could account for those complaints. &nbsp;This differential diagnosis then drives the choice of diagnostic tests and possible treatments. Despite striking advances in information technology, clinical problem solving has not yet been effectively replicated by computers, making it essential that clinicians work to develop expertise in this very important skill set. &nbsp;While television shows make this seem like a magical process, work done by cognitive psychologists and medical educators has helped us understand the ways in which expert physicians reason through these difficult problems to help their patients.<\/div>\n<div>&nbsp;<\/div>\n<div>This course will examine the ways physicians think about clinical problem solving and will help participants develop competence in the building blocks of clinical problem solving. The professor will use cases to illustrate different reasoning strategies and will discuss how both correct and incorrect diagnoses result from these strategies. Participants will use sample clinical cases to practice what they have learned through the lectures. Finally, the professor will discuss strategies to help students and young physicians read textbooks and articles in a way that enhances their ability to use information in the clinical environment.&nbsp;<\/div>\n<div><\/div>","targetAudience":1,"courseSyllabus":"<ul><li><b>Module 1:<\/b> How experts understand diseases and how to read like an expert to form disease based illness scripts.<\/li><li><b>Module 2:<\/b> How experts analyze their patient' problems: processing and the patient illness script.<\/li><li><b>Module 3:<\/b> Using disease and patient illness scripts to prioritize differential diagnostic possibilities into tiers of probability<\/li><li><b>Module 4:<\/b> Understanding how diagnostic tests can be appropriately used to improve diagnostic accuracy.<\/li><li><b>Module 5:<\/b> Diagnostic Mistakes: how they happen, how you can avoid them and how to find them once they occur.<\/li><li><b>Module 6:<\/b> How our clinical problem solving strategies can be used to write good test questions, perform well on tests, and teach others to do well too.<\/li><\/ul>","courseFormat":"The class will consist of lecture videos, which are between 8 and 12 minutes in length. These contain 1-2 integrated quiz questions per video. &nbsp;Suggested readings will accompany the lectures. There will be homework assignments including multiple choice and short answer questions. Feedback on homework will be provided using rubric-guided peer review. &nbsp;A final cumulative exam will be required to complete the course.","suggestedReadings":"Recommended textbook (not required):&nbsp;<a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=clinprobsolv&isbn_ean=9780071781824\"><i>Current Medical Diagnosis &amp; Treatment,&nbsp;<\/i><\/a>eds Papadakis,\nMcPhee, and Rabow (2012 or 2013 edition)","instructor":"Catherine R Lucey, MD","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"<div>\n<ul>\n<li>Medical Terminology<\/li>\n<li>Introduction to Physical Diagnosis<\/li>\n<\/ul>\n<\/div>\n<div><\/div>","links":{}}