{"id":453,"shortName":"einstein","name":"Understanding Einstein: The Special Theory of Relativity","language":"en","shortDescription":"This course offers you the opportunity to gain a deeper understanding of the life and work of the young Albert Einstein and especially his mind-bending special theory of relativity. ","aboutTheCourse":"In this course we will seek to “understand Einstein,” especially focusing\non the special theory of relativity that Albert Einstein, as a 26-year-old\npatent clerk, introduced in his so-called “miracle year” of 1905. Our goal\nwill be to go behind the myth-making and beyond the popularized presentations\nof relativity in order to gain a deeper understanding of both Einstein\nthe person and the concepts, predictions, and strange paradoxes of his\ntheory. Some of the questions we will address include: How did Einstein\ncome up with his ideas? What was the nature of his genius? What is the\nmeaning of relativity? What’s “special” about the special theory of relativity?\nWhy did the theory initially seem to be dead on arrival? What does it mean\nto say that time is the “fourth dimension”? Can time actually run more\nslowly for one person than another, and the size of things change depending\non their velocity? Is time travel possible, and if so, how? Why can’t things\ntravel faster than the speed of light? Is it possible to travel to the\ncenter of the galaxy and return in one lifetime? Is there any evidence\nthat definitively confirms the theory, or is it mainly speculation? Why\ndidn’t Einstein win the Nobel Prize for the theory of relativity?\n<br>\n<br>Students may choose one of three approaches to the course: a more quantitative\napproach, a more qualitative approach, or an auditing approach. The more\nquantitative approach will include weekly problem sets, while the more\nqualitative approach will include a creative project relating to the young\nEinstein and\/or the special theory of relativity.\n<br>","targetAudience":0,"courseSyllabus":"<b>Week One (Einstein in Context):<\/b> Einstein quotes of the week; a thought\nexperiment involving relativity; physics and Einstein circa 1900.\n<br>\n<br><b>Week Two (Events, Clocks, and Reference Frames):<\/b> Einstein quotes\nof the week; synchronizing clocks; the famous June 1905 paper; thinking\nmore deeply about events and observers; understanding inertial frames of\nreference; spacetime diagrams; the Galilean transformation; Einstein's\nstarting point: the two postulates.\n<br>\n<br><b>Week Three (Ethereal Problems and Solutions):<\/b> Einstein quotes of\nthe week; a few words about waves; the luminiferous ether; the Michelson-Morley\nexperiment vs. stellar aberration; how do you solve a problem like the\nether?; the solutions of Fitzgerald, Lorentz, Poincare, and Einstein.\n<br>\n<br><b>Week Four (The Weirdness Begins):<\/b> Einstein quotes of the week; the\nlight constancy principle; time and length are suspect; what isn't suspect;\nexploring the Lorentz factor; the miracle of the muon.\n<br>\n<br><b>Week Five (Spacetime Switching):<\/b> Einstein quotes of the week; the\nLorentz transformation; leading clocks lag; the ultimate speed limit.\n<br>\n<br><b>Week Six (Breaking the Spacetime Speed Limit?): <\/b>Einstein quotes\nof the week; spacetime diagrams revisited; regions of spacetime; cause\nand effect, or vice versa?; faster than light paradoxes.\n<br>\n<br><b>Week Seven (Paradoxes to Ponder): <\/b>Einstein quotes of the week;\nthe pole-in-the-barn paradox; the spaceships-on-a-rope paradox; how length\ncontraction actually works; the twin paradox.\n<br>\n<br><b>Week Eight (To the Center of the Galaxy and Back): <\/b>Einstein quotes\nof the week; traveling the galaxy in one lifetime; the reception of relativity;\nEinstein's Nobel Prize and the nature of genius; relativity beyond science.\n<br>","courseFormat":"Students may choose one of three approaches to the course: a more quantitative\napproach, a more qualitative approach, or an auditing approach. The more\nquantitative approach will include weekly problem sets, while the more\nqualitative approach will include a creative project relating to the young\nEinstein and\/or the special theory of relativity. (Students who choose\nthe quantitative approach may also do a creative project if they wish.)\n<br>\n<br>The more quantitative approach is designed for those students who desire\nthe deepest understanding of the special theory of relativity (within the\nintroductory context of this course). Although one can gain a good understanding\nof the theory via a qualitative approach, the theory is ultimately a mathematical\ntheory. The mathematics required, however, is not advanced. A familiarity\nwith basic algebra will suffice. (For those whose knowledge is rusty, a\nreview of the math needed is provided in a video clip.) The primary assignments\nfor students who take this approach will be to watch lecture videos each\nweek, take an assessment quiz for each video, take a weekly review quiz,\nand work on weekly problem sets.\n<br>\n<br>The more qualitative approach is designed for those students who desire\na deeper understanding of Einstein and the special theory of relativity,\nfocusing on the concepts and results. The primary assignments for students\nwho take this approach will be to watch lecture videos each week, take\nan assessment quiz for each video, and take a weekly review quiz. (Though\nthe videos will cover quantitative aspects of the theory, the quizzes will\nfocus on the concepts and results.) Students will also complete a creative\nproject relating to the young Einstein and\/or the special theory of relativity\n(e.g., a video, poem, musical piece, artwork, animation, etc.). The creative\nproject may be instructional, humorous, serious, or dramatic, or some combination\nthereof. Further guidelines will be given in a later handout.\n<br>\n<br>The auditing approach is designed for those students who want to learn\nmore about Einstein and the special theory of relativity, but may not want\nto complete all the assignments in one of the other approaches.\n<p><\/p>","suggestedReadings":"Although the course is designed to be self-contained, it is recommended\n(but not required) that you read the following profile: \"Young Einstein:\nFrom the Doxerl Affair to the Miracle Year,\" by L. Randles Lagerstrom,\navailable for US$2.99 from Amazon Direct Publishing (<a href=\"http:\/\/www.amazon.com\/dp\/B00BKKHS4U\">http:\/\/www.amazon.com\/dp\/B00BKKHS4U<\/a>).\nYou may also download the free software for viewing it here: <span><a href=\"http:\/\/www.amazon.com\/gp\/feature.html?ie=UTF8&amp;docId=1000493771\">http:\/\/www.amazon.com\/gp\/feature.html?ie=UTF8&amp;docId=1000493771<\/a>.<\/span> (Versions\nare available for PCs, Macs, tablets, and smart phones.)\n<br>","instructor":"Larry Randles Lagerstrom","estimatedClassWorkload":"2-8 hours\/week","recommendedBackground":"No prior knowledge is required. Anyone who is willing to engage with the\nmaterial is welcome. (For students choosing the more quantitative approach,\na familiarity with basic algebra will be helpful. But a brief math review\nwill be provided.)\n<br>","links":{}}