{"id":3217,"shortName":"chinesepolitics1","name":"Chinese Politics Part 1 – China and Political Science","language":"en","shortDescription":"This course helps students understand Chinese politics. Using approaches from political science, it looks at the politics behind China’s economy, its leadership, how the government and Communist Party make and implement decisions, the ways people try to influence those decisions, and whether democracy or authoritarianism are in China’s future.","aboutTheCourse":"This course offers a conceptual framework for understanding China that highlights the intersection of politics and economics. It shows that rather than develop into a full blown market economy, state and party officials at all levels of the political system maintain significant influence in economic development. Such a “political” economy has had both positive and negative outcomes, which we will assess in detail. We also look at the origins, views, backgrounds and relations among leaders, and how those leaders make decisions about public policy and try to get those decisions implemented down through the system. China has few formal institutions through which citizens can participate in politics, but we will study the strategies Chinese people use to try to influence their leaders’ decisions. Finally, we assess China’s future and whether rapid economic development and the emergence of a vibrant middle class will push China towards greater democracy or whether the single party system is likely to survive into the future. The course is a quite useful background for <a target=\"_blank\" href=\"https:\/\/www.coursera.org\/course\/chinesepolitics2\">Chinese Politics Part 2 – China and the World<\/a>.","targetAudience":0,"courseSyllabus":"<p>Part 1 covers the following topics:<\/p>\n<ol><li>Models of the Chinese Political System and the Structure of the Chinese Party\/State<\/li>\n<li>Leadership in China<\/li>\n<li>Public Policy in China<\/li>\n<li>Understanding Societal Engagement in Politics in China<\/li>\n<li>Political Economy and China’s Model of Development<\/li>\n<li>China’s Future: Democratization or “Flexible Authoritarianism?”<\/li>\n<\/ol>","courseFormat":"Each subject involves a 60 minute lecture, which\nincorporates recent, often on-going, research by the professor on these issues,\nand suggests 50 pages of relevant reading followed by peer mentored online\ndiscussions of the lecture and assigned reading. Topics 1, 2 and 6 will be\nassessed through multiple choice quizzes while 3, 4 and 5 will be assessed\nthrough a 500 word essay, graded by peer evaluation. There will also be a multiple\nchoice exam at the end of the course.<br>","suggestedReadings":"<p>William A. Joseph, Politics in China: An Introduction, Second Edition (Oxford University Press, 2014)<\/p>\n<p><a target=\"_blank\" href=\"http:\/\/www.amazon.com\/Politics-China-Introduction-William-Joseph-ebook\/dp\/B00IIO5VL8\/ref=tmm_kin_title_0?_encoding=UTF8&amp;sr=&amp;qid=\">http:\/\/www.amazon.com\/Politics-China-Introduction-William-Joseph-ebook\/dp\/B00IIO5VL8\/ref=tmm_kin_title_0?_encoding=UTF8&amp;sr=&amp;qid=<\/a><\/p>","estimatedClassWorkload":"3-4 hours\/week","recommendedBackground":"Nil","links":{}}