{
    "id": 2155,
    "shortName": "sustainability",
    "name": "Learning for Sustainability: Developing a personal ethic",
    "language": "en",
    "shortDescription": "We all have our own understandings of ‘sustainability', of its significance as an environmental, social, economic and moral concept, and as a principle for individual, collective or corporate behaviour. This course begins from your starting point and explores how we might make positive differences to the future of our planet, and encourage others to do so.\n",
    "aboutTheCourse": "<p>Many issues threaten\nthe future of ourselves and other species on the planet.&nbsp;The most\nprominent of these is dangerous global climate change; and this with the\nover-exploitation of our lands and seas, loss of biodiversity,\nand&nbsp;over-use of manufactured chemicals, affects the stability of the\nglobal systems upon which all life depends. For our species these (and other\nfactors) contribute to social inequalities and impact on human well-being and\neconomic stability. It is imperative that we develop an informed response to\nthese challenges and that we feel empowered and enabled to take positive\nactions towards a sustainable future.&nbsp;<\/p>\n\n<p>In this course you\nwill refine your own understanding of 'sustainability' in light of the range of\ndefinitions, contexts and educational approaches that we will discuss. This\nprocess will enable you to develop a personal ethic and positive response to\n‘sustainability’, and help you to communicate these ideas to others. What on\nEarth could be more important?<\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p><p><b>Week 1: Disruption:\nReorienting our thoughts<\/b><\/p>\n\n<p>Using your current thinking as a starting point we will explore a range\nof contemporary definitions and perspectives. By sharing and discussing our\nexperiences we will broaden our collective understanding of the range and scope\nof 'sustainability', and address this as a ‘contested concept’. We will\nintroduce the fundamentals of ‘how the planet’s global systems work’.<\/p>\n\n<p><b><br><\/b><\/p><p><b>Week 2: Thinking\ndeeply: Local issues and personal reflections<\/b><\/p>\n\n<p>This week we will begin to contextualise our discussion by asking you to\nintroduce some local sustainability issues. We will then discuss our personal\nresponses to these and consider how we can draw on local matters as drivers for\nchange.<\/p>\n\n<p>&nbsp;<\/p>\n\n<p><b>Week 3:\nUnderstanding broadly: &nbsp;Global issues and wider positioning<\/b><\/p>\n\n<p>This week we will widen our discussion to consider how local issues are\nrelated to and nested within wider, global contexts. We will discuss how these\nproblems relate to global systems and introduce concepts such as systems\nthinking and complexity as frameworks to help position our thinking. We will\nuse a range of case studies to exemplify these global connections.&nbsp;<\/p>\n\n<p>&nbsp;<\/p>\n\n<p><b>Week 4: Implement:\nHow do we take action?<\/b><\/p>\n\n<p>Drawing on the knowledge gained in previous weeks we will consider how we\ncan turn our thoughts into action. We will discuss what that ‘action’ would\nlook like at a personal, local and global level, and what impacts we can expect\nto have.&nbsp; We will also consider how we could measure and evaluate\n‘success’ across those domains.<\/p>\n\n<p><b>&nbsp;<\/b><\/p>\n\n<p><b>Week 5: Learning\nfor sustainability: How can we inform and educate others?<\/b><\/p>\n\nFinally we will offer ‘learning for\nsustainability’ as a strategy for future action. We will discuss how\n‘education’ taken in its broadest sense (to include our daily interactions with\nothers, in our homes, in workplaces, and for some in more formal educational\nsettings) can be used to encourage others to develop a personal ethic of\nsustainability, encourage a value shift at a wider societal level and engender\ntransformational change.&nbsp;&nbsp;<b> &nbsp;&nbsp;<br><\/b><p><\/p><p><strong><br><\/strong><\/p><p><strong>Learning objectives<\/strong><\/p><p>By the end of this course you will have:<\/p><ol><li>gained a better understanding of the concept and practice of sustainability.<\/li><li>understood the complexity and range of definitions and responses to the issue of sustainability between and within communities, societies and cultures at local and global levels.<\/li><li>analysed your own situation and considered the manifestation of sustainability within your local space and its connection with the global visioning of sustainability.<\/li><li>developed a personal response to the issue of sustainability and imagined how you could positively respond to local sustainability challenges.<\/li><li>considered the role of education (in its broad sense) and communication as a way to encourage a deeper understanding of sustainability and as a process for positive change.<\/li><li>become more informed, confident and able to encourage others within your family, community and workplace to develop their own understanding of sustainability and to become ‘agents of change’ themselves.&nbsp;&nbsp;<br><\/li><\/ol>",
    "estimatedClassWorkload": "1-3 hours\/week",
    "recommendedBackground": "No background required, just a willingness to actively engage in the course; all are welcome.",
    "links": {

    }
}