{"id":1428,"shortName":"parasitology","name":"Tropical Parasitology: Protozoans, Worms, Vectors and Human Diseases","language":"en","shortDescription":"This course provides students an understanding of important human parasitic diseases, including their life cycles, vectors of transmission, distribution and epidemiology, pathophysiology and clinical manifestations, treatment, and prevention and control.  ","aboutTheCourse":"\"Tropical Parasitology: Protozoans, Worms, Vectors and Human Diseases\" will present information on important human parasites. The specific parasites for discussion include malaria, trypanosomiasis, toxoplasmosis, cestodes (<i>Taenia saginata<\/i>, <i>Taenia solium<\/i>, and <i>Echinococcus<\/i>), trematodes (<i>Schistosoma<\/i> and <i>Fasciola<\/i>), nematodes (<i>Ancylostoma\/Necator<\/i>, <i>Strongyloides<\/i>, filariasis, and <i>Ascaris<\/i>), and ectoparasites. An emphasis will be placed on field demonstrations of relevance in sub-Saharan Africa and clinical presentations of parasitic illness, including their life cycles, vectors of transmission, distribution and \nepidemiology, pathophysiology and clinical manifestations, treatment, \nand prevention and control. <br>","targetAudience":1,"courseSyllabus":"<p>The overall objective of this course is to acquaint medical school and graduate-level students with tropical parasitology and entomology. The course complements the\nclassical or traditional teaching of tropical parasitology and entomology.\nOther individuals interested in tropical parasitology and entomology will benefit equally. Course content covers epidemiology, transmission cycle, clinical manifestations, treatment and control of parasites in the following categories:<\/p>\n\n<ol>\n<li>Protozoa, including: malaria, trypanosomiasis, leishmaniasis, toxoplasmosis, leishmaniasis;<\/li>\n<li>Nematodes, including: filariasis, ascariasis, hookworm, strongyloidiasis;<\/li>\n<li>Cestodes, including: taeniasis, cystcercosis, echinococcosis;<\/li>\n<li>Trematodes, including: schistosomiasis, fascioliasis;<\/li>\n<li>Ectoparasites, including: fleas, ticks and mites, and lice.<\/li>\n<\/ol>","courseFormat":"The course format includes lecture videos, course readings, quizzes, and a final exam. Students will have the opportunity to observe authentic video footage of field site visits in Tanzania. Supplementary articles are provided for further investigation and exploration. Students may participate in discussion forums to comment on and discuss the readings, video lectures, and tropical parasitology topics.<br>","suggestedReadings":"This course is designed to be self-contained for students with the recommended background; however, those students who desire to expand their knowledge and reinforce their understanding are encouraged to review the supplementary readings.<br>","estimatedClassWorkload":"8-10 hours\/week","recommendedBackground":"Advanced undergraduate and graduate students with an interest in health disparities due to communicable diseases, and a background in microbiology is recommended.","links":{}}