{"id":2663,"shortName":"ntucp","name":"Explorations in Confucian Philosophy","language":"en","shortDescription":"Explore the world of Confucianism, its foundational teachings, the ways in which it continues to shape Chinese culture and society, and how it may respond to today’s global challenges.","aboutTheCourse":"<span>Is Confucianism synonymous with Chinese culture? While it may be an\noverstatement to equate the two, there is little doubt that Confucianism\npervades every level of Chinese culture and society. To be sure, other\ntraditions such as Daoism and Buddhism have also left an indelible mark;\nnevertheless, Confucianism remains central to the shaping of the Chinese imagination.\nThe influence of Confucianism extends beyond China to East Asia and through\nmigration and cultural diffusion, other parts of the world. Confucianism traces\nits origins to the teachings of Confucius. What makes Confucius so special and\nwhat did he teach? This course will explore some of the key concepts in\nConfucian philosophy. Much of the discussion will centre on the <i>Analects<\/i> of Confucius, the foundational\ntext of Confucian wisdom, although attention will also be given to the\nsubsequent unfolding of the Confucian tradition. We will attempt to situate\nConfucian philosophy in its own context and to bring out its contemporary\nsignificance. Confucianism is a living tradition. Its vitality hinges on not\nonly its continuing relevance in Chinese society but also its contribution to\nmeeting the pressing global challenges confronting the world today. There are\nno prerequisites for this course.<\/span>","targetAudience":3,"courseSyllabus":"<p><u>Week 1<\/u><\/p>\n\n<p>Introduction:\nThe World of Confucius<\/p>\n\n<p><span>Studying Confucian philosophy requires a\ndisciplined and informed imagination. Confucius (or Kongzi, in Chinese) flourished\nin a time of great change and political turbulence. Some understanding of the\nworld of early China would be critical, as Confucian ideas did not sprout from\na historical vacuum. In this context, we will examine the <i>Analects<\/i> – known in Chinese as <i>Lunyu<\/i>\n– a compilation of sayings and conversations of Confucius that is essential to\nour understanding of Confucian philosophy.<\/span><\/p>\n\n<p>&nbsp;<\/p>\n\n<p><u>Weeks 2-3<\/u><\/p>\n\n<p>The Teachings\nof Confucius<\/p>\n\n<p><span>The teachings of Confucius are perhaps best\nunderstood as a major philosophical renovation of the early Chinese\nintellectual scene. We will start with the cardinal concept of the <i>junzi<\/i>, the moral and cultural exemplar\nthat stands at the heart of the Confucian vision. What are the characteristics of\nthe ideal <i>junzi<\/i>? Can one become a <i>junzi<\/i> and if so, how can that be\naccomplished? In this context, some of the key Confucian ethical concepts such\nas <i>ren<\/i> (humaneness), <i>li<\/i> (propriety), and <i>xiao<\/i> (filial piety) will be introduced. Is there a spiritual\ndimension to Confucian philosophy, and does it have political relevance? There\nis much to discuss here, and we will return to the question of the impact of\nthe Confucian vision on Chinese culture towards the end of this course. <\/span><\/p>\n\n<p>&nbsp;<\/p>\n\n<p><u>Weeks 4-5<\/u><\/p>\n\n<p>The Development\nof Confucianism <\/p>\n\n<p>“Confucianism” is an abstract\ngeneralization. While it may serve as a convenient label, it must be used with\ncare. What needs to be made clear is that the Confucian tradition is dynamic\nand harbours rich internal differences. In this part of the course, major\nlandmarks in the development of Confucian philosophy will be introduced. These\ninclude the debate between Mengzi (or more commonly, in English, Mencius) and\nXunzi on human nature, which is philosophically significant and also sets the\nstage for the subsequent development of Confucian thought. As Confucianism\ndeveloped, interaction with the ideas of Daoism and Buddhism became\nincreasingly important. Consequently, a new interpretation of Confucian\nphilosophy came to dominate the Chinese scene from roughly the 12th\ncentury C.E. This has come to be known as “Neo-Confucianism.” We will discuss\nbriefly some of its principal tenets. <\/p>\n\n<p>&nbsp;<\/p>\n\n<p><u>Week 6<\/u><\/p>\n\n<p>Confucianism\nand Chinese Culture Today<\/p>\n\n<p>The influence of Confucianism on Chinese\nculture is one important issue, but equally important would be the potential\ncontribution of Confucian philosophy to global dialogue. Is Confucianism still\nrelevant today? What does Confucianism have to offer to contemporary society, which\nmust confront a host of complex challenges? What can we learn from it?<\/p>","courseFormat":"<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n6\nweeks of lectures, 1.5 hours per week, in video segments of 5-8 minutes each<\/p>\n\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n2 short\nessays, which will involve peer-to-peer assessment<\/p>\n\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nA\nmultiple choice quiz may be assigned, more as a pedagogical experiment than as\nan assessment. Essays are more appropriate as a mode of assessment in the\nHumanities, as they better enable students to articulate and defend their\nideas. However, alternative modes of assessment should also be explored for the\nMOOC learning environment.&nbsp;<\/p>","suggestedReadings":"<p><span>Students in\nthis course will need to read the <i>Analects<\/i>.\nThere are several good translations. For consistency, in this course we will be\nreferring primarily to:<\/span><\/p>\n\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n<i>Confucius: The Analects<\/i>, translated by D. C. Lau. Hammondsworth:\nPenguin Books, 1979; reprinted many times, including a bilingual edition\npublished by the Chinese University Press in Hong Kong<\/p>\n\n<p>The work by\nRoger Ames and Henry Rosemont offers a philosophical translation, whereas\nEdward Slingerland’s includes selected commentaries by traditional Chinese\nscholars.<\/p>\n\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n<span>Ames,\nRoger T. and Henry Rosemont, Jr., trans. <i>The\nAnalects of Confucius: A Philosophical Translation<\/i>. New York: Ballantine\nBooks, 1998.<\/span><\/p>\n\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n<span>Slingerland,\nEdward G., trans. <i>Confucius: Analects\nwith Selections from Traditional Commentaries<\/i>. Indianapolis: Hackett Pub.\nCo., 2003. There is also an abridged version: <i>The Essential Analects: Selected Passages with Commentary<\/i>.\nIndianapolis: Hackett Pub. Co., 2006. <\/span><\/p>\n\n<p><br><\/p><p>The following\nstudies may also be consulted:<\/p>\n\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n<span>Fingarette,\nHerbert. <i>Confucius: The Secular as Sacred<\/i>.\nNew York: Harper and Row, 1972. This is a gem of a book, which promises to\nprovoke your thinking about Confucian philosophy.<\/span><\/p>\n\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n<span>Goldin,\nPaul R. <i>Confucianism<\/i>. Durham: Acumen,\n2011.<\/span><\/p>\n\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n<span>Hall,\nDavid L. and Roger T. Ames. <i>Thinking\nThrough Confucius<\/i>. Albany: State University of New York Press, 1987.<\/span><\/p>\n\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n<span>Lai,\nKaryn. <i>An Introduction to Chinese\nPhilosophy<\/i>. Cambridge and New York: Cambridge University Press, 2008,\nChapters 2-3.<\/span><\/p>\n\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n<span>Liu,\nJeeLoo. <i>An Introduction to Chinese\nPhilosophy: From Ancient Philosophy to Chinese Buddhism<\/i>.<i> <\/i>Oxford: Blackwell Pub., 2006, Part I.<\/span><\/p>\n\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n<span>Makeham,\nJohn, ed. <i>Dao Companion to Neo-Confucian\nPhilosophy<\/i>. Dordrecht: Springer, 2010.<\/span><\/p>\n\n<p>· &nbsp; &nbsp; &nbsp; &nbsp;<span>Olberding,\nAmy, ed. <i>Dao Companion to the Analects<\/i>.\nDordrecht: Springer, 2014.<\/span><\/p>\n\n<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n<span>Van\nNorden, Bryan W. <i>Introduction to\nClassical Chinese Philosophy<\/i>. Indianapolis: Hackett Pub. Co., 2011, Chapters\n1-3, 6 and 10.<\/span><\/p>\n\n<p>&nbsp;<\/p>","estimatedClassWorkload":"4-5 hours\/week","recommendedBackground":"None; anyone who has an interest in Chinese culture and philosophy is\nwelcome to take this course.","links":{}}