{
    "id": 1137,
    "shortName": "ourearth",
    "name": "Our Earth: Its Climate, History, and Processes",
    "language": "en",
    "shortDescription": "Develop a greater appreciation for how the air, water, land, and life formed and have interacted over the last 4.5 billion years.",
    "aboutTheCourse": "<p>This course focuses on a basic science understanding that demonstrates how the processes on Earth (including biological processes) lead to natural climate changes that have shaped the planet and the path of evolution. Students are challenged to think of the Earth as an integrated system made up of water, air, ice, land, and life.&nbsp;&nbsp;<br><\/p><p>For example, students learn that the rise of oxygen in the atmosphere 2.5 billion years ago produced massive extinctions of life on Earth that forever altered the dominant types of single-celled life. &nbsp;Students are exposed to how new scientific discoveries are made through the observations that led to plate tectonics, how the Moon formed, and why dinosaurs went extinct.<\/p><div><br><\/div>",
    "targetAudience": 0,
    "courseSyllabus": "<b>1.&nbsp; Building blocks of the Earth's climate<\/b><br><ul><li>How science works<\/li><li>How Earth's climate works<\/li><li>What is geologic time?<\/li><li>Rocks and minerals<\/li><li>How old is the Earth?<br><\/li><\/ul><b>2. Formation, evolution, and processes of the solid Earth<br><\/b><ul><li>Formation of the Earth<\/li><li>Formation of the Moon<\/li><li>Plate tectonics<br><\/li><li>The first continents<\/li><li>Earth's magnetic field<\/li><li>Mid-ocean ridges and subduction zones<br><\/li><li>Supercontinents<\/li><li>Continent–continent collisions (Example: the Himalaya)<br><\/li><\/ul><b>3. Water in the Earth's climate system: Oceans, atmosphere, and cryosphere<\/b><br><ul><li>The oceans: How they regulate the Earth's climate<\/li><li>The cryosphere: Ice on our planet<\/li><li>The atmosphere: Our protective layer and weather-maker<br><\/li><\/ul><b>4. Life, and its effect on the Earth's climate system<\/b><br><ul><li>Evolution of the atmosphere<\/li><li>Single cells and hard shells<\/li><li>Life on land<\/li><li>Death from above (and below): Mass extinctions<\/li><\/ul>The course presents four weeks of primary content, but runs for five weeks to allow students time to complete all assignments. Although the course is structured as separate weeks, all material will be available from the beginning.<br>",
    "estimatedClassWorkload": "5-8 hours\/week",
    "recommendedBackground": "There is no recommended background content.&nbsp; The course is open to anyone.&nbsp; Basic science knowledge (e.g. chemistry) will be assumed, but will not be a barrier to participation.<br>",
    "links": {

    }
}