{"id":239,"shortName":"musicsbigbang","name":"Music's Big Bang: The Genesis of Rock 'n' Roll","language":"en","shortDescription":"Explores the factors — musical and cultural — that led to the birth of American rock 'n' roll music in the early 1950s.","aboutTheCourse":"<p>How did rock 'n' roll music come to be?<\/p> Join us to explore Music's Big Bang -- how music brought to America by immigrants evolved, blended and eventually became the delectable stew that is rock 'n' roll.<p><\/p>\n<p>We will see and hear the ingredients in that stew, such as blues, jazz and gospel, and explore rock 'n' roll's first half\n    decade, roughly 1955 to 1960. We will consider cultural factors, too, including the advance of technology, the migration of rural Americans from the South to the cities of the North, and the threats to mainstream American\n    values presented by teenage rebellion and the Civil Rights Movement.<\/p>","targetAudience":0,"courseSyllabus":"<ul><li><b>Week 1<\/b> What is rock 'n' roll? It's a whole lot more than just music. It's a business, an attitude, a cultural phenomenon, a showcase of technology and more.<br><\/li><li><b>Week 2<\/b> Before there was rock: Major musical genres, technological advances and players integral to the birth of rock 'n' roll. The genres include jazz, blues, country, western, bluegrass, gospel, popular music and more.<\/li><li><b>Week 3<\/b> Mississippi Ghosts: W.C. Handy and the Delta Blues of Robert Johnson, Son House, Charley Patton and Lead Belly.<\/li><li><b>Week 4<\/b> A Tale of Three Cities: New Orleans' jazz and early rock 'n roll, Chicago and its electric blues, and Memphis, Tenn., home of Elvis Presley and Sun Records.<\/li><li><b>Week 5<\/b> The emergence of Chuck Berry, Little Richard and Bo Diddley; the Sun Records \"Class of 1955\" and \"The Day the Music Died.\"<\/li><li><b>Week 6<\/b> The major labels finally awaken and start to rock: The search is on for the next big thing, Elvis II.<\/li><li><b>Week 7<\/b> The five styles of rock 'n' roll as postulated by author Charlie Gillett.<\/li><li><b>Week 8<\/b> Summation and project review.<\/li><\/ul><br>","courseFormat":"The class will consist of lecture videos. Several videos, usually 8 to 12 minutes in length, will be posted each week. To advance through the course, you must complete a short weekly quiz by answering questions from the videos. <br><br>An optional but exciting project involves creating your own interactive online timeline of events covered in our course.<br>","suggestedReadings":"There are no required readings, but if you want to know more, there are dozens of great books you can buy. Here are a few recommendations:<br><ul><li><span>Gillett, C. (1993). <i>The Sound of the City: The Rise of Rock 'n' Roll<\/i> (Second Edition). Cambridge, Ma: Da Capo Press.<\/span><\/li><li><span>Gioia, T.\n(2009). <i>Delta Blues: The Life and Times\nof the Mississippi Masters Who Revolutionized American Music<\/i>. New York, NY:\nW.W. Norton.<\/span><\/li><li><span>Palmer, R.\n(1982). <i>Deep Blues:\nA Musical and Cultural History of the Mississippi Delta. <\/i>New\nYork, NY: Penguin.<\/span><\/li><li><span>Covach, J. &amp; Flory, A. ((2012). <i>What's That Sound? An Introduction to Rock and Its History<\/i> (Third Edition). New York, NY: W.W. Norton.<\/span><\/li><li><span>Guralnick, P. (1995). <i>Last Train to Memphis: The Rise of Elvis Presley<\/i>. Boston, Ma.: Back Bay.<\/span><\/li><li><span>Mckeen, W. (2000). <i>Rock 'n' Roll Is Here To Stay: An Anthology. <\/i><\/span>New York, NY:\nW.W. Norton.<\/li><li>Guralnick, P. (1999). <i>Sweet Soul Music:<\/i> <i>Rhythm and Blues and the Southern Dream of Freedom<\/i>.&nbsp; Boston, Ma.: Back Bay.<\/li><\/ul>","instructor":"","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"No previous knowledge is required.<br>","links":{}}