{"id":185,"shortName":"wealthofnations","name":"Generating the Wealth of Nations","language":"en","shortDescription":"A survey of the history of economic development in the world in the past 300 years.","aboutTheCourse":"<p>If\nyou had been alive at the start of the eighteenth century, your material\nwell-being would have been much the same whichever region of the world you\nlived in, and it would almost certainly have been a precarious existence.  Go back 300 years before the eighteenth\ncentury, and not much was different.  But\ncome forward 300 years to the present, and we see a startling transformation. <\/p>\n\n<p>Incomes\nin some parts of the world have increased more than ten-fold; and now it most\ncertainly does matter where you live – with income differentials of 50 times\nbetween the world’s richest and poorest countries.  What has changed in the past 300 years is the\ndevelopment and application of new technologies at a pace unprecedented in\nhuman history – the steam engine, electricity and the computer, to name just a\nfew.  With these developments, for those\nwho have access to them, have come huge gains in living standards.<\/p>\n\n<p>In\nthis course we’ll explore the spectacular (but uneven) story of economic\ndevelopment – beginning with the Malthusian era, moving on to the take-off of\ngrowth in the Industrial Revolution and the Great Divergence in living\nstandards that followed, and finishing in the present with the Global Financial\nCrisis.  We’ll cover the main episodes\nand events in the development of the world economy in the past 300 years, and\nhave something to say about most regions of the world.  As well as dealing with ‘what happened’, the\ncourse will emphasise what is known about ‘why’ – and what lessons historical\nexperience can provide for understanding how some countries today are so rich\nyet others remain so poor.<\/p><p>Course image: Copyright JL Brown. Creative Commons Attribution 3.0 Unported (CC BY 3.0) <br><\/p><br>","targetAudience":0,"courseSyllabus":"The course will cover the development of the world economy by concentrating on the following main episodes and events:<br><ul><li>Introduction to the history of economic development<br><\/li><li>The Malthusian Era <\/li><li>The Industrial revolution<br><\/li><li>The first era of globalisation and the rise of the United States<\/li><li>The Great Depression<\/li><li>The Golden Age<\/li><li>Japan and High Performing Asian Economies<\/li><li>China and former Soviet Union<\/li><li>The history of economic development in Africa<br><\/li><li>The history of economic development in Latin America<\/li><\/ul>","courseFormat":"This course will run for ten weeks, including two weeks of assessment at the end. There will be a number of video lectures presented each week as well as discussion groups and written assignments.<br><br><br>","suggestedReadings":"The lectures are designed to be self-contained and there\nare no required readings for this course.<br>","instructor":"Professor Jeff Borland","estimatedClassWorkload":"6-8 hours\/week","recommendedBackground":"No prior knowledge about the subject matter is required, all are welcome to enrol.","links":{}}