{
    "id": 2959,
    "shortName": "deafness",
    "name": "Deafness in the 21st Century",
    "language": "en",
    "shortDescription": "If you want to know more about deafness in low and middle income countries this MOOC is for you. It is primarily aimed at those working as health or education professionals, government officials, support workers, NGOs and anyone with a family or personal interest in deafness. It aims to improve knowledge and understanding of this topic.",
    "aboutTheCourse": "<p>Communication is central to human experience. For those\nwho are born deaf this is the area most at risk. Unless you have personal\nexperience of deafness in your work or a family member who is deaf you may\nnever have thought about this topic. As deafness is invisible the 350 million\nindividuals worldwide who are deaf, half of this is preventable, are at the\nfringe of many societies. <\/p>\n\n<span>This short course\nwill allow you to consider health, social and societal issues in relation to\ndeafness. You will understand how the hearing system works and what can go\nwrong, particular challenges in low and middle income countries, about\nscreening and diagnostic services, amplification including solar powered aids,\nchallenges to inter-personal communication, sign language and positive stories\nabout what deaf individual can and do achieve. This will challenge stereotypes\nand promote a positive message about deafness in the 21st century.<\/span>",
    "targetAudience": 3,
    "courseSyllabus": "<strong>1.\t Deafness:&nbsp;<\/strong><b>a global perspective\nof the silent epidemic<\/b><br><ul><li>The global inequalities and implications for deaf children, young people\nand adults.<br><\/li><li>An introduction to the hearing system and basic physiology.&nbsp;<br><\/li><li>Understanding the auditory system.<\/li><\/ul><strong><\/strong><br><strong>2.&nbsp;<\/strong><b>Preventable cause of\ndeafness<\/b><br><ul><li>Epidemiology of hearing loss in low and middle income countries.<br><\/li><li>Prevention of hearing impairment and disability, including noise damage,\nototoxicity, age related hearing loss, middle ear disease and measles, mumps,\nrubella and malaria as causes of deafness.<br><\/li><\/ul><br><strong>3.&nbsp;<\/strong><b>Identification and assessment of deafness and amplification<\/b><br><ul><li>Screening, diagnostic assessment, the potential and challenge of\namplification.<br><\/li><li>The role of NGOs and manufacturing companies in provision of\namplification.<br><\/li><li>Examples of practice.&nbsp;<br><\/li><\/ul><br>&nbsp;<strong>4.&nbsp;<\/strong><b>Family Centred Early\nIntervention<\/b><br><ul><li>Consideration of the international consensus statement on family centred\nearly intervention.<br><\/li><li>Examples of how this can apply in a low income countries.<br><\/li><li>Developing early communication and literacy skills, empowering parents and working with the Deaf community.&nbsp;<br><\/li><\/ul><br>&nbsp;<strong>5.\tFostering interpersonal communication across language modalities<\/strong><br><ul><li>Use of signed languages<br><\/li><li>Speechreading<br><\/li><li>Spoken language<br><\/li><li>Facilitating communication&nbsp;<br><\/li><\/ul><br>&nbsp;<strong>6.\tPossible futures:  given support, what can deaf children and adults achieve?<\/strong><br><ul><li>Case studies of possible futures<br><\/li><li>Focus on international projects<\/li><\/ul><br><br>",
    "estimatedClassWorkload": "2-4 hours\/week",
    "recommendedBackground": "<span>The course is suitable for professionals working in a range of settings\ninternationally such as medics, health care workers, teachers, charity workers, NGOs as well as many other groups of people.&nbsp;People with a personal experience of deafness such as family members\nshould also find information to interest them.<\/span>",
    "links": {

    }
}