{"id":3000,"shortName":"explorelight","name":"Exploring Light","language":"en","shortDescription":"This is an Exploratorium Teacher Institute professional development course open to any science teacher (particularly middle or high school level) and light enthusiast. Participants will engage in hands-on STEM activities that allow them to directly experience natural phenomena and gain an understanding of how the Exploratorium helps people learn.","aboutTheCourse":"A hallmark of the\nExploratorium Teacher Institute is that we have developed hundreds of \"snacks\" over the years: hands-on teaching activities (thoroughly\ntested by students and teachers) that explore scientific phenomena using\neasy-to-obtain materials. Throughout the class, we'll share some of our favorite snacks and ask you to try them out at home.<br><br>This course is designed as a hands-on workshop that explores various strategies middle- and high-school teachers can use to help their students investigate light. We will start by examining light perception, then we'll take a brief historical tour of our evolving scientific understanding. We’ll then look at optics and optical instruments, and finish by looking at modern views of light as a wave and a particle.<br><br>To get the most out of this experience, you'll have to try out some activities! In return, you'll get lots of valuable teaching resources, an in-depth understanding of the subject matter, and useful tips and techniques for the classroom.<br><br><strong> NOTE: Because this is a hands-on workshop, you will need to buy or find materials for this course. <\/strong>All\n of the materials required are inexpensive and should be easy to obtain.\n We'll send out a complete list with recommended sources before the \ncourse begins. <br><br><br>","targetAudience":3,"courseSyllabus":"<b>Week One: Perception <br><\/b><span>To understand light, we must understand how our eyes and brain\nperceive and make sense of it. We’ll look at illusions that illuminate how the\neye and the brain use light to construct models of the natural world. <br><br>\u2028\u2028<b>Week\nTwo: <\/b><b>Optics<\/b>\u2028 <br>Make images using lenses and mirrors, and do a deep dive into the fascinating world of optics.\n\u2028\u2028<b><br><\/b><\/span><br><span><b><span><b>Week Three: What is light? A historical tour<\/b>\u2028 <br><\/span><\/b><span>Explore the nature of light by doing\nsimple modern versions of classical experiments following light from particle\nto wave to quantum object.\u2028\u2028<b><br><br><\/b><\/span><strong>Week Four: The wave nature of light\u2028 <\/strong><br>Explore the modern view of\nlight: see light as a wave and as a photon.<\/span>\n\n\n\n<p>If you wish to earn a Statement of Accomplishment, you'll need to take what you’ve learned in this class and submit a mini-lesson for peer review and evaluation. You can\nadapt one of our activities or come up with your own, but you must try things out! In return, you'll get valuable feedback and tips\nfrom the instructors and other students in the class.<\/p><br>","courseFormat":"<span>Each week we'll present several short videos that illuminate different aspects and properties of light. We'll show you demonstrations of some of our favorite Exploratorium museum exhibits and also&nbsp;teach you how to do simple light explorations at home, using inexpensive materials that enable you to experience natural phenomena and inspire you to ask questions and seek answers. <br><br>We'll show you how to build the activities and use them in a classroom. <\/span><span>We'll also talk about strategies for facilitating inquiry and monitoring student learning. Your job as a participant in the course will be to gather materials, try out the featured activities, then reflect on the experience and examine them with a critical eye.<br><br>Discussion forum participation is essential, so we hope you'll share the results of your investigations along with questions, observations, ideas, and any suggested modifications and improvements. We want to foster an active community so we can all benefit and learn from one another. <br><br>We will also film and post weekly Fireside Chat videos to highlight important conversations, respond to participant questions, and demonstrate other activities and strategies. There will also be selected readings and assignments to complete, particularly for those who wish to obtain a Statement of Accomplishment.<\/span><br>","suggestedReadings":"A great book that covers much of the material we will present is <a href=\"http:\/\/www.amazon.com\/Seeing-Light-Optics-Photography-Holography\/dp\/0471603856\"><strong>Seeing the Light<\/strong><\/a><strong>,<\/strong> by David Falk, Dieter Brill and David Stork. You do not need to acquire this book, but if you would like an excellent reference, this is the best, most readable book on the subject, well illustrated and full of hands-on explorations.","estimatedClassWorkload":"2-4 hours\/week","recommendedBackground":"This course is appropriate\nfor any middle or high school teacher interested in learning about light and\nhow to guide students to a better understanding of light. Formal training in\nthe physical or life sciences is highly recommended (BA\/BS in science or\nequivalent), although a passionate interest in obtaining a deep understanding\nof light will suffice.\n\n\n\n\n\n<br>","links":{}}