{
    "id": 602,
    "shortName": "poisonings",
    "name": "Poisonings in the Home and Community: Assessment and Emergency Response",
    "language": "en",
    "shortDescription": "This is a survey course on the principles of Clinical Toxicology. The emphasis will be pre-hospital and emergency hospital management of poisonings with a case-oriented lecture format. The topics are prioritized by prevalence of human poisoning, natural and synthetic toxins, and target organ effects. \n",
    "aboutTheCourse": "<p><b>Clinical Toxicology: Poisons in the Home and Community<\/b> will cover clinical assessment & emergency response.\n    <br>\n<\/p><span><p>Here are the overall learning objectives for this course:<\/p><\/span>\n\n<p>1.    Describe the epidemiology of poisonings to include most common age groups, scenarios, substances involved, and outcomes.<\/p>\n\n<p>2.    List the steps taken if confronted with a poisoning to include appropriate first-aid, history necessary to assess a poisoning, and appropriate emergency response (poison control center, 9-1-1).<\/p>\n\n<p>3.    Recognize the hazard potential among common household products (cleaning agents, personal care products, hydrocarbons, caustics).<\/p>\n\n<p>4.    Describe the clinical presentation and emergency treatment for poisonings caused by plants and mushrooms, venoms, stimulants, and depressants.<\/p>\n\n<p>5.    Identify useful clinical signs and symptoms to diagnose a suspected poisoning.  <\/p>\n\n<p>6.    Describe the advantages and disadvantages of methods to decontaminate a poisoned patient.<\/p>\n\n<p>7.    List the steps taken to manage a comatose poisoned patient to include supportive care and use of antidotes.\n<\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<p>Lectures will be provided by the following speakers as follows:<\/p>\n\n<p>Week 1: <b>General Principles & Household Hazards<\/b> — Tom Kearney<\/p>\n\n<p>Week 2: <b>Plants & Mushrooms<\/b> — Ilene Anderson<\/p>\n\n<p>Week 3: <b>Venoms<\/b> — Lee Cantrell<\/p>\n\n<p>Week 4: <b>Stimulants<\/b> — Patil Armenian<\/p>\n\n<p>Week 5: <b>Depressants<\/b> — Kent Olson<\/p>\n\n<p>Week 6: <b>ED Management & Assessment<\/b> — Craig Smollin<\/p><p>Week 7: Final exam<\/p>",
    "estimatedClassWorkload": "3-4 hours\/week",
    "recommendedBackground": "<b> <\/b>The course may be appropriate for healthcare and upper-division undergraduate students that have had previous pharmacology course experiences, as well as practicing healthcare professionals.",
    "links": {

    }
}