{
    "id": 902,
    "shortName": "population",
    "name": "An Introduction to Population Health",
    "language": "en",
    "shortDescription": "This MOOC is aimed at anyone wishing to understand the basics of population health. It provides a general introduction to some of the key themes, topics and discussion relevant to population health across the world. Primarily aimed for the general public, the course will also help those already working in health and social care who wish to improve their knowledge and understanding on this topic. ",
    "aboutTheCourse": "<p>If you are like the course instructors, then you've probably spent a lot of time focusing on your own health and that of people in your family and close friends. But have you ever thought much about the health of a whole group of people, such as your village, town, or country, or even the whole world? Well this is what population health is all about. It takes us from thinking about the health of one or just a few people, up to <strong>the health of a whole group of people<\/strong> which is defined in some way, often in terms of where they live. .&nbsp;<\/p>\n\n<p>On this short course, you will learn some of the key reasons <strong>why population health is important to consider<\/strong>, not just by healthcare professionals but by local, national and international policy makers. I'm sure many of you have heard of the World Health Organization (WHO)- primarily the WHO is concerned with the health of everyone in the whole world. Awesome! At the same time, <strong>population health is something that affects everyone, whether they are poorly or not<\/strong>, and this includes you. <em>So it's fantastic that you are interested in this subject. <\/em>&nbsp;&nbsp;<\/p>\n\n<p><em>The University of Manchester pioneered the teaching of population health<\/em> with one of the first, online distance learning programmes in the world. You can find out more about this at:&nbsp;<a href=\"http:\/\/www.manchester.ac.uk\/phpc\" title=\"Link: http:\/\/www.manchester.ac.uk\/phpc\">www.manchester.ac.uk\/phpc<\/a>. We continue to&nbsp;teach people all over the world for professional certificates right though to masters level. This is the second year that we have run this MOOC. As you may know, MOOCs are a very new way of teaching anyone using this short, open-course approach. So it's great that you are also taking part in new ways of learning.&nbsp;<\/p>",
    "targetAudience": 3,
    "courseSyllabus": "<h2>Week 1<\/h2><p>An <em>Introduction to\nPopulation Health<\/em>.<\/p>\n\n\n\n\n\n\n\n<p>This week will introduce some of the main topics relevant to population health, some of which are explored in more detail over the next few weeks.<\/p><h2>Week 2<\/h2><p>An I<em>ntroduction\nto Epidemiology<\/em>,&nbsp;<\/p><p>This week will introduce you to some of the ways in which we can find out more about the health of a population. This is known as epidemiology.&nbsp;<\/p><h2>Week 3<\/h2><p>The <em>State of the\nWorld’s Health.&nbsp;<\/em><\/p><p>This week looks at some of the major health issues in the world and considers some of their causes and their consequences.<\/p><h2>Week 4<\/h2><p><em>Global Influences\non Population Health.<\/em><\/p><p>This week looks at migration and poverty and how they are influencing the\nhealth of populations.<\/p><h2>Week 5<\/h2><p><em>Population Health\nInterventions.<\/em>&nbsp;<\/p><p>This week looks at ways of improving the health at a population level, including different approaches to the design of specific 'interventions'.<\/p><h2>Week 6<\/h2><p><em>Your Reflections<\/em><\/p><p>Wow - we hope you have completed the previous five weeks of teaching on this short course. This week is an opportunity to <strong>focus on you. &nbsp;<\/strong>So you will be given direction to think about what you have learnt so far, and how this relates to your understanding of population health - and more importantly, we want you to think about applying this learning and think about how it relates to some of the things going on around you as part of your work and as part of your home environment.&nbsp;<\/p><p><br><\/p><p>A short course run as a MOOC is not really about learning from the teachers. <strong>The best learning will come from 'talking' to other students<\/strong>, sharing your thoughts and reflecting back on the ideas from other students. You can gently challenge other students and think about how something might be different for you and your own local environment. That's why you will be guided to develop and then actively take part in a number of Discussion Boards - notice the word 'discuss'!!! And there is nothing to stop you from setting up other ways to work like this - in the past some students have set up their own Facebook pages to&nbsp;<\/p><p><em>Dr Roger Harrison and Dr Arpana Verma.<\/em><\/p>",
    "estimatedClassWorkload": "1-3 hours\/week",
    "recommendedBackground": "We haven't set any background reading for this short course. We want you to start the course with your own ideas and experiences and with your interest in learning more about this topic. During the course it will be great if you bring your own learning materials too, and we encourage you to share relevant articles, documents etc with other people on the course.&nbsp;",
    "links": {

    }
}