{"id":1271,"shortName":"droitshomme","name":"Introduction aux droits de l’homme","language":"fr","shortDescription":"Ce cours propose une introduction à la protection internationale des droits de l’homme. Il en présente les sources, les catégories, le contenu et les limites qui leur sont opposables, ainsi que les obligations qu’ils génèrent à la charge des Etats. Il expose aussi les principaux mécanismes de mise en œuvre prévus au niveau universel et régional pour assurer leur respect.","aboutTheCourse":"Depuis la fin de la Seconde Guerre mondiale, les\n      droits de l’homme sont un domaine en plein essor. De nombreuses causes\n      sont aujourd’hui défendues et débattues sous la bannière des droits de\n      l’homme&nbsp;: la protection des minorités, la lutte contre la\n      discrimination des femmes, des personnes lesbiennes, gaies, bisexuelles\n      et transgenres (LGBT), la lutte contre la torture et les disparitions\n      forcées, la lutte contre la pauvreté ou encore la protection de\n      l’environnement et la protection des données. Partout dans le monde, ces\n      causes mobilisent tant les acteurs politiques que la société civile et elles sont\n      discutées dans de multiples enceintes, nationales et internationales.<br><br>Le présent cours vise à offrir les bases nécessaires\n      pour appréhender et comprendre le domaine vaste et complexe que sont\n      devenus les droits de l’homme. Quelles sont les caractéristiques et les\n      différentes catégorie des droits de l’homme&nbsp;? Quels sont leurs fondements\n      philosophiques et historiques ? Pourquoi ces droits sont-ils\n      importants&nbsp;? Quels instruments visent à les protéger ? Comment\n      rendre ces droits opérationnels&nbsp;? Quels mécanismes existent pour les\n      mettre en œuvre et quels sont leurs avantages et leurs\n      inconvénients&nbsp;?<br><br>En abordant ces questions, le cours s’adresse tant à\n      des membres de la communauté universitaire qu’à des praticiens\n      (responsables politiques, membres du corps diplomatique, fonctionnaires,\n      journalistes, membres d’ONG, défenseurs des droits de l’homme et\n      spécialistes de la coopération au développement, de l’aide humanitaire et\n      des questions relatives aux réfugiés), ainsi qu’à toutes les personnes\n      qui sont engagées dans la protection des droits de l’homme ou simplement\n      désireuses de mieux comprendre ce phénomène.<br><br>Le cours est conçu et dispensé par les Professeurs\n      Maya Hertig Randall et Michel Hottelier, de la Faculté de droit de\n      l’Université de Genève. Durant le cours, des membres d’organes et\n      institutions voués à la protection des droits de l’homme et des\n      spécialistes de la communauté académique seront invités à intervenir. \n\n\n\n\n\n<br>","targetAudience":0,"courseSyllabus":"<ul><li>Semaine\n      1&nbsp;: Les fondements des droits de l’homme<\/li><li>Semaine 2 : L’internationalisation des droits de l’homme<\/li><li>Semaine\n      3&nbsp;: Les sources des droits de l’homme<\/li><li>Semaine\n      4&nbsp;: La typologie des droits de l’homme<\/li><li>Semaine\n      5&nbsp;: Les obligations découlant des droits de l’homme<\/li><li>Semaine\n      6&nbsp;: Les limites des droits de l’homme<\/li><li>Semaine\n      7&nbsp;: Les mécanismes de mise en œuvre des droits de l’homme (première partie) <br><\/li><li>Semaine\n      8&nbsp;: Les mécanismes de mise en œuvre des droits de\n      l’homme (seconde partie) <br><\/li><\/ul>","courseFormat":"Le cours\n      est donné en français.<br>Il\n      consiste en une série de 8 sessions, comprenant chacune un certain nombre\n      de brèves présentations vidéo (8 à 15 minutes).<br>Chaque\n      session s'accompagne d'un questionnaire d'évaluation.<br>Des\n      lectures préparatoires sont requises pour chaque session.\n\n\n\n\n\n<br>","suggestedReadings":"<ul><li>ALSTON P. \/ GOODMAN R., <i>International Human Rights<\/i>, Oxford 2013<\/li><li>ANDRIANTSIMBAZOVINA\nJ. \/ GAUDIN H. \/ MARGUÉNAUD J.-P. \/ RIALS S. \/ SUDRE F. (éds.), <i>Dictionnaire\ndes droits de l'homme<\/i>, Paris 2008<\/li><li>BALLESTEROS J.,\n<i>Derechos humanos: concepto, fundamentos, sujetos<\/i>, Madrid 1992<\/li><li>BEITZ C. R., <i>The Idea of Human\nRights<\/i>, Oxford 2009<\/li><li>BUERGENTHAL T. \/ THÜRER D.,\n<i>Menschenrechte: Ideale, Instrumente, Institutionen<\/i>, Zurich&nbsp;2010<\/li><li>CARETTI P., <i>I\ndiritti fondamentali: Libertà e diritti sociali<\/i>, 3ème éd., Turin 2011<\/li><li>EIDE A. \/\nALFREDSSON G. (éds.), <i>The Universal Declaration of Human Rights: A Commentary<\/i>,\nOslo 1992<\/li><li>FERNÁNDEZ DE\nCASADEVANTE ROMANI C., <i>Derecho internacional de los derechos humanos<\/i>, 4ème éd.,\nMadrid 2011<\/li><li>FORSYTHE D. P.,\n<i>Encyclopedia of Human Rights<\/i>, Oxford 2009<\/li><li>KÄLIN W. \/\nKÜNZLI J., <i>The Law of International Human Rights Protection<\/i>, Oxford 2009<\/li><li>KÄLIN W. \/ KÜNZLI J., <i>Universeller\nMenschenrechtsschutz<\/i>, 3ème éd., Bâle 2013<\/li><li>LEVINET M.,\n<i>Théorie générale des droits et libertés<\/i>, 3ème éd., Bruxelles 2010<\/li><li>MOECKLI D. \/ SHAH S. \/ SIVAKUMARAN\nS. \/ HARRIS D., <i>International Human Rights Law<\/i>, Oxford 2010<\/li><li>NOWAK M., <i>Einführung in das\ninternationale Menschenrechtssystem<\/i>, Vienne 2002<\/li><li>ROBERT J. \/\nDUFFAR J., <i>Droits de l’homme et libertés fondamentales<\/i>, 8ème éd., Paris 2009<\/li><li>SUDRE F., <i>Droit\ninternational et européen des droits de l’homme<\/i>, 11ème éd., Paris 2012<\/li><li>TOMUSCHAT C., <i>Human rights:\nBetween Idealism and Realism<\/i>, 2ème éd., Oxford 2008<br><\/li><\/ul>","estimatedClassWorkload":"3-4 hours\/week","recommendedBackground":"Aucune\n      formation préalable n’est requise. \n\n\n\n\n\n<br>","links":{}}