{"id":2954,"shortName":"sdn1","name":"Software Defined Networking","language":"en","shortDescription":"In this course, you will learn about software defined networking and how it is changing the way communications networks are managed, maintained, and secured.","aboutTheCourse":"<p>This course introduces software defined networking, an emerging paradigm in computer networking that allows a logically centralized software program to control the behavior of an entire network. &nbsp;<\/p><p>Separating a network's control logic from the underlying physical routers and switches that forward traffic allows network operators to write high-level control programs that specify the behavior of an entire network, in contrast to conventional networks, whereby network operators must codify functionality in terms of low-level device configuration. &nbsp;<\/p><p>Logically centralized network control makes it possible for operators to specify more complex tasks that involve integrating many disjoint network functions (e.g., security, resource control, prioritization) into a single control framework, allowing network operators to create more sophisticated policies, and making network configurations easier to configure, manage, troubleshoot, and debug.&nbsp;<\/p>","targetAudience":1,"courseSyllabus":"<p>This course will cover 8 modules (one per week).<\/p><p>Module 1: History and evolution of SDN<\/p><p>Module 2: Control and data plane separation<\/p><p>Module 3: Control Plane<\/p><p>Module 4: Network Virtualization<\/p><p>Module 5: Data Plane<\/p><p>Module 6: Programming SDNs<\/p><p>Modules 7: Verification and Debugging<\/p><p><\/p><p>Module 8: Use Cases and Looking Forward<\/p>","courseFormat":"<p>The course will consist of a series of video lectures, each about 10 minutes in length.<\/p><p>Assignments for the course are lab-based programming assignments, many of which build off of the Mininet software developed at Stanford University, which can run SDNs in emulated environments on networks of virtual machines.<\/p>","suggestedReadings":"There are some useful videos available online; these&nbsp;might be a good starting point for many people:<br><ul><li>&nbsp;Prof. Nick McKeown, Stanford<br>\"<a href=\"https:\/\/www.youtube.com\/watch?v=c9-K5O_qYgA\" target=\"_blank\" title=\"Link: https:\/\/www.youtube.com\/watch?v=c9-K5O_qYgA\">How&nbsp;SDN&nbsp;will Shape Networking\"<\/a><\/li><\/ul><ul><li>&nbsp;Prof. Scott Shenker, Berkeley:<br><a href=\"https:\/\/www.youtube.com\/watch?v=WVs7Pc99S7w\" target=\"_blank\" title=\"Link: https:\/\/www.youtube.com\/watch?v=WVs7Pc99S7w\">\"An attempt to motivate and clarify Software-Defined Networking (SDN)\"<\/a><br>(watch the first 35 minutes or so)<\/li><\/ul><i><b>You may find the additional reading useful for introductory material:<\/b><\/i><br><ul><li>&nbsp;&nbsp;<a href=\"http:\/\/www.openflow.org\/documents\/openflow-wp-latest.pdf\" target=\"_blank\">OpenFlow: B<\/a><a href=\"http:\/\/www.openflow.org\/documents\/openflow-wp-latest.pdf\" target=\"_blank\">asic description of OpenFlow<\/a><\/li><li>&nbsp;&nbsp;<a href=\"https:\/\/www.opennetworking.org\/\" target=\"_blank\">Open Networking Foundation:&nbsp;<\/a>For recent OpenFlow specifications, etc.<\/li><li>&nbsp;&nbsp;<a href=\"http:\/\/yuba.stanford.edu\/foswiki\/bin\/view\/OpenFlow\/Mininet\" target=\"_blank\">Mininet<\/a>: Environment that allows you to emulate OpenFlow networks on a laptop.<\/li><\/ul>","estimatedClassWorkload":"7-10 hours\/week","recommendedBackground":"Students should have taken at least an undergraduate-level networking course and have programming experience in Python.&nbsp; Experience with virtual machines and other virtual networking environments may also be useful.","links":{}}