{
    "id": 2500,
    "shortName": "ccandph",
    "name": "Climate Change Policy and Public Health",
    "language": "en",
    "shortDescription": "Explore current evidence linking climate change and public health while learning the fundamental co-benefits of climate change mitigation.  Evaluate policies and interventions while gaining hands on experience communicating climate science and health to policy makers and the general public. ",
    "aboutTheCourse": "<p>Climate change is\nhaving and will continue to have a dramatic impact on global public health –\nfrom natural disasters and the increased spread of infectious disease to\npredicted crop losses and heat waves. <\/p><p><span>This course explores the impact of human activities on climate change\nand consequently public health, as well as the many real benefits to climate\nchange mitigation. We will discover the multiple benefits – or <i>co-benefits <\/i>– provided by public\npolicies and initiatives to reduce emissions.<i> <\/i>For example, protecting the environment by reducing greenhouse\ngases can simultaneously improve human health.<\/span><\/p><p><span>In addition to providing evidence for climate change’s impact on human\nhealth, this course will explore three primary areas where <i>co-benefits<\/i> can be realized: renewable energy, agriculture and\nfood, urban design and active transport. Please note: use of the term “urban”\nis relative; traits traditionally understood as “urban” can exist in many\nplaces, even if populations are not large.<\/span><\/p><p>This course will feature input from experts across the globe.\nParticipants will have the opportunity to engage with the current scientific\nand political literature, and discuss course content with peers worldwide. <\/p><p>Course participants will be given a strong foundation in the core\nlinkages between climate change, policy, and health. There will also be\nhands-on opportunities to develop skills in communicating the science and\npolicy connections between climate change and public health.<\/p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p><p>The course will emphasize a way forward for all, one providing the most\nbeneficial effects on both human health and the environment.<\/p>",
    "targetAudience": 3,
    "courseSyllabus": "<p><b>Week 1<\/b>: Week\n1 will explore crucial background information for this course, including the\nscientific consensus on climate change and its known impacts on health.&nbsp; Students will also review the Lima Decision,\nwhere at the 20th Conference of the Parties held in Lima, health concerns were\nexplicitly mentions for the first time as a requirement for countries to\nconsider in their formal policy planning for climate change mitigation and\nadaptation. <\/p>\n\n<p><b>Week 2<\/b>: Week\n2 will cover the health “Co-Benefits” of renewable energy and&nbsp; efficient housing, with a detailed look at\nhow burning fossil fuels impacts air pollution and health.&nbsp; Students will also explore air quality\nlegislation in India.&nbsp; <\/p>\n\n<p><b>Week 3<\/b>: Week\n3 will focus on the health “co-benefits” of sustainable agriculture, and\nintroduce students to some missed opportunities in agriculture policy.&nbsp; Students will review the US-Farm Bill, one of\nthe most influential pieces of legislation controlling land management in the\nUnited States. <\/p>\n\n<p><b>Week 4<\/b>: The final week of the course will feature the health\n“co-benefits” of active transportation and smart urban design.&nbsp; Students will evaluate Sweden’s “Vision Zero”\ninitiative and consider polices that support active transportation and reduced\nreliance on fossil fuels.&nbsp;&nbsp;<\/p>",
    "estimatedClassWorkload": "4-8 hours\/week",
    "recommendedBackground": "<p>No background in the subject matter\nis required, and all are welcome! Whether you are a high-school student, decision-maker,\nindustry leader, or working professional this course will be of value to you. Supplementary\nresources will be provided for advanced students.<\/p>",
    "links": {

    }
}