{
    "id": 2333,
    "shortName": "vtfinalproject",
    "name": "Virtual Teacher Final Project",
    "language": "en",
    "shortDescription": "This final project allows students to apply their knowledge of virtual instruction by designing an online or blended instructional module. It is the final requirement for the Virtual Teacher Specialization Certificate.",
    "aboutTheCourse": "The Final Project will be a hands-on, comprehensive project that practitioners of virtual education can implement in their profession. For this final project, learners will draft a design plan for an online learning module utilizing materials learned from the virtual teacher series. Learners will&nbsp;choose the subject matter, method of delivery, tools, instructional strategies, and assessments, with the goal of creating a module of online or blended instruction that meets the needs of their students. Learners do not have to create, develop or teach the online learning module they design.&nbsp;<br><br>Learners will have three weeks to draft their project, receive early feedback on first draft from peers (if desired) and&nbsp;submit their final project. During the&nbsp;fourth week of the course, all students participate in the peer review process by assessing three of their classmates' projects.<br><br><br>",
    "targetAudience": 3,
    "courseSyllabus": "Week 1: Familiarize yourself with the project and course requirements, complete activities (optional), submit early draft (optional)<br>Week 2: Participate in early peer review phase (optional)<br>Week 3: Submit final project (required)<br>Week 4: Participate in the peer review process (required)<br>* The project will be due on <strong>Sunday of Week 3<\/strong>. The&nbsp;peer review&nbsp;will be&nbsp;due&nbsp;on <strong>Sunday of Week 4. &nbsp;<\/strong><br>",
    "estimatedClassWorkload": "3-5 hours\/week",
    "recommendedBackground": "The Final Project is available to learners who successfully complete all four of the Virtual Teacher courses offered by UC Irvine Extension (with a grade of 70% or above) with Signature Track.&nbsp;",
    "links": {

    }
}