{
    "id": 1278,
    "shortName": "neurobio",
    "name": "Understanding the Brain: The Neurobiology of Everyday Life",
    "language": "en",
    "shortDescription": "Learn how the nervous system produces behavior, how we use our brain every day, and how neuroscience can explain the common problems afflicting people today. ",
    "aboutTheCourse": "<p dir=\"ltr\">The Neurobiology of Everyday Life is a 10-week course intended for anyone interested in how the nervous system works. The course starts by introducing basic neuroanatomy, neurodevelopment and mechanisms of neural communication. Students will gain an understanding of how injury and disease of different types and in different locations can alter a person’s life. Students will then use their understanding of fundamental neuroanatomy and physiology to examine how:&nbsp;<\/p><p>1) we perceive the outside world; <br>2) we act in the world either volitionally or emotionally; <br>3) our nervous system allows us to live; and <br>4) cognition operates to make us the human individuals that we are.&nbsp;<\/p><p>We will look at the neurobiology of everyday situations such as multitasking (walking and chewing gum) and at the ways in which the nervous system commonly fails us (e.g. motion sickness). Each week, topics that are best described as neuro-philosophical conundrums will be discussed in forums. Beyond emerging from this course with a new appreciation of many neurological conditions, students will come out recognizing the brain in action all day and every day. <br><\/p><p><b>If you'd like to get started thinking about the brain now, follow us on <a href=\"http:\/\/www.twitter.com\/neuromooc\" target=\"_blank\">Twitter @neuromooc!<\/a><\/b><\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<p>1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<u><\/u>Introduction: neurons, development and organization of the human brain<u><\/u><u><\/u><\/p><p><u><\/u>2. &nbsp; &nbsp; &nbsp; &nbsp;Neural communication: Information transfer in the nervous system<\/p><p><u><\/u><\/p><p><u><\/u>3. &nbsp; &nbsp; &nbsp; &nbsp;Neuroanatomy, strokes, and the blood-brain barrier<\/p><p><u><\/u>4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Perception and Vision<\/p><p><u><\/u>5. &nbsp; &nbsp; &nbsp; &nbsp;Hearing<\/p><p><u><\/u>6. &nbsp; &nbsp; &nbsp; &nbsp;The Vestibular System: Balance and Gaze<\/p><p><u><\/u>7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<u><\/u>Voluntary movement: From stumbling to Simon Says<u><\/u><u><\/u><\/p><p><u><\/u>8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<u><\/u>Voluntary movement: Coordination, chunking and habit<u><\/u><u><\/u><\/p><p><u><\/u>9.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<u><\/u>Homeostasis: Thermoregulation, sleep, and eating<u><\/u><u><\/u><\/p><p><u><\/u>10. &nbsp; &nbsp; &nbsp;<u><\/u>Executive function: Memory, language, playing well with others<\/p><p><span><u><\/u>&nbsp;<\/span><\/p>",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": "<p>Anyone interested in the brain is encouraged to sign up. No background is required. For those who may have forgotten their high school biology, short\nlessons for catch-up will be available as well as suggestions for further study.<\/p>",
    "links": {

    }
}