{"id":147,"shortName":"organalysis","name":"Organizational Analysis (Self-Paced)","language":"en","previewLink":"https:\/\/class.coursera.org\/organalysis-003\/lecture\/preview","shortDescription":"In this introductory, self-paced course, you will learn multiple theories of organizational behavior and apply them to actual cases of organizational change. ","aboutTheCourse":"<strong>Best MBA Mooc in 2013 as per review in the <\/strong><a href=\"http:\/\/www.ft.com\/cms\/s\/0\/2bfeed6a-5cf0-11e3-a558-00144feabdc0.html#axzz3DWCPIZwt\" target=\"_blank\"><strong>Financial Times<\/strong><\/a><strong>!&nbsp;\"The best [MBA Mooc] was Organizational Analysis taught by Stanford's Dan McFarland\" - Philip D. Broughton MBA<\/strong><br><br><br>It is hard to imagine living in modern society without participating in or interacting with organizations. The ubiquity and variability of organizations means there is ample room for complexity and confusion in the organizational challenges we regularly\nface. Through this course, students will consider cases describing various organizational struggles: school systems and politicians attempting to implement education reforms; government administrators dealing with an international crisis; technology firms\ntrying to create a company ethos that sustains worker commitment; and even two universities trying to gain international standing by performing a merger.\n<br>\n<br>Each case is full of details and complexity. So how do we make sense of organizations and the challenges they face, let alone develop means of managing them in desired directions? While every detail can matter, some matter more than others. This is why\nwe rely on organizational theories -- to focus our attention and draw out relevant features in a sensible way.\n<br>\n<br>Through this self-paced course you will come to see that there is nothing more practical than a good theory. In every module, you’ll learn a different organizational theory, and it will become a lens through which you can interpret concrete organizational situations.\nArmed with a toolset of theories, you will then be able to systematically identify important features of an organization and the events transforming it – and use the theories to predict which actions will best redirect the organization in a desired direction.<br><br>Join your future classmates and course alumni on&nbsp;<a href=\"https:\/\/www.facebook.com\/groups\/219602578167354\/\" target=\"_blank\">Facebook<\/a>!<br><br>","targetAudience":0,"courseSyllabus":"<strong>Module 1<\/strong>: Introduction\n<br><strong>Module 2<\/strong>: Decisions by rational and rule-based procedures\n<br><strong>Module 3<\/strong>: Decisions by dominant coalitions\n<br><strong>Module 4<\/strong>: Decisions in organized anarchies\n<br><strong>Module 5<\/strong>: Developing organizational learning and intelligence\n<br><strong>Module 6<\/strong>: Developing an organizational culture\n<br><strong>Module 7<\/strong>: Managing resource dependencies\n<br><strong>Module 8<\/strong>: Network forms of organization\n<br><strong>Module 9<\/strong>: Institutions and organizational legitimacy\n<br><strong>Module 10<\/strong>: Summary<br>","courseFormat":"This is a self-paced course that you can take at your leisure. There are no deadlines! <br><br>Each module includes a series of short lectures, followed by interactive assessments that refer to the module readings on an organizational theory and case. In addition, there will be a forum where students post questions, respond to others, and “like”\nquestions they want answered. Within each module, I record and post on-line the discussion of highly rated forum questions (screen-side chat). A final exam reviews all the material in the course.&nbsp;<br><br>You may take the quizzes and exams as many times as you like and we will keep the last score you achieve. We will grade all registered students every few months and send out Statements of Accomplishments at that time. If you don't finish in time, then complete the remaining requirements as soon as you can and the Statement of Accomplishment will arrive when we grade again. &nbsp;<br>","suggestedReadings":"No readings are required to complete this course. However, thousands of prior students have found the <a href=\"https:\/\/service.sipx.com\/service\/php\/inspect_document.php?id=perma-x-03de8060-5290-11e5-9868-22000a890e29\" target=\"_blank\" title=\"Link: https:\/\/service.sipx.com\/service\/php\/inspect_document.php?id=perma-x-03de8060-5290-11e5-9868-22000a890e29\">course textbook<\/a> to be especially useful and worth the purchase. The textbook is over 200 pages in length but written in an accessible style.&nbsp;An e-book version&nbsp;costs about $10 plus transaction fees, which will vary depending on your location&nbsp;(see course page for details).&nbsp;<br><br>Here is the manual link:&nbsp;<a href=\"https:\/\/service.sipx.com\/service\/php\/inspect_document.php?id=perma-x-03de8060-5290-11e5-9868-22000a890e29\">https:\/\/service.sipx.com\/service\/php\/inspect_document.php?id=perma-x-03de8060-5290-11e5-9868-22000a890e29<\/a><br><br><p>Please note the textbook is large and will take a while to download, so please secure a good connection before commencing the download process.&nbsp;If you are mostly interested in single modules of the course, then you can also purchase single chapters after you register using the&nbsp;links listed on&nbsp;the syllabus.&nbsp;<\/p><p>Additional readings will be made available in the course syllabus and through a text provider. For further information, please register and access the course page.<\/p>","instructor":"Daniel A. McFarland","estimatedClassWorkload":"","recommendedBackground":"None; all are welcome.","links":{}}