{"id":1129,"shortName":"globe","name":"Globalization of Business Enterprise","language":"en","shortDescription":"The majority of businesses say they want to become more global. And business leaders say that the lack of people with global intelligence is the key constraint holding them back. This course will address both gaps — at the business and the personal level, it will focus on practical strategies for dealing with the real consequences of globalization.\n\n\n","aboutTheCourse":"<p>The GLOBE course was developed and refined during the term of Professor Ghemawat’s \nmembership of the AACSB taskforce on the globalization of business education. <br><\/p><p>This\ncourse begins by debunking some of the many myths that surround globalization—what\nProfessor Ghemawat refers to as \"globaloney\".<\/p>\n\n<p>After\ndiscussing what globalization isn’t, this course devotes several sessions to\nunderstanding what globalization is. It\nwill focus on the differences between countries that underlie observed levels\nof globalization and their implications for business. These differences will be summarized in terms\nof a framework for thinking about distances developed by Professor Ghemawat\nthat is widely used at leading business schools around the world.<\/p>\n\n<p>The final part of the course will synthesize the\nimplications of globalization for business strategies—and for your personal\ndevelopment and career trajectories.  <\/p><p>Praise<\/p><p><b>\"Pankaj Ghemawat is one of those rare individuals who combines world class scholarship with a deep knowledge of business practice.\" <\/b><br><\/p><p><i>Michael E. Porter, Bishop William Lawrence<\/i> <i>University Professor, Harvard Business School<\/i><\/p><p><b>“Pankaj Ghemawat’s framework is both visionary and pragmatic—aware of the broad historic trajectories of globalization, but grounded in the real kinds of decisions business leaders have to make now.”<\/b><br><i>Samuel J. Palmisano, Former Chairman and CEO, IBM<\/i><br><br><b>“Pankaj Ghemawat has provided an impressive and comprehensive analysis of the world’s situation in times of globalization and strong economic and social imbalances.\"<\/b><br><i>Mohammed Yunus, Winner of the Nobel Prize for Peace<\/i><br><\/p>","targetAudience":3,"courseSyllabus":"<p>The course is broken up into eight sessions.<\/p>\n\n<p><b>Session 1: <\/b><b>Globalization and Globaloney <\/b>\n<\/p>\n\n<p><span>This\nsession will focus on how globalized the world is, how the data in that regard\ncompare with people’s intuitions on the subject, possible reasons for the\ndiscrepancies observed, and their implications.<b><\/b><\/span>\n<\/p>\n\n<p><b>Session 2: <\/b><b>The CAGE Distance Framework<\/b><br><\/p>\n\n<p>This session will focus on understanding the cross-country differences that underlie observed levels of globalization, summarized in terms of the CAGE distance framework, where “CAGE” is an acronym for Cultural, Administrative (institutional and political),\n    Geographic and Economic distances among countries.<\/p>\n\n<p>The four sessions that follow will look in greater depth at each of the components of the CAGE framework and their implications for business.<br><b><\/b><\/p><p><b><b>Session 3: <\/b>Cultural Distance<\/b><\/p>\n\n<p>This session will focus on cultural distance, which encompasses differences in religious beliefs, race\/ethnicity, language, and social norms and values. <b><\/b>\n<\/p>\n\n<p><b><b>Session 4: <\/b>Administrative Distance<\/b><\/p>\n\n<p>This session will focus on administrative differences, by looking at how international differences in capital and labor systems affect the ways in which business enterprises are structured and governed around the world.<\/p>\n\n<p><b>Session 5: <\/b><b>Geographic Distance<\/b><\/p>\n\n<p>This session will look at how cross-border interactions are influenced by physical distance and by other geographic considerations, such as whether contiguity, within-country distances to borders, access to the ocean, topography, and even time zones.\n    Attention will also be paid to the degree to which cross-border interactions are regionalized.\n<\/p>\n\n<p><b>Session 6: <\/b><b>Economic Distance<\/b><br><\/p>\n\n<p>Consumer wealth and income and the cost of labor are the most obvious (and related) determinants of economic distance between countries. This module will focus on these and others differences such as availability (or lack) of resources, inputs, infrastructure\n    and complements, and organizational capabilities.<\/p>\n\n<p><b>Session<\/b> <b>7: <\/b><b>The Implications of Distances for Business Strategy<\/b><br><\/p>\n\n<p><span>This\nsession will review three broad strategies for dealing with differences:  <i>Adaptation<\/i>\nto adjust to differences across countries to achieve some local responsiveness;\n<i>Aggregation, <\/i>to overcome some of the\ndifferences across countries and thereby unlock  cross-border economies of scale\/scope; and <i>Arbitrage<\/i> to exploit some of <i> <\/i>the\ndifferences across countries in order to achieve absolute efficiency. <\/span>\n<\/p>\n\n<p><b>Session 8: <\/b><b>The Implications of Distances for Personal Strategy<\/b><br><\/p>\n\n<p>This session will focus on the individual rather than the company level and will discuss, in particular, some of the implications for personal development. It will also provide a course summary.<\/p><p><br><\/p>","courseFormat":"<p>The course is divided into eight sessions. These sessions include a number of elements, described below. For each session, you can expect to spend a minimum of three hours to complete the assigned materials and tasks. As noted above, additional materials will\nalso be suggested that will allow you to go deeper into the issues discussed,\nbut that will require more time.<br><\/p><p><\/p><p><\/p><p>Each\nsession will be\nintroduced with a video of\napproximately 10 to 20 minutes each.  Some of the sessions will\nrequire you to complete online surveys before you view the videos. Quizzes will be embedded within the lectures\nto help you evaluate your understanding of course concepts. <\/p>\n\n<p>For each session, readings will be assigned that discuss\ncourse concepts in more detail and present intuition and applications. <br><\/p>\n\n<p>In some sessions, discussion forums\nwill be used to discuss case studies. These case studies are meant to serve as vehicles for\napplying course concepts to particular businesses. Your active participation in these discussions is strongly encouraged.<br><\/p>\n\nFinally, a peer-assessed\nassignment will be an important part of the course and will require you to\nanalyze your country—or one of particular interest to you—in relation to others.<br><br>","suggestedReadings":"<p>All of the required course readings will\nbe listed in the course syllabus, and will be\nprovided for free.&nbsp;Actually, what will often be required is one\nof two or more readings covering the same topic but of different lengths and\ncomplexity, so that you can customize preparation to your background and\ninterests as well as the amount of time that you have available.<\/p><p>Optional readings that you might find\nhelpful for the course include:<\/p>\n\n<p><i><a title=\"Link: http:\/\/www.ghemawat.com\/books_redefining-global-strategy\" target=\"_blank\" href=\"http:\/\/www.ghemawat.com\/books_redefining-global-strategy\">Redefining Global Strategy: Crossing Borders in a World\nWhere Differences Still Matter<\/a><\/i>, Pankaj Ghemawat, Harvard Business School Press, 2007<\/p>\n\n<p><i><a title=\"Link: http:\/\/www.ghemawat.com\/books_world-3.0-global-prosperity-and-how-to-achieve-it\" target=\"_blank\" href=\"http:\/\/www.ghemawat.com\/books_world-3.0-global-prosperity-and-how-to-achieve-it\">World 3.0: Global Prosperity and How to Achieve it<\/a><\/i>, Pankaj Ghemawat,\nHarvard Business Review Press, 2011<\/p><p>These books are not required for completion of the course. However, they\n are recommended for those wanting more depth and examples related to \nthe course topics, as a way to enhance the learning. The books can be \npurchased online and doing so is the responsibility of each student. At the start of the course, you will receive&nbsp;instructions for how to \npurchase&nbsp;the books.<\/p>","estimatedClassWorkload":"3-7 hours\/week","recommendedBackground":"<p>While no particular background is required for this course, some\ninterest in globalization and knowledge of basic business concepts will be\nhelpful.<\/p>","links":{}}