{
    "id": 354,
    "shortName": "globalsportsbusiness",
    "name": "The Global Business of Sports",
    "language": "en",
    "shortDescription": "This course analyzes the business side of sports and discusses the intricacies of global sports leagues as well as various countries' sports strategies. You will be equipped with a framework and tools to understand and evaluate the business side of competitive sports around the world.",
    "aboutTheCourse": "<p>\n\n\n\n\n\n\n\n<\/p><p>The wide range of global sports businesses constitutes a multi-billion dollar industry. This course will examine and explain the business of sports by analyzing the economic, legal, governance and success models in various sports industries. The primary focus will be on American team sports but comparative global models will be contemplated as well.&nbsp;&nbsp;We will seek to find the answers to questions such as: what lessons can global sports entities learn from each other? What business strategies are used to improve the profitability of leagues, sports teams and franchises? What lessons can be drawn from the United States-based sports models? What revised models should new entrepreneurial leagues apply in order to achieve success? Substantive instruction will be drawn from the likes of the NFL, MLB, English Premier League, Bundesliga, various player unions, India and much more.&nbsp;&nbsp; Ultimately, our goal is to equip the student with a framework and tools with which to understand and evaluate the business side of a wide range of competitive sports ventures.<\/p>",
    "targetAudience": 3,
    "courseSyllabus": "<p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p>\n<p><strong>Module One: Introduction to Professional Sports <\/strong>I<\/p><p>Where is the Money?&nbsp;&nbsp;This module will begin with a focus on the reasons why people are drawn to the sports industry and the built-in advantages that that affinity provides. We will continue with a brief look at the history of the sports business and then proceed to review the current sports business landscape from a league perspective.The lecture will also provide an introduction to the key revenue streams for professional sports franchises - gate receipts,&nbsp;&nbsp;media rights, sponsorships, and many others. We will conclude by reviewing the key expense items.<\/p><p><strong>Module Two: Introduction to Professional Sports II<\/strong><\/p><p>In this module we will begin with a look at how professional sports leagues generate revenue. We will then review how professional sports teams determine their business priorities. In addition, we will investigate the many nuances of professional sports leagues. We will also examine the biggest issues facing the professional sports enterprise today. We will discuss leadership and ownership in the sports business industry. In addition, we will focus on the role of commissioners and analyze reasons for ownership as well as integration strategies that have been developed.<\/p><p><strong>Module Three: American and Global Sports Leagues<\/strong><\/p><p>This module will focus on the globalization of sports leagues. We will begin by looking at both the popularity and 'states of' the biggest leagues and begin a discussion on how the largest sports leagues, teams and events generate revenue globally. We will examine the structure of sports leagues and teams including a broad overview of the legal and financial structures.&nbsp;&nbsp;For example, we will study U.S. and European league governance including promotion and relegation. We will analyze the globalization of labor and product markets in the the Big 4 leagues in the U.S. and the English Premier League and Bundesliga, with a deeper look at Manchester United and its broad array of sponsorships.<\/p><p><strong>Module Four: Player Salaries, Unions and Sports Agents<\/strong><\/p><p>The largest figures on the expense side of the sports business ledger are player salaries. This lecture focuses on salaries as well as the key proponents of those salary increases. Sports agents and unions are key stakeholders in the sports business industry. Agents source and manage talent while unions use collective bargaining to champion for an organization of the economic system that favors salary increases. We will analyze the impact these stakeholders have had on the industry in different regions in the world and use case examples including lockouts from the past. Students will have the opportunity to compare and contrast unions around the world.<\/p><p><strong>Module Five: Sport Matters<\/strong><\/p><p>In this module, we examine the need for diversity, inclusion, respect, and equality in sports, focusing on the need for leadership to embrace and deliver these principles in a real and tangible way within the sports industry.<br><\/p><p>Sport Matters addresses issues such as: What the Donald Sterling drama can teach us about race and the need for inclusion at the ownership level; the lessons learned from the NFL and Ray Rice case; the Washington Redskins name and the economics of change; what the Miami Dolphins matter tells us about respect in the workplace and beyond; compensation and equality in “amateur” sports; and race issues in soccer.<br><\/p><p>Prior to this module, students are asked to read <a href=\"http:\/\/wdp.wharton.upenn.edu\/book\/sport-matters\/\" target=\"_blank\">Sport Matters: Leadership, Power, and the Quest for Respect.<\/a><br><\/p>\n\n<p><\/p>",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": "<p>None; all are welcome.<\/p>",
    "links": {}
}