{
    "id": 841,
    "shortName": "smac",
    "name": "Statistical Mechanics: Algorithms and Computations",
    "language": "en",
    "shortDescription": "In this course you will learn a whole lot of modern physics (classical and quantum) from basic computer programs that you will download, generalize, or write from scratch, discuss, and then hand in. Join in if you are curious (but not necessarily knowledgeable) about algorithms, and about the deep insights into science that you can obtain by the algorithmic approach.",
    "aboutTheCourse": "<div>This\n course discusses the computational approach in modern physics in a \nclear yet accessible way. Individual modules contain in-depth \ndiscussions of algorithms ranging from basic enumeration methods to cutting-edge Markov-chain techniques. Emphasis will be put on \napplications in classical and quantum physics. The focus\n will be on subjects such as Monte Carlo sampling, molecular \ndynamics, transition phases in hard-sphere liquids, simulated annealing \nfor solving geometrical constraints, perfect sampling of classical spin \nmodels, to aspects of quantum Monte Carlo algorithms, Bose-Einstein \ncondensation, and many-body physics with fermions. <span>The emphasis is on orientation. Discussion of implementation details will be kept to a minimum.<\/span><\/div>\n<p>\nThe course is entirely\nself-contained. It heavily relies on concise algorithms  (each\nwith between 10 and  50 lines of Python code). Modules lead from\nelementary discussions to the rich and difficult problems in\ncontemporary physics, and are of interest to a wide range of students\nin the natural sciences.<\/p><br>",
    "targetAudience": 1,
    "courseSyllabus": "Weeks and Themes:<br><br><ol><li><strong>Introduction to Monte Carlo algorithms<br><br><\/strong><\/li><li><strong>Hard disks: From Classical Mechanics to Statistical Mechanics<\/strong><br><br><strong><\/strong><\/li><li><b><strong><strong><\/strong><\/strong>Energy, Free energy, and Phase transitions<\/b><strong><br><br><\/strong><b><b><strong><\/strong><\/b><\/b><\/li><li><b>Sampling and integration: From Gaussians to the Maxwell and Boltzmann distributions<br><br><\/b><\/li><li><b>Quantum Statistical Mechanics: Density matrix and path integral<br><br><\/b><\/li><li><b>Quantum Monte Carlo and path-integral sampling<br><br><\/b><\/li><li><b>Bose-Einstein condensation<br><br><\/b><\/li><li><b>Classical spin models: From basic enumerations to the Cluster Monte Carlo algorithms<br><br><\/b><\/li><li><b>Classical spin models: \"Faster-than-the clock\" algorithms<br><br><\/b><\/li><li>\n\n<p><b>The Alpha and Omega of Monte Carlo: From zero \nvariances (in Buffon's needles) to infinite variances (in\n Lévy's stable distributions<\/b>)<\/p><\/li><\/ol><br>",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": " Understanding of basic calculus and linear algebra will be assumed, as well as some familiarity with College  physics or chemistry. No prior exposure to programming is required:\nExpertise in the Python language will be acquired during the course.\n\n<br><br>",
    "links": {

    }
}