{"id":357,"shortName":"cariesmanagement","name":"Caries Management by Risk Assessment (CAMBRA)","language":"en","shortDescription":"This course will provide the scientific basis for caries (dental decay) risk assessment and practice interventions.  You will immediately be able to apply “caries management by risk assessment” into your clinical setting or into your personal health care.","aboutTheCourse":"Dental Caries (tooth decay) is a bacterially based disease that progresses\nwhen acid produced by bacterial action on dietary fermentable carbohydrates\ntravels into the tooth and dissolves the carbonated hydroxyapatite mineral.\n This process is<span> called demineralization.<br>\n<br>\nPathological factors, including acidogenic bacteria, salivary dysfunction, and\ndietary carbohydrates are related to caries progression.  Protective factors, which include\nantibacterials, salivary calcium, phosphate and proteins, salivary flow, and\nfluoride in saliva can balance, prevent or reverse dental caries through a\nprocess of remineralization. \nRemineralization is a natural and reliable repair mechanism for\nnon-cavitated carious lesions.<br>\n<br>\nThis course will provide the scientific basis behind the “caries balance”\nconcept, which is the key to caries management by risk assessment in clinical\npractice.  If pathological factors\nprevail caries progresses.  If protective\nfactors prevail the caries process is halted or reversed.<br>\n<br>\nThe course will present tools to implement  CAMBRA, “caries management by risk assessment,”\nin your clinical setting.  It can be in\nimplemented medical and dental settings, and can benefit children and adults of\nall ages. Implementation in dental practice provides patients with genuine hope\nand success for the management of their oral health.  It is a practice builder for dentistry.<\/span>","targetAudience":1,"courseSyllabus":"<b>Week 1:<\/b><br><ul><li>Understand what dental caries is<\/li><li>Understand the concept of the caries balance<\/li><li>Know the three principal pathological factors of caries formation<\/li><li>Understand that multiple bacterial species are responsible for dental caries<\/li><li>Understand the role of frequent ingestion of fermentable carbohydrates in dental caries<\/li><li>Recognize hyposalivation, how this occurs, and its importance in caries progression<\/li><\/ul><b>Week 2:<\/b><br><ul><li>Refine the concept of the caries balance <br><\/li><li>Know and understand the multiple caries protective components in saliva<\/li><li>Understand demineralization and the role of fluoride<\/li><li>Understand remineralization and the role of fluoride <\/li><\/ul><b>Week 3:<\/b><br><ul><li>Understand remineralization and the role of fluoride <br><\/li><li>Understand how fluoride interacts with cariogenic bacteria <br><\/li><li>Know the three main mechanisms of action of fluoride <br><\/li><li>Know about fluoride toothpastes and fluoride mouthrinses<\/li><\/ul><b>Week 4:<\/b><br><ul><li>Know about fluoride products for the dental office and for home use by prescription <br><\/li><li>Know why high concentration fluoride products are used for high caries risk individuals <br><\/li><li>Know the antibacterial products currently available for caries control <br><\/li><li>Understand the root caries process including similarities and differences with coronal caries<\/li><\/ul><b>Week 5: <\/b><br><ul><li>Understand the distinction among disease indicators, pathological (biological risk) factors, and protective factors<br><\/li><li>Know that the CAMBRA risk assessment method is validated in clinical use in thousands of patients for 6 years through adult<\/li><li>Know the bacterial assessment methods<\/li><li>Understand the sequence for the entire CAMBRA method <\/li><\/ul><b>Week 6:<\/b><ul><li>Know how to assess caries risk for an individual as low, moderate, high, or extreme <br><\/li><li>Know the currently recommended chemical therapy for patients at low, moderate, high, or extreme risk <br><\/li><li>To study numerous examples of risk assessment and therapy and how to build this into the treatment plan <br><\/li><li>Understand the differences between risk assessment for young children, older children, and adults <\/li><\/ul>","courseFormat":"The class will consist of lecture videos, containing integrated quiz questions\nfor review and additional features to prepare the learner to practice CAMBRA.\nStudents will be asked to participate in discussion forums, and use their\nforum posts as the basis for peer-reviewed writing assignments. A final\nexamination will be provided at the end of the course.","suggestedReadings":"<ol>\n    <li><span>Featherstone\nJDB. The science and practice of caries prevention. <i>J American Dental Assoc<\/i> 2000, 131<b>:<\/b>887-899.<\/span>\n\n    <\/li>\n    <li>Featherstone JD. Caries Prevention and Reversal Based on the Caries Balance.\n        Pediatric Dent. 28:128-132, 2006.<\/li>\n    <li> Featherstone JDB, Young DA, Domejean-Orliaguet S, Jenson L, Wolff\n        M. Caries risk assessment appropriate for age 6 through adult. CDA Journal.\n        35(10): 703-713. Oct\/Nov 2007.<\/li>\n    <li>Featherstone JD. Dental caries: a dynamic disease process. Aust Dent J.\n        2008;53:286-291<\/li>\n    <li>Doméjean S, White JM, Featherstone JD. Validation of the CDA CAMBRA caries\n        risk assessment--a six-year retrospective study. J Calif Dent Assoc. 2011\n        Oct; 39(10):709-15.<\/li>\n    <li>Featherstone JD, White JM, Hoover CI, Rapozo-Hilo M, Weintraub JA, Wilson\n        RS, Zhan L, Gansky SA. A Randomized Clinical Trial of Anticaries Therapies\n        Targeted according to Risk Assessment (Caries Management by Risk Assessment).\n        Caries Res. 2012; 46(2):118-29.<\/li>\n<\/ol>","instructor":"","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"A dental background is ideal, but not required. This course will be of\ninterest to all clinicians who have a basic understanding of oral health\nand disease, and the significance of oral health education.","links":{}}