{
    "id": 705,
    "shortName": "scistudentinquiry",
    "name": "Inquiry Science Learning: Perspectives & Practices 4 - Student-Centered Inquiry",
    "language": "en",
    "shortDescription": "In this course, teachers will develop the skills essential to move from a top-down content delivery model of science instruction to one in which the teacher is a guide, enabling students to create shared meaning of important science concepts.",
    "aboutTheCourse": "<p>A revolution is underway in science classrooms. The demands of the new workplace and the ready access to information afforded by new technologies have radically changed the way we define a scientifically literate society.&nbsp;<\/p>\n<p>More than ever teachers need professional development that provides them with the resources they need and empowers them to take the action required to build classrooms where the next generation of scientifically literate students will flourish.&nbsp;<\/p>\n<p><i>Inquiry Science Learning: Perspectives and Practices<\/i>&nbsp;consists of four courses, each designed to address a different strand in the development of skills teachers need to meet the demands of their career, including the following.<\/p>\n<p><\/p>\n<ol>\n    <li><a href=\"https:\/\/www.coursera.org\/course\/scileadership\" target=\"_blank\">Science Leadership<\/a>\n        <br>\n    <\/li>\n    <li><a href=\"https:\/\/www.coursera.org\/course\/inquirytechniques\" target=\"_blank\">Techniques for Success<\/a>\n        <br>\n    <\/li>\n    <li><a href=\"https:\/\/www.coursera.org\/course\/scicontentsurvey\" target=\"_blank\">Science Content<\/a>\n        <br>\n    <\/li>\n    <li><b>Student-Centered Inquiry<\/b>\n    <\/li>\n<\/ol>\n<p><\/p>\n<p>In this fourth course we will focus on helping teachers change the nature of their classrooms to promote student engagement and proficiency in inquiry science&nbsp;<\/p>",
    "targetAudience": 3,
    "courseSyllabus": "<p><b>Week 1: Self-Assessment - Initial:<\/b>\n    <br>Participants will be provided with a rubric that will help them assess where they are in the continuum from a teacher-centered to a student-centered classroom. After watching a teacher use the rubric, with guidance from a mentor, participants will\n    be asked to evaluate themselves and reflect the results.&nbsp;<\/p>\n<p><b><br>Week 2: Student-Centered Inquiry: On Paper:<\/b>&nbsp;\n    <br>Participants will learn how to take a current lesson that may be more teacher-centered, and to alter it component-by-component, to create a more student-centered lesson.&nbsp;\n    <br><b><br>Week 3: Student-Centered Inquiry: On Paper:<\/b>&nbsp;\n    <br>Participants will get to watch a coach in action helping a teacher look for ways to make their teaching more student-centered and to identify obstacles and solutions.&nbsp;\n    <br><b><br>Week 4: Self-Assessment - Final:<\/b>&nbsp;\n    <br>In the last week of the course, participants will reflect on a change they tried to make in their classroom. Through peer review all participants will have the opportunity to evaluate these transformations and to receive feedback that will encourage\n    further growth.\n    <br>\n<\/p>",
    "estimatedClassWorkload": "2-4 hours\/week",
    "recommendedBackground": "No previous coursework is recommended, but the course will be most helpful to teachers with 3 or more years of teaching experience who are willing to directly apply experiences in their schools. While the course was designed with the K-8 teacher in mind,\nthe topics covered are appropriate for all teachers, including those teaching in high school.",
    "links": {}
}