{
    "id": 57,
    "shortName": "introastro",
    "name": "Introduction to Astronomy",
    "language": "en",
    "shortDescription": "An introduction to astronomy through a broad survey of what we know about the universe and how we know it.",
    "aboutTheCourse": "In this class, we will be studying, quite literally, everything in the universe. &nbsp;We will start with \"classical\" astronomy, describing the night sky and organizing what we see as was done in ancient times. &nbsp;We will then embark on a journey,\nstarting here on Earth and progressing outward, to study the Solar system, the Milky Way galaxy, and the wonderful and strange objects we observe in deep space, such as black holes, quasars, and supernovae. &nbsp;We will end with some discussion of what\nscientists know today about the universe as a whole. &nbsp;Along the way we will introduce some of the methods, theoretical and experimental, that have been used to understand all of this, from Newton's laws, through our understanding of light and matter,\nto Einstein's theory of relativity, and from Galileo's telescope to WMAP.",
    "targetAudience": 0,
    "courseSyllabus": "<u>Week 1: Positional Astronomy (naked-eye Astronomy)<\/u><br>We will spend our first week familiarizing ourselves with descriptions of the positions and motions of celestial objects.<br><br><u>Weeks 2-3: Newton’s Universe<\/u><br>Newtonian physics revolutionized the way we understand our Universe. &nbsp;We will discuss Newton’s laws of mechanics, the conservation laws that follow from them, his theory of gravity and some applications to Astronomy, as well as some properties of radiation. &nbsp;The last clip will be a quick look at the features of quantum mechanics relevant to our course. &nbsp;This will be a particularly busy and challenging unit, but hard work here will pay off later.<br><br><u>Week 4: Planets<\/u><br>We will not have time in this course to do justice to the broad and exciting field of planetary science. &nbsp;We will spend the week on a general review of the properties and structure of our Solar System and our understanding of its origins and history. &nbsp;&nbsp;We will end with some discussion of the exciting discoveries over the past decade of many hundreds of extrasolar planets.<br><br><u>Week 5: Stars<\/u><br>What we know about stars and a bit about how we found out. &nbsp;&nbsp;&nbsp;We will begin with a quick review of the best-studied star of all, our Sun. &nbsp;We will then talk about classifications; H-R diagrams and main sequence stars; distance, mass, and size measurements; binaries; clusters; and stellar evolution through the main sequence<br><br><u>Week 6: Post-Main-Sequence Stars<br><\/u>Final stages of stellar evolution and stellar remnants. &nbsp;&nbsp;Giants, white dwarfs, novae, variable stars, supernovae, neutron stars and pulsars.<br><br><u>Week 7: Relativity and Black Holes<\/u><br>We will spend most of this week acquiring an understanding of the special theory of relativity.&nbsp; We will then discuss the general theory in a qualitative way, and discuss its application to black holes, gravitational lensing, and other phenomena of interest.<br><br><u>Week 8: Galaxies<\/u><br>Galactic structure and classification. &nbsp;Active galactic nuclei, quasars and blazars. &nbsp;Galactic rotation curves and dark matter. &nbsp;Galaxy clusters and large-scale structure.<br><br><u>Weeks 9-10: Cosmology<\/u><br>What we can say about the universe as a whole. &nbsp;Hubble Expansion. &nbsp;Big bang cosmology. The cosmic microwave background. &nbsp;Recent determination of cosmological parameters.&nbsp; Early universe physics.",
    "estimatedClassWorkload": "6-12 hours\/week",
    "recommendedBackground": "<ol>\n<li>An interest in learning something about the universe we live in and a willingness to invest some thought and some work in this.<\/li>\n<li>The ability to calculate with large and small numbers, e.g. to compute the product of <img src=\"https:\/\/s3.amazonaws.com\/coursera\/topics\/introastro\/eqn1.png\" style=\"height: 20px; top: 2px; position: relative;\"> and <img src=\"https:\/\/s3.amazonaws.com\/coursera\/topics\/introastro\/eqn2.png\" style=\"height: 20px; top: 2px; position: relative;\">.<\/li>\n<li>A familiarity with the rudiments of high-school algebra, the ability to solve an equation like <img src=\"https:\/\/s3.amazonaws.com\/coursera\/topics\/introastro\/eqn3.png\" style=\"height: 40px; top: 2px; position: relative;\"> to get &nbsp; <img src=\"https:\/\/s3.amazonaws.com\/coursera\/topics\/introastro\/eqn4.png\" style=\"height: 55px; top: 2px; position: relative;\"> and comfortably use this to obtain numerical values for <img src=\"https:\/\/s3.amazonaws.com\/coursera\/topics\/introastro\/eqn5.png\" style=\"height: 20px; top: 2px; position: relative;\"> in appropriate units given values of <img src=\"https:\/\/s3.amazonaws.com\/coursera\/topics\/introastro\/eqn6.png\" style=\"height: 20px; top: 2px; position: relative;\">, <img src=\"https:\/\/s3.amazonaws.com\/coursera\/topics\/introastro\/eqn7.png\" style=\"height: 13px; top: 2px; position: relative;\">, and <img src=\"https:\/\/s3.amazonaws.com\/coursera\/topics\/introastro\/eqn8.png\" style=\"height: 13px; top: 2px; position: relative;\">, and to draw and use graphs to describe the properties of functions.<\/li>\n<li>A basic background in science at a high school level. What elements, atoms, nuclei, magnetic fields, gravity, etc. are will be assumed familiar. &nbsp;The details of their physics or its mathematical description will not.<\/li>\n<\/ol>",
    "links": {

    }
}