{"id":2646,"shortName":"genbioconductor","name":"Bioconductor for Genomic Data Science","language":"en","shortDescription":"Learn to use tools from the Bioconductor project to perform analysis of genomic data. This is the fifth course in the Genomic Big Data Specialization from Johns Hopkins University.","aboutTheCourse":"<span>This class will provide an introduction to the Bioconductor project (<a href=\"http:\/\/bioconductor.org\/\">http:\/\/bioconductor.org\/<\/a>). The class will cover how to install and use Bioconductor software. We will discuss common data structures, including ExpressionSets, SummarizedExperiment and GRanges used across several types of analyses. Several popular packages for analysis and annotation of your data will be covered, including packages such as GenomicRanges, biomaRt, rtracklayer, AnnotationHub and others.&nbsp;<\/span><strong>This course has a $99 value but being offered at a significant discount.<\/strong>","targetAudience":1,"courseSyllabus":"<ol><li>Introduction to Bioconductor<\/li><li>Introduction to common data structures<\/li><li>Getting data into Bioconductor<\/li><li>Data analysis using Bioconductor<\/li><li>Annotate your results using Bioconductor<\/li><li>Visualize your data using Bioconductor<\/li><\/ol>","courseFormat":"Around 2 hours of video lectures weekly, a weekly quiz, and a course project. This class will also require extra time by the student to open and practice using Bioconductor.","suggestedReadings":"","estimatedClassWorkload":"3-5 hours\/week","recommendedBackground":"Prerequisite: <a href=\"https:\/\/www.coursera.org\/course\/genintro\" target=\"_blank\">Introduction to Sequencing Technologies<\/a><br>Very strongly recommended:&nbsp;<a href=\"https:\/\/www.coursera.org\/course\/rprog\" target=\"_blank\">R programming<\/a>&nbsp;is essentially a prerequisite for this course since Bioconductor builds on R programming. We don't require an R Programming certificate to enter this course, but you will need the skills and knowledge covered in R Programming to do well in this course. If you don't have those skills already, you should expect to struggle in this course.<br><br>The target audience of this course consists of individuals in the molecular or computational sciences who want how to learn how to perform basic computational biology. This class is “hands on” and designed to get you started with the tools you need to perform Genomic Data Science.<br>","links":{}}