{
    "id": 2252,
    "shortName": "ecnonec",
    "name": "Экономика для неэкономистов (Economics for non-economists)",
    "language": "ru",
    "shortDescription": "Задача курса - дать базовые основы экономической грамотности и \"экономического образа мышления\" слушателям-некономистам в рамках короткого курса и показать, как экономические знания могут применяться в реальной жизни. Надеюсь, что изложение материала получится максимально живым и неформальным.\n\nDuring this short and informal course you will get the basics of economics, “economical way of thinking” and its implementation to the everyday life.\n",
    "aboutTheCourse": "<p>Этот курс вводного уровня включает важнейшие и наиболее связанные с повседневной жизнью темы из двух разделов экономической теории, микроэкономики и макроэкономики. Микроэкономика изучает поведение отдельных элементов экономической системы страны - прежде всего, потребителей и производителей - то, как они делают свой выбор (что купить\/произвести) и как взаимодействуют друг с другом. Ключевые категории микроэкономического анализа, с которыми мы познакомимся: спрос и предложение; производство, издержки и прибыль; рыночные структуры (такие, как совершенная конкуренция, монополия и олигополия). Макроэкономика изучает экономическую систему страны как единое целое и проблемы, общие для всей экономики. Ключевые категории макроэкономического анализа, с которыми мы познакомимся: ВВП, инфляция и безработица; экономический рост и деловой цикл; государственная макроэкономическая политика.<\/p><p>This introductory course explores main and most connected with everyday life topics of economics. Two parts of economics are micro-and macroeconomics. Microeconomics studies the behavior of smallest parts of national economy, first of all consumers and producers, their choices and interaction. In Microeconomics we deal with demand and supply; production, costs and profits; competition, monopoly and oligopoly. Macroeconomics studies the national economy as a whole and deals with GDP, inflation, unemployment; economic growth and business cycle; fiscal and monetary policy.<\/p><p><\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<p><b>Неделя 1. Введение в\nэкономическую теорию.&nbsp;<\/b>Кто такие экономисты, чем они занимаются и как работают? Основные понятия\nи термины.<\/p>\n\n<p><b>Недели 2 и 3. Спрос и\nпредложение. Государство и рынок.&nbsp;<\/b>Самая известная экономическая модель и ее применение. Закон\nспроса.&nbsp; Эластичность спроса по цене и\nдругие виды эластичностей. Последствия государственного вмешательства в работу рынка.<\/p>\n\n<p><b>Неделя 4. Производство и издержки.&nbsp;<\/b>Что стоит за предложением. Кратко- и долгосрочный анализ поведения\nфирмы. Производство, издержки и прибыль фирмы.<\/p>\n\n<p><b>Неделя 5. Типы рынков.&nbsp;<\/b>Совершенная и монополистическая конкуренция, олигополия и монополия.<\/p>\n\n<p><b>Неделя 6. Введение в\nмакроэкономику.&nbsp;<\/b>Макроэкономический кругооборот. Основные типы макроэкономических\nагентов и рынков и связи между ними. Среда бизнеса.<\/p>\n\n<p><b>Неделя 7. Основные\nмакроэкономические показатели.&nbsp;<\/b>Система национальных счетов. Инфляция и безработица, процентные ставки,\nобменный курс.<\/p>\n\n<p><b>Неделя 8.<\/b> Экономический рост и цикл. Факторы\nэкономического роста. Экономический цикл и его стадии. <\/p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p><p><b>Недели 9-10.<\/b> Государственная макроэкономическая\nполитика. Фискальная политика. Деньги и финансовые рынки. Монетарная политика. Открытая\nэкономика. Платежный баланс и валютный курс. Государственная макроэкономическая\nполитика в открытой экономике.<\/p><br>",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": "Курс\nможет быть успешно пройден без каких-либо начальных экономических знаний.",
    "links": {

    }
}