{
    "id": 67,
    "shortName": "nutrition",
    "name": "Nutrition for Health Promotion and Disease Prevention",
    "language": "en",
    "shortDescription": "This course covers the basics of normal nutrition for optimal health outcomes and evidence-based diets for a variety of diseases.",
    "aboutTheCourse": "<div>This course covers the basics of normal nutrition for optimal health outcomes\n    and evidence-based diets for a variety of diseases. Participants will learn\n    the fundamentals of nutrition science and build upon these to explore emerging\n    diet therapies, to analyze nutrition research and to plan well-balanced\n    meals and dietary interventions for both healthy individuals and those\n    with a number of diseases and health conditions. <\/div>",
    "targetAudience": 1,
    "courseSyllabus": "<div><strong>Module 1:         Introduction to Nutrition Science<\/strong>\n\n<\/div>\n<div> <\/div>\n<div>If you are what you eat, you should probably know something about how\n    to eat! In this introductory module, you will learn about the field of\n    nutrition science, the basics of nutrition research and some important\n    terms that will set the stage for the remainder of the class. This module\n    ends with a global look at meal planning guides and tools and provides\n    you with an opportunity to determine your own individual nutrient needs.<\/div>\n<div> <\/div>\n<div><strong>Module 2:         Heart Disease<\/strong>\n\n<\/div>\n<div> <\/div>\n<div>Heart disease is the number one cause of death around the world. Your\n    food choices make a difference when it comes to heart disease. This module\n    we cover the risk factors for heart disease and explore different dietary\n    avenues for the prevention and management of heart disease, hypertriglyceridemia,\n    hypertension and stroke. Dietary foci include vegetarian diets, the DASH\n    diet and the Mediterranean diet.<\/div>\n<div> <\/div>\n<div><strong>Module 3:         Diabetes<\/strong>\n\n<\/div>\n<div> <\/div>\n<div>Globally, it is estimated that 438 million people – or roughly 8% of the\n    world’s population – will have diabetes by 2030. This module looks at the\n    role of nutrition in the prevention and management of pre-diabetes and\n    Types 1, 2 and gestational diabetes. Additional topics include evidence-based\n    recommendations for physical activity with diabetes, meal planning, carbohydrate\n    counting and the roles of dietary fiber and the glycemic index in blood\n    sugar control.<\/div>\n<div> <\/div>\n<div><strong>Module 4:         Cancer<\/strong>\n\n<\/div>\n<div> <\/div>\n<div>Diet and cancer are certainly linked; but the degree to which food intake\n    impacts the development and progression of cancer is still not entirely\n    understood. We will look at the diet-related risk factors in cancer development\n    as well as evidence-based guidelines for the nutritional management of\n    cancer and treatment-related side effects. Additional emphasis is placed\n    on emerging cancer nutrition research and debunking diet and cancer myths.<\/div>\n<div> <\/div>\n<div><strong>Module 5:         Obesity and Weight Management<\/strong>\n\n<\/div>\n<div> <\/div>\n<div>Global statistics for obesity did not exist 50 years ago. Now, you can’t\n    turn around without exploding obesity statistics smacking you in the face!\n    We will explore the complex and interrelated factors that contribute to\n    rising obesity rates, discuss various approaches to weight loss and weight\n    maintenance and strategize for future solutions to this global epidemic.<\/div>\n<div> <\/div>\n<div><strong>Module 6:         Disorders of the GI Tract<\/strong>\n\n<\/div>\n<div> <\/div>\n<div>A healthy digestive tract is crucial for optimal nutrition status. Impairments\n    in any segment of the gastrointestinal (GI) tract can quickly undermine\n    proper nutrient digestion, absorption and utilization. In this module we\n    will look at how a healthy gut should work, and what to do when the digestive\n    process is disrupted. Specific GI focus areas include celiac disease and\n    gluten free foods, diverticular disease, peptic ulcer disease, inflammatory\n    bowel disease, dysphagia, gas, constipation and malabsorptive disorders\n    and look at the roles of dietary fiber and probiotics and prebiotics in\n    gut health.<\/div>",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": "Basic understanding of nutrition science: macronutrients, micronutrients\nand digestion.",
    "links": {

    }
}