{"id":1807,"shortName":"enrpv","name":"Physique des cellules solaires au silicium","language":"fr","shortDescription":"Le cours présente les cellules solaires à base de silicium, depuis la physique des semiconducteurs cristallins jusqu’au fonctionnement des modules photovoltaïques. Les semiconducteurs désordonnés utilisés dans les cellules en couche mince sont également traités. Les aspects socio-économiques et environnementaux du photovoltaïque sont abordés.","aboutTheCourse":"<p>Le solaire photovoltaïque (PV) est l’une des formes\npossibles de l’utilisation de l’énergie solaire. Le PV consiste en la\nconversion directe du rayonnement solaire en énergie électrique. Le PV est\nappelé à un très fort développement dans le contexte énergétique mondial,\ncompte tenu de la raréfaction des énergies fossiles et du réchauffement\nclimatique. Le contexte économique du PV est abordé, ainsi que les impacts\nsociétaux et environnementaux.<\/p>\n\n<p>La principale filière PV actuellement utilisée est basée\nsur l’utilisation d’un matériau semiconducteur cristallin&nbsp;: le silicium.\nLes principaux éléments de physique des semiconducteurs, nécessaires à la\ncompréhension détaillée du fonctionnement des cellules solaires, sont\nintroduits dans les premiers chapitres du cours&nbsp;: structure de bande,\ntransport, jonction p-n, contacts semiconducteur-métal… Cette introduction est\nfacilement accessible aux étudiants possédant des bases de physique&nbsp;:\néléments de mécanique quantique et physique statistique, connaissances en\noptique. Cette présentation des concepts de base est illustrée par de nombreux\nexercices. Cette introduction permet ensuite l’étude approfondie des cellules\nsolaires cristallines, notamment à base de silicium. L’influence des divers\nparamètres sur les performances des cellules est abordée à l’aide de logiciels\nde simulation. <\/p>\n\n<p>La seconde partie du cours est consacrée aux cellules à\nbase de silicium en couche mince. On introduit d’abord les propriétés spécifiques\ndes semiconducteurs désordonnés et plus particulièrement du silicium amorphe\nhydrogéné. On décrit ensuite le fonctionnement des cellules à base de silicium\nen couches minces, notamment celles qui associent le silicium amorphe et\nnanocristallin. On termine par les hétérojonctions qui combinent silicium\ncristallin et amorphe.<\/p>","targetAudience":2,"courseSyllabus":"<div>Energie solaire photovoltaïque<br><\/div><div>Introduction à la physique des semi-conducteurs&nbsp;<\/div><div>Phénomènes de transport. Jonction p-n&nbsp;<\/div><div>Autres Dispositifs à jonction&nbsp;<\/div><div>Les cellules Solaires<\/div><div>Les cellules solaires cristallines<\/div><div>Les semiconducteurs en couche mince&nbsp;<\/div><div>Les cellules silicium en couche mince&nbsp;<\/div><div>Energie solaire photovoltaïque en couche mince<\/div><div><br><\/div>","courseFormat":"Le cours est composé de vidéos théoriques et d'exercices pratiques.&nbsp;Des QCM seront insérés dans les vidéo de cours.&nbsp;Les sujet des&nbsp;exercices seront donnés chaque semaine et les corrigés seront publiés la semaine suivante.&nbsp;<br>Les exercices hebdomadaires compteront pour moitié dans la note de l'examen final, un examen final validera l'aquisition des compétences.<br><br><br>","suggestedReadings":"","estimatedClassWorkload":"3-4 hours\/week","recommendedBackground":"<p>Le cours est destiné aux personnes ayant des connaissances en physique, niveau licence. Plus précisément, les étudiants devront posséder les éléments de base en mécanique quantique et physique statistique ainsi qu’en optique.<\/p>","links":{}}