{"id":1019,"shortName":"changetheworld","name":"How to Change the World","language":"en","shortDescription":"How can we use the things we share in common to address some of the most challenging problems facing the world? This course examines issues concerning poverty, the environment, technology, health care, gender, education and activism to helps us understand better how to initiate positive change.","aboutTheCourse":"<p>\n\n<\/p><p><i>How to Change the World<\/i><span> has its origins in the <a title=\"Link: http:\/\/mashable.com\/sgs\/#sgs\" target=\"_blank\" href=\"http:\/\/mashable.com\/sgs\/#sgs\">Social\nGood Summit<\/a> held at the 92nd Street Y in New York. The summit\nbrought together some of the world's most creative entrepreneurs, writers,\nacademics and political leaders to discuss ways innovative thinking and\ntechnology can address pressing global challenges.  Beginning from talks,\npanels and conversations from the summit, we will add lectures, on-line\ndiscussion groups, hangouts and readings to explore the issues in\npolitics, technology and the environment in broader academic and historical\ncontexts. We will then discover together what actions we can take to make a\ndifference.    <\/span><\/p>\n\n<p> <\/p>\n\n<p><\/p><br><br><br>","targetAudience":0,"courseSyllabus":"<p><i>How to Change the World<\/i>&nbsp;examines how we can\ndevelop “social goods” and use them to create networks of progressive\nchange.&nbsp;Classes will explore the meaning of “social goods” and then\naddress the following topics: Poverty and Philanthropy; Climate Change and\nSustainability; Women, Education and Social Change; Social Networks, Education\nand Activism. Each week will be structured along the following questions: 1.\nWhat do we know?&nbsp;&nbsp;2. Why should we care? 3. What can we do?<\/p>\n\n<p>At\nthe end of the class students should have a clearer understanding of these\nglobal issues, and they should develop strategies for working with others to\nbegin to address them. Our aim is simple and bold: to put together the facts,\nthe energy and the actions to make a real difference in addressing some of the\nmajor problems confronting the world today.<\/p>\n\n<p><b>Course Syllabus<\/b>\n<\/p>\n\n<p>Week\n1: What are Social Goods? What is the Commons?<br><\/p>\n\n<p>Week\n2: Poverty and Development<br><\/p>\n\n<p>Week\n3: Climate Change and Sustainability<\/p><p>Week 4: Finish Up Papers, Catch Up on Reading and Viewing<br><\/p>\n\n<p>Week 5: Disease and Global Health Care<\/p>\n\n<p>Week 6: Women, Education and Social Change<\/p>\n\n<p>Week 7: Looking Back, Looking Forward (Catch up on Assignments)<br><\/p>\n\n<br>","courseFormat":"<p>Each week there will be lectures, many of which will be put together from presentations at the Social Good Summit. Michael Roth will introduce the topics and raise questions that we will consider together as we come to terms with these contemporary challenges. Other resources from Wesleyan, the 92nd&nbsp;St Y, Mashable and the United Nations will be deployed to enrich the course content.<br><\/p><p>Students will be encouraged to participate in the discussion forums, and to meet together when possible to discuss the issues raised in the class. Students will write short essays on each week’s topic, and these will be assessed by other students in the class. Students will consider “action plans,” concrete steps they can take to do something positive in relation to the global challenges discussed in the class.<\/p>","suggestedReadings":"<p>There will be weekly readings provided as PDFs or as links. Materials will range from philosophy to fiction, from economics to art.<\/p>","estimatedClassWorkload":"3-5 hours\/week","recommendedBackground":"No recommended background is required; all are welcome.","links":{}}