{
    "id": 2058,
    "shortName": "surveillance",
    "name": "Surveillance Law",
    "language": "en",
    "shortDescription": "Learn how police and intelligence agencies can access your data, and how the law (might) protect you! Hackers, attorneys, and concerned citizens are all welcome.",
    "aboutTheCourse": "<p>It’s easy to be\ncynical about government surveillance. In recent years, a parade of Orwellian\ndisclosures have been making headlines. The FBI, for example, is <a href=\"http:\/\/www.wired.com\/2013\/09\/freedom-hosting-fbi\/\">hacking into\ncomputers<\/a> <a href=\"http:\/\/www.wired.com\/2014\/08\/operation_torpedo\/\">that run anonymizing software<\/a>. The NSA is <a href=\"http:\/\/www.theguardian.com\/world\/2013\/jun\/06\/nsa-phone-records-verizon-court-order\">vacuuming up domestic phone\nrecords<\/a>. Even local police departments are getting in on the act, <a href=\"http:\/\/www.usatoday.com\/story\/news\/nation\/2013\/12\/08\/cellphone-data-spying-nsa-police\/3902809\/\">tracking cellphone location history and intercepting signals in realtime<\/a>.<\/p>\n\n<p>Perhaps 2014 is\nnot quite 1984, though. This course explores how American law facilitates electronic\nsurveillance—but also substantially constrains it. You will learn the legal\nprocedures that police and intelligence agencies have at their disposal, as well as the security\nand privacy safeguards built into those procedures. The material also provides\nbrief, not-too-geeky technical explanations of some common surveillance\nmethods.<\/p>",
    "targetAudience": 3,
    "courseSyllabus": "<b>I. Introduction<\/b><br>\nWe will begin with a brief overview of how surveillance fits into the American legal system. We will also discuss how surveillance issues can be litigated.\n<br>\n<br>\n<b>II. The Basics of Surveillance Law<\/b><br>\nNext, we will review established police surveillance procedures. Using telephone technology as a simple starting point, we will work through various sorts of data that investigators might seek to access—and the constitutional and statutory safeguards on that data.<br>\n<br>\n<b>III. Applying Surveillance Law to Information Technology<\/b><br>\nHaving learned the basics, we will turn to more modern technologies. We will discuss snooping on email, web browsing, and mobile phone location, as well as hacking into devices.<br>\n<br>\n<b>IV. Compelled Assistance to Law Enforcement<\/b><br>\nWhat happens when data is technically protected? In this section, we will talk about the government’s (limited) ability to mandate backdoors and to require decryption.<br>\n<br>\n<b>V. The Structure of Foreign Intelligence Surveillance Law<\/b><br>\nThe law that applies to foreign intelligence activities runs parallel to the law that applies to police activities. We will compare the two systems of law and review key distinctions. The section places particular emphasis on <a href=\"http:\/\/www.law.cornell.edu\/uscode\/text\/50\/1861\">Section 215 of the USA PATRIOT Act<\/a>, <a href=\"http:\/\/www.law.cornell.edu\/uscode\/text\/50\/1881a\">Section 702 of the FISA Amendments Act<\/a>, and <a href=\"http:\/\/www.archives.gov\/federal-register\/codification\/executive-order\/12333.html\">Executive Order 12333<\/a>.<br>\n<br>\n<b>VI. Controversial NSA Programs<\/b><br>\nIn the final section, we will review the conduct and legality of controversial National Security Agency programs. We will discuss in detail the domestic phone metadata program, PRISM, and “upstream” Internet monitoring.<br>",
    "estimatedClassWorkload": "1-3 hours\/week",
    "recommendedBackground": "",
    "links": {}
}