{"id":8,"shortName":"algo","name":"Algorithms: Design and Analysis, Part 1","language":"en","previewLink":"https:\/\/class.coursera.org\/algo-004\/lecture\/preview","shortDescription":"In this course you will learn several fundamental principles of algorithm design: divide-and-conquer methods, graph algorithms, practical data structures (heaps, hash tables, search trees), randomized algorithms, and more.","aboutTheCourse":"In this course you will learn several fundamental principles of algorithm design. You'll learn the divide-and-conquer design paradigm, with applications to fast sorting, searching, and multiplication. You'll learn several blazingly fast primitives for computing on graphs, such as how to compute connectivity information and shortest paths. Finally, we'll study how allowing the computer to \"flip coins\" can lead to elegant and practical algorithms and data structures. Learn the answers to questions such as: How do data structures like heaps, hash tables, bloom filters, and balanced search trees actually work, anyway? How come QuickSort runs so fast? What can graph algorithms tell us about the structure of the Web and social networks? Did my 3rd-grade teacher explain only a suboptimal algorithm for multiplying two numbers?","targetAudience":1,"courseSyllabus":"<b>Week 1:<\/b> Introduction.&nbsp; Asymptotic analysis including big-oh notation.&nbsp; Divide-and-conquer algorithms for sorting, counting inversions, matrix multiplication, and closest pair.<br><br><b>Week 2: <\/b>Running time analysis of divide-and-conquer algorithms.&nbsp; The master method.&nbsp; Introduction to randomized algorithms, with a probability review.&nbsp; QuickSort.&nbsp; <br><br><b>Week 3: <\/b>More on randomized algorithms and probability.&nbsp; Computing the median in linear time.&nbsp; A randomized algorithm for the minimum graph cut problem.<br><br><b>Week 4:<\/b> Graph primitives.&nbsp; Depth- and breadth-first search.&nbsp; Connected components in undirected graphs.&nbsp; Topological sort in directed acyclic graphs.&nbsp; Strongly connected components in directed graphs.<br><br><b>Week 5:<\/b> Dijkstra's shortest-path algorithm.&nbsp; Introduction to data structures.&nbsp; Heaps and applications.<br><br><b>Week 6:<\/b> Further data structures.&nbsp; Hash tables and applications.&nbsp; Balanced binary search trees.<br>","courseFormat":"<div>The class will consist of lecture videos, generally between 10 and \n15 minutes in length. These usually integrated quiz questions. There \nwill also be standalone homeworks and programming assignments that are \nnot part of video lectures, and a final exam.<\/div><br>\n<br>","suggestedReadings":"No specific textbook is required for the course.&nbsp; Much of the course \nmaterial is covered by the well-known textbooks on algorithms, and the \nstudent is encouraged to consult their favorite for additional \ninformation.<br>","instructor":"Tim Roughgarden","estimatedClassWorkload":"5-7 hours\/week","recommendedBackground":"<div>How to program in at least one programming language (like C, Java, \nor Python); and familiarity with proofs, including proofs by induction \nand by contradiction. &nbsp;At Stanford, a version of this course is taken by\n sophomore, junior, and senior-level computer science majors.&nbsp; <br><\/div><br>","links":{}}