{
    "id": 2356,
    "shortName": "healthimaging",
    "name": "Healthcare Technologies to Assess Human Behavior for Health Management",
    "language": "en",
    "shortDescription": "Introduction to Behavioral Imaging, a new research field which encompasses the measurement, modeling, analysis, and visualization of behaviors from multi-modal sensor data. It is tailored for undergraduate and graduate students who are interested in this emerging field. ",
    "aboutTheCourse": "<p>This course will provide an introduction to Behavioral\nImaging, a new research field which encompasses the measurement, modeling,\nanalysis, and visualization of behaviors from multi-modal sensor data. It is\ntailored for undergraduate and graduate students who are interested in this\nemerging field. The course is designed to provide:<\/p>\n\n\n\n<p><\/p><ul><li>A\nbroad introduction to research questions in Behavioral Imaging (BI)<br><\/li><li>An\nin-depth understanding of the key technologies for BI<br><\/li><li>Hands-on\nexperience in working with relevant sensor data (video, audio, wearable)<br><\/li><li>An\noverview of the psychology and neuroscience literature relating to behavior\nfrom a computational perspective, with a particular focus on disorders of\ndevelopment such as autism and behaviors implicated in chronic health\nconditions<br><\/li><\/ul><p><\/p>\n\n\n\n\n\n\n\n<br><br><br><br>",
    "targetAudience": 0,
    "courseSyllabus": "<p>This course will provide an introduction to Behavioral Imaging, a new research field which encompasses the measurement, modeling, analysis, and visualization of behaviors from multi-modal sensor data. It is tailored for undergraduate and graduate students who are interested in this emerging field. The course is designed to provide:<\/p><p><\/p><ul><li>A broad introduction to research questions in Behavioral Imaging (BI)<br><\/li><li>An in-depth understanding of the key technologies for BI<br><\/li><li>Hands-on experience in working with relevant sensor data (video, audio, wearable)<br><\/li><li>An overview of the psychology and neuroscience literature relating to behavior from a computational perspective, with a particular focus on disorders of development such as autism and behaviors implicated in chronic health conditions<\/li><\/ul><p><\/p>",
    "estimatedClassWorkload": "5-7 hours\/week",
    "recommendedBackground": "",
    "links": {}
}