{"id":58,"shortName":"thinkagain","name":"Think Again: How to Reason and Argue","language":"en","shortDescription":"Reasoning is important.  This course will teach you how to do it well.  You will learn how to understand and assess arguments by other people and how to construct good arguments of your own about whatever matters to you.","aboutTheCourse":"Reasoning is important. &nbsp;This course will teach you how to do it\nwell. &nbsp;You will learn some simple but vital rules to follow in thinking\nabout any topic at all and some common and tempting mistakes to avoid in\nreasoning. &nbsp;We will discuss how to identify, analyze, and evaluate\narguments by other people (including politicians, used car salesmen, and\nteachers) and how to construct arguments of your own in order to help you\ndecide what to believe or what to do. These skills will be useful in dealing\nwith whatever matters most to you.","targetAudience":0,"courseSyllabus":"<div>\n\n\n\n\n\n\n\n<p><b>PART I: HOW TO ANALYZE ARGUMENTS<\/b><\/p>\n<p>Week 1: How to Spot an Argument<br>Week 2: How to Untangle an Argument&nbsp;<br>Week 3: How to Reconstruct an Argument&nbsp;<br>Quiz #1: At the end of Week 3, students will take their first quiz.&nbsp;<br><\/p>\n<p><b>PART II: HOW TO EVALUATE DEDUCTIVE ARGUMENTS<\/b><\/p>\n<p>Week 4: Propositional Logic and Truth Tables<b>&nbsp;<br><\/b>Week 5: Categorical Logic and Syllogisms&nbsp;<br>Week 6: Representing Information<br>Quiz #2: At the end of Week 6, students will take their second quiz.&nbsp;<\/p>\n<p><b>PART III: HOW TO EVALUATE INDUCTIVE ARGUMENTS<\/b><\/p>\n<p>Week 7: Inductive Arguments&nbsp;<br>Week 8: Causal Reasoning&nbsp;<br>Week 9: Chance and Choice&nbsp;<br>Quiz #3: At the end of Week 9, students will take their third quiz.&nbsp;<\/p>\n<p><b>PART IV: HOW TO MESS UP ARGUMENTS<\/b><\/p>\n<p>Week 10: Fallacies of Unclarity&nbsp;<br>Week 11: Fallacies of Relevance and of Vacuity&nbsp;<br>Week 12: Refutation&nbsp;<br>Quiz #4: At the end of Week 12, students will take their fourth quiz.<\/p><\/div><ul>\n<\/ul>","courseFormat":"Each week will be divided into multiple video segments that can be grouped\nas three lectures or viewed separately. There will be short exercises after\neach segment (to check comprehension) and several longer midterm quizzes.","suggestedReadings":"Students who want more detailed explanations or additional exercises or who want to explore these topics in more depth should consult <a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&amp;AFID=301076&amp;ADID=1088031&amp;SID=thinkagain&amp;isbn_ean=9780495603955\">Understanding Arguments: An Introduction to Informal Logic<\/a>.&nbsp;","instructor":"Walter  Sinnott-Armstrong and Ram  Neta","estimatedClassWorkload":"5-6 hours\/week","recommendedBackground":"This material is appropriate for introductory college students or advanced\nhigh school students—or, indeed, anyone who is interested. No special background\nis required other than knowledge of English.","links":{}}