{"id":1154,"shortName":"globaltrends","name":"Analyzing Global Trends for Business and Society","language":"en","shortDescription":"What does the future hold for global markets? How are societies and cultures evolving? Who will be global powers of the 21st century? Take this class and find out how global trends are transforming business and society.","aboutTheCourse":"<p>The world is changing rapidly. Populations are ageing, people are moving from the countryside to the\ncities, there are more people suffering from obesity or who are overweight than\npeople who go hungry, and the middle-class is growing fast in the emerging\neconomies while it is shrinking in Europe and the United States. These forces\nare putting pressure on governments around the world as they seek to cope with\nthe consequences. The race for energy, natural resources and food is\nintensifying, and the global financial architecture based on the U.S. dollar is\nseriously out of whack with the new realities of the 21st century.<\/p>\n\n<p>Expect to learn about these and\nother global trends in this class. Be ready to realize how fast the world is\nchanging, and what are the consequences for markets, businesses, and society at\nlarge. Learn how to analyze global trends, understanding their magnitude and how\nthey are related to one another. Realize how the world can cope with massive\nchange.<\/p>","targetAudience":1,"courseSyllabus":"<p>Week 1: Globalization<\/p>\n\n<p>Week 2: Demographic Trends<\/p>\n\n<p>Week 3: Inequality and the Global Middle Class<\/p>\n\n<p>Week 4: Global Economic and Financial Imbalances<\/p>\n\n<p>Week 5: The Shifting Geopolitical Landscape<\/p>\n\n<p>Week 6: The Quest for Sustainability<\/p>\n\n<p>Week 7: Global Powers of the 21st Century<\/p>","courseFormat":"<p>The weekly videos will walk you\nthrough the most important data and concepts to gauge the various directions of\nchange in the global economy and society. I will introduce case studies to\nillustrate the implications of global trends, such as the launching of the Tata\nNano or the problem of piracy around the Horn of Africa. You will also see my\nreaction to events on the ground as I travel the world examining the impact of\nglobal trends.<\/p>","suggestedReadings":"All of the readings indicated below are available for free from our website when the class begins.<br><br>Week 1: \"Welcome to the 21st Century.\" Chapter 1 of Mauro F. Guillen and Emilio Ontiveros, <i>Global Turning Points<\/i> (Cambridge University Press, 2012).<br><br>Week 2: \"The New Demography.\" Chapter 4 of Mauro F. Guillen and Emilio Ontiveros, <i>Global Turning Points<\/i> (Cambridge University Press, 2012).<br><br>Week 3: <i>Poverty\nand Inequality: Persistent Problems and New Solutions. <\/i>Lauder\nInstitute’s Global TrendLab and Santander Universities.<br><br>Week 4: <i>Global Risk: New Perspectives and\nOpportunities. <\/i>Lauder\nInstitute’s Global TrendLab and Santander Universities.<br><br>Week 5: <span><i>The Future of the State. <\/i>Lauder\nInstitute’s Global TrendLab and Santander Universities.<\/span><br><br>Week 6: <i>Sustainability: New\nPerspectives and Opportunities<\/i>. Lauder\nInstitute’s Global TrendLab and Santander Universities.<br><br>Week 7: No reading.<br>","estimatedClassWorkload":"3-4 hours\/week","recommendedBackground":"","links":{}}