{
    "id": 247,
    "shortName": "ecfoodandyou",
    "name": "Economic Issues, Food & You",
    "language": "en",
    "shortDescription": "This course emphasizes the role of economics regarding its influence on food prices, the environment, and government policies. The primary objective of this course is to explore the basic tool kit of economic concepts that will enable students to critically analyze the choices they face as consumers and world citizens.",
    "aboutTheCourse": "Students will study the economic concepts of scarcity, supply and demand, society’s income and well-being, inflation, productivity, unemployment, the basic tools of finance, labor, and the “Fed”.  Students will examine how parts of the U.S. economy function and develop an awareness of current economic issues and problems. <br>",
    "targetAudience": 0,
    "courseSyllabus": "<p><b>Statement of Accomplishment<\/b><\/p><ul><li>Students who earn an overall score of at least 70% based on:<\/li><ul><li>50% Quizzes<\/li><li>30% Reflection Journal Assignment &amp; Peer Assessment<\/li><li>20% Forum Posts &amp; Comments (out of 8 total)<\/li><\/ul><\/ul><p><b>Statement of Accomplishment with Distinction<\/b><\/p><ul><li>Students who earn an overall score of at least 80% based on:<\/li><ul><li>40% Quizzes<\/li><li>30% Final Project<\/li><li>20% Reflection Journal Assignment &amp; Peer Assessment<\/li><li>10% Forum Posts &amp; Comments (out of 8 total)<\/li><\/ul><\/ul><p>Please note: The online offering of this class does not reflect the entire curriculum offered to students enrolled at the University of Florida. Completion of this Coursera course does not affirm that this student was enrolled as a student at the University of Florida in any way. It does not confer a University of Florida grade; it does not confer University of Florida credit; it does not confer a University of Florida degree; and it does not verify the identity of the student.&nbsp;<\/p>",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": "No special background is needed for this course.<br>",
    "links": {}
}