{"id":692,"shortName":"4dimensions","name":"Climate Change in Four Dimensions","language":"en","shortDescription":"This course views climate change from a variety of perspectives at the intersection of the natural sciences, technology, and the social sciences and humanities. ","aboutTheCourse":"<p><span>This course views climate change from a variety of\nperspectives at the intersection of the natural sciences, technology, and the\nsocial sciences and humanities. <br>\n&nbsp;<br>\nSpecific topics included are: <\/span><\/p>\n\n<ul>\n <li>the scientific basis for\n     human-induced climate change, including uncertainties and controversies,\n     the historical context for identifying the climate problem, links to other\n     issues such as air pollution, and the evidence for extreme as well as\n     irreversible climate changes;<\/li>\n <li>communication and social responses\n     to the scientific evidence, including the role of science in the media; <\/li>\n <li>assessment of climate impacts and\n     adaptive management; and <\/li>\n <li>mitigation of emissions, including\n     the design of national policy instruments, the roles of market failures\n     such as in technological innovation, and the role of institutions in\n     managing international collective action.&nbsp; <\/li>\n<\/ul>","targetAudience":1,"courseSyllabus":"Below you will find the course topics for each week.  You will have access to a more detailed syllabus on the course start date.<br><br><p>This course has 19 lessons, weekly activities, a mid-term, and a final exam. The topics are as follows:\n    <br>\n<\/p>\n<p><strong>Week 1: Basic Science of Climate Change<\/strong>\n<\/p>\n<ul>\n    <li>Lesson 1: Climate Change Science: History, Foundations, Detection, Attribution<\/li>\n    <li>Lesson 2: How Much Will Climate Change? Climate Models and Sensitivity<\/li>\n<\/ul>\n<p><strong>Week 2: The Nature of Scientific Knowledge<\/strong>\n<\/p>\n<ul>\n    <li>Lesson 3: The Scientific Consensus on Climate Change:\n        <br>How Do We Know We’re Not Wrong? Part 1<\/li>\n    <li>Lesson 4: The Scientific Consensus on Climate Change:\n        <br>How Do We Know We’re Not Wrong? Part 2<\/li>\n<\/ul>\n<p><strong>Week 3: Climate Change Mitigation<\/strong>\n<\/p>\n<ul>\n    <li>Lesson 5: Physics and chemistry of climate mitigation<\/li>\n    <li>Lesson 6: Why Climate is an International Problem<\/li>\n<\/ul>\n<p><strong>Week 4: International dimensions of climate change<\/strong>\n<\/p>\n<ul>\n    <li>Lesson 7: International Cooperation on the Ozone Layer:\n        <br>A Useful Model?<\/li>\n    <li>Lesson 8: International Cooperation on Climate Change:\n        <br>Models for Reform (with a Focus on Mitigation)<\/li>\n<\/ul>\n<p><strong>Week 5: The Impacts of Climate Change<\/strong>\n<\/p>\n<ul>\n    <li>Lesson 9: Extreme weather, climate change and communication&nbsp;<\/li>\n    <li>Lesson 10: Impacts of Climate Change<\/li>\n<\/ul>\n<p><strong>Week 6: What may be in store for the world?<\/strong>\n<\/p>\n<ul>\n    <li>Mid-term<\/li>\n    <li>Lesson 11: Coping with Climate Change in the Next Half-Century&nbsp;&nbsp;<\/li>\n<\/ul>\n<p><strong>Week 7: How the public views climate change<\/strong>\n<\/p>\n<ul>\n    <li>Lesson 12: Merchants of Doubt, Part 1<\/li>\n    <li>Lesson 13: Merchants of Doubt, Part 2<\/li>\n<\/ul>\n<p><strong>Week 8: How regions are preparing to adapt<\/strong>\n<\/p>\n<ul>\n    <li>Lesson 14: Ice, Snow, and Water<\/li>\n    <li>Lesson 15: Arctic and California Climate Change Assessments<\/li>\n<\/ul>\n<p><strong>Week 9: What we can do, Part 1<\/strong>\n<\/p>\n<ul>\n    <li>Lesson 16: What if climate change turns ugly? The Pros and Cons of Geoengineering.<\/li>\n    <li>Lesson 17: Technology Innovation (With a Focus on Energy)<\/li>\n<\/ul>\n<p><strong>Week 10: What we can do, Part 2<\/strong>\n<\/p>\n<ul>\n    <li>Lesson 18: It’s Not Too Late to Mitigate<\/li>\n    <li>Lesson 19: Avoid the Unmanageable, Manage the Unavoidable<\/li>\n<\/ul>","courseFormat":"<ul>\n    <li>19 video lectures given by professors Charles Kennel, Naomi Oreskes, Richard Somerville, and David Victor are the foundation of this ten week&nbsp;course.&nbsp;<\/li>\n    <li>There is an additional presentation by&nbsp;&nbsp;Veerabhadran Ramanathan.<\/li>\n    <li>Students may review released video lectures at any time during the course.&nbsp;<\/li>\n    <li>Interactive simulations, web links, and videos explain and enrich lesson topics.<\/li>\n    <li>Students will collaborate with&nbsp;students from around the world on learning activities. For example, during week one students will predict and calculate their carbon footprint; consider ways they could reduce their footprint; collaborate with students from other regions to compare their findings using social media; and, finally, reflect&nbsp; on what they learned and write a paragraph or two about their experience.<br><\/li>\n    <li>A weekly live interactive session&nbsp;will summarize the previous week’s content, bridge to&nbsp;the upcoming week’s learning objectives, and allow students&nbsp;to ask questions.<\/li>\n    <li>The&nbsp;“Ask The Professor” section answers&nbsp;frequently asked scientific, policy, international, and social questions pertaining to climate change.<\/li>\n    <li>The Discussion Forum fosters relevant&nbsp;and&nbsp;enriching interaction between participants.&nbsp;<\/li>\n    <li>&nbsp;“Check Your Knowledge” questions help students reinforce the lesson’s material.<\/li>\n    <li>Weekly quiz questions are based on defined lesson learning&nbsp;objectives.<\/li>\n    <li>Use of notes, access to lecture materials, and three attempts per quiz&nbsp;&nbsp;is permissible.&nbsp;<\/li>\n    <li>Course grades&nbsp;are based on quizzes, activities,&nbsp;the mid-term, and the final exam.<\/li>\n    <li>Professional credit from UC San Diego is available by enrolling in, and successfully completing, a companion course at UC San Diego Extension.<span>&nbsp; The companion course does have a fee, and builds upon the information presented\nin this course, with increased interactivity, assignments, and demonstration of\nmastery. &nbsp;For more information about earning credit for this course,\nplease visit: <a href=\"http:\/\/extension.ucsd.edu\/studyarea\/index.cfm?vAction=singleCourse&amp;vCourse=BIOL-40282\" target=\"_blank\">UC San Diego Extension<\/a>.&nbsp;<\/span>\n        <p><\/p>\n    <\/li>\n<\/ul>","suggestedReadings":"Required and optional readings are aligned with the weekly lesson learning objectives. There is no required textbook.&nbsp; Open Educational Resources are being used in this course.&nbsp; For example, during week one this is a required reading and is made available to students as a PDF document:<br><span><span><a href=\"https:\/\/d396qusza40orc.cloudfront.net\/4dimensions%2Flesson_01%2F01_01_01_ipcc_ar4_summary.pdf\" target=\"_blank\"><b>IPCC,\n 2007: Summary for Policymakers<\/b><\/a>. IPCC, 2007: Summary for Policymakers. In: <i>Climate\n Change 2007: The Physical Science Basis. Contribution of Working Group I\n to the Fourth Assessment Report of the Intergovernmental Panel on \nClimate Change<\/i> [Solomon,\nS., D. Qin, M. Manning, Z. Chen, M. Marquis, K.B. Averyt, M.Tignor and \nH.L. Miller (eds.)]. Cambridge University Press, Cambridge, United \nKingdom and New York, NY, USA.<\/span>\n<\/span><br><br>","estimatedClassWorkload":"5-7 hours\/week","recommendedBackground":"<p>The course is designed for\nindividuals with previous collegiate experience,&nbsp;and will be taught in an\nonline lecture format. There are no specific background requirements and everyone is welcome. It will be helpful to you if you have experience in interpreting data as well\nas graphic representations of data and to have a familiarity with basic principles of natural and physical science.\n\n<\/p>","links":{}}