{
    "id": 879,
    "shortName": "ntusym",
    "name": "An Exploration of Symmetry (Eligible for NTU Credit)",
    "language": "en",
    "shortDescription": "[IF YOU ARE LOOKING FOR THE NO-CREDIT ON-DEMAND VERSION OF THIS COURSE PLEASE GO TO https:\/\/www.coursera.org\/learn\/symmetry].\n\nLearn how to identify symmetrical forms and appreciate their importance in nature, art, architecture, crystallography and technology.  Understand symmetry quantitatively, recognize its role in beauty and design, and appreciate its function in our everyday life. The level of difficulty is intermediate-to-hard with a workload is 7-10 hrs\/week.  This MOOC is for credit, and students who obtain a Verified Certificate by submitting and authenticating at least 8 out of the 9 assignments with an overall mark of more than 60%, earn 3 Academic Units (AU) that can be directed towards either an Unrestricted Elective (UE) or General Elective (GE-STS) subject at NTU.  The usual NTU examination procedure requires student identification through webcam plus keystroke patterning for each assignment submission with a no-tolerance policy towards cheating (https:\/\/www.coursera.org\/about\/terms\/honorcode and http:\/\/www.ntu.edu.sg\/SAO\/Pages\/HonourCode.aspx).  Students who are found to cheat, tamper with or falsify grades, or collude on assignments will be denied credits. It is not necessary to be enrolled at NTU to be awarded 3 AU and once received the AU remain valid 3 years. Because this is a for-credit course students must join the Signature Track stream within the first 2 week add-drop period (up to 22 January 2016, 2359 hrs) in accordance with NTU rules.",
    "aboutTheCourse": "&nbsp;<br>Nanyang Technological University\nand Coursera are proud to offer Beauty, Form &amp; Function: An Exploration of\nSymmetry that caters to both non-specialists via a <strong>non-academic credit on-demand version<\/strong> (<a target=\"_blank\" href=\"https:\/\/webmail.ntu.edu.sg\/owa\/redir.aspx?C=qXFzMQlNjk2rDeiYsyjF3DSxSJUOk9IIIoPcPB3lFIXM756UNx5Lrvit9qv3-I2hyn9nyqeU3kI.&amp;URL=https%3a%2f%2fwww.coursera.org%2flearn%2fsymmetry%2f\">https:\/\/www.coursera.org\/learn\/symmetry<\/a>) and specialists through this <strong>academic credit fixed-session version<\/strong>.&nbsp; Below can be found the:<br><strong><br>Syllabus • Grading Scheme • Recommended Readings • <br><\/strong><p><strong>Required Background <\/strong><strong><strong> • <\/strong>Essential Resources<\/strong><strong><strong> • <\/strong> Student Responsibility • FAQs<\/strong><br><\/p><p>Symmetry is everywhere. In the\ngrand scheme of things it is the blueprint by which the universe operates. We\nsee symmetry in nature, art, architecture, science and engineering. This course\nexplores the Beauty, Form and Function of Symmetry in common objects, then\nprogresses to investigate tiling and tessellation, gems and crystals, and\nfinally its indispensable role in technology.&nbsp;\nSymmetry and asymmetry are also key factors that ensure the successful\nreproduction of plants and animals. For example, the bilateral symmetry of\norchids is widely admired and this geometry is essential for insects to pollinate\nthese flowers.<\/p><p>Duration: 8 weeks<\/p><p>Time Commitment: 7-10 hours per\nweek<\/p><p>Target Group: Scientists and\nEngineers (current and prospective NTU students)<\/p><p>Recognition: Verified Certificate through Signature Track enrollment<\/p><p>NTU Academic Units: Verified\nCertificate Students earn 3 Academic Units<\/p><p>NTU Course Type:&nbsp; Unrestricted Elective or General Elective<\/p><p>This course gives you the means to address several fundamental questions.<\/p><p><\/p><ul><li>What tags do we recognize in decorative arrangements?<br><\/li><li>What guidelines shape the patterns in the world around us?<br><\/li><li>What functions do these symmetrical patterns serve?<\/li><li>How are drug and materials design engineered through\natomic scale symmetry?<br><\/li><li>How is the internal\narrangement of atoms reflected by crystal faceting?<\/li><li>How does symmetry manipulation create polytypes, polymorphs and polysomes?<\/li><\/ul><p><\/p><p><\/p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p><p>To amplify these ideas, you will\nundertake field-exercises and be introduced to specialists - botanists,\nartists, geomancers, historians, scientists and engineers - that work with\nsymmetry, and who will provide their personal insights into its ‘magic’ and\nimpact on their disciplines.<\/p><p>\n\n\n\n<\/p><p>The option of earning AUs is open\nto all students. It is not necessary to be already enrolled at NTU.&nbsp; Once earned, the AUs remain valid for 3\nyears.<\/p><p><b>Course Difficulty<\/b><\/p>\n\n<p>This is a challenging course with 65% of students rating the material\n as Difficult to Very Difficult, but many find the subject matter \nstimulating.<\/p><p><img src=\"https:\/\/d396qusza40orc.cloudfront.net\/ntusym\/Announcements\/CourseDifficultyGraph_v1.png\" height=\"198\" width=\"512\">\n<\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<p>The course content is\nreleased in two week blocks and consists of approximately 1 hr of\nlectures and tutorials per week. There are specific windows for uploading\nhomework and undertaking peer-to-peer marking. These are detailed in the downloadable course timetable.<br><\/p><p><strong>Part I: Basic Concepts of Symmetry<\/strong><\/p><p><\/p><ul><li><strong>Week 1: <\/strong>‘A World of Symmetry’ will refresh your intuitive\nappreciation of symmetry in furniture, botany and common objects and introduce\nthe mathematics of point symmetry.<br><br><\/li><li><strong>Week 2:<\/strong> ‘Tiling and the Asymmetric Unit’ begins by examining tessellations\nin architecture that will illustrate key concepts in plane symmetry including\nthe asymmetric unit.&nbsp; ‘Chirality’ discusses this key concept in symmetry and its impact on drug design\nand delivery.<\/li><\/ul><p><\/p><p><strong>Part II: Plane (2D) and Space (3D)\nSymmetry<\/strong><\/p><p><\/p><ul><li><strong>Week 3: <\/strong>‘Escher and Graphic Design’ introduces symmetry operations in 2 dimensions\nand the difference between ‘primitive’ and ‘centered’ unit cells are illustrated\nusing the art of Escher. ‘Nets’ examines the role of symmetry in Islamic\narchitecture and history in the context of regular networks.<br><br><\/li><li><strong>Week\n4: <\/strong>‘Space Symmetry’ expands the symmetry operations to include 3 dimensional\nmotion.&nbsp; The methodology for reading and\nusing the symmetry diagrams of the 17 plane groups and 230 space groups is\nintroduced.<\/li><\/ul><p><\/p><p><strong>Part III: Symmetry in Crystals<\/strong><\/p><p><\/p><ul><li><strong>Week 5: <\/strong>‘Crystal Forms and the Beauty of Minerals’ looks the external shape of\nmineral crystals and we learn about crystal power by visiting a geomancer. The manner in which crystal faceting\nreflects the internal atomic arrangements is described. <strong><\/strong>‘Planes, Directions and Unit Cell’ introduces the mathematics\nfor describing perfect crystal structures. <br><br><\/li><li><strong>Week 6: <\/strong>‘Platonic Solids and Atomic Bonding’\nshows that regular geometrical shapes can be derived from folding plane \nnets into polyhedra that often describe atomic clustering and also the appearance of defects or\nasymmetry that are important aesthetically and technologically.&nbsp; A laboratory tour will show the experiments\nused to extract crystallographic information.<\/li><\/ul><p><\/p><p><strong>Part IV: Symmetry and Technology<\/strong><\/p><p><\/p><ul><li><strong>Week 7: <\/strong>‘Tailoring Crystals for Technology’ brings together chemistry and\ncrystallography, shows how they are inter-related, and how they are adapted to\nengineer designer technological materials.&nbsp;\nA clean room fabrication facility provides real world context for\nexploiting chemically- and physically-driven symmetry.<br><br><\/li><li><strong>Week 8:&nbsp;<\/strong> ‘Looking for Broken Symmetry - Atomic Scale Imaging’ looks beyond 3 dimensional symmetry to higher dimensional\nrepetitions found in incommensurate crystal structures. ‘Deceptive Perception - Symmetry &amp; Furniture Design’ returns to the everyday appearance of symmetry that can now be\nexplored analytically.<\/li><\/ul><p><\/p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAt the conclusion of this study, you will\npossess the tools and the motivation to look at symmetry with even greater\ndelight, wonder and appreciation!<br><\/p>",
    "estimatedClassWorkload": "4-10 hours\/week",
    "recommendedBackground": "<p><\/p>Mathematics at GCE\nAdvanced Level or International Baccalaureate Diploma or equivalent to junior\nhigh school.&nbsp;In addition, high school or undergraduate (freshman) chemistry is very helpful.<br><p><b>.<br><\/b><\/p><p><b>Essential Resources Required<\/b><\/p>\n\n<p>This is an undiluted university\ncourse and resources equivalent to an undergraduate student at NTU are\nessential to complete these studies.&nbsp;\nThese include:<\/p>\n\n<p><\/p><ul><li><strong>Access to a Windows or Apple\npersonal computer:<\/strong>&nbsp; While lectures can be\nviewed on tablets and smartphones it is not possible to run the specialized\nprograms on these architectures.&nbsp; There can\nbe no troubleshooting of compatibility problems.<br><br><\/li><li><strong>Access to a smartphone with\ncamera or a digital camera:<\/strong>&nbsp; The\nfield-work exercises involve photographing objects in your environment and\nanalysing their symmetry.&nbsp; Submission of these\ngraded exercises is essential to obtain course recognition.<br><br><\/li><li><strong>Access to Microsoft Office or\nOpen Office:<\/strong> Homework must be prepared in PowerPoint or Word using the pptx and docx templates provided, converted to a\npdf and uploaded. If you have have an older version of Powerpoint and Word you can convert the pptx and docx files to doc and ppt files at <a href=\"http:\/\/www.convertfiles.com\/convert\/document\/DOCX-to-DOC.html\" target=\"_blank\">http:\/\/www.convertfiles.com\/convert\/document\/DOCX-to-DOC.html<\/a> and <a href=\"http:\/\/www.convertfiles.com\/convert\/document\/PPTX-to-PPT.html\" target=\"_blank\">http:\/\/www.convertfiles.com\/convert\/document\/PPTX-to-PPT.html<\/a>.\n<br><\/li><\/ul><p><\/p><p><\/p><p>\n\n<\/p>",
    "links": {

    }
}