{"id":1733,"shortName":"ethique","name":"Le Bien, le Juste, l'Utile. Introduction aux éthiques philosophiques","language":"fr","shortDescription":"Ce cours présente les principaux courants qui marquent aujourd'hui la réflexion éthique et touchent tout un chacun dans sa vie personnelle, sociale et citoyenne. D’Aristote à Kant, de Bentham à Derrida, à travers un voyage philosophique passionnant nous entrerons dans le vif du débat éthique contemporain.","aboutTheCourse":"<p>Notre monde toujours plus complexe semble nous échapper. Réchauffement climatique, questions de début et de fin de vie, évolution vertigineuse des bio-technologies, inégale distribution des richesses, pressions migratoires accentuées… La tentation est grande d’une vie morale repliée sur elle-même à partir d’une éthique minimale&nbsp;: «&nbsp;fais ce que tu veux, du moment que tu ne mets pas en péril la liberté des autres&nbsp;». Nous proposons de prendre le contre-pied&nbsp;: défendre l’idée d’une éthique qui nous plonge dans notre réalité sociale et politique, parmi nos semblables et avec eux. Et pour cela nous reposons la question de ce qui est juste, de ce qui est bien. Sans repartir de rien, sans tout réinventer.<\/p><p>\n\n<\/p><p>C’est pourquoi nous présentons un cours qui permet de se familiariser avec les plus importantes perspectives éthiques traversant le monde contemporain&nbsp;: l’éthique des vertus (ou perfectionnisme)&nbsp;; l’éthique du devoir (ou déontologisme)&nbsp;; l’éthique utilitariste (ou conséquentialisme)&nbsp;; l’éthique de l’amour (ou éthique du don). Ainsi chacun pourra mettre de l’ordre dans ses idées, repérer les différentes manières de s’orienter dans la vie morale, comprendre les différences d’appréciation face aux diverses situations qui interpellent et sollicitent.<\/p><p>\n<\/p><p>Quels que soient votre champ de savoir académique, votre engagement professionnel ou vos choix personnels, il s’agit de proposer des clés d’analyse dont vous disposerez. Pour cela, nous alternerons tout au long de ce cours les présentations des grands courants, sous leur forme ancienne puis contemporaine, et des questions plus transversales ou des cas concrets. Avec un seul but&nbsp;: clarifier les idées\npour mieux comprendre le réel et mieux orienter l’action.<\/p><p><\/p>","targetAudience":1,"courseSyllabus":"<ul><li>18\/09\/2015 - Leçon 1&nbsp;: Aristote et l'éthique des vertus<\/li><li>25\/09\/2015 - Leçon  2 : Les éthiques des vertus contemporaines&nbsp;<\/li><li>09\/10\/2015 - Leçon 3 : Kant et l'éthique du devoir&nbsp;<\/li><li>16\/10\/2015 - Leçon 4 : Les éthiques déontologiques contemporaines&nbsp;<\/li><li>30\/10\/2015 - Leçon 5 : Bentham et l'éthique utilitariste<\/li><li>06\/11\/2015 - Leçon 6 : Les éthiques utilitaristes contemporaines&nbsp;<\/li><li>20\/11\/2015 - Leçon 7 : Vers un au-delà de l'éthique ? Les éthiques du don&nbsp;<\/li><li>27\/11\/2015 - Leçon 8&nbsp;: Mises en perspective - pour aller plus loin \n\n\n\n<br><\/li><\/ul>","courseFormat":"<p>Le cours est donné en français. <br>Il consiste en une série de 8 leçons. Le cours est diffusé sur une période totale de 12 semaines.<br><\/p><p>\n<\/p><p>Chaque leçon comporte 8-9 présentations vidéo. \u2028Les présentations vidéo durent entre 8 à 15 minutes chacune.<br> \u2028Lors de certaines leçons, la lecture de textes choisis viendra compléter la leçon. Ces lectures vous prendront environ 1 heure.<br><\/p><p>Les leçons 1 à 7 s'accompagnent d'un test (quiz), qui vous permettra d’évaluer votre compréhension de la matière abordée dans les leçons. <br>Un questionnaire d’évaluation final clôt le cours.<\/p><p><\/p>","suggestedReadings":"<ul><li>BARAQUIN, Noëlla, Les grands courants de la morale, (coll. Synthèse), Paris, Armand Colin, 1998. <br><\/li><li>BILLIER, Jean-Cassien, Introduction à l’éthique, Paris, PUF, 2010.<\/li><li>METAYER, Michel, La philosophie éthique. Enjeux et débats actuels, Saint-Laurent (Québec), Editions du Renouveau Pédagogique, 2000.<\/li><li>PERELMAN, Chaïm, Introduction historique à la philosophie morale, Bruxelles, Ed. de l'Université de Bruxelles, 1980.<\/li><li>SINGER, Peter (Ed.), A Companion to Ethics, Oxford, Basil Blackwell, 1991 (Coll. Blackwell Companions Philosophy).<\/li><\/ul>","estimatedClassWorkload":"3-4 hours\/week","recommendedBackground":"Aucune formation préalable n’est requise.<br>","links":{}}