{
    "id": 208,
    "shortName": "algebra",
    "name": "Intermediate Algebra",
    "language": "en",
    "shortDescription": "This course is taught so that students will acquire a solid foundation in algebra. The course concentrates on the various functions that are important to the study of calculus.",
    "aboutTheCourse": "This course is taught so that students will acquire a solid foundation \nin algebra. Emphasis is placed on understanding \nthe properties of linear, polynomial rational and radical functions, including \ninequalities and complex numbers. Students will learn to work with \nvarious types of functions in symbolic, graphical, numerical and verbal \nform.<br><br>The course videos are licensed Creative Commons Attribution-Sharealike-NonCommercial 3.0. The <a href=\"http:\/\/ocw.uci.edu\/courses\/math_1a1b_precalculus.html\" target=\"_blank\">course videos<\/a> can be found at UC Irvine's <a href=\"http:\/\/ocw.uci.edu\" target=\"_blank\">OpenCourseWare <\/a>site.",
    "targetAudience": 0,
    "courseSyllabus": "This course will be taught over ten weeks, with materials released on a weekly basis. Below you will find the weekly topic schedule.&nbsp;<br><br><i>Week One.<\/i> Introduction, Algebra and Real Numbers. Exponents and Radicals.&nbsp;<br><i>Week Two<\/i>. Polynomials: Basic Operations and Factoring. Rational Expressions: Basic Operations.<br><i>Week Three<\/i>. Linear Equations. Linear Inequalities.&nbsp;<br><i>Week Four<\/i>. Absolute Value in Equations and Inequalities. Complex Numbers. Quadratic Equations. Additional Equation Solving Techniques.<br><i>Week Five<\/i>. Cartesian Coordinate System. Distance in the Plane.<br><i>Week Six<\/i>. Equations of a Line.&nbsp; Linear Equations and Models.&nbsp;Functions.<br><i>Week Seven<\/i>. Graphing Functions. Transforming Functions.<br><i>Week Eight<\/i>. Quadratic Functions. Operations on Functions, Composition. Inverse Functions. Polynomial Functions and Models<br><i>Week Nine<\/i>. Real Zeros and Polynomial Inequalities. Complex Zeros and Rational Zeros of Polynomials. Rational Functions and Inequalities.<br><i>Week Ten<\/i>. Review and Final.<br><br><br><br><br>",
    "estimatedClassWorkload": "8-10 hours\/week",
    "recommendedBackground": "High school algebra and geometry are recommended. <br>",
    "links": {

    }
}