{"id":186,"shortName":"exphys","name":"Exercise Physiology: Understanding the Athlete Within","language":"en","shortDescription":"Learn about the physiological responses to acute and chronic exercise and their relevance for athletic performance.","aboutTheCourse":"This course examines the physiological responses to acute and chronic exercise, with a focus on skeletal muscle, energy metabolism, the oxygen transport system and temperature and fluid balance.  The factors that limit exercise performance will be reviewed and the role of genes in determining athletic performance will be considered.  At the end of this course, you should have a better understanding of the athlete within!<br>","targetAudience":1,"courseSyllabus":"<strong>Week One:<\/strong> Review of excitation-contraction coupling in skeletal muscle, muscle fibre types, energetics and muscle adaptations to exercise training.<br><br><strong>Week Two:<\/strong> The key fuels by contracting skeletal muscle during high intensity sprint exercise through to prolonged endurance exercise.<br><br><strong>Week Three:<\/strong> Cardiovascular and respiratory responses to exercise that ensure adequate oxygen delivery to contracting skeletal muscle and the determinants of maximal oxygen uptake.<br><br><strong>Week Four:<\/strong> Temperature and fluid balance during exercise.<br><br><strong>Week Five:<\/strong> Mechanisms of fatigue during exercise and interactions between the central nervous system and peripheral factors. Factors influencing sprint and endurance performance.<br><br><strong>Week Six:<\/strong> How do genes influence athletic performance - are athletes \"born or made?\"<br>","courseFormat":"The class will comprise lecture videos and integrated quiz questions at the end of each module. Lecture notes and selected readings will be provided.&nbsp; Optional, additional assignments can be undertaken, but the final exam is compulsory.&nbsp; <br>","suggestedReadings":"The lecture and support materials are designed to be self-contained, and there is no requirement to purchase a textbook. <br><br>However students may wish to refer to an exercise physiology textbook, of which there are many.  A well regarded text is <i><a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=exphys&isbn_ean=9780078022531\">Exercise Physiology: Theory and Applications to Fitness and Performance<\/a><\/i> by Scott Powers and Edward Howley (6th Ed, McGraw-Hill).<br>","instructor":"Mark Hargreaves","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"Undergraduate study in human physiology.&nbsp; The Coursera subject <a href=\"https:\/\/www.coursera.org\/course\/humanphysio\" target=\"_blank\" title=\"Link: https:\/\/www.coursera.org\/course\/humanphysio\">Introductory Human Physiology<\/a> would provide appropriate background. <br>","links":{}}