{
    "id": 1142,
    "shortName": "infrafinance",
    "name": "Financing and Investing in Infrastructure",
    "language": "en",
    "shortDescription": "Learn how debt and equity can be used to finance infrastructure investments and how investors approach infrastructure investments.",
    "aboutTheCourse": "<p>According\nto the OECD, the total global infrastructure investment requirement by 2030 for\ntransport, electricity generation, transmission &amp; distribution, and water &amp; telecommunications comes to 71 trillion dollars. This figure represents about 3.5% of the\nannual World GDP from 2007 to 2030.<\/p><p>The\nEuropean Commission estimated that by 2020, Europe will need between 1.5 - 2 trillion Euros in infrastructure investments. Between 2011 and\n2020 about 500 billion Euros will be required for the implementation of the\nTrans-European Transport Network (TEN-T) program, 400 billion Euros for Energy\ndistribution networks and smart grids, 200 billion Euros on Energy transmission\nnetworks and storage, and 500 billion Euros for the upgrade and construction of new\npower plants. An additional 38 - 58 billion Euros and 181 - 268 billion Euros capital investment\nwill be needed to achieve targets set by the European Commission for broadband\ndiffusion.<br><\/p><p>Traditionally investments in infrastructure were financed using public sources. However, severe budget constraints and inefficient management of infrastructure by public entities have led to an increased involvement of private investors in the business. <br><\/p><p>The course focuses on how private investors approach infrastructure projects from the standpoint of equity, debt, and hybrid instruments. <br><\/p>\n\n<p>The course concentrates on the practical aspects of project finance, the most frequently used financial technique for infrastructure investments. The repeated use of real life examples and case studies allows students to link the theoretical\nbackground to actual business practice.<\/p>\n\n<p>At the end of the course, students will be in the position to analyze a\ncomplex transaction, to identify key elements of the deal and to suggest proper\nsolutions for deal structuring from the perspective of a financial advisor.<\/p>",
    "targetAudience": 2,
    "courseSyllabus": "<b>Week 1<\/b>: Introduction to project and infrastructure finance; vocabulary of project finance.<br><br><b>Week 2<\/b>: The syndication process.<br><br><b>Week 3<\/b>: Risk analysis and risk allocation from the perspective of private investors.<br><br><b>Week 4<\/b>: Capital budgeting for infrastructure investments.<br><br><b>Week 5<\/b>:&nbsp;How to assess financial sustainability of an infrastructure project from the investor's standpoint.<br><br><b>Week 6<\/b>: Recent evolutions in the infrastructure finance market.<br>",
    "estimatedClassWorkload": "5-6 hours\/week",
    "recommendedBackground": "No particular background in finance is required, although a basic knowledge of principles of corporate finance is recommended.<br>",
    "links": {

    }
}