{"id":1613,"shortName":"medievalspain","name":"Deciphering Secrets: Unlocking the Manuscripts of Medieval Spain","language":"en","previewLink":"https:\/\/class.coursera.org\/medievalspain-001\/lecture\/preview","shortDescription":"In this course students will explore the history of Jews, Christians, and Muslims in late medieval, fifteenth century Spain. Serving as citizen-scholars, students will learn about the positive and negative elements of inter-religious co-existence in Plasencia, Spain, and more importantly, contribute to an international scholarly effort by helping transcribe manuscripts.","aboutTheCourse":"<p><b><i><a href=\"http:\/\/youtu.be\/vG-byHYng0w\" target=\"_blank\">Deciphering Secrets: Unlocking the Manuscripts of Medieval Spain&nbsp;<\/a><\/i><\/b><br><b><i><\/i><\/b><\/p>\n\n<p><i>Challenging\nAssumptions<\/i><\/p>\n\n<p>Our modern, global world is often\npresented as an unprecedented era of exceptional religious, political, and\ncultural enlightenment. Certainly we continue to experience tumultuous events\nand problematic relations, but many of us believe our world exists along a trajectory of human progress.&nbsp; This\ncourse is about doubt, questioning, and complications. It opens with the\nproposition that our present-day world is neither exceptional nor special, but\nrather is the beneficiary and the slave of history.<\/p>\n\n<p><i>About\nthis Course: The Challenges of Co-Existence<\/i><\/p>\n\n<p>Serving as citizen-scholars, students will\nlearn about the positive and negative elements of inter-religious co-existence\nin Plasencia, Spain, and more importantly, contribute to an international\nscholarly effort known as the <i><a href=\"http:\/\/www.revealingcooperationandconflict.com\" target=\"_blank\" title=\"Link: http:\/\/www.revealingcooperationandconflict.com\">Revealing\nCooperation and Conflict Project<\/a><\/i>.<\/p>\n\n<p>Together, we turn to a historical era that\nstumbled through the challenges of cultural and religious intermixing and\nco-existence. From the saved memories of Catholic churchmen, Jewish noble and\nmerchant families, as well as medieval lords and knight clans, students will\nstudy and contribute to an effort to revive long lost interactive and\ncooperative networks of people in Plasencia, Spain. <a href=\"http:\/\/youtu.be\/YmLnlNg0R2c\" target=\"_blank\" title=\"Link: http:\/\/youtu.be\/YmLnlNg0R2c\">And among the most textured, fascinating elements of our investigation is the history of Spain's Jewish community, or the Sepharad.<\/a><\/p>\n\n<p><span>For example, students will evaluate the Spanish\nanti-Jewish <i>pogroms<\/i> of 1391 that led\nto the large scale conversion of Jews to Christianity (forced and voluntary). By\ndocumenting such incidents and the interaction of noteworthy families,\nreligious organizations, political networks, and economic partnerships, we will\nreconstruct the quintessential cultural dynamics that underlay the foundation\nof the Castilian world and impacted the broader European continent.<\/span><\/p><p><\/p><p>Within the documents that students\ntranscribe, we will encounter historical persons such as Zanfines Capa, the Jewish\nchainmail maker, who was a close associate of the Carvajal family of knights.\nIn this specific case, the Catholic Carvajal clan and their compatriots in the\ncathedral, the Santa Maria clan (formerly the Jewish Ha-Levis), leased\nchurch-owned properties to Jewish families (like the chainmail makers) at the expense of\ntheir political competitors, the Catholic Estuñiga family (the Counts of\nPlasencia and Bejar). In this event, competing and overlapping political and\nreligious jurisdictions are revealed as well as vibrant Catholic-Jewish\nalliances that sought to expel interloping secular lords.<\/p>\n\n<p>In sum, we will evaluate the lives of\nJews, Christians, and Muslims, in a vibrant fifteenth century Spanish community\non the edge of incredible events – the consolidation of Spain under Queen\nIsabel and King Ferdinand, the encounter with the New World, and the defeat of\nthe Islamic Kingdom of Granada Spain and the expulsion of the Jews from Iberia.<\/p>\n\n<p><i>The\nCourse Work<\/i><i>&nbsp;<\/i><\/p>\n\n<p><i>In\nthis specific course, students will:<\/i> (1) study the history of medieval Spain and the community of Plasencia,\n(2) explore the world of medieval manuscripts and texts, (3) learn to read\nhistorical documents, and (4) transcribe and evaluate these documents.&nbsp;<\/p>\n\n<p><span>The primary source that students will be\ntranscribing in this course is <i>Book Five (1499-1513)<\/i> of the <i>Capitulary Acts <\/i>of\nthe <i>Cathedral of Plasencia<\/i>, which is\na census-like accounting document that details the activities and business\ntransactions of the cathedral. Most students will work with the 19th\ncentury transcription of the original 15th century text. Students who wish to challenge themselves will be granted the opportunity to work with\nthe original late fourteenth\/fifteenth century text.<u><\/u><\/span><\/p><p><a href=\"https:\/\/www.youtube.com\/watch?v=vG-byHYng0w\" target=\"_blank\" title=\"Link: https:\/\/www.youtube.com\/watch?v=vG-byHYng0w\">View the high resolution promotional video -- with English and Spanish subtitles.<\/a><\/p>","targetAudience":0,"courseSyllabus":"<p><b>PART ONE:\nFinding Our Way into the Provocative History of Spain<\/b><\/p><p><\/p><ul><li>Class 1: An Overview of the European,\nByzantine, and Islamic Middle Ages.<br><\/li><li>Class 2: Reflections on Christian Spain and\nIslamic al-Andalus (Part 1) and an Introduction to the Revealing Cooperation\nand Conflict Project (RCCP).<br><\/li><li>Class 3: Reflections on Christian Spain and\nIslamic al-Andalus (Part 2) and Video Tour of the Reales Alcazar (Sevilla) and\nthe Alhambra (Granada).&nbsp;<\/li><\/ul><p><\/p><p><b>PART TWO:\nPreparing For Discovery in Plasencia, Spain<\/b><\/p><p><\/p><ul><li>Class 4: Medieval Spanish Sources: Royal\nMunicipal and Church Records.<br><\/li><li>Class 5: The Medieval World of Plasencia,\nSpain, and Exploring the&nbsp;<i>Cathedral of Plasencia’s Capitulary Acts.<\/i><\/li><\/ul><p><\/p><p><b>PART\nTHREE:&nbsp;Citizen Scholars at Work – Interpreting Manuscripts&nbsp;<\/b><\/p><ul><li>Class 6: Transcription &amp; Interpretation\nProject from the&nbsp;<i>Capitulary Acts,<\/i>&nbsp;Course Conclusion, and\nFuture Opportunities.<br><\/li><\/ul><p><\/p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p>","courseFormat":"<p>Students will:<br><\/p><ul><li>View one required video lecture each week. Additional optional video lectures will be presented.&nbsp;<\/li><li>Read approximately 5-15 pages of online course content each week.<\/li><li>Complete short quizzes each week.<\/li><li>Transcribe Spanish primary texts.<\/li><li>Assess each other's transcription work.<\/li><li>Participate in problem-solving discussion boards<\/li><\/ul><p><\/p>","suggestedReadings":"For this course, you will be provided all necessary readings.","estimatedClassWorkload":"1-2 hours\/week","recommendedBackground":"No background is required; all are welcome to participate in the course. You do not need to be able to understand written Spanish as well. You just need to know how to recognize letters and numbers.","links":{}}