{
    "id": 51,
    "shortName": "rationing",
    "name": "Rationing and Allocating Scarce Medical Resources",
    "language": "en",
    "shortDescription": "This course will explore the complex challenges of allocating scarce medical resources at both the micro and macro level. Students will learn the theories behind allocation and use modern examples to explore how society makes the difficult decisions that arise when there is not enough to go around.",
    "aboutTheCourse": "<p>You have one liver but three patients awaiting a liver transplant. \nWho should get the liver? What criteria should be used to select the \nrecipient? Is it fair to give it to an alcoholic? These are some of the \nquestions that arise in the context of rationing and allocating scarce \nhealth care resources among particular individuals, and concern what are\n called micro-allocation decisions. But trade-offs also need to be made \nat the meso- and macro-level. Budgets of public payers of healthcare, \nsuch as governments, and of private ones, such as health plans, are \nlimited: they cannot cover all drugs and services that appear beneficial\n to patients or physicians. So what services should they provide? Is \nthere a core set of benefits that everyone should be entitled to? How \ncan we make fair decisions, if we know from the outset than not all \nneeds can be met? Using the cases of organs for transplantation, the \nrationing for vaccines in a flu pandemic, and drug shortages, the course\n will critically examine alternative theories for allocating scarce \nresources among individuals, while also exploring the principles and \nvalues that underlie those theories.<\/p>\n<div><\/div>",
    "targetAudience": 1,
    "courseSyllabus": "<strong>Logistics and Grading<\/strong>\n\n<p>This class is seven weeks long. Each week, students will watch approximate\n    30 - 40 minutes of lectures by Dr. Emanuel. Students should expect to spend\n    2 - 5 hours per week reading related materials from the reading list, all\n    of which are freely accessible online.<\/p>\n<p>Students taking the course for a grade will complete one quiz (also referred to throughout the course as a peer assessment) per week, which will be\n    peer-graded based on a detailed answer key provided after the due date.\n    Of the seven scores earned for assignments, the lowest two scores will\n    be dropped in calculating the final grade. The remaining five scores will\n    be weighted equally. As a result, students who miss a homework assignment\n    can still earn full credit in the course. There are no exams or final projects\n    in this course. Students not taking the course for a grade may choose not\n    to complete the assignments.<\/p>\n<p>The details of these logistics are subject to change; if changes are made,\n    students will be notified via an announcement and this page will be updated.<\/p>\n<strong><br>Course Outline<\/strong>\n\n<br>\n<br><strong>Week 1: \"Who Gets the Liver?\" &amp; History of Rationing<\/strong>\n\n<p>We begin the course with a hypothetical case. We have one liver and three\n    patients who will die if they don't get a transplant. We will discuss some\n    of the potential approaches for making life and death decisions in the\n    context of absolute scarcity. Next we will explore the history of rationing\n    in medicine. Absolute scarcity has always been a problem. How have we dealt\n    with this problem in the past? We'll take a look at what happened in the\n    cases of three major 20th century medial advances: insulin, penicillin,\n    and dialysis.<\/p>\n<strong>Week 2: Conceptual Distinctions<\/strong>\n\n<p>The study of rationing was borne out of the concept of absolute scarcity\n    in medicine--cases in which the demand for medical care far exceeds the\n    resources existing to meet that need. Because demand will inevitably exceed\n    supply--no matter what--choices must be made about which patients receive\n    treatment, and which don't. But what do we really mean when we use the\n    term 'rationing?' Is there a difference between the terms rationing, resource\n    allocation, and priority-setting? In this lecture, we will attempt to explain\n    the conceptual distinctions that give meaning to the terms we use in this\n    course.<\/p>\n<strong>Week 3: Organs for Transplantation<\/strong>\n\n<p>Kidneys, livers, hearts, and lungs are among the most discussed absolutely\n    scarce medical resources. And their allocation poses some of the most vexing\n    ethical dilemmas. The lecture for this week will break down the process\n    by which organs for transplantation are allocated in the United States\n    through the United Network for Organ Sharing (UNOS). We will discuss some\n    of the values and principles that are implicitly favored in the UNOS rules\n    and grapple with a few particularly difficult cases. Should alcoholics\n    with cirrhosis be eligible to receive a liver transplant, if their receiving\n    a liver means a person with a \"blameless\" liver disease will die as a result?\n    What role should socioeconomic or legal status play in organ transplantation?\n    Do you agree with the UNOS policies as written?<\/p>\n<strong>Week 4: Theories<\/strong>\n\n<p>This week, we will explore some of the moral schools of thought that have\n    shaped the modern-day study of bioethics, and have a tremendous impact\n    on health policy. Deontology regards morality as the driving guide behind\n    our choices of what we ought to do. Utilitarianism, on the other hand,\n    views the proper course of action as the one that maximizes utility. The\n    tension between these two ethical theories highlights the ethical dilemmas\n    that bioethicists face in determining how to ration scarce medical resources.<\/p>\n<strong>Week 5: Values &amp; Principles<\/strong>\n\n<p>Value judgments are inescapable in rationing decisions. But what are the\n    competing values and principles that are inherently at play? How can one\n    choose among them? This week's lecture explores 4 key values and 8 guiding\n    principles that ethicists and policymakers must consider when confronting\n    rationing decisions. We'll look at the distinctions between the values\n    and principles, and discuss the advantages and disadvantages of each. Additionally,\n    we'll examine the Complete Lives System, which is a theoretical framework\n    designed to draw upon multiple principles and values.<\/p>\n<strong>Week 6: Flu Emergency<\/strong>\n\n<p>This week, we will explore another real life example of rationing in action.\n    What should we do if there is a major flu pandemic and there isn't enough\n    vaccine to go around? Who should get the limited vaccine and who should\n    not? We'll examine the U.S. Government's actual policy for major health\n    crises. For example, we will look at Department of Health and Human Services\n    (HHS) briefs that deal with allocation protocols in the event of an influenza\n    pandemic. We will also look into historical examples of flu crises, and\n    analyze the ethical approaches taken in specific case studies.<\/p>\n<strong>Week 7: From Micro to Macro<\/strong>\n\n<p>For the final week of the course, we'll examine the difference between\n    micro rationing decisions and meso\/macro decisions. We'll look at the case\n    of Shep Glazer, whose testimony before Congress fundamentally changed the\n    way dialysis treatment was allocated in the United States. We'll also look\n    briefly at cost effectiveness analysis and the Quality Adjusted Life Year\n    (QALY) as tools for macro level decisions. What paradoxes arise when using\n    these tools? Do they favor some people over others? What values are implicit\n    in policies that draw upon cost-effectiveness and QALYs?<\/p>\n<br>",
    "estimatedClassWorkload": "8-10 hours\/week",
    "recommendedBackground": "",
    "links": {

    }
}