{"id":1262,"shortName":"chemprep","name":"Preparation for General Chemistry","language":"en","shortDescription":"The course develops critical thinking and analytic problem solving skills within a chemistry context in order to prepare students for success in college-level General Chemistry—a key gateway class required for many undergraduate majors.","aboutTheCourse":"Chemistry is about atoms and molecules and their transformations,\nand is referred to as the <i>Central Science<\/i> because it connects the\nphysical and life sciences. &nbsp;General Chemistry is your gateway into chemistry, and is\nrequired for majors in just about every field of science, technology and\nmedicine. &nbsp;General Chemistry trains students to think like scientists\nthrough the application of chemical principles to solve problems.<br><br>College-level general chemistry, however, is extremely\nfast-paced, and students are faced with challenges of absorbing new chemistry\nconcepts at the same time they are applied to complex problems. The goal of\nthis class is to prepare students for success in General Chemistry by honing\ntheir chemistry problem solving skills. <br><br>In this class, we will review fundamental mathematical\nskills, as well as provide strategies for general chemistry problem solving. &nbsp;Focus will be placed on selected conceptual areas of chemistry, and then delve deeply into application of these concepts to solve real-world problems. &nbsp;The class emphasizes critical thinking, solution strategies for complex chemical problems and foundational math skills. &nbsp;A goal of this course is to train students to think like scientists, and prepare them for success in university courses in science, technology engineering and mathematics.<br><br>I hope that you enjoy the class!","targetAudience":0,"courseSyllabus":"<b>Week 1 - Introduction and Warm Up: <\/b>Preliminary Assessment given to appraise current knowledge and help set goals; introductory material, including matter and energy, classification and properties of matter, scientific measurement and units, significant figures, dimensional analysis, and problem-solving strategies.<b><br><br>Week 2 - Boot-Camp I: &nbsp;<\/b>Understanding atomic structure and quantum theory, which includes properties of waves, wave-particle duality, the interaction of radiation and matter, the photoelectric effect and the Bohr atom model.<br><br><b>Week 3 - Boot-Camp II:<\/b> Introducing the concept of mole and understanding how compounds form, by differentiating ionic and covalent bonding, learning how to write molecular and empirical formulas and how to determine percent composition of compounds. Introducing solutions and how to measure their concentration.<br><br><b>Week 4 - Boot-Camp III:<\/b> Move on to chemical reactions, by understanding how to write balanced chemical equations, use them to perform various stoichiometric calculations and determine the yield of reactions; learning the different types of reactions, including combustion, precipitation, and acid-base reactions.<br><br><b>Week 5 - Boot-Camp IV:<\/b> Introduction to the thermodynamics of reactions, by discussing energy and energy changes, heat, work, enthalpy, calorimetry, and Hess's Law.<br><br><b>Week 6 - Final Exam Preparation:<\/b> Reviewing of concepts from Weeks 1-5, in preparation for the final examination. <br>","courseFormat":"<p><b>Preliminary\nAssessment<\/b><\/p>\n\n<p>Students will take a preliminary examination that will not\ncount for credit, but must be completed prior to beginning the rest of the\ncoursework. Students will be asked a series of chemistry questions, followed by\ntheir level of confidence in each of their answers. The purpose of this\nassessment is to make students aware of their current knowledge, as well\nhelp set learning goals for the class. As such, it is important that students take the\npreliminary exam seriously, and are honest about what they understand.<\/p>\n\n<p><b>Learning Modules<\/b><\/p><p>There will be four learning modules per week for the first\nfive weeks. Ideally, students will complete one module per day, leaving Friday\nfor the End-of-Week Review. Modules will be released Mondays at 10:01am EST, and are due on\n10:00am EST the following Monday. Each learning module consists of the following:<\/p><ul><li>A lecture\nvideo in which the concepts will be outlined and narrated by the instructor<br><\/li><li>A series of conceptually-based questions embedded within the\nlecture video itself<\/li><li>A video in which a set of relevant worked\nproblems of progressively higher difficulty, narrated by the instructor, are solved<br><\/li><li>A short problem-solving quiz related to the concepts and worked problems<br><\/li><li>A link to more problems that\nstudents may use for practice<\/li><\/ul>\n\n<p><b>End-of-Week Review<\/b><\/p>\n\n<p>After each weekly learning module, students will be given additional\nreview material and practice. The review will consist of the following:<\/p><p><\/p><ul><li>An exciting laboratory\ndemonstration to aid in connecting the material learned to the physical world.<\/li><li>A video demonstrating the solution of several highly challenging cross-cutting problems that bring together concepts and skills from several learning modules.<br><\/li><li>A set of 10 challenge problems, to be turned in, that generally will encompass more than one learning objective.<br><\/li><li>A set of Chemistry Sleuth problems,\nin which students will become detectives and \"buy\" clues in order to determine the most cost effective solution to the problem. &nbsp; Students\nare encouraged to discuss different ways to solve the problems on the discussion forums, and complete solutions (not just answers)\nmay be submitted for peer-grading for 1 extra credit point each.<\/li><li>A comprehensive weekly assessment\nQuiz consisting of 10 questions.<\/li><\/ul><p><\/p>\n\n<p><b>Exam Review Week<\/b><\/p>\n\n<p>Week 6 will serve as an exam preparation week. Students will\nbe given numerous practice problems ranging in difficulty, as well as a\npractice final exam.<\/p><p><b>Course Community<\/b><\/p>\n\n<p>Students are highly encouraged to participate in the\ndiscussion forums by asking questions, discussing course material, and helping\nother students in the course.&nbsp;<\/p>","suggestedReadings":"Most any college-level general chemistry textbook, for which there are many excellent options (this course is not tied to any specific textbook).&nbsp; If you are taking a full general chemistry class after participating in this course, it might be useful to begin to look at the textbook that is used for that class.&nbsp; Also - there is a free wiki book for general chemistry available <a target=\"_blank\" href=\"http:\/\/en.wikibooks.org\/wiki\/General_Chemistry\">here<\/a>.<br>","estimatedClassWorkload":"6-8 hours\/week","recommendedBackground":"Students are expected to have had an introductory chemistry course, for example in high school, as well as mathematics up to the level of precalculus (e.g., algebraic expressions, algebraic equations, inequalities, functions, and graphing).<br><br>","links":{}}