{
    "id": 592,
    "shortName": "plantknows",
    "name": "What a Plant Knows (and other things you didn’t know about plants)",
    "language": "en",
    "shortDescription": "Can we say that plants have senses? You will learn how plants sense their environment and how scientists study plant senses. You will be exposed to both classic and modern experiments in plant biology, and may even start to question what defines us as humans.",
    "aboutTheCourse": "<p>For centuries we have collectively marveled at\nplant diversity and form—from Charles Darwin’s early fascination with stems and\nflowers to Seymour Krelborn’s distorted doting in Little Shop of Horrors. <\/p>\n\n<p>This course intends to present to you an\nintriguing and scientifically valid look at how plants themselves experience\nthe world—from the colors they see to the sensations they feel. <\/p>\n\n<p>Highlighting the latest research in genetics\nand more, we will delve into the inner lives of plants and draw parallels with\nthe human senses to reveal that we have much more in common with sunflowers and\noak trees than we may realize. We’ll learn how plants know up from down, how\nthey know when a neighbor has been infested by a group of hungry beetles, and\nwhether they appreciate the music you’ve been playing for them or if they’re\njust deaf to the sounds around them. We’ll explore definitions of memory and\nconsciousness as they relate to plants in asking whether we can say that plants\nmight even be aware of their surroundings. This highly interdisciplinary course\nmeshes historical studies with cutting edge modern research and will be\nrelevant to all humans who seek their place in nature. <\/p>\n\n<p>By taking this course you'll be able to:<\/p>\n\n<p>1. Describe basic plant biology and plant\nsenses (sight, smell, hearing, touch, taste, balance). <\/p>\n\n<p>2. Define the world of biological research and\nthe scientific method. <\/p>\n\n<p>3. Question life in general and what defines us\nas humans.<\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<strong>Week 1 - Introduction:<\/strong><span>&nbsp;<br>Why we study plants, plant influence on evolution of the Earth.<br><strong><br>Week 2 -&nbsp;<\/strong><\/span><strong>What a Plant Sees:<\/strong>&nbsp;<br>Over view of human vision, plant responses to light, Darwin and phototropism, phytochrome and flowering and modern research.<br><strong><br>Week 3 -&nbsp;<\/strong><strong>What a Plant Smells:<\/strong>&nbsp;<br>Over view of human olfaction,&nbsp;Introduction to the plant cell and membranes, ethylene and fruit ripening,&nbsp;<i>Cuscuta&nbsp;<\/i>and plants smelling plants, Baldwin's experiments and plant olfactory communication.<br><br><strong>Week 4 -&nbsp;What a Plant Feels:<\/strong>&nbsp;<br>Over view of human physical sensory mechanisms, Venus fly trap, plant responses to shaking, Do plants hear?<br><br><strong>Week 5 -&nbsp;How a Plant Knows Where it is:<\/strong>&nbsp;<br>Overview human proprioception, Early experiments in gravitropism, root structure and the gravi-sensing mechanism, phototropism and discovery of auxin, gravitropism in space.<br><br><strong>Week 6 -&nbsp;What a Plant Remembers:<\/strong>&nbsp;<br>Overview of the human memory, electrical memory and Venus Fly trap, epigenetics and long-term memory.<br><br><strong>Week 7 -&nbsp;The A<\/strong><strong>ware Plant:&nbsp;<br><\/strong>Theoretical discussion on the definition of memory and consciousness and&nbsp;a quick examination of \"intelligence\".<br>",
    "estimatedClassWorkload": "3-4 hours\/week",
    "recommendedBackground": "Curiosity about nature and our place in the world.",
    "links": {

    }
}