{"id":2028,"shortName":"ruralnursing","name":"Rural Health Nursing","language":"en","shortDescription":"This course will provide learners with an opportunity to explore the challenges, opportunities, and skills necessary to provide nursing care in rural areas. ","aboutTheCourse":"The care of populations in remote and frontier areas requires an expanded understanding of the geographical elements, situational factors, and the unique issues that occur when resources are scarce, distant, or culturally inappropriate. We will identify what constitutes the definition of rural nursing, and what kinds of needs are presented by individuals and populations living in rural communities. Historical, geographical, cultural, and systems challenges to the provision of nursing care will be explored, and approaches to overcoming barriers to support the development of healthy communities in rural areas will be presented. Students will identify a rural or frontier area in which they are either currently practicing or expect to practice, and using elements from the course, design a program, policy, or intervention to address the specific health care needs of the population in that area.<br>","targetAudience":1,"courseSyllabus":"Week 1: This week will be for introductions, and a discussion about rurality: what does it mean in your context, and how it is described in different countries.<br><br>Week 2: We will be looking at all the aspects of health that are experienced in rural communities, including geographic, economic, political, and social factors.&nbsp; <br><br>Week 3: There are many ways in which culture affects health; we will be exploring the experience of Native Americans this week, and discussing the concepts of unconscious bias, cultural humility, and ethnography as tools for understanding how best to meet the health needs of rural populations.<br><br>Week 4: Performing a community assessment is an important tool to meet the needs of any population, but it is especially important for rural health care delivery.&nbsp; This week we will reflect on the specific aspects of community assessment that are most relevant to the health of rural populations.<br><br>Week 5: With a community assessment in hand, you can begin the process of planning projects and interventions to improve the health of a rural population.&nbsp; This week we will discuss the planning process, and how to ensure success by key stakeholders, and achievable and measurable outcomes.<br><br>Week 6:&nbsp; Health care policy is frequently in the spotlight, as the cost of care skyrockets, amid concerns about ensuring the quality of that care.&nbsp; We will explore the role of policy in the design and delivery of care in the rural environment, and what factors influence the development of health care policy.&nbsp; <br><br>Week 7:&nbsp; Technology is one of the many tools that can be used to improve the delivery of care to rural populations.&nbsp; We will share insights from some of the innovative leaders in rural health care, and discuss ways to successfully integrate new strategies.<br><br>Week 8:&nbsp; This will be our final week, and an opportunity to share the innovative strategies and unique ideas to improve health in rural areas that have been discovered by class participants while we've been on this journey together.&nbsp; <br>","courseFormat":"This course will be broken up into 8 modules which each address the following content areas:<br>Week 1: Addressing unconscious bias in the delivery of health care<br>Week 2: Assessing geographic, economic, political, and social aspects of health<br>Week 3: Culture and health<br>Week 4: Performing community assessments in rural and underserved areas<br>Week 5: Planning for improvement in health outcomes in rural and underserved areas<br>Week 6: Beyond the patient to policy: from the personal to the political<br>Week 7: Innovative strategies for rural health care delivery<br>Week 8: Putting it all together: community-based rural health care delivery<br>Each weekly module will consist of at least two lecture videos of instructors and\/or guest speakers and will include suggested readings.<br>","suggestedReadings":"See weekly assignments for suggested readings.","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"This course is open to anyone who has an interest in, or currently participates in, rural health nursing.&nbsp; <br>","links":{}}