{
    "id": 1117,
    "shortName": "logic1",
    "name": "Logic: Language and Information 1",
    "language": "en",
    "shortDescription": "This is an introduction to formal logic and how it is applied in computer science, electronic engineering, linguistics and philosophy. You will learn propositional logic—its language, interpretations and proofs, and apply it to solve problems in a wide range of disciplines.",
    "aboutTheCourse": "<span>Information is everywhere: in our words and our world, our thoughts and our theories, our devices and our databases. <i>Logic<\/i> is the study of that information: the features it has, how it’s represented, and how we can manipulate it. <i>Learning<\/i> logic helps you formulate and answer many different questions about information:<br><br><ul><li>Does this hypothesis clash with the evidence we have or is it consistent with the evidence?<\/li><li>Is this argument watertight, or do we need to add more to make the conclusion to really follow from the premises?<\/li><li>Do these two sentences say the same things in different ways, or do they say something subtly different?<\/li><li>Does this information follow from what’s in this database, and what procedure could we use to get the answer quickly?<\/li><li>Is there a more cost-effective design for this digital circuit? And how can we specify what the circuit is meant to do so we could check that this design does what we want?<\/li><\/ul>These are questions about Logic. When you learn logic you'll learn to recognise patterns of information and the way it can be represented. These skills are used whether we're dealing with theories, databases, digital circuits, meaning in language, or mathematical reasoning, and they will be used in the future in ways we haven't yet imagined. Learning logic is a central part of learning to think well, and this course will help you learn logic and how you can apply it.<br><br>If you take this subject, you will learn how to use the core tools in logic: the idea of a formal language, which gives us a way to talk about logical structure; and we'll introduce and explain the central logical concepts such as consistency and validity; models; and proofs. But you won’t only learn concepts and tools. We will also explore how these techniques connect with issues in <i>linguistics<\/i>, <i>computer science<\/i>, <i>electronic engineering<\/i>, and <i>philosophy<\/i>. <\/span>",
    "targetAudience": 0,
    "courseSyllabus": "<span><b>Week 1<\/b>. <i>The Syntax of Propositional Logic<\/i>; <i>Truth Tables<\/i>; <i>Classifying Propositions<\/i><br><br><b>Week 2<\/b>. <i>Relationships between Propositions<\/i>; <i>Tree Proofs<\/i>; <i>Soundness and Completeness<\/i><br><br><b>Weeks 3–5<\/b>. Applications to different reasoning domains (take at least two):<br><ul><li><i>Electronic Engineering<\/i> — simplifying digital circuits<br><\/li><li><i>Philosophy<\/i> — vagueness and borderline cases<br><\/li><li><i>Computer Science<\/i> — databases, resolution and propositional Prolog<br><\/li><li><i>Linguistics<\/i> — meaning: implication vs implicature<\/li><\/ul><\/span>",
    "estimatedClassWorkload": "6-8 hours\/week",
    "recommendedBackground": "This subject presumes no specialist background knowledge. You just need to be able to read and write, and be prepared to think, work and learn new skills—in particular, a willingness to work with symbolic representation and reasoning.",
    "links": {

    }
}