{
    "id": 733,
    "shortName": "911aftermath",
    "name": "Understanding 9\/11: Why Did al Qai’da Attack America?",
    "language": "en",
    "shortDescription": "This course will explore the forces that led to the 9\/11 attacks and the policies the United States adopted in response. We will examine the phenomenon of modern terrorism, the development of the al Qai'da ideology, and the process by which individuals radicalize towards violence. ",
    "aboutTheCourse": "The attacks of September 11, 2001, were a seminal moment in modern history. They demonstrated the ability of non-state actors to inflict serious damage on the world's greatest superpower and exposed the vulnerability of the entire global community to catastrophic acts of terrorism. <br><br>To understand the causes of the attacks, <b>9\/11 and Its Aftermath -- Part I <\/b>will examine the phenomenon of terrorism, in general, and, more specifically, the radical ideology developed and propagated by Osama bin Laden through al Qai'da. We will consider why individuals are attracted to this ideology and how they radicalize to violence. We will also explore the way in which the United States addressed terrorism prior to 9\/11 and the policy challenges it (and its allies around the globe) faced in the immediate aftermath of the attacks. <br><br>The second part of this course -- to be offered sometime in 2014 -- will examine the policy \"aftermath\" of 9\/11. <b>Part II <\/b>will examine how the United States changed its policies in response to 9\/11 in three areas: the use of military force, law enforcement and intelligence activities, and homeland security. We will trace the evolution of these policies from the Bush to the Obama Administration and critically assess the overall counter-terrorism strategy.&nbsp;<br><br>Together, these courses will provide the background necessary to understand why 9\/11 occurred, and consider the range of options that democratic nations can use to counteract this form of political violence. &nbsp;",
    "targetAudience": 0,
    "courseSyllabus": "<b>Course Topics<\/b><br><br>Week 1: The 9\/11 Attacks<br>Week 2: What is Terrorism?<br>Week 3: A Primer on Islam<br>Week 4: The Al Qai'da Ideology<br>Week 5: The Radicalization Process<br>Week 6: Counterterrorism Pre-9\/11<br>Week 7: September 12, 2001<br>",
    "estimatedClassWorkload": "3-4 hours\/week",
    "recommendedBackground": "No background is required. <br>",
    "links": {

    }
}