{"id":2325,"shortName":"engagecitizen","name":"Engaging Citizens:  A Game Changer for Development?","language":"en","shortDescription":"Government works best when citizens are directly engaged in policymaking and public service delivery. What conditions are necessary for inclusive and effective citizen engagement? Can it positively improve people's lives? This course provides an overview of citizen engagement, critically analyzing how it can be leveraged most effectively to achieve development results.","aboutTheCourse":"<img src=\"https:\/\/d396qusza40orc.cloudfront.net\/engagecitizen\/images\/about-us.jpg\" style=\"float:left; margin:0 10px 0 0px; width:265px;\" alt=\"\">\n<p>Recent events have shown that the relationship between government and citizens is in need of repair. In just the last few years, we have witnessed calls from all over the world, from the <a href=\"http:\/\/en.wikipedia.org\/wiki\/Arab_spring\" target=\"_blank\">Arab Spring<\/a> and <a href=\"http:\/\/en.wikipedia.org\/wiki\/Occupy_Wall_Street\" target=\"_blank\">Occupy Wall Street<\/a> to the <a href=\"http:\/\/www.opengovpartnership.org\/\" target=\"_blank\">Open Government Partnership<\/a>, for governments to become more open, accountable and responsive by deepening their engagement with citizens. As a result, interest in citizen engagement programs for effective development has gained momentum. This MOOC has been developed to explore what is meant by citizen engagement and how it can be used to enhance development impact.<\/p>\n<p>The 4-week course brings together a diverse range of experts to provide students with a comprehensive overview of citizen engagement. It begins by synthesizing the theories and concepts that underlie citizen engagement, and goes on to explore how citizens can be engaged in both policymaking and public service delivery. Finally, it investigates how recent innovations are shaking up the field, through detailing both successes and failures of these new approaches. Our presenters, leaders in academia, government, and civil society, provide a wide range of perspectives and real-world experience to give participants a deeper understanding of whether citizen engagement can truly enhance the process of development. Participants will also have the opportunity to collaborate with one another and design their own citizen engagement initiatives, thereby putting theories learned in the course into practice.<\/p>\n<h2>Course Instructors and Facilitators <\/h2>\n<p>The course instructors are <strong>Jeff Thindwa, Björn-Sören Gigler <\/strong>and<strong> Tiago Peixoto<\/strong>. You can click on their names on the right to view their detailed profile. Benji Holzman and Kate Henvey will also be playing a key role in the course facilitation. You will be able to look at their detailed profile by clicking on their names below.<\/p><div>\n<img width=\"78\" src=\"https:\/\/d396qusza40orc.cloudfront.net\/engagecitizen\/images\/Benji_instru.jpg\" height=\"78\" style=\"float:left ; margin-right:20px; height:78px\"><div><a href=\"\/instructor\/benji\">Benji Holzman<\/a><br>\n<a href=\"\/worldbank\">The World Bank<\/a><\/div><\/div> <br>\n<br>\n<div>\n<img width=\"78\" src=\"https:\/\/d396qusza40orc.cloudfront.net\/engagecitizen\/images\/Kate_Henvey_instru.jpg\" height=\"78\" style=\"float:left ; margin-right:20px\"><div><a href=\"\/instructor\/katehenvey\">Kate Henvey<\/a><br>\n<a href=\"\/worldbank\">The World Bank<\/a><\/div><\/div>\n<br><br>\n\n \n\n\n<h2>Partners<\/h2>\n<p>We have partnered with four leading institutions in the citizen engagement field to collaborate on the design and facilitation of this course: <\/p>\n<p><img src=\"https:\/\/d396qusza40orc.cloudfront.net\/engagecitizen\/images\/partners-logos.jpg\" style=\"float:right; margin:0 65px 0 0px; width:184px;\" alt=\"\"> <\/p>\n<ul>\n  <li><a href=\"http:\/\/www.lse.ac.uk\/home.aspx\" target=\"_blank\">London School of Economics<\/a><\/li>\n  <li><a href=\"http:\/\/www.odi.org\/\" target=\"_blank\">Overseas Development Institute<\/a> <\/li>\n  <li><a href=\"http:\/\/www.participedia.net\/\" target=\"_blank\">Participedia<\/a><\/li>\n    <li><a href=\"http:\/\/civicus.org\/index.php\/en\/\" target=\"_blank\"> CIVICUS<\/a><\/li>\n\n<\/ul>","targetAudience":3,"courseSyllabus":"<img src=\"https:\/\/d396qusza40orc.cloudfront.net\/engagecitizen\/images\/course-syllabus.jpg\" style=\"float:right; margin:0 0 0 10px; width:265px;\" alt=\"\">\n<strong>Overview <\/strong><br>\nThe overview will provide a course roadmap and explain the rationale behind this course—why this topic, and why now?<br>\n<br>\n<strong>Week 1: Citizen Engagement: What It Is and Why It Matters<\/strong><br>\n \nThis week examines the theoretical underpinnings of citizen engagement and how it can lead to better development results. We begin by exploring the definitions and history of citizen engagement, as well as related concepts such as transparency, accountability, responsiveness and inclusiveness. We then look at the concept of the feedback loop, and the differences between intrinsic and instrumental approaches. Next we examine the crucial role of sociopolitical context and the enabling environment, and finally introduce the concept of strategic and tactical approaches to citizen engagement.<br>\n<br>\n<strong>Week 2: Engaging Citizens for Improved Policymaking<\/strong><br>\nThis week explores the role that citizens can play in actively shaping public policy. We start by examining how citizens participate, analyzing the differences between ‘thick’ and ‘thin’ forms of engagement and asking strategic questions such as who should participate, how should participants interact with decision makers, what information do participants need, and how will participation impact policy decisions. Next, we survey examples of crowdsourcing and open innovation that are helping governments and citizens better interact. Finally, we unpack why citizens participate, moving beyond the mere calculation of costs and benefits described in the rational choice model to an analysis of broader factors that influence participation.<br>\n<br>\n<strong>Week 3: Can Engaging Citizens Bring Better Services?<\/strong><br>\nIn this week we examine the role of citizen engagement in public service delivery. We first unpack different conceptions of the government-citizen relationship and then explore the ways citizens can serve as active agents of, rather than passive recipients in, the delivery of public services. We then provide an in-depth look at a range of citizen engagement projects in this area by exploring the methods, tools, barriers to inclusion and factors for success of case studies, particularly in developing country contexts.<br>\n<br>\n<strong>Week 4: Innovations in Citizen Engagement<\/strong><br>\nHaving outlined the role of citizen engagement during policymaking and service delivery, the final week investigates recent innovations in citizen engagement. We begin by examining how recent advances in information and communications technology (ICT) can be used to enhance citizen engagement from a human development perspective, and review some of the most compelling new developments in this area. Next, we explore the reasons why some of these innovative approaches succeed while others fail, and look at how hybrid approaches-those that combine ICT tools with traditional methodologies-are being used in an attempt to maximize development results. Finally, we look at recent ICT-enabled citizen engagement case studies to assess their real-world impact.<br>\n<br>\nWe conclude the course with review videos, as well as ‘call to action’ videos from high-profile leaders in government, civil society and academia  to provide you with tangible next steps to put your knowledge into practice. <br>\n<h2>Course Tracks<\/h2>\n<img src=\"https:\/\/d396qusza40orc.cloudfront.net\/engagecitizen\/images\/course-tracks.jpg\" style=\"float:right; margin:0 0 0 10px; width:275px;\" alt=\"\">\nDepending on your level of interest, you can choose to participate in one of two tracks:<br><br>\n\n\n<ul>\n<li>Track 1: Citizen Engagement Champions (1-2 hours\/week)<\/li>\n<li>Track 2: Policy and Leadership (2-4 hours\/week)<\/li>\n<\/ul>\nStudents can move from the Citizen Engagement Champions track to the Policy and Leadership track at any point during the course. We encourage students to join the Policy and Leadership track to gain deeper knowledge and practical experience.<br>\n<br>\n<strong>Track 1 – Citizen Engagement Champions<\/strong><br><br>\n \n\n<ul><strong>Target Audience<\/strong><br>\nThis track is suitable for anyone with a general interest in citizen engagement. It provides insight into underlying concepts and current trends in citizen engagement, and the ways in which it can be utilized to improve development results.<br>\n <br>\n<strong>Track-Specific Objectives<\/strong><ul>\n  <li>To understand the theoretical underpinnings of citizen engagement and why it is a critical component of good governance.<\/li>\n <li>To evaluate current citizen engagement initiatives for development around the world.<\/li> \n  \n  <\/ul>\n<br>\n<strong>Assignments<\/strong>\n<ul>\n  <li>Assignments focus on facilitating an understanding of mandatory course material (video talks and core readings) through multiple choice quizzes and peer-reviewed short answer responses.<\/li>\n <li>Optional exercises are also suggested.<\/li> \n  \n<\/ul><\/ul>\n<br>\n<strong>Track 2 – Policy and Leadership<\/strong><br><br>\n \n\n<ul><strong>Target Audience<\/strong><br>\nThis track is designed for those wishing to gain greater practical experience in citizen engagement, as well as to develop networks of practice with counterparts from around the world. Our hope is that this track will catalyze the launch of real-world initiatives.<br>\n \n<br>\n<strong>Track-Specific Objectives<\/strong><ul>\n  <li>To understand the theoretical underpinnings of citizen engagement and why it is a critical component of good governance.<\/li>\n <li>To evaluate current citizen engagement initiatives for development around the world.<\/li> \n   <li>To build networks of practice and catalyze collaboration among students.<\/li> \n      <li>To allow students an opportunity to design and create a citizen engagement project that could be implemented in their community.<\/li> \n  <\/ul>\n<br>\n<strong>Assignments<\/strong>\n<ul>\n  <li>Assignments focus on facilitating an understanding of mandatory course material (video talks and core readings) through multiple choice quizzes and peer-reviewed short answer responses.<\/li>\n <li>Students must also design a citizen engagement project and represent it creatively online through a digital artifact.<\/li> \n <li>Optional exercises are also suggested.<\/li> \n<\/ul><\/ul>\n\n<h2>Connect<\/h2>\n\nParticipants are encouraged to communicate and share resources via Twitter using hashtag <a href=\"https:\/\/twitter.com\/search\/?q=%23CitizensEngage\" target=\"_blank\">#CitizensEngage<\/a>, and via our LinkedIn group (to be announced). Sign up for free accounts for these services at <a href=\"https:\/\/twitter.com\/\" target=\"_blank\">http:\/\/www.twitter.com<\/a> and <a href=\"http:\/\/www.linkedin.com\/\" target=\"_blank\">http:\/\/www.linkedin.com<\/a>.","courseFormat":"<img src=\"https:\/\/d396qusza40orc.cloudfront.net\/engagecitizen\/images\/course-format.jpg\" style=\"float:right; margin:0 0 0 10px; width:275px;\" alt=\"\">\nEach week, you will find a variety of course material, including:\n<br><br>\n\n<ul>\n\n                 <li>A <strong>Citizen Engagement Film Fest: <\/strong>23 interactive video talks by renowned citizen engagement experts and practitioners<br>\n<br>\n<\/li>\n\n           <li><strong>Resources:<\/strong> Core readings and suggested material (‘Deep Dives’) on the week’s theme<br>\n<br>\n<\/li>\n              <li><strong>Quizzes<\/strong> that test your knowledge, reinforce the lesson’s material and provide immediate feedback<br>\n<br>\n<\/li>\n               <li><strong>Assignments<\/strong> that sharpen your skills of analysis, reflection and communication<br>\n<br>\n<\/li>\n               <li><strong>Discussion forums, social media channels and meet ups<\/strong> that enable collaboration with others from around the world, enriching interaction among participants<br>\n<br>\n<\/li>\n               <li>\n  Two live interactive <strong>Google Hangouts on Air <\/strong>with international experts who will engage in a live Q&amp;A session on citizen engagement<\/li>\n             <\/ul>","suggestedReadings":"›&nbsp;&nbsp;&nbsp;<a href=\"https:\/\/consultations.worldbank.org\/Data\/hub\/files\/consultation-template\/engaging-citizens-improved-resultsopenconsultationtemplate\/materials\/finalstrategicframeworkforce_4.pdf\" target=\"_blank\">Strategic Framework for Mainstreaming Citizen Engagement in <br>\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;World Bank Operations<\/a>, World Bank Group, 2014.<br>\n›&nbsp;&nbsp;&nbsp;Opening The Black Box: Contextual Drivers of Social Accountability <br>\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Effectiveness (forthcoming), World Bank Group, 2014.<br>\n›&nbsp;&nbsp;&nbsp;<a href=\"http:\/\/gpsaknowledge.org\/wp-content\/uploads\/2014\/09\/Social-Accountability-What-Does-Evidence-Really-Say-GPSA-Working-Paper-11.pdf\" target=\"_blank\">‘Social Accountability: What Does The Evidence Really Say?<\/a>, <br>\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Jonathan Fox, 2014.<br>\n›&nbsp;&nbsp;&nbsp;<a href=\"http:\/\/www-wds.worldbank.org\/external\/default\/WDSContentServer\/WDSP\/IB\/2014\/05\/23\/000442464_20140523135121\/Rendered\/PDF\/882680PUB0978100Box385205B00PUBLIC0.pdf\" target=\"_blank\">Closing the Feedback Loop: Can Technology Bridge The <br>\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Accountability Gap?<\/a>, World Bank Group, 2014.<br>","estimatedClassWorkload":"2-4 hours\/week","recommendedBackground":"","links":{}}