{
    "id": 1585,
    "shortName": "globalaffairsfinal",
    "name": "Global Affairs Final Project",
    "language": "en",
    "shortDescription": "This Final Project course is only available to learners who have earned a Verified Certificate in each course of the Challenges in Global Affairs Specialization (The Changing Global Order, Configuring the World, and International Organizations Management). You won't be able to enroll in this course if you do not have a Verified Certificate in each of those three courses.",
    "aboutTheCourse": "<div>This Final Project of the Specialization “Challenges in Global Affairs” brings together the knowledge, insights and skills you have learned in the three MOOCs: The Changing Global Order (Leiden University), Configuring the World (Leiden University) and International Organizations Management (University of Geneva). You will integrate your knowledge and skills by way of a Final Project. In this Peer Reviewed Assignment, you will reflect on a critical international issue.<\/div><div><br><\/div><div>Some of the professors you came to know during the course will join forces and will be present in this capstone. During a number of Google Hangout sessions (live video chats), the course team will respond to your discussions in the forum and guide you along the way to write your Final Project.<\/div><div><br><\/div><div>Upon completing this project, you can show that you have successfully understood today’s main challenges&nbsp;and that you are able to critically evaluate this and come up with creative solutions. Integrating these different approaches and showing creativity will be much appreciated for tomorrow’s world leaders.<\/div><div><br><\/div><div><\/div><div><br><\/div>",
    "targetAudience": 2,
    "courseSyllabus": "In this capstone project we would like you to apply your academic skills, go out in the field and do research. You will apply knowledge and skills acquired in the various MOOCs to make your own creative contributions to ongoing challenges in international relations in practice. Each student will choose a topic and write an article-length essay. This written argument engages with other evidence in the form of visual and\/or written texts. Students will also learn by giving and receiving feedback on each others' essays.",
    "estimatedClassWorkload": "4-8 hours\/week",
    "recommendedBackground": "",
    "links": {

    }
}