{"id":3092,"shortName":"brand","name":"Brand Management: Aligning Business, Brand and Behaviour","language":"en","shortDescription":"Professor Nader Tavassoli of London Business School contrasts traditional approaches to branding - where brands are a visual identity and a promise to customers - to brands as a customer experience delivered by the entire organisation. The course offers a brand workout for your own brands, as well as guest videos from leading branding professionals. ","aboutTheCourse":"<p><strong>What?<\/strong> <\/p><p><\/p><p>The aim of the\ncourse is to change the conception of brands as being an organisation's visual identity (e.g., logo) and image (customers' brand associations) to an experience along \"moments-that-matter\" along the customer journey and, therefore, delivered by people across the entire organisation. Brands are\nthus not only an external promise to customers, but a means of executing\nbusiness strategy via internal brand-led behaviour and culture change.<\/p><p>You will learn and practice the following skills:<\/p><p>\n\n<\/p>\n<ul>\n<li><p>How to build brands from a broad organisational perspective&nbsp;<\/p><\/li>\n<li><p>How to lead brand-led\nculture change with human resource practices at the core (i.e., brand as a\nlever and not just an outcome)&nbsp;<\/p><\/li>\n<li><p>How to build brands in multi-brand companies, across cultures and\ngeographies<\/p><\/li>\n<li><p>How to measure brand health in new ways, that is, internally in addition to externally<\/p><\/li>\n<li><p>How to value and capture returns to brands across the organisation - introducing the new concept of employee-based brand equity - and how this is different from the valuation of brands as intangible assets.&nbsp;<\/p><\/li>\n<\/ul>\n\n<p><span><strong>Who?<\/strong> <\/span><\/p><p><span>This course is designed for a broad audience of marketing\nand non-marketing professionals, in particular human resources and finance but\nextending to all employees who need to understand their critical role in\ndelivering on the brand promise. It is also accessible to students, to complement a more traditional\ncourse on branding. This course is&nbsp;<i>NOT<\/i>\nfor couch potatoes as you will be challenged to do stuff in the real world!<\/span><\/p>\n\n<p><strong>Why? <\/strong><\/p><p>This course allows you to develop the following aspects of yourself:<\/p><p>\n\n<\/p><ul><li><p><i>Head<\/i>. Gain a deeper\nunderstanding of the evolving practice of brand management, one that goes further than\npracticed in most organisations today<\/p><\/li><li><p><i>Heart<\/i>. Be motivated to\nengage in delivering your own brands – regardless of where you are in your\norganisation – thereby creating superior value for customers and for your\norganisation<\/p><\/li><li><p><i>Hands<\/i>. Translate learnings into action. As Confucius is supposed to have said: “I hear and I\nforget. I see and I remember. I do and I understand.”<\/p><\/li><\/ul>","targetAudience":3,"courseSyllabus":"Module 1 -&nbsp;Brand purpose &amp; experience&nbsp;<br>Module 2 - Brand design &amp; delivery<br>Module 3 -&nbsp;Brand leadership &amp; alignment<br>Module 4 -&nbsp;Brand practices &amp; engagement<br>Module 5 -&nbsp;Brand metrics &amp; returns<br><p>The week before the course officially starts, we'll have a soft launch with a taster video and activity.<\/p>","courseFormat":"The class will consist of about 1 hour of video material per module plus optional materials available online. You will be tasked to complete a number of practical exercises, so prepare to get involved!<br>","suggestedReadings":"The course is NOT based on these very useful books and they are entirely optional:<br><p>“Uncommon Practice: People Who Deliver a Great Brand\nExperience” edited by Andy Milligan and Shaun Smith (FT Prentice Hall)<\/p>\n\n<p>“The Power of Habit: Why We Do What We Do in Life and\nBusiness” by Charles Duhigg (Random House)<\/p>\n\n<p>“Grow – How Ideals Power Growth and Profit at the World’s 50\nGreatest Companies” by Jim Stengel (Virgin Books)<\/p>\n\n<p>“The Experience Economy: Work is Theatre &amp; Every Business is a Stage” by B. Joseph Pine II and James H. Gilmore (HBS Press)<\/p><p>\"Employees First, Customers Second\" by Vineet Nayar (HBS Press)<\/p>","estimatedClassWorkload":"2-3 hours\/week","recommendedBackground":"<p>You will not need any prior knowledge. This course is most valuable if you are currently employed as this will allow you to apply exercises directly to your organisation. As such, you will gain most value if you and one or more of your colleagues follow this course together. If you are a student or not currently employed, you can also apply the exercises to a brand of your choice.&nbsp;<\/p>","links":{}}