{"id":442,"shortName":"sitedance","name":"Creating Site-Specific Dance and Performance Works","language":"en","shortDescription":"A production course geared to performers, choreographers, and other artists interested in producing site-specific work. Through three assignments, students will have the opportunity to plan and conceptualize a site-specific work.","aboutTheCourse":"<p>This course focuses on the creation of live site-specific choreography and performance works from conception to production to performance. Site-specific dance\/performance is work created in response to a particular place or site, inspired by its architecture or design, its history, and\/or its current use.&nbsp;Lectures and forum discussions will investigate site-based projects in both&nbsp;urban and non-urban locales, and ranging from large-scale to small (guerrilla) style productions. Furthermore, together we will delineate definitions of site-specificity, and look across the history of the field, focusing primarily on dance.<\/p>\n<p>Specific techniques and approaches towards generating site-inspired choreography will be introduced here, but the primary focus is navigating technical issues (lighting, sound, media) and production challenges (budgeting, obtaining permissions, insurance, fundraising, audience\/event design). This is a media-rich course that features examples of site-specific work by Stephan Koplowitz to illustrate key points in the lectures, and other work shared by students in the class.<\/p>","targetAudience":1,"courseSyllabus":"<p><b>Week 1: History and Context<\/b>\n<br>What is site-specific performance and dance? We'll define the genre through four distinct categories, and survey the range of site work in dance, performance, and installation-based practices.<\/p>\n\n<p><b>Week 2: Working from the Outside In<\/b>\n<br>How to deal with pre-production decisions, such as selecting and assessing a site, and putting together a working budget.<\/p>\n\n<p><b>Week 3: Research and Staging<\/b>\n<br>How to begin developing an artistic proposal for a site through a variety of set research \"filters.\"<\/p>\n\n<p><b>Week 4: Production Elements<\/b>\n<br>How to generate content as it applies to site and the concept for your work, and a survey of what you need to consider in terms of sound or music, lighting, costumes and media.<\/p>\n\n<p><b>Week 5: Creative and Production Challenges, Part 1<\/b>\n<br>Safety issues; considerations when working in urban and natural environments; working with different production staff (costume, lighting, and sound designers) and other collaborators, such as composers or other artists.&nbsp;<\/p>\n\n<p><b>Week 6: Creative and Production Challenges, Part 2<\/b>\n<br>Strategies for fundraising and marketing; and an overview of documenting your work.<\/p>","courseFormat":"You are welcome to participate in this course as an observer or casual learner. You can&nbsp;watch the lecture videos, submit assignments or contribute to the discussion forums as you wish. A completion grade will be visible on your Course Records page.<br><br>If you are interested in earning a Verified Certificate through Signature Track, you&nbsp;must earn a minimum number of \"points\" which equates to a passing score. Points are awarded for completing peer-assessed assignments, completing peer evaluations, and posting in select forums.&nbsp;If you complete the course without verifying your work, you will still earn a completion grade on your Course Records page.<p><\/p>","suggestedReadings":"<strong>Recommended: <\/strong><br>\n<a href=\"http:\/\/www.amazon.com\/Site-Dance-Choreographers-Alternative-Spaces\/dp\/0813036933\/ref=sr_1_1?ie=UTF8&amp;qid=1377802216&amp;sr=8-1&amp;keywords=site+dance\" target=\"_blank\" title=\"Link: http:\/\/www.amazon.com\/Site-Dance-Choreographers-Alternative-Spaces\/dp\/0813036933\/ref=sr_1_1?ie=UTF8&amp;qid=1377802216&amp;sr=8-1&amp;keywords=site+dance\">Site Dance: Choreographers and the Lure of Alternative Spaces.<\/a> Melanie Kloetzel and Carolyn Pavlik, eds. Gainesville, FL: University Press of Florida, 2009.","instructor":"Stephan Koplowitz","estimatedClassWorkload":"3-6 hours\/week","recommendedBackground":"This course is designed for anyone interested in learning about site-specific dance and performance. Prior site-specific experience in dance or theater is not required but some experience in creating dance, theater, performance or installation-based practices is recommended.&nbsp;","links":{}}