{
    "id": 600,
    "shortName": "corethink",
    "name": "Student Thinking at the Core",
    "language": "en",
    "shortDescription": "This course explores how teachers can capitalize on what students bring to the classroom - their ideas, perceptions, and misunderstandings - to advance the learning of all students in the class, a practice we call “leveraging student thinking”.  ",
    "aboutTheCourse": "As good teachers know, our most important resource(s) in classroom interaction\nare the ideas and experiences our students bring with them. The past two\ndecades of research on learning, and more recent framings of academic goals\n(especially the Common Core State Standards) bring this insight to the\nforefront. This short course, designed for as few as four weeks and as many\nas eight, asks how teachers can and do capitalize on what students bring\nto the classroom - their ideas, perceptions, and misunderstandings – to\nadvance the learning of all students in the class.\n<br><br>Our overarching goal is to support participants in developing the knowledge\n    and skills needed to take up student thinking in ways that enable all students\n    to learn challenging subject matter – a practice we call “leveraging student\n    thinking”.<br>\n<p>Course content will focus primarily on middle grades classrooms in various\n    disciplines, but the practice of leveraging student thinking is applicable\n    to all subject areas and grade levels. Participants will explore the design\n    of curricular tasks, the analysis of patterns of talk, and the use of representational\n    tools to:<\/p>\n<ul>\n    <li>elicit student thinking,<\/li>\n    <li>attend to significant features of that thinking,<\/li>\n    <li>interpret students’ ideas within a developmental framework, and<\/li>\n    <li>bridge from students’ current understandings to more sophisticated understandings.<\/li>\n<\/ul>\n<p>These ideas will be introduced through guided engagement with video cases.\n    Analysis of the video cases will highlight the elements involved in leveraging\n    student thinking, and also will illustrate the epistemic, academic, developmental\n    and managerial “pressure points” that challenge teachers’ ability to capitalize\n    on student thinking in constructive ways.<\/p><p>Throughout the course, participants will further explore and test out these ideas in their own classrooms,&nbsp;be they formal or informal. (A Sunday school class, a scout troop, a homeschool opportunity, or a traditional classroom environment would all be appropriate, but some kind of teaching practice is necessary to benefit from the course.)&nbsp; The goal is to&nbsp;work on the work of teaching&nbsp;<i>while<\/i>&nbsp;teaching.<\/p><p>In addition, critical reflection with a group of partners is an important component of this course. &nbsp;At&nbsp;key&nbsp;points, participants will be asked to document their work to share with peers for feedback.&nbsp;Therefore, we strongly encourage teachers to&nbsp;plan to work through&nbsp;this course in teams (of two to four people) to facilitate mutual observation, analysis and discussion. Teachers&nbsp;who&nbsp;do not have a team at the beginning of the course&nbsp;will be able to create a team through&nbsp;online forums at the beginning of the course&nbsp;and can exchange their teaching examples through video or narrative descriptions.<\/p>",
    "targetAudience": 1,
    "courseSyllabus": "This course justifies and unpacks a teaching practice we call leveraging student thinking. &nbsp;This practice (actually a constellation of practices) supports important educational goals including, but not limited to, achievement as outlined in the Common Core State Standards. The elements of leveraging are:&nbsp;<div><br><ul><li>eliciting student thinking&nbsp;<br><\/li><li>attending to significant features of that thinking&nbsp;<\/li><li>interpreting students' ideas within a developmental framework<\/li><li>bridging from students' current understandings to more sophisticated understandings<\/li><\/ul>Over the course of four lessons we will explore each element listed above. We will be drawing upon both our own* and others' research,as well as the insights of practicing teachers.&nbsp;<br><br>* We are grateful to the National Science Foundation for their support of the research on which this course is based and the preparation of the materials found here: &nbsp;\"Linking Teacher Preparation to Student Learning in Mathematics and Science\", National Science Foundation, Award ID 0554486.&nbsp;<br><p><\/p><b>Lesson 1: Eliciting Student Thinking at the Core<\/b>&nbsp;(available on August 19)<br><p><\/p><p><b>Goal:&nbsp;<\/b>Design a better task -- i.e., one that will more effectively get students’ thinking on the table.&nbsp;<br><\/p><p><b>Essential Questions:&nbsp;<\/b><\/p><p>&nbsp;&nbsp;&nbsp; •&nbsp;&nbsp;&nbsp; What does it mean to leverage student thinking?&nbsp;<br>&nbsp;&nbsp;&nbsp; •&nbsp;&nbsp;&nbsp; Why is leveraging student thinking educative?&nbsp;<br>&nbsp;&nbsp;&nbsp; •&nbsp;&nbsp;&nbsp; How can you design tasks to more effectively elicit student thinking and make students' understandings more visible? &nbsp;<\/p><p><b>Assignments:<\/b>&nbsp;<\/p><p><\/p><ul><li>Design a task to effectively elicit student thinking.&nbsp;&nbsp;<br><\/li><li>Complete survey.<\/li><\/ul><b>Lesson 2: Anticipating and Interpreting Student Thinking<\/b><b>&nbsp;<\/b>(available on August 26)<br><br><b>Goal:<\/b>&nbsp;Locate your students' thinking (elicited in assignment #2) within a developmental framework.&nbsp;&nbsp;<br><br><b>Essential Questions:&nbsp;<\/b><br><ul><li>What’s the developmental trajectory that links students' current understandings of particular concepts to more sophisticated understandings?&nbsp;<\/li><li>What does it mean to locate student thinking within a trajectory of development?<\/li><\/ul><b>Assignments:&nbsp;<\/b>&nbsp;<br><ul><li>Sort the student work you collected from least to most sophisticated. On what basis are you making this judgement?<p><\/p><\/li><li>Conduct a clinical interview with one or more of your students about a concept in your subject area and hypothesize how those students' understanding might build over time \"in the direction of what the expert already knows.\"*&nbsp;<\/li><\/ul>*See Dewey, J. (1916).&nbsp;<i>Democracy and Education.<\/i>&nbsp;New York: &nbsp;Basic Books, p. 191. See Barb's lecture in Lesson 2 to put this phrase in context)&nbsp;<div><b>Lesson 3: Taking Up Learners’ Ideas as Pedagogical Resources<\/b><b>&nbsp;<\/b>(available on September 2)<br><br><b>Goal:<\/b>&nbsp;Use talk and representational tools to “take up” student thinking in ways that advance the understandings of all students.&nbsp;&nbsp;<br><br><b>Essential Questions:<\/b>&nbsp;<br><ul><li>How do teachers use student thinking to build important ideas and understandings?<\/li><\/ul><b>Assignments<\/b>:&nbsp;&nbsp;<br><ul><li>Analyze a video excerpt for the moves made by the teacher and students to build students' understandings.<\/li><li>Videotape\/audiotape a lesson in your classroom, and, with a peer, analyze the moves you and your students make to build understanding.<\/li><\/ul><b>Lesson 4: Putting Will and Skill Together to Leverage Student Thinking<\/b><b>&nbsp;<\/b>(available on September 9)<br><br><b>Goal:<\/b>&nbsp;Identify personal &amp; professional challenges of leveraging practice (based on attempting, and reflecting critically on that attempt to leverage), and sketch a plan for your development of this practice.&nbsp;<br><br><b>Essential Questions:<\/b><br><ul><li>How and why is the diversity of student ideas and understandings a resource for leveraging? In other words, how can diversity of ideas propel learning?&nbsp;<br><\/li><li>What are the challenges or “pressure points” that impede the practice of leveraging in general?<\/li><li>What can you do to develop this practice in your teaching context?<\/li><\/ul><b>Assignments:<\/b>&nbsp;<br><ul><li>Teach, videotape\/audiotape, and reflect on a lesson in which you focus on building from and through students’ ideas.&nbsp;<br><\/li><li>Develop an action plan with your partner to develop your skills in leveraging student thinking<\/li><li>Submit action plan as a peer assessment and assess the work of three of your peers.&nbsp;<\/li><\/ul><\/div><\/div>",
    "estimatedClassWorkload": "3-4 hours\/week",
    "recommendedBackground": "K-12 teaching experience in any subject area and a commitment to all students' learning and achievement is necessary background. Also, as instructions and forums are English-langugage centric, is it necessary that all participants be able to work through the English medium. At times this can be troublesome for those participants who teach a class in a language other than English but should not be prohibitive of contribution.<br> <br>We also recommend joining the course with colleagues, friends, or family who can form a “critical partnership” in thinking through – and putting into practice – the ideas of the course.",
    "links": {

    }
}