{
    "id": 1385,
    "shortName": "oceansolutions",
    "name": "Ocean Solutions",
    "language": "en",
    "shortDescription": "This course will look at how intelligent and innovative use of the ocean can sustainably deliver the key resources necessary to help meet some of the great challenges faced by humanity.",
    "aboutTheCourse": "The world's population recently reached seven billion people, and is expected to swell to nine billion by 2050. This growing population is putting pressure on food, water and energy supplies, threatening biodiversity, and contributing to global\nclimate change. We need find a way to meet these challenges while maintaining a healthy and sustainable environment.\n<br>\n<br>We believe that the oceans hold the key to overcoming these challenges. \n<br>\n<br>In this 8-week course we will look at:<br>\n\n<ul><li>The significant challenges facing humanity now and in the future<\/li><li>Identifying the bottle-necks behind these challenges<\/li><li>How ocean-based solutions will help to meet the growing demands for resources<\/li><li>How ocean-based solutions can be used in climate change mitigation\nstrategies<\/li><li>The historical impact of ocean governance on implementing effective solutions<br><\/li><li>The impacts of public perception and attitudes in\nimplementing ocean solution strategies and consider the practicality of\nsuccessfully deploying them<\/li><\/ul>\n\nWe hope you can join us. <br><br>",
    "targetAudience": 1,
    "courseSyllabus": "The following modules will be covered during the first 6 weeks of the course: <br><br>Module 1: Problem Statement<br>Module 2: The Challenge<br>Module 3: Ocean Solutions<br>Module 4: Food from the Ocean<br>Module 5: Water from the Ocean<br>Module 6: Energy<br>Module 7: Marine Bioresources<br>Module 8: Climate Change Mitigation<br>Module 9: Governance of Ocean Solutions<br>Module 10: Successfully Deploying Ocean Solutions<br>Module 11: Prospects<br><br>The final 2 weeks of the course will involve a peer assessment activity. <br>",
    "estimatedClassWorkload": "4-8 hours\/week",
    "recommendedBackground": "This course is best suited to university students and graduates of the environmental sciences and science teachers. However the concepts are introduced in a simple manner so it is accessible to anyone with a keen interest in the environment and sustainability.<br>",
    "links": {}
}