{
    "id": 53,
    "shortName": "bioelectricity",
    "name": "Bioelectricity: A Quantitative Approach",
    "language": "en",
    "shortDescription": "Nerves, the heart, and the brain are electrical. How do these things work? This course presents fundamental principles, described quantitatively.",
    "aboutTheCourse": "<p>In this class you will learn how to think about electrically active\ntissue in terms of individual mechanisms, and you will learn to analyze the\nmechanisms quantitatively as well as describe them qualitatively. &nbsp;The\ncourse uses many of the same examples used by Hodgkin and Huxley, who won the\nNobel Prize for their experimental unraveling of the mechanisms of the nerve\naxon of the giant squid, and their creation of a mathematical model of\nmembranes and propagation to understand its function. &nbsp;That work has been\nthe foundational element of most subsequent understandings of electrically\nactive tissue, whether in nerves, the brain or in muscle, including the heart. \n<\/p>\n<p>\nIn this course, topics include:\n<\/p><ol>\n<li>The electrical charging of active membranes from the creation and use of differences in ionic concentrations across the membrane.<\/li>\n<li>The stimulation of the membrane, both naturally and from engineered sources.<\/li>\n<li>The creation of action potentials by the membrane in response to stimulation.<\/li>\n<li>The chain reaction of membrane responses, with each small region or cell initiating an action potential in adjacent ones.<\/li>\n<li>The observation of associated electrical currents in terms of extracellular wave voltages they create, the basis of clinical measurements such as the electrocardiogram.<\/li>\n<\/ol>\n<p><\/p>\n<p>\nThe course will at each step present equations and other quantitative reasoning so that you will be able to go beyond describing what happens qualitatively and be able to link together the phenomena in the mosaic in a quantitative fashion, which is essential to judging whether specific changes in inputs are important to the outcome. Through the use of quantitative analysis, you will learn that all the elements of the system are tied together and be able to link together and analyze the effects of one part on another.\n<\/p>",
    "targetAudience": 1,
    "courseSyllabus": "The topics addressed in the course will include:<ol>\n<li>Electricity in living tissue, “animal electricity,\" Galvani and Volta<\/li>\n<li>&nbsp;Voltages, currents and sources in solutions. &nbsp;<\/li>\n<li>Electrically active membranes and their resistance and capacitance<\/li>\n<li>Diffusion and fields across membranes, Nernst equilibrium<\/li>\n<li>Ion channels<\/li>\n<li>Action potentials<\/li>\n<li>Impulse propagation, current along the fiber<\/li>\n<li>&nbsp;Electrical stimulation<\/li>\n<li>Extracellular fields &nbsp;1,2<\/li>\n<li>Extracellular wave forms<\/li>\n<li>Transmembrane stimulation<\/li>\n<li>&nbsp;Field stimulation<\/li>\n<\/ol>The goal of the course is to understand an integrated system. That requires understanding the components individually, but the challenge is to understand them working together as an integrated whole.",
    "estimatedClassWorkload": "6-9 hours\/week",
    "recommendedBackground": "<p>Insofar as\nBioelectricity, this course begins at the beginning, so all the main ideas can\nbe understood without prerequisite courses. &nbsp;As electricity is invisible,\nno one sees it, so the most important prerequisite is one’s willingness to\nbring imagination, reflection and patience to the topics, so as to allow the\nideas to grow and knit together in one’s own mind. <\/p>\n\n<p>Some of the\npresentation uses equations and other mathematics that come from calculus and\ndifferential equations and other parts reason from the physics of electricity\nand the analysis of circuits, so background knowledge about these subjects is\nhelpful. For example, one needs to recognize that dV\/dt is the rate of change\nof voltage V with time t, so as to understand that C dV\/dt is the current\nthrough a capacitor C.&nbsp; As another example, if V=1\/r, what is dV\/dr?<\/p>\n\n<p>A course\nlike this one usually is given to advanced undergraduates or early graduate\nstudents in science and engineering, as these students have taken calculus and\nphysics, and differential equations and circuits, and thus are comfortable when\nnotation or simple operations from these fields are used.<\/p>",
    "links": {

    }
}