{
    "id": 242,
    "shortName": "datamanagement",
    "name": "Data Management for Clinical Research",
    "language": "en",
    "shortDescription": "Learn critical concepts and practical methods to support research data planning, collection, storage and dissemination.",
    "aboutTheCourse": "<p>This course is designed to teach important concepts related to research data planning, collection, storage and dissemination. Instructors will offer information and best-practice guidelines for 1) investigator-initiated & sponsored research studies, 2) single- & multi-center studies, and 3) prospective data collection & secondary-reuse of clinical data for purposes of research. The curriculum will balance theoretical guidelines with the use of practical tools designed to assist in planning and conducting research. Real-world research examples, problem solving exercises and hands-on training will ensure students are comfortable with all concepts.  <\/p>",
    "targetAudience": 3,
    "courseSyllabus": "<p>Data Management for Clinical Research will balance \nbest-practice guidelines and hands-on demonstrations &amp; exercises in \ncovering important concepts related to research data collection and \nmanagement. We will focus primarily on data management for \npatient-centered (clinical) research, but core data management \nprinciples are applicable across all research domains. Clinical research\n is an essential part of all medical advances and directly impacts our \nsocietal ability to prevent, detect and treat medical conditions as well\n improve the quality of life for individuals with need for medical \ndevices.<\/p>\n<p>The course is organized as follows:<\/p>\n<strong>Week 1<\/strong>\n<p>Course Introduction, Mechanics and Broad Coverage (what topics are \nin\/out with respect to data management principles covered by the course)<\/p>\n<p>Planning a Data Collection Strategy<\/p>\n<strong>Week 2<\/strong>\n<p>Standardizing Operations and Procedures<\/p>\n<p>Electronic Data Capture Systems<\/p>\n<strong>Week 3<\/strong>\n<p>Practicing What We Have Learned - Working Through Planning, EDC Setup and Study Launch<\/p>\n<strong>Week 4<\/strong>\n<p>Data Management Considerations Once a Study Is Launched (Mid-Study Operations and Challenges)<\/p>\n<p>Data Management Considerations Once a Study Is Finished <\/p>\n<p>Special Topic: Regulatory Requirements and Compliance<\/p>\n<strong>Week 5<\/strong>\n<p>Special Topic: Collecting Information Directly From Research Participants (Surveys)<\/p>\n<p>Special Topic: Imaging Data <\/p>\n<p>Special Topic: Multi-Center and Network Studies<\/p>\n<p>Special Topic: Resource-Limited Settings and Global Health Studies<\/p>\n<p>Special Topic: Using Data Standards<\/p>\n<p>Wrap-Up Video<\/p><br>",
    "estimatedClassWorkload": "2-4 hours\/week",
    "recommendedBackground": "A general interest in medical research (any scientific domain) and basic computer skills.",
    "links": {

    }
}