{"id":1500,"shortName":"innovationarts","name":"Leading Innovation in Arts and Culture","language":"en","shortDescription":"Developed by David Owens at Vanderbilt University and customized for the cultural sector with National Arts Strategies, this course will help arts and culture leaders create an environment where new ideas are constantly created, shared, evaluated and the best ones are successfully put to work.","aboutTheCourse":"<div><p>One of the toughest challenges for any leader is getting\ntraction for new ideas. Winning support can be a struggle. As a result, powerful\nnew ideas often get stuck. This is especially true in the cultural sector.\nPeople involved in arts and culture often have little time and even less money\nfor experimentation and risks. This course will help those in the performing\narts, museums, zoos, libraries and other cultural organizations build environments where new management and\nprogram ideas are created, shared, evaluated and the best ones are successfully\nput to work.<\/p>\n\n<p><i>Leading\nInnovation in Arts &amp; Culture<\/i> will teach your team how to make an \"innovation strategy\" a\nfundamental component of your organization's overall strategy. In this seminar\nyou will learn to:<\/p><ul><li>Analyze\nconstraints on innovation in your organization, foresee obstacles and\nopportunities, and develop a shared vision<br><\/li><li>Develop\na process to manage the demands of multiple stakeholders, shifting priorities\nand the uncertainty inherent in new initiatives<br><\/li><li>Create\na culture for innovation and risk-taking that generates new perspectives and\nchallenges existing practice<br><\/li><li>Create\na strong customer focus within your organization that anticipates customer\nneeds<\/li><\/ul><p><\/p>\n\n<p><a href=\"http:\/\/www.artstrategies.org\/about\/index.php\">National Arts Strategies<\/a>&nbsp;worked with\nDavid Owens to customize this course for those working in the cultural sector.\nThey based their work on David Owens’&nbsp;<a href=\"https:\/\/www.coursera.org\/course\/innovation\">Leading\nStrategic Innovation in Organizations<\/a>&nbsp;course. This highly interactive 8-week course will\nengage your team through a series of class discussion and team exercises. The\nteam from National Arts Strategies will use its deep experience working in this\nfield to facilitate discussion among participants. They will also lead\nexercises to help you examine and change your current habits of thought and\nbehavior.&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<\/div>","targetAudience":3,"courseSyllabus":"<div><span>Week 1: Introduction<br>\n  Why Everyone Wants Innovation but No One Wants to Change<\/span>\n\n<p>We introduce the approach of the class:  instead of trying to be innovative, just stop stopping it.  We discuss a framework for analyzing the six most common barriers (constraints) that stop innovation.<\/p>\n    <span>Week 2: Individual Constraints<br>\n    Why Most of Us Are More Creative Than We Think<\/span>\n<p>Psychologists treat innovation as a problem of having creative ideas; we sometimes stop innovation by not \"thinking different.\" This week explores the constraints of perception, intellection and expression and offers strategies for overcoming them.<\/p>\n<span>Week 3: Group Constraints<br>\nWhy a Brainstorm Meeting Can Be Worse Than No Meeting at All<\/span>\n<p>Social psychologists treat innovation as a group problem: we often don't get early support for our ideas because of adverse group dynamics. This week looks at the constraints of emotion, culture and process in groups as well as the environment within which groups work and looks at ways to overcome them.<\/p>\n<span>Week 4: Organizational Constraints<br>\nWhy You’ll Never Be a Prophet in Your Own Hometown<\/span>\n<p>The field of management sees the problem of innovation as one of the organization; organization is the opposite of innovation, after all. This week explores the constraints of strategy, structure and resources and we explore ways of framing them that will help us to overcome them.   <\/p>\n<span>Week 5: Industry Constraints<br>\n  If It’s Such a Great Idea, Why Isn’t Our Competitor Doing It?<\/span>\n<p>An economist view of failed innovation sees it as a problem of adoption; when there's no market to adopt it, it's not an innovation, it's just a creative idea. We look at the constraints of competition, suppliers and markets and discuss strategies you can use to relax them.<\/p>\n<span>Week 6: Societal Constraints<br>\n  Why My Innovation Means You Have to Change<\/span>\n<p>The sociological and anthropological perspective suggests that societies control or obstruct innovations that are deemed as dangerous or contrary to societal values. This week explores the constraints of identity, social control, and history and we will seek an understanding of how we might avoid them. <\/p>\n<span>Week 7: Technological Constraints<br>\n  How to Take a Really Hard Problem and Make It Completely Impossible<\/span>\n<p>Engineers and scientists see failed innovation as a failure of technology; if it doesn't work, it's not an innovation. Here we explore the constraints of knowledge, time and the natural environment. Rather than trying to overcome them, we develop strategies for working within these constraints.<\/p>\n<span>Week 8: When Failure Is Not an Option<br>\n  Leading an Innovation Strategy<\/span>\n<p>The final week has us putting the entire model together into the leadership context. We will learn about innovation portfolios and discuss a tested process for moving innovations from ideas to realities.  <\/p>\n<p>This <a href=\"http:\/\/creativepeoplemustbestopped.com\/video\/\">animated video<\/a> describes the basic issues addressed by the course. <\/p>\n<p>&nbsp;<\/p>\n<\/div>","courseFormat":"<div>The course will consist primarily of weekly video lectures with embedded quizzes, short exercises, readings, several diagnostic surveys and a brief weekly reflection paper. \n<p><br>\nIn recognition that not all participants have the same learning objectives or available time, the course is offered at two levels of engagement: a \"Standard Level\" or a \"Studio Mastery Level.\"<strong> The major difference between the two tracks is that the Studio Mastery Level requires that you work with a small team on a course-related project. <\/strong>You can read more about the tracks below:<\/p>\n<span>\n  <span><span>\n    <span><span>\"<strong>Standard Level<\/strong>\"&nbsp;<\/span>\n      <p>Estimated Time Commitment: 4-6 Hours Per Week<\/p>\n    <p>Students at this level receive a “<u><i>Statement of Accomplishment<\/i><\/u>” or a Verified Certificate (for those taking the course through <a target=\"_blank\" href=\"https:\/\/www.coursera.org\/signature\/guidebook\">Signature Track<\/a>). These statements indicate advanced proficiency with the course concepts and framework. This program is designed for those who wish to engage the material by doing assignments, exercises and discussion board participation, however, who may not have the time to complete an innovation project<\/p>\n    <p>&nbsp;<\/p><\/span>\n  <\/span>\n  <span>\n    <span><b>“Studio Mastery Level”<\/b>\n      <p>Estimated Time Commitment: 6-10 Hours Per Week<\/p>\n      <p>Students at this level will receive a&nbsp;“<u><i>Statement of Accomplishment - With Distinction<\/i><\/u>&nbsp;(or Verified Certificate) that indicates mastery of the practice of the course content. Students will apply the material by completing an innovation project in a small team. This program is designed for those students wishing to achieve mastery of the course material and to understand its application in a real-world project context. You are strongly encouraged to recruit other local participants to take the course with you if you’d like to do this program. If you work in an arts or cultural organization, this is a great opportunity to create a team at your office to learn together and push a project forward. If you don't have a local team to work with, there will be an opportunity to recruit a virtual team through discussion board posts once the course has begun.<\/p><\/span>\n  <\/span>\n<\/span><\/span>\n<p>&nbsp;<\/p>\n<\/div>","suggestedReadings":"<div><span>While I will provide pointers to additional readings for each class module, I recommend (but do not require) that students refer to the book \"<a target=\"_blank\" href=\"http:\/\/creativepeoplemustbestopped.com\">Creative People Must Be Stopped!<\/a>\" which was written specifically for this course.<\/span>\n<p>&nbsp;<\/p>\n<\/div>","estimatedClassWorkload":"6-8 hours\/week","recommendedBackground":"<div>This course is designed for people involved in arts and culture around the globe. The content and discussions will be ideal for professionals, board members, funders, volunteers, students, teachers, artists and advocates in all types of cultural organizations. This includes performing arts, museums, heritage, science, zoos, aquarium, botanical gardens, literary organizations, libraries, arts education and other organizations delivering arts and cultural content and activities around the globe.\n<p>&nbsp;<\/p>\n<\/div>","links":{}}