{
    "id": 524,
    "shortName": "globalization",
    "name": "Globalization and You",
    "language": "en",
    "shortDescription": "This course offers an evidence-based analysis of globalization that addresses what is happening to us personally as well as economically amidst the market-led processes of global integration. ",
    "aboutTheCourse": "<p>Particular attention is paid to the ways market-led macro-economic reforms\n    associated with globalization (such as free trade agreements and privatization\n    initiatives) have come together with much more micro innovations in how\n    personal behavior is organized by market forces (rethinking education as\n    a personal investment practice, for example, or outsourcing dating to for-profit\n    companies).  Mediating between these macro and micro scales of capitalist\n    transformation are a wide array of other market-based mechanisms examined\n    in the course.  From bond risk ratings to the market metrics shaping\n    FICO scores, personalized medicine and online mapping, these market-mechanisms\n    require close examination. Tracing their influence with an awareness of\n    their material geographic variation and unevenness, the course offers an\n    alternative to economistic assumptions about choice-maximizing behavior\n    on a ‘level playing field’. It explores instead the complex uneven development\n    dynamics of globalization in ways that allow you to see how your own personal\n    perspectives on these dynamics are at once outcomes and enablers of economic\n    and social change.  And, by doing so, the course aims in turn at enabling\n    you to be a more engaged participant in the ongoing debates over the direction\n    these dynamics <i>should<\/i> take.  Key words that are debated, defined\n    and\/or explained in the course include: globalization, interdependency,\n    discourse, capitalism, neoliberalism, value, financialization, harmonization,\n    competition, governance, governmentality, power, citizenship, choice, accountability,\n    enclaving, geopolitics, biopolitics, biocapital and global health.<\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<p><b>Course goal:<\/b> \n    <br>To enable you to comprehend market-led globalization in ways that allow\n    you to evaluate how your own life and personal choices are shaped by market\n    forces and associated global ties.\n    <br>\n<\/p>\n<p><b>Course-level learning objectives:<\/b>\n\n    <br>At the end of this class you will be able to:<\/p>\n<ul>\n    <li>Describe the main debates and controversies surrounding globalization;<\/li>\n    <li>Analyze the ties and tensions of uneven global development;<\/li>\n    <li>Understand the growing impact of global market integration;<\/li>\n    <li>Synthesize knowledge of market globalization with your own experiences\n        of market forces and market reforms;<\/li>\n    <li>Evaluate the way in which market forces define and delimit personal choices\n        and everyday life globally;<\/li>\n    <li>Develop capacity to respond and reflect personally amidst the ties and\n        tensions of market-led globalization.\n        <br>\n    <\/li>\n<\/ul>\n<p><strong><u>Assignment Overview:<\/u><\/strong> \n    <br>Here are some of the course assignments and activities: <\/p>\n<ul>\n    <li><strong>Video lectures<\/strong>: Most of the course content is delivered\n        through video lectures. Each video runs 10-12 minutes<\/li>\n    <li><strong>Discussion forums<\/strong>: This class thrives on discussion.\n        Multiple discussion forums are designed to develop out of the lectures.\n        You will have the ability to articulate your own views on globalization\n        as well as learn from your fellow students from around the world.<\/li>\n    <li><strong>Quizzes<\/strong>: Many video lectures have short quizzes embedded\n        that allow you to check your grasp of basic knowledge as the course proceeds.<\/li>\n    <li><strong>Peer Assessment Assignments -<\/strong> There are peer assessment\n        activities available for this course.  By participating in these,\n        and reading and responding to the work of others, you can also help improve\n        your own learning and understanding.<\/li><\/ul><ul>\n<\/ul><br>",
    "estimatedClassWorkload": "2-3 hours\/week",
    "recommendedBackground": "There are no prerequisites for this course. That said, an interest in common media depictions of globalization will help you understand the main arguments more quickly. Relatedly, reading and writing comfortably in English at the undergraduate college level will enable your more active engagement in course discussion forums and peer assessment exercises.<br>",
    "links": {

    }
}