{"id":2477,"shortName":"cities","name":"Cities are back in town : urban sociology for a globalizing urban world ","language":"en","shortDescription":"Urbanization is reaching a new peak in the contemporary world with the rise of mega cities. Researchers try to make sense of these large urban areas using a variety of concepts. The class will review debates and present social science models of cities to analyse and compare contemporary developments.","aboutTheCourse":"<p>Globalization, Europeanization processes support the rapid developments of cities in different part of the world. Urbanization is reaching a new high in the contemporary world with the rise of mega cities (beyond 15 million inhabitants) such as Calcutta, Los Angeles, Dhaka, Cairo, Tokyo, New York, Shanghai, Mexico or Seoul. Beyond the modern metropolis, researchers try to make sense of these large urban areas using a variety of concepts such as the ‘postmetropolis’, ‘global cities’, and ‘global city-regions’. The class will review debates and present social science models of cities and metropolis to analyse and compare contemporary developments. How can do we study those cities when they become mega urban regions, does size matter and for what? Do we see the making of a vast urban world or by contrast beyond the apparent convergence of complex globalisation processes understood in relation to globalised capitalism, is it possible to identify masked differentiations and the strengthening of different urban worlds? How do we make sense of this urban world when cities are not independent units but have to be understood both in terms of territories, rootedness, and at the same time in terms of relations to take into account flux, mobility, circulations ? What is the relevance of social science concepts developed in the Western world to analyse the transformation of Lagos? To what extent may the systematic development of new forms of comparison between northern cities and cities from the South change social sciences and contribute to overcome the bias towards national comparison?&nbsp;<\/p><p>For the time being, given current conditions of capitalism, political, economic, cultural and social questions are increasingly becoming urban questions. In the modern conception of the world\/globalcity, characterised by size, the aggregation of housing, differentiated divisions of labour, and the density of interaction, several conceptions of cities exist which have become entangled and sometimes opposed to each other. These different conceptions underline different processes of integration: the material city of walls, squares, houses, roads, light, utilities, buildings, waste, and physical infrastructure; the cultural city in terms of imaginations, differences, representations, ideas, symbols, arts, texts, senses, religion, and aesthetics; the politics and policies of the city in terms of domination, power, government, mobilisation, public policies, welfare, education; the social city of riots, ethnic, economic and gender inequalities, everyday life and social movements; and the economy of the city : the division of labour, scale, production, consumption, trade.....<\/p><p>Classic urban questions about inequalities, housing, government, integration, are combined with issues about the urban fabric, questions of mobility and rootedness, sustainable development and risks, the making of the cyborg cities, questions of social control and riots, urban culture, innovation and urban economic development.<\/p><p>All video produced by Sciences Po for this Mooc are under Creative Commons (BY \/ NC \/ SA)<\/p>\n<p><img width=\"80\" src=\"https:\/\/d396qusza40orc.cloudfront.net\/cities\/images\/LogoSPC.jpg\" height=\"80\" alt=\"LogoSPC.jpg\">USPC - Supported by Université Sorbonne Paris Cité&nbsp;<\/p><p><img width=\"80\" src=\"https:\/\/d396qusza40orc.cloudfront.net\/cities\/images\/logo_Avenir.jpg\" height=\"80\" alt=\"logo_Avenir.jpg\">IDEX - Investissements d'Avenir<\/p><p><br><\/p>\n<br>","targetAudience":1,"courseSyllabus":"<p>Week #1 : Introduction, definition, urban questions and the use of models<\/p><p>Week #2 : European cities and the weberian model of integration<br><\/p><p>Week #3 :&nbsp;Colonial and post colonial cities<br><\/p><p>Week #4 : Industrial cities (and Socialist cities) and Marxist models<br><\/p><p>Week #5 : The American metropolis and the Chicago School,&nbsp;<br><\/p><p>Week #6 :&nbsp;Post metropolis, fragments and differences<br><\/p><p>Week #7 : Global cities and mega cities<br><\/p><div>Week #8 : Smart cities and the sociology of science and technology<br><\/div>","courseFormat":"<p>The course is organized in 8 sequences and displays multimedia contents (images, video, original documents).&nbsp;<\/p><p>There will be also an assignment in exploring a theorical model presented in the course to a case study of your choice.<\/p>","suggestedReadings":"<p><b>Key references&nbsp;<\/b><\/p><p>Bridge, G., Watson, S., eds, (2011), <i>The new Blackwell Companion of Cities<\/i>, Oxford, Wiley Blackwell<\/p><p>Clarke, P., (2013), <i>The Oxford Handbook of cities in world history<\/i>, Oxford, Oxford University Press<\/p><p>Harding, A., Blokland, T., (2014), Urban theory, A critical introduction to power, cities, and urbanism in the 21rst century, London, Sage<br><\/p><p>Parnell, S. Oldfield, S., (2014), <i>The Routledge Handbook on Cities in the Global South,<\/i> London, Routledge<\/p><p><b>Key books&nbsp;<\/b><\/p><p>Brenner, N., (2004), <i>New state spaces<\/i>, Oxford, Oxford University Press<\/p><p>Caldeira, T., (2000), <i>City of Walls,<\/i> Berkeley, University of California Press<\/p><p>Castells, M., (1983), <i>The City and the grassroots<\/i>, Berkeley, University of California Press<\/p><p>Davies, D., (1994), <i>Urban leviathan&nbsp;: Meixco city in the Twentieth century<\/i>, Temple University Press.<\/p><p>Gandy, M. (2002)&nbsp;<i> Concrete and clay: reworking nature in New York City.<\/i> <br>\nCambridge, MA: The MIT Press,&nbsp;<\/p><p>Harvey, D. (1989). <i>The condition of Postmodernity<\/i>. Oxford: Blackwell.<\/p><p>King,&nbsp; A.D. 1976: <i>Colonial urban development; culture, social power and environment<\/i>.<\/p><p>London: Routledge and Kegan Paul.<\/p><p>Le Galès, P. (2002). <i>European Cities: Social Conflicts and Urban Governance<\/i>. Oxford: Oxford University Press.<\/p><p>Marcuse, P., Van Kempen, R., 1999, eds,&nbsp;Globalizing cities, Oxford, Blackwell<br><\/p><p>J.Logan, H.Molotch, 1987.<i>Urban fortunes. The political economy of place<\/i>, Berkeley, The University of California Press<\/p><p>&nbsp;Marques, E. (2012), <i>Opportunities and Deprivation in the Urban South, <\/i>London, Ashgate<\/p><p>Pattilo, M. (2007), <i>Black on the Block:&nbsp; The Politics of Race and Class in the City,<\/i> Chicago, University of Chicago Press<\/p><p>Robinson, J. (2005), <i>Ordinary Cities<\/i>, London, Routledge<\/p><p>Sassen, S. (2001) The Global City: New York, London, Tokyo Princeton Princeton University Press, 2nd ed.&nbsp;<\/p><p>Storper, M., (2013), <i>Keys to the city,<\/i> Princeton, Princeton University Press<\/p><p>Simone A., 2004. <i>For the City Yet to Come: Changing Urban Life in Four African Cities<\/i>. Duke University Press.&nbsp;<\/p><p>Sampson, R., (2012), <i>The Great American city<\/i>, Chicago, University of Chicago Press<\/p><p>Scott, A. J., and Soja, E. W. (eds.) (1996). <i>The City: Los Angeles and Urban Theory at the End of the Twentieth Century<\/i>. Berkeley: University of California Press.&nbsp;<\/p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p><p>Savage, M and al.., (2005), <i>Globalisation and belonging<\/i>, London, Sage.<\/p><p>Zhang, L., (2010),&nbsp;In search of paradise, middle class living in Chinese metropolis,&nbsp;Cornell, Cornell University Press<br><\/p>","estimatedClassWorkload":"2-3 hours\/week","recommendedBackground":"The course is designed for undergraduates but it also will interest graduates and professionals concerned in urban issues.","links":{}}