{
    "id": 755,
    "shortName": "nanosensors",
    "name": "Nanotechnology and Nanosensors",
    "language": "en",
    "shortDescription": "Learn about novel sensing tools that make use of nanotechnology to screen, detect and monitor various events in personal or professional life. Together, we will lay the groundwork for infinite innovative applications, starting from diagnosis and treatments of diseases, continuing with quality control of goods and environmental aspects, and ending with monitoring security issues. ",
    "aboutTheCourse": "<p>Nanotechnology and nanosensors are broad, interdisciplinary areas\nthat encompass (bio)chemistry, physics, biology, materials science, electrical\nengineering and more. The present course will provide a survey on some of the\nfundamental principles behind nanotechnology and nanomaterials and their vital\nrole in novel sensing properties and applications. The course will discuss interesting interdisciplinary\nscientific and engineering knowledge at the nanoscale to understand fundamental\nphysical differences at the nanosensors. By the end of the course, students\nwill understand the fabrication, characterization, and manipulation of\nnanomaterials, nanosensors, and how they can be exploited for new applications.\nAlso, students will apply their knowledge of nanotechnology and nanosensors to\na topic of personal interest in this course.<\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<p><b>Week 1: Introduction to Nanotechnology:<\/b>\nDefinition of nanotechnology; main features of nanomaterials; types of\nnanostructures (0D, 1D, and 2D structures); nanocomposites; and main\nchemical\/physical\/electrical\/optical properties of nanomaterials.<\/p>\n\n<p><b>Week 2: Introduction to Nanotechnology - continue:<\/b>\nMethods for characterizing the nanomaterials: Atomic Force Microscopy (AFM),\nScanning Electron Microscopy (SEM), Transmission Electron Microscopy (TEM), and\nspectroscopy- and spectrometry-based surface analysis techniques. Fabrication\nof sensors by bottom-up and top-down approaches; self-assembly of\nnanostructures; and examples for nanotechnology application<\/p>\n\n<p><b>Week 3: Introduction to Sensors' Science and Technology:<\/b>\nDefinition of sensors; main elements of sensors; similarities between living\norganisms and artificial sensors; working mechanism of physical sensation\n(seeing, hearing, and feeling) and chemical sensation (smelling and tasting); the\nparameters used for characterizing the performance of sensors: accuracy,\nprecision, sensitivity, detection limit, dynamic range, selectivity, linearity,\nresolution, response time, hysteresis, and life cycle.<\/p>\n\n<p><b>Week 4: Metal nanoparticle-based Sensors:<\/b>\nDefinition of nanoparticle; features of nanoparticles; and production of\nnanoparticles by physical approach (laser ablation) and chemical approaches\n(Brust method, seed-mediated growth, etc.).<\/p>\n\n<p><b>Week 5: Quantum Dot Sensors: <\/b>Definition of\nquantum dot; fabrication techniques of quantum dots; Macroscopic and\nmicroscopic photoluminescence measurements; applications of quantum dots as\nmultimodal contrast agents in bioimaging; and application of quantum dots as\nbiosensors.<\/p>\n\n<p><b>Week 6:<\/b><span> <b>Nanowire-based Sensors:<\/b> Definition of nanowires; features\nof nanowires; fabrication of individual nanowire by top-down approaches and\nbottom-up approaches; and fabrication of nanowire arrays (fluidic channel,\nblown bubble film, contact printing, spray coating, etc.).<\/span><\/p>\n\n<p><b>Week 7:<\/b><span> <b>Carbon Nanotubes-based Sensors:<\/b> Definition of carbon\nnanotube; features of carbon nanotubes; synthesis of carbon nanotubes;\nfabrication and working principles of sensors based on individual carbon\nnanotube; fabrication and working principles of sensors based on random array\nof carbon nanotubes.<\/span><\/p>\n\n<p><b>Week 8: Sensors Based on Nanostructures of Metal Oxide: <\/b>Synthesis\nof metal oxide structures by dry and wet methods; types of metal oxide gas\nsensors (0D, 1D, and 2D); defect chemistry of the metal oxide sensors; sensing\nmechanism of metal-oxide gas sensors; and porous metal-oxide structures for\nimproved sensing applications. <\/p>\n\n<p><b>Week 9: Mass-Sensitive Nanosensors<\/b>: Working\nprinciple of sensors based on polymeric nanostructures; sensing mechanism and\napplications of nanomaterial-based of chemiresistors and field effect\ntransistors of (semi-)conductive polymers, w\/o inorganic materials.<\/p>\n\n<p><b>Week 10: Arrays of Nanomaterial-based Sensors: <\/b>A\nrepresentative example for the imitation of human senses by means of nanotechnology\nand nanosensors: electronic skin based on nanotechnology.<\/p>",
    "estimatedClassWorkload": "6-10 hours\/week",
    "recommendedBackground": "<p>Any\nbackground is science (chemistry, biology, physics), technology and\/or engineering would fit the course.<\/p>",
    "links": {

    }
}