{"id":121,"shortName":"dsp","name":"Digital Signal Processing","language":"en","shortDescription":"Learn the fundamentals of digital signal processing theory and discover the myriad ways DSP makes everyday life more productive and fun.","aboutTheCourse":"The goal of the course is to develop a complete working set of digital signal processing notions from the ground up. DSP is arguably at the heart of the “digital revolution” that, in the space of just a few decades, has enabled unprecedented levels of interpersonal communication and of information availability. <br><br> In the class, starting from the basic definitions of a discrete-time signal, we will work our way through Fourier analysis, filter design, sampling, interpolation and quantization to build a DSP toolset complete enough to analyze a practical communication system in detail. Hands-on examples and demonstration will be routinely used to close the gap between theory and practice.","targetAudience":1,"courseSyllabus":"Broad outline of the topics covered in the class: <br>\n\n\n\n\n\n\n\n<ol><li>Introduction: What is signal processing, history of the topic, application examples.<\/li><li>Discrete-time (DT) signals: the discrete-time complex exponential, and a computer music synthesis example.<\/li><li>Euclid and Hilbert: Signal processing as geometry, vectors spaces, bases, approximations.<\/li><li>Fourier Analysis: The discrete Fourier transform (DFT) and series (DFS). The discrete-time Fourier transform (DTFT). Examples. The fast Fourier transform algorithm (FFT).<\/li><li>Linear Filters: Linear time-invariant systems, convolution, ideal and realizable filters. Filter design and implementation, examples.<\/li><li>Interpolation and Sampling: Continuous-time (CT) signals, interpolation, sampling. The sampling theorem as orthonormal basis expansion. Processing of CT signals in DT.<\/li><li>Stochastic Signal Processing and Quantization: Stochastic signals, quantization, analog-to-digital (ADC) and digital-to-analog (DAC) conversion.<\/li><li>Image Processing: Introduction to image processing and two-dimensional (2D) Fourier analysis. Filtering and compression. The JPEG compression standard.<\/li><li>Digital Communication Systems: Analog channels and bandwidth\/power constraints. Modulation and demodulation. Transmitter and receiver design. ADSL.<\/li><\/ol>","courseFormat":"<p>The class will consist of video lectures, each approximately 45 minutes in length; videos will contain some interactive quiz questions. Students are encouraged to implement many of the course topics in the programming language of their choice; worked out examples in Python will be provided on a weekly basis. The final grade will be based on the students' performance in weekly homework sets, which will include applied coding problems.<\/p>","suggestedReadings":"A companion textbook is available both in printed format and electronically on the web (free of charge). Please refer to <a href=\"http:\/\/www.sp4comm.org\" target=\"_blank\">www.sp4comm.org<\/a> for details. Many more bibliographical references can be found in the textbook.","instructor":"Paolo Prandoni and Martin Vetterli","estimatedClassWorkload":"8-10 hours\/week","recommendedBackground":"Fundamentals of linear algebra and calculus are a must. Familiarity with probability theory and system theory are highly recommended. Familiarity with Matlab (or equivalent) and\/or scientific programming are a plus.","links":{}}