{"id":2388,"shortName":"virtualshakespeare","name":" Shakespeare in Community","language":"en","shortDescription":"Shakespeare in Community will introduce a broad audience of learners to Shakespeare, as we collectively read, watch, and engage four plays: Romeo and Juliet, A Midsummer Night’s Dream, Much Ado About Nothing, and The Tempest.","aboutTheCourse":"Shakespeare in Community&nbsp;begins as a Massive Open Online Course but it is also a massive public digital humanities event. The course will introduce a broad audience of learners to Shakespeare, as we collectively read, watch, and engage four Shakespeare plays: Romeo and Juliet, A Midsummer Night’s Dream,&nbsp;Much Ado About Nothing,&nbsp;and The Tempest.<br><br>Shakespeare’s Hamlet begins with the curious and provocative line, “Who’s there?,” and these are the words that will begin our course. The line is both a literal question to the audience and a deeper question about what it means to be human. The question takes on a different set of potential meanings when it is read on the screen of a computer, iPad, smart phone, or within a MOOC, asking contemporary readers of Shakespeare to consider how their humanity is changing in the face of rapid technological changes. The goal of this&nbsp;Shakespeare in Community&nbsp;course,&nbsp;then, will be to discover Shakespeare while also considering together what it is for us to discover and un-cover Shakespeare in the digital age.<br><br>Ultimately, this course will be focused on building a global community around the study of Shakespeare. And so one of our central goals will be to use Shakespeare’s plays as an occasion for creating important conversations that bridge cultures, languages, and geographies. Students in the course will also increase their digital literacies, learning new tools for reading, writing, critical analysis, and collaboration. The course will be both about Shakespeare and also about the digital humanities, encouraging learners to think critically about how digital tools (including MOOCs) can be used to investigate literary texts.<br><br>While the primary instructors have 60+ years of experience teaching Shakespeare among us, we will not be serving as talking head “experts” in this course. Rather, the course will bring together a broad range of experts at UW-Madison, within the Madison theater communities, from the Folger Shakespeare Library, and around the world. Launching each week of the course will be a series of short documentaries, but the heart of the course will be the community we build among the participants. Our goal is not to teach you what we know about Shakespeare, but to help each of you find your Shakespeare.<br><br>Some stuff you can do right now to get started:&nbsp;<br><ul><li>Follow <a href=\"http:\/\/twitter.com\/hackshakespeare\" target=\"_blank\">@hackshakespeare<\/a> on Twitter.&nbsp;<br><\/li><li>Join our&nbsp;<a href=\"https:\/\/www.facebook.com\/groups\/hackshakespeare\/\" target=\"_blank\">Facebook group<\/a>.&nbsp;<br><\/li><li><a href=\"https:\/\/youtu.be\/-MHgoqmoflc\" target=\"_blank\">Watch the second preview<\/a>.<\/li><li>And <a href=\"https:\/\/www.youtube.com\/playlist?list=PLK7f2NlWMXYDRfV2fDTyjgx8hbh75dEnn\" target=\"_blank\">browse the YouTube Playlist with all the videos produced for the MOOC<\/a>.<\/li><\/ul>Finally, the instructors will be gathering together with some participants from the course and also some new friends for an educational travel experience in Spring Green, WI in September of 2015. <a href=\"http:\/\/continuingstudies.wisc.edu\/classes\/shakespearience-weekend\" target=\"_blank\" title=\"Link: http:\/\/continuingstudies.wisc.edu\/classes\/shakespearience-weekend\">Click here for more details about the Shakesperience Weekend.<\/a>","targetAudience":3,"courseSyllabus":"","courseFormat":"The primary instructors will be joined by a handful of additional instructors, who will contribute video and text lectures, as well as visit the course for one or more weeks, including James DeVita, Joshua Calhoun, Eric Alexander, and Sean Michael Morris. We will also be joined by over 70 additional teachers, learners, actors, and more who we'll be featuring in the short films being made for the course.<br><br>Image:&nbsp;\"<a href=\"http:\/\/luna.folger.edu\/luna\/servlet\/detail\/FOLGERCM1~6~6~40370~102858:The-Globe-Playhouse,-1599-1613--A-c?sort=Call_Number%2CAuthor%2CCD_Title#\" target=\"_blank\" title=\"Link: http:\/\/luna.folger.edu\/luna\/servlet\/detail\/FOLGERCM1~6~6~40370~102858:The-Globe-Playhouse,-1599-1613--A-c?sort=Call_Number%2CAuthor%2CCD_Title#\">Conjectural reconstruction of the Globe theatre by C. Walter Hodges based on archeological and documentary evidence<\/a>\", 1958 by C. Walter Hodges and the&nbsp;<a href=\"http:\/\/www.folger.edu\/Content\/Collection\/Digital-Image-Collection\/\" target=\"_blank\">Folger Shakespeare Library<\/a>&nbsp;is licensed under&nbsp;<a href=\"http:\/\/creativecommons.org\/licenses\/by-sa\/4.0\/deed.en\" target=\"_blank\" title=\"Link: http:\/\/creativecommons.org\/licenses\/by-sa\/4.0\/deed.en\">CC Attribution-Share Alike 4.0 International license<\/a>. \/ Cropped and edited from original.<br>","suggestedReadings":"Free open-access editions of the four plays we'll be focusing on are available online at <a href=\"http:\/\/www.folgerdigitaltexts.org\" target=\"_blank\">folgerdigitaltexts.org<\/a>. You can download a PDF to read on an e-reader, read in HTML format on your laptop, or you can also buy the texts if you prefer to read them in a print edition. (This is also the order that we'll be discussing the plays.)<br><br><strong>Free Online Versions:<\/strong><br><a href=\"http:\/\/www.folgerdigitaltexts.org\/?chapter=5&amp;play=Rom&amp;loc=p7\" target=\"_blank\">Romeo and Juliet<\/a> [<a href=\"http:\/\/www.folgerdigitaltexts.org\/html\/Rom.html\" target=\"_blank\">html<\/a>] [<a href=\"http:\/\/www.folgerdigitaltexts.org\/PDF\/Rom.pdf\" target=\"_blank\">pdf<\/a>]<br><a href=\"http:\/\/www.folgerdigitaltexts.org\/?chapter=5&amp;play=MND&amp;loc=p7\" target=\"_blank\">A Midsummer Night's Dream<\/a> [<a href=\"http:\/\/www.folgerdigitaltexts.org\/html\/MND.html\" target=\"_blank\">html<\/a>] [<a href=\"http:\/\/www.folgerdigitaltexts.org\/PDF\/MND.pdf\" target=\"_blank\">pdf<\/a>]<br><a href=\"http:\/\/www.folgerdigitaltexts.org\/?chapter=5&amp;play=Ado&amp;loc=p7\" target=\"_blank\">Much Ado About Nothing<\/a> [<a href=\"http:\/\/www.folgerdigitaltexts.org\/html\/Ado.html\" target=\"_blank\">html<\/a>] [<a href=\"http:\/\/www.folgerdigitaltexts.org\/PDF\/Ado.pdf\" target=\"_blank\">pdf<\/a>]<br><a href=\"http:\/\/www.folgerdigitaltexts.org\/?chapter=5&amp;play=Tmp&amp;loc=p7\" target=\"_blank\">The Tempest<\/a> [<a href=\"http:\/\/www.folgerdigitaltexts.org\/html\/Tmp.html\" target=\"_blank\">html<\/a>] [<a href=\"http:\/\/www.folgerdigitaltexts.org\/PDF\/Tmp.pdf\" target=\"_blank\">pdf<\/a>]<br><br><strong>Optional Print Editions:<\/strong><br><a href=\"http:\/\/shop.folger.edu\/store\/003501%21003\/Romeo+and+Juliet+Trade+Paperback\" target=\"_blank\">Romeo and Juliet<\/a><br><a href=\"http:\/\/shop.folger.edu\/store\/003502%21003\/A+Midsummer+Night%27s+Dream+Trade+Paper\" target=\"_blank\">A Midsummer Night's Dream<\/a><br><a href=\"http:\/\/shop.folger.edu\/store\/003507%21003\/Much+Ado+About+Nothing+Trade+Paperback\" target=\"_blank\">Much Ado About Nothing<\/a><br><a href=\"http:\/\/shop.folger.edu\/store\/003030%21003\/The+Tempest\" target=\"_blank\">The Tempest<\/a>","estimatedClassWorkload":"2-10 hours\/week","recommendedBackground":"","links":{}}