{"id":1386,"shortName":"intlhumanrightslaw","name":"International Human Rights Law: Prospects and Challenges","language":"en","shortDescription":"This course introduces the international and domestic laws, institutions, and legal and political theories that protect basic liberties of all human beings.  The course provides an overview of the internal law of human rights and the principal mechanisms and strategies for holding governments accountable for violating those rights.","aboutTheCourse":"<p>This course analyzes the international and\ndomestic laws and institutions that protect the fundamental rights of all human\nbeings. The course also describes and evaluates the principal mechanisms and\nstrategies for holding governments accountable for violating those rights.<\/p><p><span>\nStudents engage with thought-provoking issues that\narise at the intersection of human dignity, state sovereignty, and international\njustice.&nbsp; Cutting-edge topics include:\ngenocide and humanitarian intervention, the right to life and capital\npunishment, the right to health and HIV-AIDS, counterterrorism, and LGBT rights.&nbsp;\nStudents also learn about the international, regional and national mechanisms for\nmonitoring government conduct and redressing violations of human rights, such\nas United Nations political and expert bodies, international courts, domestic\ncriminal prosecutions, and truth commissions.<\/span><\/p>","targetAudience":0,"courseSyllabus":"<p>Week 1 – What are human rights?<\/p>\n\n<p>Week 2 – Which human rights are protected in international law?<\/p>\n\n<p>Week 3 – How are human rights implemented and enforced? – Global Mechanisms<\/p>\n\n<p>Week 4 – How are human rights implemented and enforced? – Regional Mechanisms<\/p>\n\n<p>Week 5 – How are human rights implemented and enforced? – National Mechanisms<\/p>\n\n<p>Week 6 – What are some current and future human rights challenges?\n<\/p>","courseFormat":"The course consists of videotaped lectures (4 to 7 each week) between 8 and 12 minutes each in length.  Each lecture includes a PowerPoint presentation, a short quiz, and a case study or problem to prompt student discussion in the online forums.  Some lectures may include news clips, field interviews in different countries, or conversations with human rights advocates.  A separate lecture on how to research international human rights law using open-access online resources will be provided.  The course concludes with a final exam composed of multiple choice, true-false and other objective questions.<br>","suggestedReadings":"<p>The course lectures will refer to the key texts of international human rights law (such as treaties and declarations), to the decisions of international and national courts, and to relevant news stories or video clips.  These materials are freely\n    available on the internet. <\/p>\n\n<p>Students interested in more detailed information and analysis may wish to consult:  Henkin, Cleveland, Helfer, Neuman and Orentlicher, Human Rights, University Casebook Series, 2d Edition, 2009, which is available for purchase <a href=\"http:\/\/www.amazon.com\/Human-Rights-University-Casebooks-Henkin\/dp\/1599412616\" title=\"Link: http:\/\/www.amazon.com\/Human-Rights-University-Casebooks-Henkin\/dp\/1599412616\">here<\/a>.\n    The August 2013 Supplement to this book is available for free download <a href=\"http:\/\/www.google.com\/url?sa=t&rct=j&q=&esrc=s&source=web&cd=4&ved=0CEoQFjAD&url=http%3A%2F%2Fwww.westacademic.com%2FFileDownload.aspx%3Fcategory%3DRD%26relatedinfotype%3DUpdate%2BMemo%2B-%2BUnsecured%26productid%3D138725%26filename%3D138725_2013207_95631.pdf%26basepath%3D%255Cepic_docs%255C%26tab%3D2&ei=Pom8Uo7eOebgsATIi4GADQ&usg=AFQjCNFQwIrSdmY5CcVm_A8zF2YnjR0xFA&sig2=6QrYQAo0RLOLkq8VJyL51Q&bvm=bv.58187178,d.cWc&cad=rja\" title=\"Link: http:\/\/www.google.com\/url?sa=t&rct=j&q=&esrc=s&source=web&cd=4&ved=0CEoQFjAD&url=http%3A%2F%2Fwww.westacademic.com%2FFileDownload.aspx%3Fcategory%3DRD%26relatedinfotype%3DUpdate%2BMemo%2B-%2BUnsecured%26productid%3D138725%26filename%3D138725_2013207_95631.pdf%26basepath%3D%255Cepic_docs%255C%26tab%3D2&ei=Pom8Uo7eOebgsATIi4GADQ&usg=AFQjCNFQwIrSdmY5CcVm_A8zF2YnjR0xFA&sig2=6QrYQAo0RLOLkq8VJyL51Q&bvm=bv.58187178,d.cWc&cad=rja\">here<\/a>.<\/p>","estimatedClassWorkload":"5-10 hours\/week","recommendedBackground":"<p>This course is a modified version of the international human rights law course that I offer at Duke University School of Law.  It is intended for anyone interested in learning about human rights, including undergraduate and graduate and professional\n    students. No prior knowledge of law, international relations or human rights is required, although the course will be of interest to those who have studied or worked in these areas.<\/p>","links":{}}