{
    "id": 1178,
    "shortName": "sustainablefood",
    "name": "Sustainable Food Production Through Livestock Health Management",
    "language": "en",
    "shortDescription": "Learn about the impact of infectious disease on sustainable animal-based food production by understanding the science of growth, immunity, and infection and by learning the problem-solving skills needed to advance animal health and food production through optimal management practices.",
    "aboutTheCourse": "<p>There is a growing global need in agricultural production for a workforce that is capable of integrating knowledge of animal health and production with an understanding of consumer preferences in the context of economic reality, business efficiency, and\nethical constraint.&nbsp; However, current evidence suggests that there is a growing shortage of people with the knowledge and problem-solving skills required to match the rapid advances being made in animal health, science, and food production.&nbsp;\nThe results of this shortage are wide-ranging and could lead to challenges in food security and agricultural economic competitiveness in some countries.<\/p><p>In this course we will explore the effect of infectious disease on sustainable animal-based food production. The content and learning outcomes of this new course will be designed to be relevant across different food production sectors (i.e., beef, dairy, poultry,\n    and pigs). While the instructors will provide the participants with a strong scientific base for understanding the impact of infectious disease in animal-based food production, the emphasis of the material will be on practical problem-solving and\nwill be    directed towards equipping participants with a platform for developing the skills needed to contribute to sustainable food production.<\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<p><strong>Week 1: <\/strong>How does livestock disease impact the affordability and\nsustainability of food production?<\/p>\n<p><strong>Week 2: <\/strong>What causes infectious disease in animals?<\/p>\n<p><strong>Week 3: <\/strong>How does the host respond to infectious disease?<\/p>\n<p><strong>Week 4: <\/strong>What is the impact of caregivers, the environment, and management\nsystems on host response and disease transmission?<\/p>\n<p><strong>Week 5: <\/strong>How do infectious diseases behave in production animal\npopulations?<\/p>\n<p><strong>Week 6: <\/strong>How do pathogens, animal management practices, and cultural norms influence human health?<\/p>",
    "estimatedClassWorkload": "7-9 hours\/week",
    "recommendedBackground": "Some understanding of the following will help maximize your learning experience:<br><ul><li>Basic mammalian biology<\/li><li>Rudimentary microbiology<\/li><li>Fundamentals of immunology<\/li><li>Livestock husbandry<\/li><li>Animal production cycles<\/li><\/ul>",
    "links": {

    }
}