{
    "id": 684,
    "shortName": "moralities",
    "name": "Moralities of Everyday Life",
    "language": "en",
    "shortDescription": "How can we explain kindness and cruelty? Where does our sense of right and wrong come from? Why do people so often disagree about moral issues? This course explores the psychological foundations of our moral lives. ",
    "aboutTheCourse": "<p>How is it that we are capable of transcendent kindness—and\nunspeakable cruelty? How do we make sense of people’s strongly-held opinions\nabout abortion, gay marriage, affirmative action, and torture? How do\nevolution, culture, and religion conspire to shape our moral natures?<\/p>\n\n<p>These are among the most important—and most exciting—questions\naround, and they are the focus of this course. We will explore the modern\nscience of moral belief and moral action, drawing upon disciplines such as\ncognitive science, neuroscience, economics, and philosophy. We will look at\nresearch from the lab, from the community, and from the battlefield; we will\ndiscuss babies, monkeys, and psychopaths; we will debate claims about moral\ndifferences between men and women, liberals and conservatives, Christians and\nMuslims. This course will cover prejudice and bigotry, sexuality and purity; punishment,\nrevenge, and forgiveness; and much much more.&nbsp;<\/p><p>\n\n\n\n\n\n\n\n<\/p><p>As a preview, we have uploaded the introductory lecture to YouTube, which you can view here: <a href=\"http:\/\/youtu.be\/1jUd72Dmd_A\">http:\/\/youtu.be\/1jUd72Dmd_A<\/a><\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<i><br><\/i>\n\n<b>Week 1: The Big Questions<br><\/b>What\nis morality, anyway? What are the big debates in the field of moral psychology?<p><\/p>\n<p><b>Week 2: Compassion<\/b>\n\n    <br>Where does concern for others come from? How is it related to empathy—and is more empathy necessarily\n    a good thing? And what can we learn from the study of those who seemingly\n    lack normal moral feelings, such as violent psychopaths?<\/p>\n<p><b>Week 3: Origins of Morality<\/b>\n\n    <br>Here, we ask about which aspects of morality are universal. We discuss\n    evolution, cross-cultural research, and the fascinating new\n    science of the moral life of babies.<\/p><p><b>Week 4: Differences<\/b>&nbsp;<br>How does culture influence our moral thought and moral action? What role does religion play? Why are some of us conservative and others liberal, and how do political differences influence our sense of right and wrong?<\/p>\n<p><b>Week 5: Family, friends, and strangers\n<\/b> \n    <br>Our moral feelings are usually most powerful towards our kin (such as\n    our parents and our children) and our friends and allies. We will discuss\n    these special bonds, and then turn to the morality of racial and ethnic bias. Then we use the tools of behavioral economics to explore\n    the controversial question of whether we are ever truly altruistic to strangers.<\/p>\n<p><b>Week 6: The Big Answers&nbsp;<\/b> \n    <br>We’ll discuss some clever studies that show how our moral behavior is\n    powerfully influenced—often at the unconscious level—by the situations\n    that we find ourselves in. Such findings raise some hard problems about\n    determinism, free will, and moral responsibility. Most of all, if our actions\n    are determined by our brains, our genes, and our situations, in what sense\n    can we be said to be moral agents? The course will end by trying to address\n    this question.&nbsp;<\/p>",
    "estimatedClassWorkload": "6-14 hours\/week",
    "recommendedBackground": "",
    "links": {

    }
}