{
    "id": 124,
    "shortName": "maththink",
    "name": "Introduction to Mathematical Thinking",
    "language": "en",
    "shortDescription": "Learn how to think the way mathematicians do - a powerful cognitive process developed over thousands of years.",
    "aboutTheCourse": "<div><b><i>NOTE: For the Fall 2015 session, the course website will go live at 10:00 AM US-PST on Saturday September 19, two days before the course begins,&nbsp;so you have time to familiarize yourself with the website structure, watch some short introductory videos,&nbsp;and look at some preliminary material.<br><br><\/i><\/b>The goal of the course is to help you develop a valuable mental ability – a powerful way of thinking that our ancestors have developed over three thousand years.<\/div>\n<div>&nbsp;<\/div>\n<div>Mathematical thinking is not the same as doing mathematics – at least not as mathematics is typically presented in our school system. School math typically focuses on learning procedures to solve highly stereotyped problems. Professional mathematicians think a certain way to solve real problems, problems that can arise from the everyday world, or from science, or from within mathematics itself. The key to success in school math is to learn to think inside-the-box. In contrast, a key feature of mathematical thinking is thinking outside-the-box – a valuable ability in today’s world. This course helps to develop that crucial way of thinking.<\/div>\n<div>&nbsp;<br>The course is offered in two versions. The eight-week-long Basic Course is designed for people who want to develop or improve mathematics-based, analytic thinking for professional or general life purposes. The ten-week-long Extended Course is aimed primarily at&nbsp;first-year students at college or university who are thinking of majoring in mathematics or a mathematically-dependent subject, or high school seniors who have such a college career in mind. The final two weeks are more intensive and require more mathematical background than the Basic Course. There is no need to make a formal election between the two. Simply skip or drop out of the final two weeks if you decide you want to complete only the Basic Course.<\/div><div><br><b>Subtitles for all video lectures available in<\/b>: Portuguese&nbsp;(provided by&nbsp;<a href=\"http:\/\/www.fundacaolemann.org.br\/\" target=\"_blank\">The Lemann Foundation<\/a>), English<br><\/div>",
    "targetAudience": 0,
    "courseSyllabus": "<div>Instructor’s welcome and introduction<\/div>\n<div> 1.  Introductory material<\/div>\n<div> 2.  Analysis of language – the logical combinators<\/div>\n<div> 3.  Analysis of language – implication<\/div>\n<div> 4.  Analysis of language – equivalence<\/div>\n<div> 5.  Analysis of language – quantifiers<\/div>\n<div> 6.  Working with quantifiers<\/div>\n<div> 7.  Proofs<\/div>\n<div> 8.  Proofs involving quantifiers<\/div>\n<div> 9.  Elements of number theory<br>10.  Beginning real analysis<\/div>",
    "estimatedClassWorkload": "8-10 hours\/week",
    "recommendedBackground": "High school mathematics. Specific requirements are familiarity with elementary symbolic algebra, the concept of a number system (in particular, the characteristics of, and distinctions between, the natural numbers, the integers, the rational numbers, and the real numbers), and some elementary set theory (including inequalities and intervals of the real line). Students whose familiarity with these topics is somewhat rusty typically find that with a little extra effort they can pick up what is required along the way. The only heavy use of these topics is in the (optional) final two weeks of the Extended Course.<br><br>A good way to assess if your <i>basic<\/i> school background is adequate (even if currently rusty) is to glance at the topics in the book <a href=\"http:\/\/www.nap.edu\/catalog.php?record_id=9822\" target=\"_blank\" title=\"Link: http:\/\/www.nap.edu\/catalog.php?record_id=9822\">Adding It Up: Helping Children Learn Mathematics<\/a> (free download), published by the US National Academies Press in 2001. Though aimed at K-8 mathematics teachers and teacher educators, it provides an excellent coverage of what constitutes a good basic mathematics education for life in the Twenty-First Century (which was the National Academies' aim in producing it).",
    "links": {

    }
}