{
    "id": 1367,
    "shortName": "chronicpain",
    "name": "Preventing Chronic Pain: A Human Systems Approach",
    "language": "en",
    "shortDescription": "Chronic pain is at epidemic levels and has become the highest-cost condition in health care. This course uses evidence-based science with creative and experiential learning to better understand chronic pain conditions and how they can be prevented through self-management in our cognitive, behavioral, physical, emotional, spiritual, social, and environmental realms.",
    "aboutTheCourse": "<span><p>Chronic musculoskeletal pain (including head, neck, and back pain) is a significant cause of suffering, disability, and health care in the world. Care for chronic pain often involves surgery, multiple medications (including opioids), endless physical and chiropractic therapy, injections, implanted devices, and other passive treatments-- making it the highest cost condition in health care. The burden upon individuals in terms of ongoing pain and suffering is incalculable.<\/p><p>Consider an alternative. By using a human systems approach, we can better understand how individual risk factors in the cognitive, behavioral, physical, emotional, spiritual, social, and environmental realms of our lives can interact to perpetuate chronic pain and, if improved, can prevent it. &nbsp;<\/p><p>During this course, you will: Identify the problems of our health care system in dealing with chronic pain. Review the diagnosis, mechanisms, and etiology of chronic pain conditions. Explore specific risk factors that can contribute to chronic pain. Learn how a human systems approach can be applied through evidence-based self-management strategies to prevent chronic pain. Experience active strategies designed to enhance the protective factors that can transform our own lives, and those of our patients, to one of health and wellness.<\/p><p>This course was first offered in 2014.&nbsp;The course evaluations were carefully reviewed and the course was modified to improve its quality. Overall, 91%\nof participants believed the overall\nexperience was satisfying, 92%\nbelieved it met\nthe\nobjectives, 93%\nbelieved that it made\na\ndifference in their life, and 85% believed that it\nmade\na\ndifference in the care of\npatients. <br><\/p><p>Selected comments from participants included;&nbsp;\"This course is one of the most generous offerings that I have ever\nencountered. There is so much life-changing,\nlife-affirming information available at no charge, to anyone who wants it,\nis rare and amazing. I am VERY grateful\nfor it.\" “The learning experience has been tremendous!!&nbsp;Everyone\nshould have this knowledge, especially those in the health profession.” \"I loved this class and want to take it again!\"\n\n\n\n“Absolutely\nfascinating and enlightening…This information should be part of every health\ncare educational program!” “This course has really helped me to understand\nmyself better and why I think, act and see the world as I do.” “I am eternally\ngrateful for taking the time and energy to provide this beacon of knowledge to\nthe world.” “I think this course is a wonderful gift, because pain is an avoidable\npart of our life. I have learned so many things.”<\/p><p>We hope you enjoy the course and, of course, learn how to prevent chronic pain.<br><\/p><\/span><br><br>",
    "targetAudience": 0,
    "courseSyllabus": "<span><p><b>Part &nbsp;A: &nbsp;Putting chronic pain in context<\/b><\/p><p><\/p><ul><li>Introduction to the course<\/li><li>The health care dilemma of chronic pain<br><\/li><li>The personal impact of chronic pain<br><\/li><li>The balance between health and illness<br><\/li><\/ul><p><\/p><p> <\/p><p><b>Part B: Tracing the mechanisms of pain<\/b><\/p><p><\/p><ul><li>Myofascial pain<br><\/li><li>Headache<br><\/li><li>Fibromyalgia<\/li><li>Arthritis<\/li><li>Temporomandibular and orofacial pain<br><\/li><li>Current concepts of chronic pain mechanisms<br><\/li><\/ul><p><\/p><p> <\/p><p><b>Part C: Preventing pain in the 7 realms of daily life<\/b><\/p><p><\/p><ul><li>Resilience, self-efficacy, &amp; expectation<br><\/li><li>Exercise, posture, &amp; reducing physical strain<br><\/li><li>Positive relationships &amp; social support<br><\/li><li>Creating safe and protective environments<br><\/li><li>Managing emotional challenges<br><\/li><li>Diet, sleep, &amp; energy<br><\/li><li>Gaining insight, hope, &amp; purpose<br><\/li><\/ul><p><\/p><p> <\/p><p><b>Part D: Bringing it all together to help the patient<br><\/b><\/p><ul><li>The patient’s story: foundations for clinical reasoning<br><\/li><li>Implementing transformative health care<\/li><li>Improving the health care system<\/li><\/ul><\/span>",
    "estimatedClassWorkload": "2-4 hours\/week",
    "recommendedBackground": "No background is required; all are welcome!<em><\/em>",
    "links": {

    }
}