{"id":1338,"shortName":"shaping2paths","name":"Shaping the Way We Teach English, 2: Paths to Success in ELT","language":"en","shortDescription":"Learn effective approaches to English language teaching. This is the second of two teacher training courses based on the internationally-recognized Shaping the Way We Teach English videos and resources and sponsored by the U.S. Department of State and the University of Oregon. You can begin with either course. \n\nThe next Paths course will be November 9-December 14, 2015.","aboutTheCourse":"<p>This course is aimed at English as a Foreign Language (EFL) teachers,\n both those who are intending to pursue this field as a career and those\n already working in the field who would like to revise and refresh their\n methods and approaches. The materials and approaches presented should \ncomplement college courses such as Introduction to TEFL\/TESOL Methods.<\/p><p>This five-week course explores important aspects \nof teaching English as a second or foreign language. The goal of this \ncourse is to help you become a better teacher. By the end of this \ncourse, you should be able to explain how the various materials and \napproaches presented will lead to better language learning; you will be \nable to choose appropriate materials and apply varied classroom \nactivities to improve your students’ study of English. You will also\n be able to better evaluate both your own and other teachers’ practices.<\/p><p>This is the second of the two-part Shaping the Way We Teach English series. The first part is the <a target=\"_blank\" href=\"https:\/\/www.coursera.org\/course\/shaping1landscape\">Landscape of English Language Teaching<\/a>. You can begin with either course.<br><\/p><br>","targetAudience":1,"courseSyllabus":"<p>Topics for Paths to Success in English Language Teaching include:<\/p><ul><li><p>Week 1: Integrating skills and using tasks to motivate learners; project overview, introductions <\/p><\/li><li><p>Week 2: Alternative assessment that shows what learners can do with language; lesson plan phase 1 is due<\/p><\/li><li><p>Week 3: Incorporating individual learning differences in instruction; peer and self-evaluations are due<\/p><\/li><li><p>Week 4: Ideas for effective classroom management; final lesson plan is due<\/p><\/li><li><p>Week 5: Improving practice with reflective teaching; final peer and self-evaluations are due<\/p><\/li><\/ul><br>","courseFormat":"<p>This\n is a collaborative course, where you enhance your English language \nteaching expertise by sharing ideas with others. The basis of this \ndiscussion will be a short video and reading each week. The videos are of master teachers in real \nclasses around the world, providing a look into the international \ncommunity of EFL teachers. Closed captioning helps you understand what the teachers\n and students are saying. <\/p><p>Each week, a reading on methods and teaching practices, written by teachers for\n teachers, adds perspective to the classroom \nvideos. To\n share ideas about each week’s topics with others, you are invited to \njoin discussion forums. In the discussions, you can contribute to the \ndialogue: Find out what other teachers do in their classes, ask \nquestions, share and gain insights into classroom practice. These \ndiscussions will also help you formulate the culminating project.<\/p>For\n the culminating project, you will write a lesson plan incorporating \nsome of the ideas from your readings, videos, and \nconversations with others. The project will build over the 5 weeks of \nthe course, resulting in a practical, well-designed lesson that will \ndemonstrate an understanding of the course material, and be truly \nmeaningful for your students. As part of the project, you will read \nothers’ lesson plans and offer constructive criticism. This peer \nreviewing activity will heighten \nyour awareness of others’ assumptions about teaching and give you a \nwindow into how English learning proceeds in other cultures. With the \npeer reviews, you will also build a repertoire of completed lessons to \nshare and experiment with. <br><p>As you watch and read and discuss, we hope you’ll build your \ncreativity and flexibility as a teacher. The videos, readings, and \ndiscussion will give you plenty of food for thought, and help you answer\n these questions: <\/p><ul><li><p>How could this be adapted to my own classroom?<\/p><\/li><\/ul><ul><li><p>How could this be adapted to my own students and culture?<\/p><\/li><li><p>How could this be adapted to different materials and objectives?<\/p><\/li><\/ul>","suggestedReadings":"Please refer to the detailed syllabus for each week for required and optional readings and media.<br>","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"Previous or current language teaching experience is desirable, but not necessary to take this course.<br>","links":{}}