{
    "id": 383,
    "shortName": "globalfoodsystems",
    "name": "Sustainability of Food Systems: A Global Life Cycle Perspective",
    "language": "en",
    "shortDescription": "This course explores the diversity of the foods we eat, the ways in which we grow, process, distribute, and prepare them, and the impacts they have upon our environment, health, and society. We will also examine the challenges and opportunities of creating a more sustainable global food system in the future.",
    "aboutTheCourse": "Hamburger or hummus? Organic or conventional? Mediterranean&nbsp;diet or&nbsp;McDonald's? What dietary choices are truly the most sustainable when&nbsp;we consider that what we eat affects not just our health but also the&nbsp;environment and the well-being of others?<br><br>This course will provide you with an overview of our world’s&nbsp;food system&nbsp;and its many impacts from the individual to the global scale. You&nbsp;will&nbsp;gain further appreciation of the complex implications of&nbsp;choices that are made&nbsp;along the food&nbsp;supply chain. You&nbsp;will be challenged to think critically about how the&nbsp;global food system may&nbsp;need to change to adapt to future economic&nbsp;and environmental conditions.<br><br>Our world’s population is projected to grow both in numbers and in wealth in the coming decades. Meeting future food demand, and doing so in a sustainable fashion, will require that we greatly increase the amount&nbsp;we produce and improve the efficiency by which it makes it to our tables.&nbsp;Join us as we explore today’s global food system and how we might improve its sustainability for our benefit and that of future generations.<br>",
    "targetAudience": 0,
    "courseSyllabus": "This course is organized around fifteen questions that span our world's food system, its impacts, and its future.<br><br><ol><li>What&nbsp;is food?<\/li><li>What&nbsp;foods do we eat?<\/li><li>How&nbsp;and where did our food originate?<br><\/li><li>How&nbsp;and where do we grow our food?<br><\/li><li>How do&nbsp;we facilitate the trade and transfer of our food?<br><\/li><li>How do&nbsp;we process and distribute our food?<br><\/li><li>How do&nbsp;we prepare our food?<br><\/li><li>How do&nbsp;we choose what to eat?<\/li><li>How do&nbsp;we assess the sustainability of the global food system?<\/li><li>How&nbsp;does what we eat affect our health?<br><\/li><li>How&nbsp;does what we eat affect our environment?<br><\/li><li>How&nbsp;much food will we need in the future?<br><\/li><li>What&nbsp;challenges do we face in reforming the global food system?<br><\/li><li>How&nbsp;can we provide more food more sustainably?<\/li><li>How can we each contribute to a more sustainable&nbsp;global food system?<br><\/li><\/ol>",
    "estimatedClassWorkload": "3-4 hours\/week",
    "recommendedBackground": "No background is required.",
    "links": {}
}