{"id":3421,"shortName":"fmri1","name":"Principles of fMRI 1","language":"en","shortDescription":"This course covers the design, acquisition, and analysis of Functional Magnetic Resonance Imaging (fMRI) data.","aboutTheCourse":"Functional Magnetic Resonance Imaging (fMRI) is the most widely used technique for investigating the living, functioning human brain as people perform tasks and experience mental states. It is a convergence point for multidisciplinary work from many disciplines. Psychologists, statisticians, physicists, computer scientists, neuroscientists, medical researchers, behavioral scientists, engineers, public health researchers, biologists, and others are coming together to advance our understanding of the human mind and brain.  In this course we provide an introduction to fMRI, including physics and acquisition, experimental design, analysis, and inferences about brain and mind.   We discuss both theoretical considerations and practical aspects of conducting fMRI studies, with an emphasis on statistical analysis.  The course is appropriate for scholars from all disciplines who want to learn more about fMRI, and for researchers engaged in fMRI studies.","targetAudience":1,"courseSyllabus":"<ul><li>fMRI Basics\n<\/li><li>Acquisition and Reconstruction\n<\/li><li>Physiology, signal, and noise\n<\/li><li>Experimental Design\n<\/li><li>Preprocessing\n<\/li><li>Statistical analysis: The General Linear Model\n<\/li><li>Group analysis and inference\n<\/li><li>Multiple comparisons\n<\/li><\/ul>","courseFormat":"Each module of the course consists of a series of short lectures followed by a quiz.","suggestedReadings":"The book “Principles of fMRI” by Wager &amp; Lindquist is recommended.","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"There are no prerequisites for this course, and it should be accessible to everyone interested in Functional Magnetic Resonance Imaging. &nbsp;For some portions, familiarity with research methods and statistics will be helpful.","links":{}}