{
    "id": 3077,
    "shortName": "ancientegypt",
    "name": "Ancient Egypt: A history in six objects",
    "language": "en",
    "shortDescription": "This course provides a general introduction to the history of ancient Egypt, based on six key items selected from the collections of The Manchester Museum.",
    "aboutTheCourse": "This course provides\nan introduction to ancient Egyptian history, using six items from the\ncollections of The Manchester Museum. These items have been carefully chosen to\nreflect the development of the dynastic age through their origin, manufacture,\ndecoration, and use. Week by week we will examine a different artefact and\nplace it in its social and historical context. This will allow us to journey\nfrom Predynastic Egypt and its first king, Narmer, to Greco-Roman Egypt and its\nfinal queen, Cleopatra.",
    "targetAudience": 0,
    "courseSyllabus": "<strong>Week 1: Predynastic and Early Dynastic Egypt\n<\/strong><br>As an introduction, you will learn a little about The Manchester Museum and its Egyptian collection and look at Egyptian geography. \n\nOur first examined artefact is a decorated Predynastic pot. This will lead you into a discussion of state formation, which includes a consideration of stone-working technologies and an introduction to the hieroglyphic script.<br><br><strong>Week 2: Old Kingdom Egypt<\/strong><br>In week 2, a ‘false door’ will open our discussion of tomb development in general, and the great Giza pyramids in particular. We will end this week by visiting the tomb of the local governor Ankhtifi and considering his important inscription.\n<br><br><strong>Week 3: Middle Kingdom Egypt<\/strong><br>This week you will meet the famous ‘spinning statue’ of the Manchester Museum. This will lead you into an exploration of aspects of daily life in ancient Egypt, including a visit to the pyramid-builders’ town of Kahun and an introduction to the intact tomb group belonging to the ‘Two Brothers’.<br><br><strong>Week 4: New Kingdom Egypt<\/strong><br>The study of a column recycled in the Ramesside Period in the fourth week will guide you into the age of wealth and empire. You will meet the soldier Ahmose, and the prominent royal women, Hatshepsut and Nefertiti. <br><br><strong>Week 5: Third Intermediate Period and Late Period Egypt<\/strong><br>In week 5 a cartonnage coffin will spark an exploration of the Egyptian approach to death towards the end of the dynastic period. We will read the myth of the healing goddess Isis and her resurrected husband Osiris, and examine burial customs and temple statues.<br><br><strong>Week 6: Greco-Roman Egypt<\/strong><br>This final week will start by examining a terracotta figure of the traditional Egyptian god Bes, who is now dressed like a Roman solder. With Egypt now heavily influenced by the wider Mediterranean world, we will consider the presentation and importance of both human and animal mummies. We will end our history by considering the evidence for the death of Egypt’s last queen, Cleopatra VII.\n<br><br>",
    "estimatedClassWorkload": "2-3 hours\/week",
    "recommendedBackground": "All are welcome –\nthose new to this area and those who have some prior knowledge of the history\nof ancient Egypt.",
    "links": {}
}