{"id":898,"shortName":"water","name":"Water Supply and Sanitation Policy in Developing Countries","language":"en","shortDescription":"This course will examine current conditions and trends in water and sanitation services in low and middle income countries. Within it we will take a critical look at the underlying political, economic, social, and technical reasons why almost a billion people lack access to improved water supplies and almost 2 billion still do not have improved sanitation services.","aboutTheCourse":"<p><span>This <b>first part of a two-part series of courses<\/b> critically examines\nthe consequences of current water and sanitation conditions, including over 2\nmillion deaths annually due to water-related diseases, millions of dollars in\navoidable health care expenditures, and billions of hours spent carrying water\nfrom sources outside the home. Reducing such costs associated with poor water\nand sanitation services is one of the major challenges for States in the low and middle income countries in the 21st century. The technologies to provide networked water\nand sanitation services are well-known, as are many low-cost, non-network\nsolutions that would appear affordable to many poor households in developing\ncountries. For decades the international community and national governments\nhave struggled to find institutional and financial arrangements to provide\nthese technologies to households and businesses in developing countries, with\nmixed success. Although progress is being made in many parts of the world,\nmillions of households in Sub-Saharan Africa and South Asia still face a\nlifetime without the improved water and sanitation services that citizens in\nindustrialized countries take for granted. <\/span><\/p>\n\n<p>The <b>second part<\/b> will focus on what can be done to solve global water\nand sanitation problems. We will examine the main strategies that donors and\nnational governments have tried to change status quo water and sanitation\nconditions, and the lessons learned from these experiences. <\/p>","targetAudience":2,"courseSyllabus":"<b>Part 1: Problem Diagnosis<\/b> – Lectures, Videos, Online discussion<br>&nbsp;&nbsp;<b><br><\/b><div><ul><li><b>Week 1:&nbsp;Introduction&nbsp;–&nbsp;<\/b>Current patterns and future trends in coverage of both network infrastructure and non-piped solutions in urban and rural areas of the low and middle income countries<\/li><p><\/p><li><b>Week 2:&nbsp;Political Economy<\/b>&nbsp;– Water markets, water vending systems, corruption<\/li><p><\/p><li><b>Week 3: Supply<\/b>&nbsp;–&nbsp;Technological options available and the associated costs of providing improved water and sanitation services<\/li><p><\/p><li><b>Week 4: Demand<\/b>&nbsp;–&nbsp;Understanding household water and sanitation behavior<\/li><p><\/p><li><b>Week 5:&nbsp;Outcomes and climate change<\/b><\/li><p><\/p><li><b>Week 6:&nbsp;Water Development Paths<\/b><\/li><p><\/p><\/ul><\/div>","courseFormat":"","suggestedReadings":"Selected readings will be provided to enrolled students. <br>","estimatedClassWorkload":"8-10 hours\/week","recommendedBackground":"<p>This course is recommended to students with a wide background, including engineering, public health, business, geography, economics, planning, sociology, anthropology, and political science.<\/p>","links":{}}