{"id":2903,"shortName":"financialanalysis","name":"The Language and Tools of Financial Analysis","language":"en","shortDescription":"In this course, participants will learn the foundations of accounting principles and financial analysis, develop an understanding of the links between these, and the measurement of value creation at the firm level. This is part of a Specialization in corporate finance created in partnership between the University of Melbourne and Bank of New York Mellon (BNY Mellon).","aboutTheCourse":"<p>This course is the first\nin the four-course Specialization <i>Essentials of Corporate Financial Analysis\nand Decision-Making<\/i>.&nbsp;<\/p><p>In this course you will develop an understanding of the\ndefinitions of key accounting measures - but more importantly you will learn\nhow accounting information is used on a daily basis in financial markets by\nanalysts, investors and CFOs.&nbsp;<\/p><p>Instructors from the University of Melbourne,\ntogether with their partners at BNY Mellon, bridge the gap between historical\nasset valuation reflected in financial statements and the forward-looking needs\nof market participants seeking to assess current value in the face of future\nuncertainty.<\/p>\n\n<p>Courses created in partnership with:<br>\n<img src=\"https:\/\/d396qusza40orc.cloudfront.net\/financialanalysis\/images\/bnym-logo-small.png\"><\/p>","targetAudience":0,"courseSyllabus":"<span><strong>Module 1: <\/strong>An introduction to accounting principles: The language of capital markets<br><p><\/p><ul><li>Define the objectives of the key financial statements issued by companies.<\/li><li>Explain the core elements of a company's financial statements.<\/li><li>Distinguish between classes of assets and liabilities on the basis of individual characteristics of these elements.<\/li><\/ul><strong>Module 2:<\/strong> An intuition-based introduction to financial analysis<br><p><\/p><ul><li>Demonstrate how the profitability of a company can be measured in a way that allows comparison with other similar companies.<\/li><li>Employ measurement tools that provide information about the risk of financial distress for a company<\/li><li>Utilize ratio analysis to demonstrate whether the assets of the company are being used efficiently – relative to comparable companies.<\/li><\/ul><strong>Module 3: <\/strong>The links between accounting principles and financial decision-making<br><p><\/p><ul><li>Identify the possible shortcomings associated with using published financial statements to conduct financial analysis.<br><\/li><li>Understand the role of accounting practices by financial managers and internal auditors to misrepresent a company's financial position.<br><\/li><li>Understand how the management-shareholder agency relationship can promote poor corporate practices such as earnings management.<\/li><\/ul><strong>Module 4: <\/strong>Value measurement via discounted cash flow analysis<br><p><\/p><\/span><div><ul><li>Demonstrate how the discounted cash flow technique explicitly allows for the time value of money via the use of a risk-adjusted discount rate.<br><\/li><li>Identify the three key factors that are reflected in the discount rate used to evaluate cash flows in a discounted cash flow analysis.<br><\/li><li>Understand the situations where discounted cash flow analysis might be challenging – in light of the individual characteristics of the asset being addressed.<br><\/li><\/ul><\/div>","courseFormat":"<p>This course will run for 4 weeks, and consist\nof 4 modules each with a series of lecture videos between 5 to 8 minutes long.\nEach video will contain a range of integrated quiz questions or reflection\nquestions. Assessment will be multiple-choice questions, and a final peer\nreviewed assessment.<\/p><p><br><\/p><p>Course hero image reproduced with permission from BNY Mellon.<br><\/p>","suggestedReadings":"<p>Texts which should be found on\nevery&nbsp;finance&nbsp;professional’s shelf...<br>Berk, J. &amp; Demarzo, P. (2014) <em>Corporate finance - the core<\/em> (3rd ed.) Boston: Pearson.<\/p><p>Harrison, W.T.,&nbsp;Herngren, C.T. &amp; Thomas, C.W. (2015) <em>Financial accounting<\/em> (10th ed.) Boston: Pearson.<\/p><p>Graham, J.R. &amp; Smart, S.B (2012)<i> Introduction\nto corporate finance: what companies do<\/i> (3rd ed.) Australia: South-Western\/Cengage Learning.<\/p>","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"<ul>\n <li>A basic\n     knowledge of statistics and an ability to employ simple algebra to solve\n     straightforward problems<\/li>\n <li>Familiarity with\n     Microsoft Excel (or a functionally-equivalent spreadsheet program).\n     Specifically participants should possess the ability to summarise data\n     using the graphical tools contained within that program.<\/li>\n <li>Apart from that,\n     a natural curiosity&nbsp;about not only how markets operate, but also how\n     participants in those markets gather and then transform information so as\n     to make financial decisions that maximise firm value<\/li>\n<\/ul>","links":{}}