{"id":3026,"shortName":"dairy","name":"Dairy Production and Management","language":"en","shortDescription":"With the world's first MOOOOO-C, you will gain a broad and comprehensive understanding of all aspects of dairy management such as genetics, nutrition, reproduction, animal health, farm economics, and sustainability of dairy production systems. There's something here for everyone whether you are just looking for the basics or have years of experience in the dairy industry.","aboutTheCourse":"Why is producing milk efficiently and sustainably so important? Milk provides humans with over 16 essential nutrients, such as: Energy, Protein and Essential Amino acids, Vitamin A, Vitamin D, several B vitamins, including B12, Pantothenic and Folic acids, and essential minerals such as Calcium, Magnesium, Phosphorus, Potassium, Zinc, as well as other minerals. Did you know that one glass of milk provides a 5-year old child with 21% of his\/her daily protein requirements and 8% of their energy needs?<br><br>Most milk in the world, about 85%, is produced from cattle. However, water buffaloes, goats, sheep, and camel are also dairy animals. The United States, India, the European Union, Brazil, and New Zealand are among the largest dairy producers in the world. Yet among these dairy-producing countries there are varied methods to generate milk with highly variable productivity and efficiency. Dairy production is vital for the survival of billions of people. Globally, around 150 million small-scale dairy households, equivalent to 750 million people, are engaged in milk production. The number and size of dairy farms varies among countries, but in India alone, there are estimated 78 million dairy farms! In the United States, one of the leading milk-producing countries in the world, total milk production has been steadily increasing in the last decades, reaching over 205 billion pounds (93 billion kilograms) in 2014. This was accompanied by a steady increase in average milk yield per cow, reaching 22,260 lb (over 10,100 kg) per lactation in 2014. How has this efficiency been achieved? What methods are necessary to ensure production of high quality milk? How do we balance milk production efficiency with animal health and environmental protection? This course will provide the student with information to better understand dairy production systems and their role in feeding the world population. <br><br>In this MOOOOO-C, you will learn about the dairy enterprise from internationally recognized dairy science professors who have delivered highly regarded dairy education programs within the United States and internationally.<br>","targetAudience":0,"courseSyllabus":"<strong>Dairy Genetics (1 week)<br><\/strong>Dairy breeds and performance differences among breeds; sire proofs and genetic evaluations; selection objectives and the prioritization of traits; long term genetic trends and the effect of genomic selection in elite and commercial dairy farms.<strong><br><br><\/strong><strong>Forage, Production and Pasture Management<\/strong><strong> (1 week)<\/strong><br>Forage production and the multiple roles that forage crops play on the dairy farm; production practices for both annual and perennial forages and the key management considerations that are necessary for optimizing the forage yield and quality of these crops on dairy farms; grazing and pasture management, including challenges of grazing systems, how grazing management has evolved, and proper grazing management for optimum forage and animal productivity.<br><br><strong>Dairy Nutrition<\/strong><strong> (2 weeks)<br><\/strong>Common terminology and basic principles of ruminant nutrition, characteristics of dairy forages, concentrate feeds, and feed additives, silage-making, and processing of feeds; specifics about animal requirements and recommended feeding practices and diet formulation basics for various categories of dairy cattle, including dry and lactating cows and young stock.<strong><br><br>Dairy Reproduction<\/strong><strong> (1 week)<\/strong><br>Begins with the birth of a heifer calf and moves to discussion of the factors that contribute to growth, development and longevity of this animal in the milking herd. Topics covered will include the basics of reproductive anatomy and hormonal control of reproductive process, managing both males and females to maximize their reproductive function, basics of assisted reproduction including appropriate insemination protocols, hormonal synchronization, methods of pregnancy diagnosis and factors affecting reproductive performance.<strong><br><br>Metabolic Disorders and Herd Health <\/strong><strong>(1 week)<\/strong><br>Various aspects of cow and calf health management and disease diagnostic methods to keep the animals healthy, profitable and producing high quality food for the growing human population.<strong><br><br>Milk Quality and Milk Hygiene (<\/strong><strong><strong>½<\/strong> week)<br><\/strong>The mastitis and milk quality section is comprised of two parts. In the first part we will address the udder health of the milking cow, milking practices, and best practices used for prevention and control of bovine mastitis. The second part of the program will focus on best practices used on dairy farms for production of quality raw milk.<strong><br><br>Dairy Farm Management and Economics (1 week)<br><\/strong>Detailed strategies for profitable management of the dairy herd; various tools for decision-making and the implications of those decisions on farm profits; the role of government; how milk is marketed<strong>.<br><br>Dairy Production and the Environment (½ week)<br><\/strong>Environmental impact and mitigation strategies for decreasing nitrogen, phosphorus, and greenhouse gas emissions from dairy operations.<strong><\/strong><br><br><br>","courseFormat":"This course will be 8-weeks in length consisting of 8 lecture segments with of a total of 47 videos. Each video will be 6 to 8 minutes in duration. All lecture segments will have additional reading materials. Assessments will be through multiple-choice exams. Students will interact with each other and course faculty through discussion forums.<br>","suggestedReadings":"Although the lectures are designed to be self-contained, we recommend (but do not require) that students refer to the following resources:<br><ul><li><a target=\"_blank\" href=\"http:\/\/extension.psu.edu\/animals\/dairy\">Penn State's Dairy Extension<\/a><\/li><li><a target=\"_blank\" href=\"http:\/\/www.extension.org\/dairy_cattle\">eXtension<\/a>, the Land-grant Universities' Extension Network<\/li><li>Additional reading materials to accompany each lecture will be provided<br><\/li><\/ul>","estimatedClassWorkload":"3-6 hours\/week","recommendedBackground":"The primary target of this MOOOOO-C is individuals interested or currently working in the field of dairy production or science. The course will deliver fundamental knowledge and best practices related to sustainable dairy production systems in their broadest sense. Target audiences include general public interested in how milk is produced, professionals directly or indirectly involved in dairy production (e.g. farm managers, employees, consultants, and government officials), livestock producers, educators, and students currently enrolled or interested in animal\/dairy science.<br>","links":{}}