{"id":201,"shortName":"immigration","name":"Citizenship and U.S. Immigration","language":"en","shortDescription":"What does it mean for an immigrant to become a U.S. citizen? Through a background of historical and policy perspectives, this course will examine U.S. law governing how citizenship is acquired, the constitutional and international law foundations underlying immigration regulation, the role of the federal government in regulating immigration, and immigration law reform.  ","aboutTheCourse":"<p>This course analyzes the\nhistorical origins of citizenship and immigration in the United States and provides\nan overview of modern U.S. law.  Beyond\ntraditional notions of “law,” the course also includes significant elements of\nimmigration policy, social science, history, political theory, and ethics.  One goal of the course is to provide a basic\nknowledge base for students to make and influence law and policy in immigration\nand citizenship.<\/p>\n\n<p>Among the questions the\ncourse will explore:<\/p>\n\n<ul><li>How is U.S. citizenship\nacquired?  Can it be lost?<\/li><li>What is the\norigin and significance of the U.S. practice of awarding citizenship to anyone\nborn here?<\/li><li>Who decides who\ncan enter the country, and who must leave?<\/li><li>What rights do\nnon-citizens have?  What about those who\nhave entered the country illegally?<\/li><li>What is most needed\nfor immigration reform in the US?<\/li><\/ul>","targetAudience":0,"courseSyllabus":"<h2>Week 1: Citizenship<\/h2><p>Citizenship is the most basic distinction among persons currently living in or seeking to enter the United States, and thus we begin the course with this legal status. Topics covered this week include how one becomes a U.S. citizen, how citizenship at birth is determined in this and other countries, the concept of \"dual citizenship,\" and how citizenship might be lost. What rights come with citizenship? What are the reasons for becoming a U.S. citizen if a non-citizen is a lawful permanent resident?<\/p><ul><li>From Non-Citizen to Citizen: The Naturalization Process<\/li><li>Citizenship at Birth: Jus Soli and Jus Sanguinis<\/li><li>The Fourteenth Amendment's Birthright Citizenship Clause<\/li><li>Status of Persons Born in U.S. Territories and Possessions<\/li><li>Rights and Responsibilities of U.S. Citizens<\/li><li>Proof of Citizenship; Dual Nationality; Loss of Citizenship<\/li><li>U.S. Citizenship for Sale? (optional lecture)<\/li><\/ul><h2>Week 2: History of U.S. Immigration<\/h2><p>Having considered the legal distinction between citizens and non-citizens in week one, we now turn to immigration into the United States, the first step toward attaining citizenship. Laws governing who may enter the country, the conditions of entry, and actions that may result in deportation will occupy the remainder of the course. This week we examine the history of U.S. immigration. Beginning with the Chinese Exclusion Acts in the 1880's, U.S. law has at times discriminated against specific racial and ethnic groups. Ironically, the most important constitutional law doctrines governing U.S. immigration law solidified during those eras. The modern constitutional doctrine of \"plenary power\" is introduced here.<\/p><ul><li>Myths and Realities of an \"Open Border\" Past<\/li><li>The Chinese Exclusion Acts and the U.S. Supreme Court<\/li><li>The \"Plenary Power\" Doctrine in U.S. Constitutional Law<\/li><li>Modern Structure: Federal Agencies and Courts<\/li><li>The Faces of Immigration Today: Numbers<\/li><\/ul><h2>Week 3: Eligibility for Immigration, Part I<\/h2><p>This week we will consider the requirements for legal immigration to the U.S. These come in the form of general criteria applicable to all who seek to enter (e.g., no criminal history, not likely to become a \"public charge\"), as well as specific requirements for an entry visa and the \"green card\" -- permission to remain in the United States indefinitely as a lawful permanent resident.<\/p><div><ul><li>Requirements for Entry:  Introduction to the Grounds of Inadmissibility<\/li><li>Inadmissibility Based on Immigration Control<\/li><li>Inadmissibility Based on National Security<\/li><li>Inadmissibility Based on Criminal Acts<\/li><li>Inadmissibility Based on Public Health<\/li><li>Inadmissibility on Economic Grounds<\/li><li>Procedures to Determine Admissibility<br><\/li><\/ul><\/div><h2>Week 4: Eligibility for Immigration, Part II<\/h2><p>Week four continues our examination of eligibility for non-U.S. citizens to enter or remain in the country. This week focuses more closely on categories of immigrants -- guest workers, business employees, and family members, as well as temporary visitors such as students and tourists. Along with border security, these visa categories are at the center of current debates over immigration reform, given that the waiting time for some persons eligible to immigrate to the United States can reach decades. Recent proposals for immigration reform are noted here.<\/p><ul><li>The \"Green Card\" and a Broken Immigration System<br><\/li><li>Permanent Residency through Family Relationship<br><\/li><li>Citizenship through Marriage and the Marriage Fraud Act<br><\/li><li>Immigration through Employment<br><\/li><li>Refugees and Asylum<br><\/li><li>U.S. Immigration Reform<br><\/li><\/ul><h2>Week 5: Breaking the Rules: Deportation Proceedings and Border Security<\/h2><p>Our concluding week focuses upon the various grounds for deportation, deportation proceedings, and a brief overview of the U.S. immigration court system. Border security measures seek to protect the nation's security as well as public health and safety. Of particular interest is the \"extended border control\" capability of the Department of Homeland Security. Enhanced border security is one key to political compromise on immigration reform, providing a final opportunity in this course to consider the future direction of immigration law in the United States.<\/p>","courseFormat":"","suggestedReadings":"","instructor":"Polly J. Price","estimatedClassWorkload":"3-4 hours\/week","recommendedBackground":"","links":{}}