{
    "id": 679,
    "shortName": "scileadership",
    "name": "Inquiry Science Learning: Perspectives and Practices 1 - Science Leadership",
    "language": "en",
    "shortDescription": "This is the first in a series of four courses; each addressing a different set of skills  science educators need to meet the demands of their career. In this course, teachers will engage in experiences designed to develop the skills needed to be a leader on their campus and to promote and enhance science learning in spheres outside their classroom.",
    "aboutTheCourse": "<p>A revolution is underway in\nscience classrooms. The demands of the new workplace and the ready access to\ninformation afforded by new technologies have radically changed the way we\ndefine a scientifically literate society. <\/p><p>More than ever teachers need\nprofessional development that provides them with the resources they need and\nempowers them to take the action required to build classrooms where the next\ngeneration of scientifically literate students will flourish. <\/p><p><i>Inquiry Science Learning: Perspectives and\nPractices<\/i> consists of four courses, each designed to address a different\nstrand in the development of skills teachers need to meet the demands of their\ncareer, including the following.<\/p><p><\/p><ol><li><b>Science Leadership<\/b><br><\/li><li><a href=\"https:\/\/www.coursera.org\/course\/inquirytechniques\" target=\"_blank\">Techniques for Success<\/a><br><\/li><li><a href=\"https:\/\/www.coursera.org\/course\/scicontentsurvey\" target=\"_blank\">Science Content<\/a><br><\/li><li><a href=\"https:\/\/www.coursera.org\/course\/scistudentinquiry\" target=\"_blank\">Student-Centered Inquiry<\/a><\/li><\/ol><p><\/p><p>In this first course we will focus on helping\nteachers expand their influence outside their classroom to promote scientific\nliteracy throughout their school and into the larger community.<br><\/p>\n\n<p><\/p>",
    "targetAudience": 3,
    "courseSyllabus": "<p><b>Week 1:  <\/b><b>Learning Outside the Classroom: <\/b><\/p><b>\n\n<\/b><p>Outdoor\nHabitats, Science Labs, Field Experiences, Family Science Night, Science Fair<\/p>\n\n<p><b>Week 2: Teachers Outside the Classroom:<\/b><\/p><b>\n\n<\/b><p>Presenting\nat Conferences, Mentoring, Training<\/p>\n\n<p><b>Week 3: Connections Outside the Classroom:<\/b><\/p><b>\n\n<\/b><p>Grant\nWriting, Collaborations\/Partnerships\/Collaboratives, Professional Associations<\/p>\n\n<p><b>Week 4: Policy Outside the Classroom:<\/b><\/p><b>\n\n<\/b>Policy that Affects Science Classrooms and How You Can Have an Impact ",
    "estimatedClassWorkload": "2-4 hours\/week",
    "recommendedBackground": "No\nprevious coursework is recommended, but the course will be most helpful to\nteachers with 3 or more years of teaching experience who are willing to\ndirectly apply experiences in their schools. While the course was designed with the K-8 teacher in mind, the topics covered are appropriate for all teachers, including those teaching in high school.",
    "links": {

    }
}