{"id":285,"shortName":"virology","name":"Virology I: How Viruses Work","language":"en","shortDescription":"Introductory virology course emphasizing the common reactions that must be completed by all viruses for successful reproduction within a host cell. ","aboutTheCourse":"This introductory virology course emphasizes the common reactions that must be completed by all viruses for successful reproduction within a host cell and survival and spread within a host population. The molecular basis of alternative reproductive cycles are presented with examples drawn from a set of representative animal and human viruses, although selected bacterial viruses will be discussed.<br><br>This offering has been a top-ten iTunes U Cours<b><\/b>e in sciences pretty much since its release in 2012, with over 80,000 subscriptions. The course will be ported to the Coursera platform in two parts and will allow interested online students to take the course as a cohort for the first time.","targetAudience":1,"courseSyllabus":"<b>Week 1<\/b><br>Welcome to virology<br>What is a virus?<br>Viruses then and now<br><b>Week 2<br><\/b>The infectious cycle<br>Assay of viral infectivity<br>Measurement\n    of virions and their components<br>Revolutionary methods<br>One-step growth\n    cycle<br>\n<div><b>Week 3<\/b><br>The Baltimore scheme<br>DNA virus genomes<br>RNA virus genomes<br>Viral\n    genetics<\/div>\n<div><b>Week 4<\/b><br>Structure<br>The tools of structural virology<br>Helical symmetry<br>Icosahedral symmetry<br>Enveloped virions<br>Complex virions<\/div>\n<div><b>Week 5<\/b><br>Attachment to cells<br>Entry into cells<br>Acid-catalyzed fusion<br>A new paradigm for entry<br>Entry of non-enveloped virions<br>Entering the nucleus<\/div>\n<div><b>Week 6<\/b><br>Viral RNA synthesis<br>RNA polymerization<br>Plus strand RNA synthesis<br>Negative strand RNA synthesis<br>RNA synthesis of dsRNA genomes<br>RNA synthesis as a source of diversity<\/div>\n<div><b>Week 7<br><\/b>DNA basics<br>Lessons from SV40<br>Priming via DNA or protein<br>Viral origins<br>Big DNA viruses<br>Regulation of DNA synthesis<\/div>\n<div><b>Week 8<br><\/b>Transcription<br>Initiation of transcription<br>Viral transcription regulation<br>Capping and polyadenylation<br>Pre-mRNA splicing<\/div>\n<div><b>Week 9<\/b><br>Reverse transcriptase<br>Retroviruses<br>Reverse transcription<br>Integration<br>The provirus<br>Hepatitis B virus<\/div>\n<div><b>Week 10<\/b><br>End-dependent initiation of protein synthesis<br>Other decoding mechanisms<br>One mRNA, one protein?<br>Maximizing coding capacity of the viral genome<br>Regulation of translation: eIF2alpha<br>How viruses regulate cell translation<br>MicroRNAs<\/div>\n<div><b>Week 11<\/b><br>Principles of virion assembly<br>Getting to the right place<br>Making sub-assemblies<br>Concerted assembly: Budding<br>Genome packaging<br>Acquisition of an envelope and egress<\/div>","courseFormat":"This class consists of lecture videos which are between 10-15 minutes in length. There will also be standalone quizzes and a final exam.","suggestedReadings":"The recommended textbook is <i>Principles of Virology. Vol I: Molecular Biology, Vol. II: Pathogenesis and Control<\/i> (S.J.\nFlint et al., Third Edition, ASM Press 2009). You don't need to buy this\nbook to do well in this course, as the lectures are self-contained, but\nif you are very interested in virology, it's a great resource.\nThe book is available through <a href=\"http:\/\/www.amazon.com\/Principles-Virology-Vol-Molecular-Racaniello\/dp\/B00BTM6O80\/ref=sr_1_10?ie=UTF8&qid=1374008184&sr=8-10&keywords=principles+of+virology+racaniello\" target=\"_blank\">amazon<\/a> or <a href=\"http:\/\/www.chegg.com\/search\/principles%20of%20virology%20racaniello\/books\" target=\"_blank\">chegg.com<\/a><div>\n    <br>\n<\/div>Students are expected to read Prof. Racaniello’s virology blog (<a href=\"http:\/\/www.virology.ws\" target=\"_blank\">virology.ws<\/a>)\nwhich will contain information relevant to the course.\n<br>\n<div>\n    <br>\n<\/div>\n<div>Students are expected to listen to the weekly podcast <i><a href=\"http:\/\/www.twiv.tv\">This Week in Virolog<\/a>y <\/i> produced\n    by Prof. Racaniello, for additional material about viruses relevant to\n    the course. You can subscribe to TWiV at <a href=\"http:\/\/www.twiv.tv\">www.twiv.tv<\/a> or\n    on <a href=\"http:\/\/itunes.apple.com\/WebObjects\/MZStore.woa\/wa\/viewPodcast?id=300973784\">iTunes<\/a>. <\/div><br>","instructor":"Vincent Racaniello","estimatedClassWorkload":"3-4 hours\/week","recommendedBackground":"Two semesters of a rigorous, molecularly-oriented introductory biology course.<br>","links":{}}