{"id":2888,"shortName":"nudgeit","name":"Nudge-it: Understanding obesity","language":"en","shortDescription":"Nudge-it is an multi-disciplinary European research project studying new ways of establishing and reinforcing healthy eating habits. Join us to learn about eating, appetite and obesity.","aboutTheCourse":"<span>Obesity is a huge health, social and economic problem affecting millions\n of people globally. Currently, it’s a problem without a solution - \ndieting is difficult, drug therapies are poor, and surgical solutions are \nonly offered to those suffering serious ill-health. In addition, there \nare many common misconceptions about appetite, diet and exercise, and about the\n best ways to treat or prevent obesity.<br>\n<br>\nThis course will be taught by partners in the EU-funded research project Nudge-it.\n This project brings together dozens of experts in neurobiology, psychology and&nbsp;behavioural economics from universities in the UK, Germany, \nthe Netherlands, Sweden, Switzerland, Denmark, the US and New Zealand. \nThe project's overall aim is to better understand decision-making in food choice \nand to contribute to improving public health policy.<br>\n<br>\nIn this course we will discuss the facts and misconceptions around \nobesity, and the gaps in the scientific knowledge. We’ll discuss key \nphysiological and psychological concepts around the brain’s control of \nappetite and body weight, and reflect on the power of these systems - \nhow they make weight gain easy and weight loss hard. We will describe \nnew approaches to the treatment and prevention of obesity, and give you \nthe opportunity to reflect on your own knowledge and assumptions around \nthe causes of obesity.<br><br><\/span><span>If you’re on Twitter, tell us why you are taking\nthe course – use the hashtag <a href=\"https:\/\/twitter.com\/search?f=tweets&amp;vertical=default&amp;q=%23nudgeitmooc&amp;src=typd\" target=\"_blank\"><strong>#nudgeitmooc<\/strong><\/a><\/span><span><br><br><\/span>Visit the project website at&nbsp;<a href=\"http:\/\/www.nudge-it.eu\/\" target=\"_blank\">www.nudge-it.eu<\/a><br><br>We're on Twitter:&nbsp;<a href=\"https:\/\/twitter.com\/nudgeit_\">@nudgeit_<\/a><br>","targetAudience":3,"courseSyllabus":"<ul><li><strong>Week 1:<\/strong>&nbsp;<strong>Evidence<\/strong>. The&nbsp;major aim of this course is to explore the evidence base for obesity science -&nbsp;what\nwe know and what we don’t know. We'll highlight how the&nbsp;evidence sometimes&nbsp;contradicts&nbsp;commonly-held beliefs.&nbsp;<br><\/li><\/ul>\n\n<ul><li><strong>Week 2:<\/strong> <strong>Physiology<\/strong>.\nExploring the neurobiological and hormonal control of appetite. How the environment interacts with our physiology to influence food choice. <br><\/li><\/ul>\n\n<ul><li><strong>Week 3:<\/strong>&nbsp;<strong>Psychology<\/strong>.\nThe psychological\ncontrol of appetite. How cognition influences food choice. <br><\/li><\/ul>\n\n<ul><li><strong>Week 4:<\/strong> <strong>Stress<\/strong>. How&nbsp;early-life experience&nbsp;influences food choice in later life. Stress and emotional eating.<\/li><\/ul>\n\n<ul><li><strong>Week 5:<\/strong>&nbsp;<strong>Economics<\/strong>. How behavioural economics may deliver new ways of changing choice\nbehaviour. Food insecurity and health inequities.<\/li><\/ul>\n\n<br>\n\n<img width=\"350\" src=\"https:\/\/d396qusza40orc.cloudfront.net\/nudgeit\/Logos\/EU%20logo%20for%20dissemination%20large.jpg\" alt=\"EU logo and statement. The research leading to these results has received funding from the European Union's Seventh Framework programme for research, technological development and demonstration under grant agreement n*607310\"><br>","courseFormat":"<p>The course contains video and audio material from the\ninstructors, and quizzes and reflective exercises to help you test your\nunderstanding. Passing these quizzes and submitting these reflective pieces\nleads to a certificate of accomplishment.<\/p>","suggestedReadings":"It is <strong>not<\/strong> necessary for you to purchase books to participate in or complete the course. However, here are some books that delve more deeply into the themes of the course.<br><br>On the obesity epidemic: \"The Shape We're In\" by Sarah Boseley.<br>On food choices: \"Mindless Eating\" by Brian Wansink.<br>On behavioural econonomics and nudging: \"Nudge\", \"Why Nudge?\", \"Simpler\", and \"Wiser\" all by Cass Sunstein.<br>","estimatedClassWorkload":"3-4 hours\/week","recommendedBackground":"<p>There is no prerequisite to take this course. No prior\nknowledge is required.<\/p>","links":{}}