{"id":2776,"shortName":"hebrewpoetry1","name":"Modern Hebrew Poetry   שירה עברית מודרנית  ","language":"he","shortDescription":"הקורס מציע מיפוי של השירה העברית החדשה למן תנועת ההשכלה דרך תקופת \"התחייה\" והמודרניזם שבא בעקבותיה, ועד לימינו. הקורס מציג באופן חי ונושם את המפנים הפואטיים ואת ההתפתחויות הסגנוניות והתמטיות בתחום השירה העברית, מראשיתה, באמצעות קריאות קרובות של טקסטים מן התקופות השונות, ומעמיד מאגר גדול ושופע של ידע תיאורטי, ספרותי  והיסטורי, לצד פרשנויות עמוקות, מאתגרות ומפתיעות. \n\n\n\n\n\n","aboutTheCourse":"<p><\/p><p dir=\"RTL\"><br><\/p><p><strong>Course Subject<\/strong><\/p><p>The course dealt with Hebrew Poetry from “Rebirth” to Israeli poetry of the last generation. Professor Ariel Hirschfeld discussed the poetic revolution that took place in Hebrew culture at the end of the 19th Century, and specifically the poetry of Bialik and Shaul Tchernichovsky, who both radically changed the way the cultural agenda of Judaism was associated with the Hebrew language. We therefore followed the development of the Hebrew literary community until the Second World War, extending over three continents. The course described the dramatic dynamics that occurred within Israeli literary society around the nature of Hebrew poetry and its extraordinary poetic achievements, which is, without doubt, one of the most impressive poetic cultures in the modern world.<br><\/p><p><br><\/p><div><br><\/div><div><br><\/div>","targetAudience":0,"courseSyllabus":"<p dir=\"RTL\"><b>השירה העברית החדשה, פואטיקה, היסטוריה, תרבות<\/b><br><\/p>\n\n<p dir=\"RTL\"><b>&nbsp;<\/b><a href=\"https:\/\/d396qusza40orc.cloudfront.net\/hebrewpoetry1\/Course%20Description\/Syllabus%20-%20Ariel%20Hirschfeld.pdf\"><strong>רשימת שירים ורשימה ביבליוגרפית<\/strong><\/a><\/p>","courseFormat":"<p>There will be one class per week covering a 14 week period. Each class will consist of lecture videos (sessions), which are between 8 to 15 minutes in length. There will be separate homework assignments at the end of each class, and a final exam.<br><\/p>","suggestedReadings":"<p><b>שמעון הלקין \/ 'תבל ואדם' (על טשרניחובסקי) בתוך: צדדים וצדי דרכים בספרות. כרך א', אקדמון, ירושלים, 1969.<\/b><\/p><p><br><\/p><b><\/b><p><b>&nbsp;יוסף האפרתי \/ סיכום: 'עקרונות האידיליה של טשרניחובסקי' בתוך: האידילה של טשרניחובסקי. ספרית הפועלים, 1971.<\/b><\/p><p><br><\/p><b><\/b><p><b>אסתר נתן \/ 'שירי הגבורה והכוח וזיקתם לסימבוליזם הרוסי'. בתוך: שאול טשרניחובסקי – מחקרים ותעודות. מוסד ביאליק. 1994.<\/b><\/p><p><br><\/p><b><\/b><p><b>&nbsp;אריאל הירשפלד \/ 'ארוס של הדיבור'. בתוך: כינור ערוך – לשון הרגש בשירת ח\"נ ביאליק. עם-עובד, 2011.<\/b><\/p><p><br><\/p><b><\/b><p><b>&nbsp;דן מירון \/ 'ללא מראי מקומות – הקדמה 'תמימה' לשירת ביאליק' בתוך: חדשות מאזור הקוטב. זמורה-ביתן, 1993.<\/b><\/p><b><\/b><p><b>&nbsp;<\/b><\/p><b><\/b><p><b>דב סדן \/ 'אל השיתין'. בתוך: בין דין לחשבון. דביר 1963.<\/b><\/p><b><\/b><p><b>&nbsp;<\/b><\/p><b><\/b><p><b>אריאל הירשפלד ' זעם – בעיר ההרגה'. בתוך: כינור ערוך.<\/b><\/p><b><\/b><p><b>&nbsp;<\/b><\/p><b><\/b><p><b>חנן חבר \/ 'קורבנות הציונות – על 'בעיר ההרגה מאת ח\"נ ביאליק'. בתוך: בעיר ההרגה – ביקור<\/b><\/p><b><\/b><p><b>מאוחר. רסלינג, 2005.<\/b><\/p><b><\/b><p><b>&nbsp;<\/b><\/p><b><\/b><p><b>ח. נ. ביאליק \/ 'שירתנו הצעירה'. בתוך: דברי ספרות. דביר, תשכ\"א.<\/b><\/p><b><\/b><p><b>&nbsp;<\/b><\/p><b><\/b><p><b>דן מירון \/ 'בין דור לתקופה'. בתוך: בודדים במועדם. עם-עובד, 1987.<\/b><\/p><b><\/b><p><br><\/p><b><\/b><p><b>עוזי שביט \/ \"השיר הפרוע – לסגנונה ולאקלימה הספרותי של השירה הארץ-ישראלית בשנות העשרים\". תעודה ה', תשמ\"ו.<\/b><\/p><b><\/b><p><b>&nbsp;<\/b><\/p><b><\/b><p><b>בנימין הרושובסקי \/ \"ריתמוס הרחבות – הלכה ומעשה בשירתו האקספרסיוניסטית של אצ\"ג\". אמנות השירה, 200.<\/b><\/p><b><\/b><p><b>&nbsp;<\/b><\/p>","estimatedClassWorkload":"2-3 hours\/week","recommendedBackground":"No background is required; all are welcome!<br>However, knowledge of the Hebrew language is necessary to understand the course.\n<br><br><br>","links":{}}