{"id":1149,"shortName":"datan","name":"Core Concepts in Data Analysis","language":"en","shortDescription":"Learn both theory and application for basic methods that have been invented either for developing new concepts – principal components or clusters, or for finding interesting correlations – regression and classification.   This is preceded by a thorough analysis of 1D and 2D data.","aboutTheCourse":"<p>This is an\nunconventional course in modern Data Analysis, Machine Learning and Data\nMining. Its contents are heavily influenced by the idea that data analysis\nshould help in enhancing and augmenting knowledge of the domain as represented\nby the concepts and statements of relation between them. According to this\nview, two main pathways for data analysis are summarization, for developing and\naugmenting concepts, and correlation, for enhancing and establishing relations.\nThe term summarization embraces here both simple summaries like totals and\nmeans and more complex summaries: the principal\ncomponents of a set of features and cluster structures in a set of entities.\nSimilarly, correlation covers both bivariate and multivariate relations between\ninput and target features including Bayes classifiers.<\/p>\n\n<span>The view of the data as a subject of\ncomputational data analysis that is adhered to here has emerged quite recently.\nTypically, in sciences and in statistics, a problem comes first, and then the\ninvestigator turns to data that might be useful in advancing towards a\nsolution. Yet nowadays the situation is reversed frequently, especially with\nthe advent of Big Data. Typical questions then are: Take a look at this data\nset - what sense can be made out of it? – Is there any structure in the data\nset? Can these features help in predicting those? This is more reminiscent to a\ntraveler’s view of the world rather than that of a scientist. The scientist\nsits at his desk, gets reproducible signals from the universe and tries to accommodate\nthem into a great model of the universe. The traveler deals with what come on\ntheir way – here is the data analysis niche. \nA textbook by the instructor along these lines has been published by\nSpringer-London in 2011: “Core\nconcepts in data analysis is clean and devoid\nof any fuzziness. The author presents his theses with a refreshing clarity\nseldom seen in a text of this sophistication. … To single out just one of the\ntext’s many successes: I doubt readers will ever encounter again such a detailed\nand excellent treatment of correlation concepts. (Computing Reviews of\nACM, June 2011).<\/span>”<b><\/b><b><\/b><p><\/p>","targetAudience":1,"courseSyllabus":"<span>\n <span><span>\n  <span>\n  <p><b>Week 1. Intro:<\/b><span> Examples of data<b> <\/b>and data analysis problems;\n  visualization.       <\/span><\/p><p><span>                     <\/span><\/p>\n  <p><b>Week 2. 1D analysis<\/b><span>. Feature scales.\n  Histogram. Two common types of histograms: Gaussian and Power Law. Central\n  values. Minkowski distance and data recovery view. Validation with Bootstrap.\n            <\/span><\/p><p><span>                        <\/span><\/p>\n  <p><b>Week 3-4. 2D analysis<\/b> cases: <\/p>\n  <p><span>(Both\n  quantitative: Scatter-plot, linear regression, correlation and determinacy\n  coefficients: meaning and properties.  Both\n  nominal: Contingency table, Quetelet index, Pearson chi-squared coefficient,\n  its double meaning and visualization).                                                               <\/span><\/p>\n  <p><b>Week 5-6. Learning multivariate correlations<\/b><\/p>\n  <p><span>(Bayes\n  approach and Naïve Bayes classifier with a Bag-of-words text model; Decision\n  trees and criteria for building them.)                      <\/span><\/p><p><span>                        <\/span><\/p>\n  <p><b>Week 7. Principal components (PCA) and SVD<\/b><\/p>\n  <p>(SVD model behind\n  PCA: student marks as the product of subject factor scores and subject loadings.\n  Application to deriving a hidden underlying factor. Data visualization with\n  PCA. Conventional PCA and data normalization issues.)<\/p>\n  <p> <\/p>\n  <p><b>Week 8. Clustering with k-means<\/b><\/p>\n  <p><span>(K-Means\n  iterations and K-Means features    <\/span><\/p>\n  <p>K-Means\n  criterion. Anomalous clusters and intelligent K-Means.)<\/p>\n  <\/span>\n <\/span>\n<\/span><\/span>","courseFormat":"The class will be run using\nlecture videos, which are between 10 and 15 minutes in length. These contain\n1-2 integrated quiz questions each. Also, there will be standalone homework\nthat is not part of video lectures. The homework includes finding an\nillustrative or real-world dataset to the student’s liking, a set of assignments\nin applying data analysis methods to the dataset, and a final exam paper.","suggestedReadings":"<span>\n <span><span>\n  <span>\n  <p>Although the lectures are designed to be self-contained, we recommend (but do not require) that students refer to the books:<br><\/p><p>B. Mirkin (2011) Core Concepts in Data Analysis: Summarization, Correlation, Visualization. Undergraduate Topics for Computer Science Series, Springer, London. <\/p><p>J. Han, M. Kamber, J. Pei (2011) Data Mining: Concepts and Techniques, Third Edition, The Morgan Kaufmann Series in Data Management Systems, Morgan-Kaufmann. <\/p><p>H. Lohninger (1999) Teach Me Data Analysis, Springer-Verlag, Berlin-New York-Tokyo.<\/p>\n  <\/span>\n <\/span>\n<\/span><\/span>","estimatedClassWorkload":"6-8 hours\/week","recommendedBackground":"<p><span>·        \n<\/span>Basics\nof calculus: the concepts of function, derivative and the first-order\noptimality condition; <\/p><p><span>·        \n<\/span>Basic\nlinear algebra including vectors, inner products, Euclidean distances,\nmatrices; <\/p><p><span>·        \n<\/span>Basic\nset theory notation; and <\/p><p>\n\n\n\n\n\n<\/p><p><span>·        \n<\/span>Basic\ncoding ability in an environment such as MatLab, or R, or any other software..<\/p>","links":{}}