{"id":3406,"shortName":"feedingtheworld","name":"Feeding the World","language":"en","shortDescription":"Over the next 40 years, food production must double to meet the growing needs of the world population, which is estimated to exceed 9 billion by the year 2050. But, how do producers provide the growing human population with the needed food while maximizing the efficiency of production and minimizing impacts on the environment to ensure a sustainable future for us all?","aboutTheCourse":"<div>This course will explore the concepts driving current food production science (population growth, urbanization, emerging affluence, resource constraints, and underlying biological limits) with the main focus on livestock production. Each of the major food animal species (dairy, swine, beef, and poultry) will be covered in terms of their universal life cycles, constraints to production and emerging societal issues.&nbsp;<br><br><\/div><div>Throughout the course, we will tackle some difficult and important questions:<\/div><div><ul><li>What are the major health benefits and potential concerns regarding the production and consumption of animal products?<\/li><li>How does animal production affect the efficient use of resources and impact our environment?<\/li><li>Can cost of production be reduced to meet growing demand for animal products around the globe while maintaining health and safety for both animals and consumers?<\/li><li>What are the different types of animal food production systems?<\/li><\/ul><\/div><div>Myths and misconceptions surrounding the animal food systems will be discussed. We’ll also look closely at some of the global issues, problems, and challenges in these food systems which scientists, farmers, and veterinarians, are attempting to solve through collaboration.<\/div><div><br><\/div><div>Lectures will be delivered by several experts from the University of Pennsylvania, School of Veterinary Medicine who are intimately involved in the study and advancement of animal production systems. The course is geared towards learners who seek a greater understanding of animal food systems as well as those who might have never visited an animal farm, but have a desire to learn more about where some of our food comes from and issues surrounding sustainability.<\/div>","targetAudience":0,"courseSyllabus":"<div><strong>WEEK ONE: &nbsp;POPULATION GROWTH AND GLOBAL ANIMAL INDUSTRIES<\/strong><\/div><div>Animal food systems will be introduced and we’ll look at production processes here and across the globe with an eye on our growing population, demands of emerging economies, and more.<\/div><div><br><\/div><div><strong>WEEK TWO: &nbsp;ISSUES SURROUNDING ANIMAL PRODUCTION<\/strong><\/div><div>The benefits, concerns, ethical aspects, and management of environmental resources used in animal production systems will be discussed.<\/div><div><br><\/div><div><strong>WEEK THREE: ANIMAL FEED, THE ENVIRONMENT AND GENETICS<\/strong><\/div><div>We’ll explore the what, how, and why aspects of animal feeding and how its production affects our environment. We’ll also talk about genetic selection and emerging technologies in animal breeding.<\/div><div><br><\/div><div><strong>WEEK FOUR: GENERAL ANIMAL PRODUCTION,&nbsp;EFFICIENCY, AND FOOD SAFETY<\/strong><\/div><div><br><em>The final weeks of the course will focus on specific animal systems. We’ll look at each (dairy cows, swine, poultry and beef cows) in terms of their industry trends, animal life cycles, different types of production systems and myths and issues surrounding them.<\/em><\/div><div><br><\/div><div><strong>WEEK FIVE: &nbsp;DAIRY PRODUCTION SYSTEMS<\/strong><br><br><\/div><div><strong>WEEK SIX: &nbsp;SWINE PRODUCTION SYSTEMS<\/strong><br><br><\/div><div><strong>WEEK SEVEN: POULTRY PRODUCTION SYSTEMS<\/strong><br><br><\/div><div><strong>WEEK EIGHT: BEEF PRODUCTION SYSTEMS<\/strong><\/div><div><br><\/div>","courseFormat":"Each week, you will have approximately one hour of video lectures on the specific topics listed above, taught by Penn Vet professors of relevant expertise. &nbsp;Mini assessments throughout the course and a final assessment at the end will be made. &nbsp;","suggestedReadings":"","estimatedClassWorkload":"2-4 hours\/week","recommendedBackground":"","links":{}}