{
    "id": 2186,
    "shortName": "sexingthecanvas",
    "name": "Sexing the Canvas: Art and Gender",
    "language": "en",
    "shortDescription": "What do paintings tell us about sex? How is art gendered? Here we get up close to some of the great paintings in the world’s most famous museums, giving you insight into how art speaks to us about sex, sexuality and gender.",
    "aboutTheCourse": "This course teaches masterpieces through the lens of sex and gender. We take you to the rich collections of New York’s Museum of Modern Art, Melbourne’s National Gallery of Victoria and California’s Huntington Library giving you access to outstanding works from the western tradition and expert tuition from specialist curators and renowned art historians.<br><br>Each unit will examine the circumstances in which paintings are produced and received, and how contemporary spectators and consumers of art view them. Why do works of art made centuries ago continue to speak so profoundly to us today?&nbsp;<div><br><\/div><div>What do art historians mean when they talk about ‘the gaze’? Are Matisse’s paintings ‘sexy’? What do the nude and the sleeping gypsy signify in Henri Rousseau’s extraordinary pictures?&nbsp;<\/div><div><br><\/div><div>Why do viewers find Frida Kahlo’s small and very personal paintings so powerful? What do Gainsborough’s portraits tell us about masculinity and sensibility in eighteenth century Britain? How is the Australian ‘dreaming’ gendered? &nbsp;<\/div><div><br><\/div><div>These are some of the intriguing questions you will study in Sexing the Canvas: Art and Gender.<\/div><div><br><\/div>",
    "targetAudience": 1,
    "courseSyllabus": "The course is taught over 7 weeks and is made up of 9 modules. The module titles are provided below.<br><br><div><ul><li><strong>Module 1:&nbsp;<\/strong>Introduction: Tiepolo’s Cleopatra: Painting, Agency and the Gaze.<br><\/li><li><strong>Module&nbsp;2:&nbsp;<\/strong>The Culture of Sensibility and the ‘Man of Feeling’: Thomas Gainsborough’s Portrait of the Officer of the Fourth Regiment of Foot.<br><\/li><li><strong>Module&nbsp;3:&nbsp;<\/strong>Gainsborough at the Huntington: &nbsp;The role of music, costume, theatre, &nbsp;charity and passion in the gendered Culture of Sensibility.<br><\/li><li><strong>Module&nbsp;4:&nbsp;<\/strong>Sexual Codes in French Courtly Painting of the Eighteenth Century.<br><\/li><li><strong>Module&nbsp;5:&nbsp;<\/strong>Orientalism, Gender and Display: Painting in Morocco<br><\/li><li><strong>Module&nbsp;6:&nbsp;<\/strong>Henri Rousseau: Challenging the Myth of the Passive Woman.<br><\/li><li><strong>Module&nbsp;7:&nbsp;<\/strong>Henri Matisse, Paul Cezanne and Max Dupain: Modernism, Gender and the Science of Movement.<br><\/li><li><strong>Module 8:&nbsp;<\/strong>Sexuality and Dissonance: Frida Kahlo and the Struggle to Paint.<br><\/li><li><strong>Module 9:&nbsp;<\/strong>What is Women’s Business?: Australian Indigenous Art and the Dreaming.&nbsp;<br><\/li><\/ul><\/div>",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": "No background is required; all are welcome.&nbsp;Visit your local art museum or gallery and look at some paintings.&nbsp;<br>",
    "links": {

    }
}