{"id":216,"shortName":"scigast","name":"The Science of Gastronomy","language":"en","shortDescription":"This course will introduce you to some of the science behind food preparation, cooking methods, and generally, the enjoyment of food. The ultimate goal is to inspire you to apply scientific principles in your everyday cooking, including the principles of manipulating the human perception of food.","aboutTheCourse":"This course introduces a number of basic scientific principles underpinning the methodology of cooking, food preparation and the enjoyment of food. All topics covered have a strong basis in biology, chemistry, and physics application. Among others, they\ninclude the consumption of cooked food, the physiological and evolutionary implication of the senses, geographic and cultural influences on food, and the rationale behind food preparation. We will also discuss issues such as coupling of senses to improve\nsense stimulation; altering flavor by chemical means; and modification of the coloration to improve the appearance of dishes. Following the video demonstrations of the scientific principles of cooking, you will learn to recognize the key ingredients and\ntheir combinations for preparing good healthy food. At the end of this course, you will be able to: <span><br><br>\n<\/span>\n<ol>\n    <li>appreciate the scientific basis of various recipes;<\/li>\n    <li>develop your own recipes by integrating some of the scientific principles into new dishes;<\/li>\n    <li>recognize the influence of the material world on human perception from the different senses;<\/li>\n    <li>appreciate the art of integrating science into cooking and dining.<\/li>\n<\/ol><br><b>Important Note:<\/b> This course is not designed for people with special dietary needs such as vegetarian, diabetic, and gluten-free diets. If you feel uncomfortable with any part of the assignments or activities of this course, you can substitute some\nof the ingredients or ask friends and family members to help with the tasting of your assignments. Alternatively, you may skip that specific assignment provided that you have fulfilled all other qualifying requirement to pass the course.","targetAudience":0,"courseSyllabus":"<div><b>Week 1: <\/b>\n<\/div>\n<div>1. Energy Transfer <\/div>\n<div>2. Hunger and Satiety<\/div>\n<div>\n    <br>\n<\/div>\n<div><b>Week 2: <\/b>\n<\/div>\n<div>3. The Sense of Taste<\/div>\n<div>4. The Sense of Smell<\/div>\n<div>\n    <br>\n<\/div>\n<div><b>Week 3: <\/b>\n<\/div>\n<div>5. The Sense of Sight<\/div>\n<div>6. The Sense of Touch<\/div>\n<div>\n    <br>\n<\/div>\n<div><b>Week 4:<\/b> <\/div>\n<div>7. Fruits and Vegetables<\/div>\n<div>8. A Perfect Steak<\/div>\n<div>\n    <br>\n<\/div>\n<div><b>Week 5: <\/b>\n<\/div>\n<div>8. A Perfect Steak (continued)<\/div>\n<div>9. Sauces<\/div>\n<div>\n    <br>\n<\/div>\n<div><b>Week 6: <\/b>\n<\/div>\n<div>9. Sauces (continued)<\/div>\n<div>10. Dessert<\/div>\n<br>\n<div><b>Week 7: <\/b>\n<\/div>\n<div>Exam<\/div>","courseFormat":"The course consists of short lecture videos of different length.\nThroughout the course, video demonstrations and audio\ncommentaries are included to illustrate specific scientific principles\nof cooking techniques and food preparation. You will be asked to try out and practice specific\ncooking principles at home. Then, you will be able to analyze and make\ncomparisons of your experiences through the weekly assignments.<br>","suggestedReadings":"","instructor":"Lam Lung Yeung and King L. Chow","estimatedClassWorkload":"3-4 hours\/week","recommendedBackground":"High school level science is assumed.<br>","links":{}}