{
    "id": 72,
    "shortName": "foodsys",
    "name": "An Introduction to the U.S. Food System: Perspectives from Public Health",
    "language": "en",
    "shortDescription": "Explore how food intersects with public health and the environment as it moves from field to plate.",
    "aboutTheCourse": "A food system encompasses the activities, people and resources involved\nin getting food from field to plate. Along the way, it intersects with\naspects of public health, equity and the environment. &nbsp;In this course,\nwe will provide a brief introduction to the U.S. food system and how food\nproduction practices and what we choose to eat impacts the world in which\nwe live. Through several case studies, we will discuss some key historical\nand political factors that have helped shape the current food system and\nconsider alternative approaches from farm to fork. The course will be led\nby a team of faculty and staff from the Johns Hopkins Center for a Livable\nFuture. &nbsp;Guest lecturers will include experts from a variety of disciplines,\nincluding public health and agriculture. <br><br>Developed in collaboration with <a href=\"http:\/\/www.jhsph.edu\/offices-and-services\/center-for-teaching-and-learning\/our-services\/open-education-lab\/index.html\">Johns Hopkins Open Education Lab<\/a>.",
    "targetAudience": 1,
    "courseSyllabus": "Module 1: Is Climate Change Vindicating Malthus? Food Security and the Right to Food.<br>Module 2: An Introduction to Food Systems, Sustainability and Resilience&nbsp;<br>Module 3: Food Security, Food Production and Public Health<br>Module 4: Food Animal Production<br>Module 5: US Agriculture Policy and the Farm Bill: Where is Health?&nbsp;<br>Module 6: Building a Healthier Food System: Two Case Studies<br>",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": "An understanding of public health or nutrition is helpful but not necessary.\nAs farmer and poet Wendell Berry noted, “Eating is an agricultural act.”",
    "links": {}
}