{
    "id": 441,
    "shortName": "livearthistory",
    "name": "Live!:  A History of Art for Artists, Animators and Gamers",
    "language": "en",
    "shortDescription": "Explore art history from the artist's perspective.  Learn how contemporary artists, animators and gamers work from the art of the past as part of their creative process, while building your own skills in visual analysis and creative and critical thinking.\n",
    "aboutTheCourse": "<p>This course approaches the questions of “art” and “history” from the perspective of contemporary makers of art (sculpture, painting, photography, performance, installation and more), animators (whether character\/story-based or experimental) and gamers, asking how artists actively make a history for their own practices by thinking about the creative process as a “conversation” with a wide range of art from the past. Why are ground-breaking artists so often historically-minded (and yet tend to break all the rules of conventional history-telling)? How do animators themselves “write” the largely unwritten history of their art through quotation, transposition and mash-ups? Why should contemporary gamers look at classical painting anyway?&nbsp;<\/p>\n\n<p>This course will combine short video lectures\/interviews and interactive quizzes with independent, peer-reviewed&nbsp;sketchbook and field work (suggested visits to local museums, film viewings, etc.) It is intended to give the student a background in a wide range of visual practices and a greater familiarity with techniques of historical analysis. It will help to build skills in visual analysis, and will also provide insight into the creative culture of CalArts, where a certain portion of these art histories have been made in the first place.<\/p>",
    "targetAudience": 1,
    "courseSyllabus": "Week 1: Introduction<br>Week 2: Story<br>Week 3: Character<br>Week 4: World-Making<br>Week 5: Time &amp; Motion<br>Week 6: Reality Distortion<br>Week 7: Novelty<br>Week 8: Mash-Ups<br>Week 9: Conclusions<br>",
    "estimatedClassWorkload": "2-4 hours\/week",
    "recommendedBackground": "Some college-level experience in the arts and humanities will be helpful. &nbsp;And the more the student is willing to complement classwork with independent looking and thinking about art, animation and video games (as well as comic books and graphic novels, film, etc.), the more they will get out of the class. &nbsp;Remember: &nbsp;Art is an ongoing process and art practice can't end in the classroom, wherever that classroom might be.",
    "links": {}
}