{"id":196,"shortName":"mysticthought","name":"Modern European Mysticism and Psychological Thought","language":"en","shortDescription":"The course will examine the psychological thought of the modern mystical traditions in Europe. We shall focus on two topics with wider cultural implications – the soul and the heart. \n","aboutTheCourse":"<p>In the revival of mysticism today, mysticism has become more psychological while psychology is increasingly interested in mysticism. This course will provide an entry into the complex world of modern mysticism, through studying its psychological thought. We shall begin with exploring the interpretations of mystical experience offered by psychoanalysts in the twentieth century, starting with Sigmund Freud and Carl Jung and ending with contemporary thinkers such as James Hillman. However, we will see that the European mystical traditions, including Kabbalah in the Jewish world and those of the Catholic, Orthodox and Protestant worlds, developed their own elaborate systems of psychological thought. Thus, we will mostly examine mystical psychology on its own terms. We shall especially look at two terms that are very much in use also in general culture: the heart (as an emotional rather than a physical center!...) and the soul, looking at the unique mystical concepts of their nature and destiny and asking if there were influences and meetings between the different religions.<\/p>","targetAudience":0,"courseSyllabus":"<p><b>Lecture 1: Introduction<br><\/b>Mysticism: Various Approaches. Magic, Mysticism, and Psychology. The Transition to Modernity. Defining the European context. The Situation of Judaism in Modernity. Psychology.<\/p><p><b>Lecture 2: Kabbalah and Psychology<br><\/b>History of Kabbalah and Kabbalah Research. History of Kabbalistic Views of Psychology.<\/p><p><b>Lecture 3: Kabbalah and Psychology: Close Reading of a Text<br><\/b>20th Century Kabbalah and Kabbalistic Psychology. Close Reading of a 20th Century Text by Rabbi Abraham Isaac Kook. 20th-21st Century: Later Development of Kabbalistic Schools. Discussion points: Will; Freedom; Depths; Cosmic theory; The soul.<\/p><p><b>Lecture 4: The Psychology of Hesychasm (Eastern Christian Mysticism)<\/b>St. Theophan the Recluse, <i>Turning the Heart to God<\/i>. Archimandrite Zacharias, <i>The Hidden Man of the Heart<\/i>. Discussion Points: The Psychology of Sin and Repentance; Transformation; Social Psychology; Positive Psychology.<\/p><p><b>Lecture 5: The Catholic Revival and the Religion of the Heart<br><\/b>Quietism: Miguel de Molinos. Feminine Spirituality. The Move to America. Discussion Points: Language and Silence; Active and Passive Models of Mystical Psychology.<\/p><p><b>Lecture 6: Psychology in Protestant Pietistic Mysticism<br><\/b>Pietism and German Mysticism in the Early Modern Period. Jacob Böhme, <i>Forty Questions of the Soul<\/i>. Discussion points: Will; Alchemy and Psychology; Wonder; Soul; Political Angle in Psychoanalysis; Gender.<\/p><p><b>Lecture 7: Concluding Discussion<br><\/b>Main Themes of the Course. Mystical Psychology in the Global Contemporary Context. Psycho-Spirituality. Mysticism in Contemporary Psychology.<\/p>","courseFormat":"<p>The course consists of seven lectures, each lasting 60-90 minutes. Lectures are divided into several 5-15 minute segments. Occasionally there will be in-class learning reinforcement exercises (These will not be calculated into the final grade of the course).<\/p><p>Each lecture will be followed by a homework assignment which will consist of several questions. The answers will be peer-graded by other students in the course; from our experience, this method is one of the best ways to ensure that students think about and \"internalize\" - not just memorize - the material they have learnt. The final grade of the course will be the average of the student's five highest grades (out of seven) on the homework assignments.<\/p><p>In this course there is no required reading. A full list of suggested readings will appear on the course session website, for those interested in deepening their understanding.&nbsp;<br><\/p><p><br><\/p>","suggestedReadings":"<i><\/i><i>The full list of suggested readings will appear on the course session website<br><\/i><br><span>Ted Campbell, <i>The Religion of the Heart.<\/i>&nbsp;Eugene, Oregon 2000<br><\/span><span><br>Jonathan Garb, <i>Shamanic Trance in Modern\nKabbalah.<\/i>&nbsp;Chicago 2011<\/span><span><br><br>Wolfgang Geigerich, <\/span><i>The Soul's Logical Life: Towards a Rigorous Notion of Psychology. <\/i>Frankfurt am Main 1998<br><br><span>James Hillman, <i>Insearch: Psychology and Religion.<\/i>&nbsp;Dallas 1994<br><\/span><br>Jess Byron Hollenback,&nbsp;<i>Mysticism: Experience, Response, and Empowerment.&nbsp;<\/i>Philadelphia&nbsp;1996<br><br>Jeffrey J. Kripal, <i>Authors of the Impossible: The Paranormal and the Sacred.<\/i>&nbsp;Chicago 2010<br><br>Tanya M. Luhrmann,&nbsp;<i>When God Talks Back: Understanding the American Evangelical Relationship With God<\/i>. New York 2012<br><br>William\nB. Parsons,&nbsp;<i>Freud and Augustine in Dialogue: Psychoanalysis, Mysticism and the Culture\nof Modern Spirituality<\/i>, Charlottesville and London 2013<br><br>Elliot R. Wolfson, <i>A Dream Interpreted within a Dream: Oneiropoiesis and the Prism of Imagination.<\/i>&nbsp;New York 2011<br><br><p>\n<\/p>","instructor":"Jonathan Garb","estimatedClassWorkload":"2-3 hours\/week","recommendedBackground":"No background is required, all are welcome!<br><br>","links":{}}