{"id":175,"shortName":"macroeconomics","name":"Principles of Macroeconomics","language":"en","shortDescription":" All of us are affected by macroeconomic forces – they shape the very world we live in. And governments all around the world try to shape those forces in ways that (hopefully) improve the lives of their constituents. In this subject, we will examine the major theories used by macro economists to analyse national economies and the international economy. ","aboutTheCourse":"<p>In this course,\nwe will examine the main bodies of economic theory that have been used to guide\neconomists’ and policy makers’ understanding of the macroeconomy. Macroeconomics\nis a word derived from the Greek prefix “makros”, meaning large. It is the study\nof economic aggregates, of national and international economies and of the\neconomic management role played by governments and international organisations.\n<\/p>\n\n<p>The founder of\nmodern macroeconomics, the British economist John Maynard Keynes, famously wrote\n“The ideas of economists and political philosophers, both when they are right\nand when they are wrong are more powerful than is commonly understood. Indeed,\nthe world is ruled by little else. Practical men, who believe themselves to be\nquite exempt from any intellectual influences, are usually slaves of some\ndefunct economist.” This will be the key theme we explore in the course, the\ninfluence of theory and the way that policy responses to events like recession,\nunemployment, inflation and the Global Financial Crisis, reflect that theory.<\/p>\n\n<p>We will cover\nimportant macroeconomic concepts such as the national accounts, unemployment\nand inflation, explain how the ideas associated with John Maynard Keynes laid\nthe foundation for governments’ active management of the macroeconomy in the\npost war era, and examine the intellectual basis for the monetary and fiscal\npolicy responses to the Global Financial Crisis.&nbsp; Economists’ approaches to the analysis of\nlong run economic growth will also be considered. The approach will be\ncritical. There are few areas of human endeavour that attract so much debate\nand disagreement as the management of a modern industrial economy. We will not\nshy away from those debates. But what we will do is emphasise the systematic\ntheorising that underlies the way macroeconomists and policy makers approach\ntheir task. The aim is to enable those who take the course to become informed\nanalysts of the macroeconomy and of current (and past) macroeconomic policy\ndebates.<\/p><p><i>Image source: Nilss Olekalns University of Melbourne 2012<\/i><br><\/p>","targetAudience":0,"courseSyllabus":"","courseFormat":"","suggestedReadings":"<div>There are no required readings for this course.<\/div>","instructor":"Nilss Olekalns","estimatedClassWorkload":"6-8 hours\/week","recommendedBackground":"","links":{}}