{
    "id": 1330,
    "shortName": "spatialcomputing",
    "name": "From GPS and Google Maps to Spatial Computing",
    "language": "en",
    "shortDescription": "This course introduces concepts, algorithms, programming, theory and design of spatial computing technologies such as global positioning systems (GPS), Google Maps, location-based services and geographic information systems. Learn how to collect, analyze, and visualize your own spatial datasets while avoiding common pitfalls and building better location-aware technologies.",
    "aboutTheCourse": "<p>From Google Maps to consumer global positioning system (GPS) devices, spatial technology shapes many lives in both ordinary and extraordinary ways. Thanks to spatial computing, a hiker in Yellowstone and a taxi driver in Manhattan can know precisely where\n    they are, discover nearby points of interest and learn how to reach their destinations. Spatial computing technology is what powers the Foursquare check-in, the maps app on your smartphone, the devices used by scientists to track endangered species,\n    the routing directions that help you get from point A to point B, the precision agriculture technology that is revolutionizing farming, and the augmented reality devices like Google Glass that may soon mediate our interaction with the real world.<\/p>\n<p>This course introduces the fundamental ideas underlying spatial computing services, systems, and sciences. Topics covered will include the nature of geospatial information, proper statistical frameworks for working with geospatial data, key algorithms\n    and data structures, spatial data mining, and cartography\/geovisualization. We will also address applied topics such as where to find spatial data, how to use powerful open source software to analyze and map spatial data, and frameworks for building\n    location-based services.\n    <br>\n<\/p>\n<p>\n    <br><b>Three Ways to Enjoy this Course:<\/b>\n    <br>\n<\/p>\n<p>This course is designed to support three different types of students and educational goals:\n    <br>\n<\/p>\n<p><i>Curiosity Track<\/i>: Most of us interact with spatial technologies every day. This track is for students who wish to learn about one or two spatial computing topics, but not commit to an entire course. Curiosity track students are not interested in\n    a certificate of accomplishment.\n    <br>\n<\/p>\n<p><i>Concepts Track<\/i>: This track is for students who want to learn about spatial computing concepts in order to make informed choices, but who are not programmers and do not have extensive experience with statistical methods. For example, concepts track\n    students will learn about Tobler’s First Law of geography and map projections, but will not delve into the quantifications of either. Students who complete the concepts track with sufficiently high scores will receive a Statement of Accomplishment.\n    <br>\n<\/p>\n<p><i>Technical Track<\/i>: This track builds on the concepts track, but adds math and programming. For example, we will cover spatial statistical indicators like Moran’s I and Ripley’s K when discussing Tobler’s First Law and will have students calculate\n    the distance between two points using two different coordinate systems and open-source APIs. Students who complete the technical track with sufficiently high scores will receive a Distinguished Statement of Accomplishment.\n    <br>\n<\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<strong>Topics Covered:<\/strong>\n<br>\nModule 1 - Introduction\n<br>\n<blockquote>\nCourse Introduction<br>\nDefining Spatial Computing<br>\nCourse Structure<br>\nInterviews with Johannes Schöning, Loren Terveen and Martin Raubal\n<\/blockquote>\nModule 2 - Spatial Query Languages\n<blockquote>\nWhat is a Query? Query Language?<br>\nAn example database with 3 tables<br>\nSQL overview<br>\nSELECT statement with 1 table<br>\nMulti-table SELECT statement<br>\nWhy spatial extensions are needed<br>\n1-table spatial queries<br>\nTrends<br>\n<\/blockquote>\nModule 3 - Spatial Networks\n<blockquote>\nMotivation, Societal use cases<br>\nExample spatial networks<br>\nConceptual and mathematical models <br>\nNeed for SQL extensions<br>\nCONNECT statement<br>\nRECURSIVE statement<br>\nStorage and data structures<br>\nAlgorithms for connectivity query<br>\nAlgorithms for shortest path<br>\nInterviews with Dev Oliver and Betsy George\n<\/blockquote>\nModule 4 - Spatial Data Mining\n<blockquote>\nMotivation, Spatial Pattern Families<br>\nSpatial data types and relationships <br>\nLimitations of Traditional Statistics<br>\nLocation Prediction model<br>\nHotspots <br>\nSpatial outliers<br>\nColocations and Co-occurrences<br>\nSummary:  What is special about mining spatial data?\n<\/blockquote>\nModule 5 - Volunteered Geographic Information (VGI)\n<blockquote>\nIntroduction to Volunteered Geographic Information<br>\nProducing VGI<br>\nPros and Cons of VGI<br>\nInterview with Michael Goodchild\n<\/blockquote>\nModule 6 - Positioning\n<blockquote>\nIntroduction to Positioning<br>\nOverview of GPS<br>\nOverview of Wifi and Cellular Positioning<br>\nIntroduction to Content-based Positioning<br>\nGeoparsing <br>\nLocation-field Positioning\n<\/blockquote>\nModule 7 - Cartography\n<blockquote>\nIntroduction to Cartography<br>\nOverview of Maps and Mapping<br>\nReference Maps<br>\nThematic Maps<br>\nSpatialization\n<\/blockquote>\nModule 8 - Future Directions\n<blockquote>\nIntroduction <br>\nSpatial Databases: Representative projects<br>\nData Mining: Representative projects<br>\nAdvances in Cartography<br>\nAdvances in Positioning<br>\nInterviews with Vipin Kumar, Wan Bae, Mohammed Mokbel and Len Kne\n<\/blockquote>",
    "estimatedClassWorkload": "4-10 hours\/week",
    "recommendedBackground": "",
    "links": {}
}