{
    "id": 1293,
    "shortName": "globalorder",
    "name": "The Changing Global Order",
    "language": "en",
    "shortDescription": "This course deals with international relations, peace and security and brings together a number of experts from the field and academia to share their perspectives. The course will help you gain insight into conflict resolution and the role organizations such as the United Nations Security Council, the European Union, the African Union and NATO play in a changing world.",
    "aboutTheCourse": "<p>How are international power relations changing and how can global peace and stability be maintained? This course familiarizes you with some main theories of international relations, shows how the global order is gradually changing and discusses how selected\n    international and regional organizations contribute to the maintenance of global peace and security.&nbsp;<\/p><p>You learn what research findings tell us in terms of the capacity of international organizations and actors to help prevent or stop violent conflict,\n    what tools are used to negotiate agreements and how foundations for sustainable peace are best created. In the course, we also focus on the role of the European Union (EU) in terms of diplomacy and efforts to prevent conflict, the North Atlantic Treaty\n    Organization (NATO) and the contribution of some other regional organizations to the prevention of conflict and war.&nbsp;<\/p><p>We also look at activities of the United Nations Security Council (UNSC) and, in the context of a final debate, see in\n    which ways its membership could be adapted to more accurately reflect the power relations of the current global order.&nbsp;<\/p><p>You learn about all of these topics by doing quizzes and exercises testing your knowledge of these subjects, helping you understand\n    crucial concepts and get insights into how the academic study of international relations and international organization can contribute to the search for global stability and peace in practice.<\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<p><\/p><p>This course is part of the Specialization track 'The Challenges in Global Affairs', which contains three courses and a capstone project. The courses do not have to be taken in any particular order.&nbsp;<\/p><div><b>Week 1:<\/b> Introduction to International Relations<\/div><div><b>Week 2:<\/b> The Changing World Order: Rising Powers and International Institutions<\/div><div><b>Week 3:<\/b> Conflict, Conflict Resolution and Security<\/div><div><b>Week 4:<\/b> Regional Organizations in Global Affairs: The Examples of the European Union, the African Union, the Shanghai Cooperation Organization and the Arctic Council<\/div><div><b>Week 5:<\/b> NATO in a Changing World<\/div><div><b>Week 6:<\/b> Reforming the United Nations Security Council: Strategies and Proposals<\/div>",
    "estimatedClassWorkload": "6-8 hours\/week",
    "recommendedBackground": "<div>Students of international relations, international law, political science, history, sociology and professionals interested in the field of international relations and security studies with relevant work experience.&nbsp;<\/div><div><br><\/div>",
    "links": {

    }
}