{
    "id": 863,
    "shortName": "dino101",
    "name": "Dino 101: Dinosaur Paleobiology",
    "language": "en",
    "shortDescription": "Dino 101: Dinosaur Paleobiology is a 12-lesson course teaching a comprehensive overview of non-avian dinosaurs. Topics covered: anatomy, eating, locomotion, growth, environmental and behavioral adaptations, origins and extinction. Lessons are delivered from museums, fossil-preparation labs and dig sites. Estimated workload: 3-5 hrs\/week.",
    "aboutTheCourse": "<div>In Dino 101: Dinosaur Paleobiology, students will learn about the many kinds of non-avian dinosaurs that roamed the earth during the Mesozoic Era, from 250 to 65 million years ago. Numerous topics are covered in order to deliver a comprehensive survey of this important group of animals. These include&nbsp;adaptations for&nbsp;attack and defence,&nbsp;anatomy,&nbsp;&nbsp;appearances, behaviors, birth, deep time, evolutionary theory, feeding, fossilization, growth, integumentary structures, locomotion, major groupings, origins, paleogeography, plate tectonics, reproduction, species definition, stratigraphy,&nbsp;and the extinction event&nbsp;that brought their dominance to an end.<\/div><div><br><\/div><div>Course material is delivered in a student-friendly short-form fashion, with numerous formative feedback sections. Many lessons are delivered from actual dinosaur dig sites. Students will gain access to a number of special interactive modules designed specifically for this course. These modules will grant users access to their very own virtual fossil collection, allow them to build dinosaur skeletons and provide them with an interactive visual representation of geologic time. This course's unique lesson delivery, combined with a classic quiz structure, will enable students to quickly gain a solid foundation for understanding dinosaurs, their adaptations and behaviours, and their place in the long history of earth. Please note that our instructors and support staff are currently being finalized and are subject to change.<br><br><div><div>Dino 101 is part of an ongoing program of research into digital learning conducted by the University of Alberta and therefore anonymized data provided by Coursera and survey information can be made accessible to the researchers.<\/div><\/div><div><br><\/div><div><br><\/div><\/div>",
    "targetAudience": 0,
    "courseSyllabus": "<p><strong>Week 1<\/strong>: \n“Appearances and Anatomy” <br>\ncovers the diversity in dinosaur appearances, and will be able to identify major features of the major groups of dinosaurs.<\/p>\n\n<p><strong>Week 2<\/strong>: \n“Death and Fossilization” <br>\ndescribes how fossils form, how we interpret the taphonomy of skeletons and bonebeds, and looks at the possible biases taphonomic events may create in the fossil record.<\/p>\n\n<p><strong>Week 3<\/strong>: \n“Eating” <br>\nlooks at the variety of food types, feeding habits, and feeding adaptations amongst the major groups of dinosaurs<\/p>\n\n<p><strong>Week 4<\/strong>: \n“Moving Around” <br>\nhelps students understand the general modes and styles of locomotion in the major dinosaur groups. The lesson also describes general methods of evaluating hypotheses on locomotion.<\/p>\n\n<p><strong>Week 5<\/strong>: \n“Birth, Growth, Reproduction” <br>\nprovides a generalized life history of a dinosaur, from birth through adulthood, including reproduction. The student will be able to describe major techniques of evaluating growth stages and rates in dinosaurs.<\/p>\n\n<p><strong>Week 6<\/strong>: \n“Attack and Defence” <br>\nexamines the behaviours and structures that may have served for attack or defence through the lifetime of a dinosaur.<\/p>\n\n<p><strong>Week 7<\/strong>: \n“What is a Species” <br>\nwill teach the different ways of defining what a species is. Students will be able to compare the strengths and weaknesses of different species concepts for different situations.<\/p>\n\n<p><strong>Week 8<\/strong>: \n“Evolution” <br>\nwill describe the basic theories of speciation, and discusses how how these different methods of speciation may have occurred, including both hypothetical and empirical examples.<\/p>\n\n<p><strong>Week 9<\/strong>: \n“Stratigraphy and Geologic Time” <br>\nprovides basic stratigraphic concepts and the scale of earth history. Students will understand the evolution of dinosaurs through time, including which groups evolved when and where.<\/p>\n\n<p><strong>Week 10<\/strong>: \n“Palaeogeography and Plate Tectonics” <br>\npresents the basic concepts in plate tectonics and the evolution of the earth’s surface.<\/p>\n\n<p><strong>Week 11<\/strong>: \n“Dinosaur Origins” <br>\nwill look at the evolution of dinosaurs from non-dinosaurian archosaurs.<\/p>\n\n<p><strong>Week 12<\/strong>: \n“Dinosaur Extinction” <br>\nwill examine the end-Cretaceous extinction event, and provide examples of vertebrate groups that both persisted and died out during the event.<\/p>",
    "estimatedClassWorkload": "3-10 hours\/week",
    "recommendedBackground": "No background is required; all are welcome!",
    "links": {}
}