{"id":1792,"shortName":"globalbusiness","name":"International Business I - Negocios Internacionales I","language":"en","shortDescription":"Una materia bilingüe (videos y materiales en español e ingles), introduciendo alumnos a los factores sociales, económicos, históricos, y políticos que influyen al entorno global de negocios.\n\nA bilingual course (materials and videos in Spanish & English) introducing students to social, economic, political, historical factors that influence the global business environment.","aboutTheCourse":"<p>Please note that this is a&nbsp;<b>bilingual English-Spanish course<\/b>&nbsp;with all material duplicated in both languages.<br><\/p><p><i><b>Atención<\/b>: este es un curso&nbsp;<b>bilingüe español-inglés<\/b>&nbsp;con todo el material duplicado en ambos idiomas. Para ver el video promocional en&nbsp;<b>español<\/b>, haz clic&nbsp;<b><a href=\"http:\/\/youtu.be\/utt2SddRnwc\" target=\"_blank\">aquí<\/a><\/b>.<\/i><\/p><p>We live in a world of intensifying global relationships, one in\nwhich international business has become the key determinant of economic\ndevelopment and prosperity. This course, Global Business Environment, Part I,\nintroduces students to a fundamental understanding of the socioeconomic\npolitical, cultural, and linguistic environment in which international businesses\noperate. This course utilizes an inquiry-based approach to understanding\ncountry level relationships in the Global Business Environment. It surveys the\nglobal business environment by asking and answering key questions about\nsociety, the global economy, cultures, institutions and languages. The\nquestions we will ask are: 1. What is Globalization?, 2. Is\nGlobalization New?, 3. How do Political and Social Institutions impact National\nEconomic Development?, 4. What is the role of Culture?, 5. What are the Gains\nfrom Trade?6. Free Trade, Free-r Trade or Managed Trade?, 7. What are Foreign\nCurrencies and how are Exchange Rates Determined?, 8. What does the Current\nGlobal Business Environment look like? This inquiry-based approach creates reflective opportunities for\nstudents to better understand the environment in which businesses operate.\nLectures are delivered in an engaging manner, which encourages reflection and\ninquiry. Course lectures will be delivered by the instructor in both Spanish\nand English.<\/p>\n\n<p>Vivimos en un mundo cada vez mas\nglobalizado, en el cual el éxito en los negocios internacionales se ha\nconvertido en el factor determinante del desarrollo económico y la prosperidad.\nEsta materia, Entorno Global de Negocios, Parte I, introduce al alumno a una\ncomprensión fundamental del entorno político, cultural, lingüística y\nsocio-económico en el cual opera una empresa internacional. Esta materia utiliza\nuna pedagogía basada en la investigación y preguntas para entender las\nrelaciones entre países en el entorno global de negocios. Se examina el entorno\nempresarial global al hacer y responder a preguntas claves sobre la sociedad,\nla economía global, las culturas, las instituciones y los idiomas. Las\npreguntas son: 1.\n¿Que es la Globalización?, 2. ¿Es la Globalización Nueva?, 3. ¿Cuál es el\nimpacto de las instituciones sociales y políticas al Desarrollo Económico\nNacional?, 4. ¿Cual es el Papel de la Cultura?, 5. ¿Cuales son los Beneficios\ndel Comercio Exterior? 6. ¿Libre Comercio?, 7. ¿Como se determinan los Tipos de\nCambio?, 8. ¿Como esta el Entorno Global de Negocios?\nEste enfoque basado en la investigación y preguntas\ngenera oportunidades de reflexión para que los alumnos comprendan mejor el\nentorno global en el que operan las empresas. Los videos se entregan de una\nmanera\ncautivador, que\nfomenta la reflexión y la investigación. Las clases serán impartidas por el\ninstructor en el español y en el Inglés.<\/p>","targetAudience":0,"courseSyllabus":"&nbsp;&nbsp; Week 1. What is Globalization?<br>Week 2. Is\nGlobalization New? <br>Week 3. How do Political and Social Institutions impact National\nEconomic Development?<br>Week 4. What is the role of Culture?<br>Week 5. What are the Gains\nfrom Trade?<br>Week 6. Free Trade, Free-r Trade or Managed Trade?<br>Week 7. What are Foreign\nCurrencies and how are Exchange Rates Determined?, <br>Week 8. What does the Current\nGlobal Business Environment look like? <br><br><strong>Descripción del Curso<\/strong><br>Semana 1. ¿Qué es la Globalización?<br>Semana 2. ¿Es Nueva la Globalización?<br>Semana 3. ¿Cómo Impactan al Desarrollo Económico Nacional las Instituciones Sociales y Políticas?<br>Semana 4. ¿Cuál es el Papel de la Cultura?<br>Semana 5. ¿Cuáles son las Ganancias del Comercio?<br>Semana 6. ¿Libre Comercio, Comercio más Libre o Comercio Manejado? <br>Semana 7. ¿Como se determinan los Tipos de\nCambio?, <br>Semana 8. ¿Como esta el Entorno Global de Negocios? <br><br><br><br><br><br><br><br><br>","courseFormat":"<div>This course will consist of lecture videos given by the instructor which will be 5-10 minutes in length. Each module will include several videos. Each week will begin with a key question.<\/div><div><br><\/div>","suggestedReadings":"The lectures are designed to be self-contained; no additional readings are necessary.","estimatedClassWorkload":"3-6 hours\/week","recommendedBackground":"No background is required; all are welcome!","links":{}}