{
    "id": 739,
    "shortName": "clinicalskills",
    "name": "Teaching and Assessing Clinical Skills",
    "language": "en",
    "shortDescription": "The purpose of this course is to improve feedback, clinical teaching, and assessment of clinical skills. ",
    "aboutTheCourse": "<p>Clinical teaching takes place in the clinical setting for health professions. Clinical teachers have the challenging and meaningful responsibility to convey the bedside art and science of medical practice. This course will provide clinicians with the tools to improve their clinical teaching and assessment practices. This course provides instruction and experience for educating members of the health professions an asynchronous way to obtain, expand, and improve their clinical teaching skills. While many courses seek to build knowledge and knowledge application, this course will extend the application to performance- based skills. These skills can be applied within their own professional context, with a variety of learners, extending across many stages. We will ask you go out and apply the skills you are learning and then come back and reflect discuss with classmates.<\/p><p><strong>Course Objectives<\/strong><\/p><p>After completing this course, learners will:<\/p><ol><li>Learn a variety of applied teaching techniques<\/li><li>Be able to have an effective feedback discussion<\/li><li>Be able to orient the learner in their clinical setting<\/li><li>Be able to analyze the RIME* level of the learner and share strategies for learner to improve<\/li><li>Understand and apply entrustment and autonomy to effectively supervise and teach residents<\/li><li>Share successful strategies in these areas<\/li><li>Integrate these teaching and assessing strategies successfully in their clinical environment<\/li><\/ol>",
    "targetAudience": 3,
    "courseSyllabus": "<p>Each section will be covered leading professors in the specific areas:<br><\/p><p dir=\"ltr\">Week 1 - Feedback: Dr. Sally Santen (Assistant Dean of Educational Research and Quality Improvement, Associate Chair of Education, Department of Emergency Medicine, Professor, Department of Emergency Medicine and Learning Health Sciences) and Dr. Jocelyn Schiller (Clerkship Director, Associate Professor of Pediatrics and Communicable Diseases) from the University of Michigan Medical School<\/p><p dir=\"ltr\">The content will cover<\/p><ul><li><p dir=\"ltr\">What is feedback?<\/p><\/li><li><p dir=\"ltr\">Why should we provide feedback? Why is feedback difficult?<\/p><\/li><li><p dir=\"ltr\">A model for providing feedback<\/p><\/li><\/ul><p dir=\"ltr\">Week 2 - Orienting your Learner: Dr. Jenny Christner (Associate Dean for Undergraduate Medical Education, Associate Professor of Pediatrics, Upstate Medical University, State University of New York) and Dr. Sally Santen<\/p><p dir=\"ltr\">The content will cover<\/p><ul><li><p dir=\"ltr\">Why is orientation important?<\/p><\/li><li><p dir=\"ltr\">A model for ORIENTing the learner<\/p><\/li><li><p dir=\"ltr\">What belongs in orientation<\/p><\/li><li><p dir=\"ltr\">Designing and providing orientation to your setting<\/p><\/li><\/ul><p dir=\"ltr\">Week 3 - RIME* Model for Learner Assessment and Feedback: Dr. Jenny Christner and Dr. Sally Santen<\/p><p dir=\"ltr\">The content will cover<\/p><ul><li><p dir=\"ltr\">What is RIME? (Reporter, Interpreter, Manager, Educator model from Dr Lou Pangaro)<\/p><\/li><li><p dir=\"ltr\">RIME in use<\/p><\/li><li><p dir=\"ltr\">How to incorporate RIME into your practice<\/p><\/li><\/ul><p dir=\"ltr\">Week 4 - How to Effectively Supervise and Teach Residents: Entrustment and Autonomy: Dr. Sally Santen and Dr. Meg Wolff (Assistant Fellowship Director, Assistant Professor of Emergency Medicine Pediatrics and Communicable Diseases) from the University of Michigan Medical School<\/p><p dir=\"ltr\">The content will cover<\/p><ul><li><p dir=\"ltr\">What is entrustment?<\/p><\/li><li><p dir=\"ltr\">Factors affecting entrustment<\/p><\/li><li><p dir=\"ltr\">Entrustment in practice<\/p><\/li><li><p dir=\"ltr\">Tips to entrustment<\/p><\/li><\/ul><p dir=\"ltr\">Week 5 - BID Model for Teaching in the Operating Room and Procedures: Nicole K. Roberts, Ph.D. and Dr. Sally Santen<\/p><p dir=\"ltr\">The content will cover<\/p><ul><li><p dir=\"ltr\">Introduction to model<\/p><\/li><li><p dir=\"ltr\">Briefing <\/p><\/li><li><p dir=\"ltr\">Interoperability and procedural teaching <\/p><\/li><li><p dir=\"ltr\">Debriefing <\/p><\/li><\/ul><p dir=\"ltr\">Week 6 - Integration, Connection &amp; Summation: Dr Sally Santen<\/p><p dir=\"ltr\">This is a period for catchup, reflection, integration, connection and summation. It will include some discussion forums, specific times to connect in real time via social media (hang-out) and final action plans of how to move forward.<\/p>",
    "estimatedClassWorkload": "3-5 hours\/week",
    "recommendedBackground": "The appropriate background is a health professional working with learners in the clinical environment. This course is provided by physicians and therefore aimed at physician learners. We think that the principles can be applied to all of the health professions.",
    "links": {}
}