{
    "id": 2614,
    "shortName": "logisticregression",
    "name": "Applied Logistic Regression",
    "language": "en",
    "shortDescription": "This course provides theoretical and practical training on the increasingly popular logistic\nregression model, which has become the standard analytical method for use with a\nbinary response variable.",
    "aboutTheCourse": "<p>This Applied Logistic Regression course provides theoretical and practical training for epidemiologists,\nbiostatisticians and professionals of related disciplines in statistical modeling with\nparticular emphasis on logistic regression.<\/p>\n<p>The increasingly popular logistic regression model has become the standard method for regression analysis of binary response data in the health sciences.<\/p>\n<p>By the end of this course, students should<\/p>\n<ul>\n<li>Master methods of statistical modeling when the response variable is binary.<\/li>\n<li>Be confident users of the Stata package for computing binary logistic regression\nmodels.<\/li>\n<\/ul>\n<p>This is a hands-on, applied course where students will become proficient at using\ncomputer software to analyze data drawn primarily from the fields of medicine,\nepidemiology and public health.<\/p>\n<p>There will be many practical examples and homework exercises in this class to help you learn.&nbsp;If you fully apply yourself in this course and complete all of the homework, you will have the opportunity to master various methods of statistical modeling and you will become a more confident user of the Stata* package for computing linear, polynomial and multiple regression.<\/p>*Access to Stata will be provided at no cost for the duration of this course.<br><br><br>\n\n<img src=\"https:\/\/d396qusza40orc.cloudfront.net\/logisticregression\/CVV-logo-1.png\" style=\"float:middle\" alt=\"Centre Virchow-Villermé logo\"><br><br>This course was developed in partnership with the <a href=\"http:\/\/virchowvillerme.eu\/\" target=\"_blank\">Centre Virchow-Villermé for Public Health Paris-Berlin<\/a>, a bi-national centre of the <a href=\"http:\/\/www.sorbonne-paris-cite.fr\/\" target=\"_blank\">Université Sorbonne Paris Cité<\/a> and <a href=\"http:\/\/www.charite.de\/en\/charite\/\" target=\"_blank\">Charité – Universitätsmedizin Berlin<\/a>. Special support was contributed from the <a href=\"https:\/\/www.univ-paris5.fr\/eng\" target=\"_blank\">Université Paris Descartes<\/a> that also belongs to the community of Université Sorbonne Paris Cité.<br><br><br><br>All lectures and instructional materials developed for this course by the Ohio State University are licensed under the Creative Commons AttributionNonCommercial-ShareAlike 4.0 International License. To view a copy of this license, visit&nbsp;<a href=\"http:\/\/creativecommons.org\/licenses\/by-nc-sa\/4.0\/\">http:\/\/creativecommons.org\/licenses\/by-nc-sa\/4.0\/<\/a><br>",
    "targetAudience": 2,
    "courseSyllabus": "<div><strong>Week One<\/strong><br>\n<ul>\n<li>Logistic Regression Analysis<\/li>\n<li>Fitting the Logistic Model<\/li>\n<\/ul>\n<\/div>\n<div><strong>Week Two<\/strong><br>\n<ul>\n<li>The Likelihood Ratio Test<\/li>\n<li>Finding a Confidence Interval for β and π<\/li>\n<li>The Multiple Logistic Regression Model<\/li>\n<li>Fitting the Multiple Logistic Regression Model<\/li>\n<\/ul>\n<\/div>\n<div><strong>Week Three<\/strong><br>\n<ul>\n<li>Confidence Intervals for β, the Logit, and π<\/li>\n<li>Interpretation of Coefficients<\/li>\n<li>Dichotomous Independent Variables<\/li>\n<\/ul>\n<\/div>\n<div><strong>Week Four<\/strong><br>\n<ul>\n<li>Polychotomous Independent Variables<\/li>\n<li>Continuous Independent Variables<\/li>\n<\/ul>\n<\/div>\n<div><strong>Week Five<\/strong><br>\n<ul>\n<li>Statistical Adjustment<\/li>\n<li>Interaction and Confounding<\/li>\n<\/ul>\n<\/div>\n<div><strong>Week Six<\/strong><br>\n<ul>\n<li>Estimating Odd Ratios in the Presence of Interaction<\/li>\n<li>The 2X2 Table - Stratified Analysis vs Logistic Regression<\/li>\n<li>Assessing the Fit of the Logistic Regression Model<\/li>\n<\/ul>\n<\/div>\n<div><strong>Week Seven<\/strong><br>\n<ul>\n<li>Summary Measures of Goodness-of-Fit<\/li>\n<li>Area Under the ROC Curve<\/li>\n<\/ul>\n<\/div>\n<div><strong>Week Eight<\/strong><br>\n<ul>\n<li>R-squared-type Measures<\/li>\n<li>Numerical Problems<\/li>\n<li>Estimating the Mortality of ICU Patients<\/li>\n<\/ul>\n<\/div><br><br>",
    "estimatedClassWorkload": "2-6 hours\/week",
    "recommendedBackground": "<p>Students interested in this course should have background in introductory statistical methods. While not absolutely necessary, familiarity with some statistical software package (such as SPSS, SAS or R) would definitely be an advantage.&nbsp;<\/p><p>We will be making exclusive use of Stata for the course lectures and homework solutions. However, students who are proficient in other packages could use those packages in place of Stata.&nbsp;<\/p><p>Based on past experience we strongly encourage students to use Stata for this course as it will facilitate communications with the professor, the teaching assistants, as well as other students in the course.<\/p><br><br>",
    "links": {}
}