{"id":524,"shortName":"globalization","name":"Globalization and You","language":"en","shortDescription":"This course offers an evidence-based analysis of globalization that addresses what is happening to us personally as well as economically amidst the market-led processes of global integration. ","aboutTheCourse":"<p>Particular attention is paid to the ways market-led macro-economic reforms\n    associated with globalization (such as free trade agreements and privatization\n    initiatives) have come together with much more micro innovations in how\n    personal behavior is organized by market forces (rethinking education as\n    a personal investment practice, for example, or outsourcing dating to for-profit\n    companies).  Mediating between these macro and micro scales of capitalist\n    transformation are a wide array of other market-based mechanisms examined\n    in the course.  From bond risk ratings to the market metrics shaping\n    FICO scores, personalized medicine and online mapping, these market-mechanisms\n    require close examination. Tracing their influence with an awareness of\n    their material geographic variation and unevenness, the course offers an\n    alternative to economistic assumptions about choice-maximizing behavior\n    on a ‘level playing field’. It explores instead the complex uneven development\n    dynamics of globalization in ways that allow you to see how your own personal\n    perspectives on these dynamics are at once outcomes and enablers of economic\n    and social change.  And, by doing so, the course aims in turn at enabling\n    you to be a more engaged participant in the ongoing debates over the direction\n    these dynamics <i>should<\/i> take.  Key words that are debated, defined\n    and\/or explained in the course include: globalization, interdependency,\n    discourse, capitalism, neoliberalism, value, financialization, harmonization,\n    competition, governance, governmentality, power, citizenship, choice, accountability,\n    enclaving, geopolitics, biopolitics, biocapital and global health.<\/p>","targetAudience":0,"courseSyllabus":"<p><b>Course goal:<\/b> \n    <br>To enable you to comprehend market-led globalization in ways that allow\n    you to evaluate how your own life and personal choices are shaped by market\n    forces and associated global ties.\n    <br>\n<\/p>\n<p><b>Course-level learning objectives:<\/b>\n\n    <br>At the end of this class you will be able to:<\/p>\n<ul>\n    <li>Describe the main debates and controversies surrounding globalization;<\/li>\n    <li>Analyze the ties and tensions of uneven global development;<\/li>\n    <li>Understand the growing impact of global market integration;<\/li>\n    <li>Synthesize knowledge of market globalization with your own experiences\n        of market forces and market reforms;<\/li>\n    <li>Evaluate the way in which market forces define and delimit personal choices\n        and everyday life globally;<\/li>\n    <li>Develop capacity to respond and reflect personally amidst the ties and\n        tensions of market-led globalization.\n        <br>\n    <\/li>\n<\/ul>\n<p><strong><u>Assignment Overview:<\/u><\/strong> \n    <br>Here are some of the course assignments and activities: <\/p>\n<ul>\n    <li><strong>Video lectures<\/strong>: Most of the course content is delivered\n        through video lectures. Each video runs 10-12 minutes<\/li>\n    <li><strong>Discussion forums<\/strong>: This class thrives on discussion.\n        Multiple discussion forums are designed to develop out of the lectures.\n        You will have the ability to articulate your own views on globalization\n        as well as learn from your fellow students from around the world.<\/li>\n    <li><strong>Quizzes<\/strong>: Many video lectures have short quizzes embedded\n        that allow you to check your grasp of basic knowledge as the course proceeds.<\/li>\n    <li><strong>Peer Assessment Assignments -<\/strong> There are peer assessment\n        activities available for this course.  By participating in these,\n        and reading and responding to the work of others, you can also help improve\n        your own learning and understanding.<\/li><\/ul><ul>\n<\/ul><br>","courseFormat":"<p><strong>Week  1: Course overview and Globalization<\/strong>\n\n    <br>\n    - part i) Definitions: introducing a world of iInterdependency and a word\n    <br>\n    - part ii) The ties that bind: outlining the networks of global interdependency\n    <br>\n    - part iii) Maps of the invisible and unequal: building your global knowledge\n    of uneven global integration\n    <br> <strong>Week  2: Discourse<\/strong>\n    <br>\n    - part i) Dominant discourse on globalization\n    <br>\n    - part ii) Dissident discourse on globalization\n    <br>\n    - part iii) Decoding discourse you use about globalization\n    <br> <strong>Week  3: Commodities<\/strong>\n\n    <br>\n    - part i) World trade\n    <br>\n    - part ii) Commodity chains\n    <br>\n    - part iii) TNCs, brand identity and the commodification of yourself\n    <br> <strong>Week  4: Labor<\/strong>\n\n    <br>\n    - part i) Worker worlds and changing geographical divisions of labor\n    <br>\n    - part ii) Worker solidarity and changing social divisions of labor\n    <br>\n    - part iii) Training yourself to be a global worker\n    <br> <strong>Week  5: Money<\/strong>\n\n    <br>\n    - part i) Making sense of your money and global financial news\n    <br>\n    - part ii) From bretton woods to the rise of global finance\n    <br>\n    - part iii) Inequality, poverty and the market discipline of debt\n    <br> <strong>Week  6: Law<\/strong>\n\n    <br>\n    - part i) Trade agreements and the globalization of commercial law\n    <br>\n    - part ii) Courts human rights and judicial globalization\n    <br>\n    - part iii) Personal rights and responsibilities amidst the grassroots\n    globalization of law\n    <br> <strong>Week  7: Governance  <\/strong>\n\n    <br>\n    - part i) Market rule and the end of the nation-state\n    <br>\n    - part ii) IGOs, global development and neoliberal governance\n    <br>\n    - part iii) NGOs, personal behavior and neoliberal governmentality\n    <br> <strong>Week  8: Space<\/strong>\n\n    <br>\n    - part i) Uneven development, geopolitics and geoeconomics\n    <br>\n    - part ii) Global cities and speculative urbanism\n    <br>\n    - part iii) Enclaves, slums and citizenship\n    <br> <strong>Week  9: Health<\/strong>\n\n    <br>\n    - part i) Interdependent ecologies of global change\n    <br>\n    - part ii) Molecular biomedicine and global health\n    <br>\n    - part iii) Globalization and the global determinants of health\n    <br> <strong>Week  10: Responses and Conclusion<\/strong>\n\n    <br>\n    - part i) Globalization and the 3 'Rs' of reaction, resistance and resilience\n    <br>\n    - part ii) Comparing and contrasting reaction and resistance as alternative\n    responses to global neoliberalization\n    <br>\n    - part iii) Conceptualizing resilience, resistance and response-ability\n    in global education innovation<\/p>","suggestedReadings":"<p><span>Matthew\nSparke, <i>Introducing Globalization: Ties, Tensions and Uneven Integration<\/i>&nbsp;(Oxford:\nWiley-Blackwell, 2013)<\/span><\/p>\n\n<p><span>Philip Mirowski, <em>Never Let a Serious Crisis Go To Waste: How Neoliberalism Survived the Financial Meltdown<\/em> (New York: Verso, 2014).<br><\/span><\/p>","instructor":"","estimatedClassWorkload":"2-3 hours\/week","recommendedBackground":"There are no prerequisites for this course. That said, an interest in common media depictions of globalization will help you understand the main arguments more quickly. Relatedly, reading and writing comfortably in English at the undergraduate college level will enable your more active engagement in course discussion forums and peer assessment exercises.<br>","links":{}}