{"id":1729,"shortName":"citizenjournalism","name":"Journalism Skills for Engaged Citizens","language":"en","shortDescription":"This is a course in basic journalism skills designed for citizens who are using new media to publish news, views and information. We cover writing skills, interviews, ethics, law and accessing public forums and documents. We also introduce basic investigative skills.","aboutTheCourse":"<p>This is a course in basic journalism skills, designed for the many people who are now taking advantage of new media to publish news, views and information. For five hundred years, the privilege of being able to publish was enjoyed by very few people – those who had access to a printing press or a radio microphone or a television camera. Now, almost anyone can publish to the world within minutes of being able to do so. But is it journalism?<\/p>\n<p>How does a citizen journalist find things out, so they can report facts and news - moving beyond merely braying opinion? And what are the legal and ethical pitfalls to publishing facts that some people might prefer remain secret?<\/p>\n<p>Over eight weeks, this course teaches the basics of news writing, how to interview people to gain crucial information, how to develop and manage your sources and how to use your legal rights to access public information - and stay on the right side of the law when you publish. We discuss the ethics behind journalism practice, and conduct a mock investigation into local government. This course aims to empower engaged citizens to better participate in the news ecology.<\/p>","targetAudience":0,"courseSyllabus":"<strong>Module one: What is a journalist?&nbsp;<br><\/strong>We cover the history and defining characteristics of journalism practice, and how this has changed over time, and is still changing. We think about what we mean by news, and introduce the principles of news writing. Finally, we introduce Newstown - a lively \"virtual town\" which will form the basis for our news writing exercises, interview skill development and investigations. There is also a non-assessable practice writing exercise.<strong><br><\/strong><br><strong>Module two: Attribution, verification and the structure of news writing.<\/strong>&nbsp;<br>We introduce the inverted pyramid style of news writing, and discuss what it means to check, attribute and verify information. The first assessable news writing exercise is delivered this week.<div><p><strong>Module three: Finding things out.&nbsp;<br><\/strong>We discuss interview skills, citizens' rights to access public forums and public documents and the ethics of disclosure, privacy and consent.<\/p>\n<strong>Module four: More on interviewing.&nbsp;<br><\/strong>We discuss different types of questions and what they are good for, and watch some very good and very bad interviews with our Newstown characters. Another assessable news writing exercise will be based on these interviews.<p><\/p>\n<p><strong>Module five: Leaks and sources.&nbsp;<br><\/strong>We cover how to develop and manage contacts and sources, the potential of new media for crowdsourcing information, and the complexities of \"off the record\" interactions, and how to deal with leaks of data and documents. We meet a Newstown \"deep throat\" and consider what we can publish of what he tells us.&nbsp;<\/p>\n<p><strong>Module six: Newstown scenario.&nbsp;<br><\/strong>We put all the lessons into practice by participating in a Newstown scenario involving allegations of corruption and the release of public documents. Your task is to break the big story, and write it clearly and with impact.<\/p>\n<p><strong>Module seven: Debrief and feedback.&nbsp;<br><\/strong>In this module we will debrief and give feedback on the exercise in module six, and ask how we would take the story forward.<\/p><strong>\n<\/strong><p><strong><strong>Module eight: Key concepts highlighted.&nbsp;<br><\/strong><\/strong>We talk about key concepts highlighted by our journalism practice, including impartiality and public interest and basic principles of law and ethics. Finally, we review and wrap up the course.<\/p><\/div>","courseFormat":"This course runs for eight weeks. Assessment tasks are completed during the course, and to deadline, as befits journalistic practice.<br><p><strong>Students participating in this course will:<\/strong><\/p><p><\/p><ul><li>Be encouraged to watch short videos, interspersed with invitations to discuss key concepts in the discussion forums.<br><\/li><li>Complete and be assessed on news writing exercises, encompassing both writing and research and organisation skills<\/li><li>Have the opportunity to undertake further reading<br><\/li><li>Explore a variety of online resources and sharing them with others<br><\/li><li>Share thoughts and discuss key concepts and the variety of journalism practice represented in discussion forums and other social media platforms.<\/li><\/ul><p><\/p><p>There are a&nbsp;<strong>variety of assessments&nbsp;<\/strong>in the course relating to a \"virtual town\" - Newstown. Students enrolled in this course will meet some of the key characters, learn how to interview them and how to gain information from Newstown's public forums.<\/p>","suggestedReadings":"<p>Lectures are designed to be self-contained, and the following readings are recommended, <strong>not required.<\/strong><\/p>\n<p>We recommend that students access a good general guide to English usage.<\/p>\n<p>Good books on journalism principles and ethics include:&nbsp;<\/p><p><\/p><ul><li>Kovach, Bill and Rosentiel, Tom. The Elements of Journalism: What Newspeople Should Know and the Public Should Expect. Three Rivers Press, New York 2007<br><\/li><li>Alysen, B., Oakham, M., Patching, R. and Sedorkin, G.&nbsp;Reporting in a Multimedia World - An Introduction to Core Journalism Skills. (second edition) Allen and Unwin 2011.<\/li><li>Michael Schudson, Why Democracies Need an Unlovable Press Polity Press, 2008.<\/li><\/ul><p><\/p>\n<p>The instructors in this course have also published the following relevant books:<\/p>\n<p>Margaret Simons <a href=\"http:\/\/scribepublications.com.au\/books-authors\/title\/journalism-at-the-crossroads\/\" target=\"_blank\">Journalism at the Crossroads - Crisis and Opportunity in the Press<\/a> Scribe 2013.<\/p>\n<p>Margaret Simons <a href=\"http:\/\/scribepublications.com.au\/books-authors\/title\/what-s-next-in-journalism\/Scribe\" target=\"_blank\">What's Next in Journalism? Media Entrepreneurs Tell Their Stories<\/a><\/p>\n<p>Denis Muller <a href=\"http:\/\/scribepublications.com.au\/books-authors-title\/journalism-ethics-for-the-digital-age\/Scribe\" target=\"_blank\">Journalism Ethics for the Digital Age<\/a> Scribe 2014.<\/p>","estimatedClassWorkload":"6-8 hours\/week","recommendedBackground":"<p>No background is required other than an interest in journalism.<\/p>","links":{}}