{
    "id": 937,
    "shortName": "clinicalneurology",
    "name": "Introduction to Clinical Neurology",
    "language": "en",
    "shortDescription": "An overview of the relevant aspects of the epidemiology, clinical presentation, basic disease mechanisms, diagnostic approaches and treatment options of the most common neurological diseases.",
    "aboutTheCourse": "<p><b><\/b><b>Course Co-Directors:<br><\/b><b><\/b>Daniel Lowenstein, MD<br>Andy Josephson, MD<br>Wade Smith, MD, PhD<\/p><p><b><\/b><b>Instructors:<\/b><br>John Engstrom, MD<br>Jill Ostrem, MD<br>Maulik Shah, MD<\/p><p><span>Neurologic diseases are common and costly.\nAccording to estimates by the World Health Organization, neurologic disorders\naffect over 1 billion people worldwide<b>,<\/b>\nconstitute 12% of the global burden of disease, and cause 14% of global deaths.  Furthermore, the number of deaths caused by\nneurological diseases have more than doubled in the past 10 years, and this\nnumber will undoubtedly substantially increase in the coming years as the\naverage age of the world’s population increase.<\/span><\/p>\n\n<p>This course will provide a basic overview of the\nmost common and important neurological diseases and conditions affecting people\nworldwide: stroke, epilepsy, headache, back pain, neurodegenerative diseases,\nmovement disorders, alterations of consciousness, nervous system infections,\ntraumatic brain injury, and neuromuscular diseases.  For each topic, a neurology professor at the\nUniversity of California, San Francisco (UCSF) who has specialized knowledge\nabout the subject area, and who teaches this material to UCSF medical students\nand other health professional students, will focus on the fundamentals of the\nclinical presentation and evaluation of people with these disorders, as well as\nsome of the additional diagnostic approaches and options for treatment.  Although not a primary focus of the course,\nthe faculty will also touch on some of the most pertinent disease mechanisms to\nhelp students appreciate the rationale for current therapies and the many\nquestions that need to be answered to achieve effective treatments and cures.<\/p>\n\n<p><\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<span>\n <span><span>\n  <span>\n  <p>This six-week course includes the following eleven modules:<\/p><p><b>Module 1:<\/b>\n  Overview of basic anatomy and functions of the nervous system.<br><b>Module 2:<\/b>\n  Stroke<br><b>Module 3:<\/b>\n  Epilepsy<br><b>Module 4:<\/b>\n  Neurodegenerative diseases<br><b>Module 5:<\/b>\n  Alterations of consciousness and brain death<br><b>Module 6:<\/b>\n  Nervous system infections<br><b>Module 7:<\/b>\n  Traumatic brain injury<br><b>Module 8:<\/b>\n  Movement disorders<br><b>Module 9:<\/b>\n  Headache<br><b>Module 10:<\/b>\n  Back pain<br><b>Module 11:<\/b>\n  Neuromuscular diseases<\/p>\n  <\/span>\n <\/span>\n<\/span><\/span>",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": "<p><span>Students who take this course should ideally have\nat least a basic knowledge of neuroanatomy and neurophysiology.  For example, students should be familiar with\nthe basic structure and function of the central and peripheral nervous system,\nincluding the lobes of the brain, the various parts of the brainstem and spinal\ncord, the main ascending and descending central pathways, and basic properties of\nperipheral nerves and muscle. Having at least a basic understanding of the way\nvarious cells in the nervous system work (such as properties of action\npotentials and other aspects of neural transmission) will be helpful but not\nessential for this course.  To make sure\neveryone is up to speed at the beginning, the class will start with an overview\nof the anatomy and functions of the nervous system as they relate to the\nvarious clinical diseases covered during the course.<\/span><\/p>",
    "links": {

    }
}