{"id":2933,"shortName":"disasterpreparedness","name":"Disaster Preparedness for the Health Care Professional","language":"en","shortDescription":"Are you ready for the next inevitable disaster or public health emergency? Whether you're an EMS responder, physician, nurse, social worker, health care student, or other health care provider, you will acquire foundational knowledge in preparedness, management, and response for disasters and large-scale public health emergencies in this 6-week course.","aboutTheCourse":"<p><strong>ABOUT THE COURSE<\/strong><br><\/p><p>In this state of the art course we will be discussing personal\nand hospital-based preparedness for disasters and large-scale public health\nemergencies. This course will provide students with a heightened awareness and\nunderstanding of the natural and man-made hazards that create disaster events. Each topic in the course is presented by a leader and subject matter expert, allowing students to learn from some of the most highly-recognized stakeholders in disaster preparedness.&nbsp;Course\ncontent is designed to assist health care providers and students in acquiring cutting-edge, evidence-based disaster knowledge and skills in order to respond in a timely\nand appropriate manner and ultimately to increase hospital surge capacity.&nbsp;<\/p><p>We\nstart by presenting an overview of the foundational concepts underlying\ndisaster preparedness with a focus on understanding individual health care\nprovider roles and responsibilities within our existing emergency response\nsystems as well as for personal and family preparedness.\nNext, we consider all components of a well-designed hospital preparedness\nprogram including redundant communications and situational awareness, the role\nof the health care provider in disaster operations and logistics, and education\nand training for workforce development. Finally, we cover the roles and\nresponsibilities of health care providers in response to specific disaster and\npublic health emergency events resulting from acts of terrorism, pandemic\ninfluenza and emerging highly infectious disease, chemical, biological and\nradiological emergencies, and natural disasters.&nbsp;<\/p><p>In this six-week course, health care providers will acquire foundational knowledge in the health care\nmanagement of victims of natural and man-made disasters and new strategies for\nincreasing hospital surge capacity. Utilizing course exercises, case studies, and\nonline discussions, students will have the opportunity to identify strategies\nand expert practices in the care of victims of disasters and public health\nemergencies.<\/p>","targetAudience":1,"courseSyllabus":"<div><strong>WEEK 1: Disaster Preparedness: Overview<\/strong><\/div><ul><li>Basic Foundational Concepts of Disaster Preparedness<\/li><li>Incident Command System and Leadership at the Unit Level<br><\/li><li>Disaster Communication and Situational Awareness<\/li><li>Establishing Personal and Family Preparedness<br><\/li><li>United States Federal Disaster Resources<\/li><\/ul><div><strong>WEEK 2: Hospital-Based Readiness<\/strong><\/div><div><ul><li>Hospital Preparedness Overview<\/li><li>Creating Surge Capacity (Lifeboat Ethics)<br><\/li><li>Disaster and Mass Casualty Triage<br><\/li><li>Workforce Readiness and Willingness to Respond<\/li><li>Disaster Drills<\/li><\/ul><\/div><div><strong>WEEK 3: Terrorism&nbsp;<\/strong><\/div><div><ul><li>Active Shooter and Dangerous Persons<br><\/li><li>Terrorism, Bomb Threats, and Other Internal Threats<br><\/li><li>Burn Casualty Management<br><\/li><li>Bomb and Blast Injury Management<\/li><\/ul><\/div><div><strong>WEEK 4: Chemical and Radiation Events<\/strong><\/div><div><ul><li>Chemical Emergencies<\/li><li>Radiation Emergency Management Overview<br><\/li><li>Responding to Radiation Events<\/li><li>Use of Personal Protective Equipment<br><\/li><li>Decontamination<\/li><\/ul><\/div><div><strong>WEEK 5: Pandemic Influenza and Emerging Infections<\/strong><\/div><ul><li>Seasonal and Pandemic Influenza&nbsp;<br><\/li><li>Responding to Emerging Infectious Disease Outbreaks<\/li><li>Disease Containment Strategies<br><\/li><li>Protective Equipment for Safety During Infectious Disease Outbreaks<\/li><\/ul><div><strong>WEEK 6: Natural Disasters<\/strong><\/div><div><ul><li>Planning for Natural Disasters<br><\/li><li>Activation of the Hospital EOC in Response to Natural Disasters<br><\/li><li>Morbidity and Mortality Related to Natural Disasters<\/li><li>Advancing the Science: Current Research Efforts<\/li><li>Q and A &nbsp;\"Ask Us Anything\"<br><\/li><\/ul><\/div>","courseFormat":"<p>The content for each module is divided into multiple video segments. These presentations have been designed so students can view them all at once, as a single cohesive lecture, or independently throughout the week at their leisure. Each topic is presented by an expert in the field, providing students with a unique opportunity to learn from an instructor who has developed a personal and professional stake in the material they provide.<\/p><p>Weekly discussion board questions, structured exercises, quizzes, and case studies have been designed to reinforce course material and help students explore the content in more depth.<\/p>","suggestedReadings":"","estimatedClassWorkload":"2-4 hours\/week","recommendedBackground":"<p>This material is appropriate for all health professionals,\nstudents in the health professions, or individuals interested in disaster\nhealth services response. The course material is designed and best suited for healthcare providers or students enrolled in programs related to health, medicine, hospital administration, or health policy.<\/p>","links":{}}