{
    "id": 1251,
    "shortName": "k12blendedlearning",
    "name": " K-12 Blended & Online Learning",
    "language": "en",
    "shortDescription": "This course introduces teachers and interested adults to K12 blended and online learning. Participants will design a blended or online unit and develop one module to use with K12 students. ",
    "aboutTheCourse": "<p>The course is designed to introduce K-12 teachers and the community to blended and online learning. In the first 4 weeks of the course learners will gain introductory knowledge of K12 blended and online teaching and learning. During the last 4 weeks learners will use this new knowledge to start designing and developing effective K12 blended and online learning experiences for K12 students. The course content was developed based on standards written by the International Association for K12 Online Learning (iNACOL). This course serves as 50 professional learning hours or can be submitted to Kennesaw State University's assessment center for graduate course credit towards a graduate degree in education.<br><\/p><p><strong>Course Partner<br><\/strong><br>This course is offered to you in partnership by Kennesaw State University&nbsp;(KSU) and the Online Learning Consortium&nbsp;(OLC). KSU would like to thank the OLC for their support in this MOOC.<\/p><ul><li><a href=\"http:\/\/onlinelearningconsortium.org\/\" target=\"_blank\">Online Learning Consortium<\/a>:&nbsp;The OLC is the leading professional organization devoted to advancing quality online learning providing professional development, instruction, best practice publications and guidance to educators, online learning professionals and organizations around the world.&nbsp;Sign up&nbsp;<a href=\"http:\/\/visitor.r20.constantcontact.com\/manage\/optin?v=001R17bMHtpg0MV2zOHBuz5GB8xniMkXwHhqPz-PgsOTGnVo2dzX1WHAuY6DKuXQD8B8fBDIbQvnLJJHJvQJutI9ESHTlLnC6_RnG2GszaHeMYAscs54xIdsGPZ3LLtf_uALng3q21C_qzq_0CZleyGcVwHYJuwc3IZHf_AO2wCQow%3D\" target=\"_blank\">HERE&nbsp;<\/a>to get additional&nbsp;information about the Online Learning Consortium and their programs.<\/li><\/ul><p><img width=\"350\" src=\"https:\/\/d396qusza40orc.cloudfront.net\/k12blendedlearning\/images\/OLC_LOGOTMrgb.jpg\" height=\"100\" style=\"border: none;\" alt=\"OLC Logo\"><br><\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<p><b>Syllabus : &nbsp;<\/b><b>K-12\nBlended and Online Learning<\/b>\n<\/p>\n\n<p>This course meets asynchronously online from&nbsp;January 13, 2015&nbsp;to&nbsp;March 10, 2015&nbsp;<span><br>\n<br>\n<b>Instructor:<\/b>&nbsp;Anissa Lokey-Vega, Ph.D. &nbsp;@LokeyVega<\/span>\n<\/p>\n\n<p><b>Co-Instructor:<\/b> Jordan Cameron, Ed.S.&nbsp; @jlpcam\n<\/p>\n\n<p><b>Course Social Media: <\/b>#KSUitecMOOC or #K12blendedlearning<\/p>\n\n<p><b>Course Description<\/b>\n<\/p>\n\n<p>The course is designed to introduce K-12 teachers and the community to blended and online learning. In the first 4 weeks of the course learners will gain introductory knowledge of K12 blended and online teaching and learning. During the last 4 weeks learners\n    will use this new knowledge to start designing and developing effective K12 blended and online learning experiences for K12 students. The course content was developed based on standards written by the International Association for K12 Online Learning\n    (iNACOL).\n<\/p>\n\n<p><b>Learning\nObjectives<\/b>\n<\/p>\n\n<p>Through the successful completion of weeks 1-4 of this course, you will gain introductory knowledge of effective K12 blended and online instruction and be able to:&nbsp;<\/p>\n\n<ul>\n    <li>demonstrate knowledge about current trends and standards in K12 online teaching and learning.<\/li>\n    <li>demonstrate knowledge about best practices of engagement, assessment, and differentiation online.<\/li>\n    <li>demonstrate knowledge about best practice in online learning in content specific areas.<\/li>\n    <li>demonstrate knowledge about what it is like to work or learn in an online school.<\/li>\n    <li>demonstrate knowledge about current technology for online instruction.<\/li>\n<\/ul>\n\n<p>Through the successful completion of weeks 5-8 of this course, you will demonstrate introductory skills of designing and developing K12 blended and online learning experiences by being able to:&nbsp;<\/p>\n\n<ul>\n    <li>design a syllabus for an online course appropriate for his\/her classroom that meets professional standards.\n    <\/li>\n    <li>design a 6-8 week unit of learning for K12 students that meets professional standards.<\/li>\n    <li>develop one module of blended or online instruction for K12 students that meets specified criteria of a rubric based on the iNACOL National Standards for Quality Course Development.\n    <\/li>\n    <li>evaluate the quality of three modules for blended\/online instruction for K12 students using specified criteria of a rubric based on the iNACOL National Standards for Quality Course Development.<\/li>\n<\/ul>\n\n<p><b>Weekly\nTopics<\/b>\n<\/p>\n\n<p>Week 1: Trends and Standards in K12 Blended and Online Learning:&nbsp;January 13 – 19<span><br>\nWeek 2: Active Learning and Assessment: <\/span>January 20 – 26<span><br>\nWeek 3: Teaching Blended and Online in the\nContent Areas:&nbsp;<\/span>January 27&nbsp;– February 2<span><br>\nWeek 4: Technologies for Blended and Online\nLearning:&nbsp;<\/span>February 3&nbsp;– 9<span><br>\n<u>Course Midpoint<\/u>\n<\/span><\/p><p>Week 5: Designing a Syllabus:&nbsp;February 10 – 16<span><br>\nWeek 6: Designing a Blended or Online Unit Plan: February 17 – 23<span><br>\n\nWeek 7: Developing a K12 Module: February 24 – March 2<span><br>\n\nWeek 8: Course Wrap-up &amp; Recommendations for On-going Learning: March 3 – March 10<br><\/span><\/span>\n    <\/span>\n<\/p>\n\n<p><b>Course\nFormat<\/b>\n<\/p>\n\n<p>This class consists of the following elements:<\/p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p><ul>\n <li>Multiple&nbsp;video lectures&nbsp;from your\n     instructor. These will be available starting Monday mornings.<\/li>\n <li>Free\n     downloadable readings. In\n     efforts to make the course more accessible to all, there is no textbook.<\/li>\n <li>Transcripts\n     of the&nbsp;video lectures.<\/li>\n <li>Links\n     and handouts mentioned in video lectures.<\/li>\n <li>One\n     or more&nbsp;announcements&nbsp;from\n     the instructor every week.<\/li>\n <li>Discussion forums.\n     These forums will help you apply the material by interacting with other\n     students in the course. <\/li>\n <li>One\n     weekly quiz for each of modules 1-4 that covers the video lectures. These quizzes\n     are previewed as embedded questions throughout the video lectures.<\/li>\n <li>Study\n     guide to prepare for the cumulative mid-point quiz.<\/li>\n <li>A\n     mid-point quiz consisting\n     of 20 questions. You may take the mid-point quiz twice. The highest score\n     will be counted. The mid-point quiz is cumulative, covering the first 4\n     weeks of material. It is an open-note and independent activity.<\/li>\n <li>Modules\n     5, 6, &amp; 7 each require a assignment that\n     will be graded by your peers.<\/li>\n <li>Modules\n     6, 7, &amp; 8 each require you to complete 3 peer assessments (9).<\/li>\n <li>Optional supplemental\n     social media interaction using #ksuitecmooc or #k12blendedlearning<\/li><\/ul>\n\n<p><b>Collaboration<\/b>\n<\/p>\n\n<p>We highly recommend that teacher groups or whole schools take the course together. We are providing a <a href=\"http:\/\/bagwell.kennesaw.edu\/files\/2214\/1642\/1515\/Meetup_Protocol_General.pdf\" target=\"_blank\">Facilitator's Guide<\/a> to support teacher professional learning groups. Meeting once per week in a face-to-face environment to discuss, share resources, and peer critique is advised; however, each person should complete independent assignments…no\n    group projects. Your projects may be closely related, though. For example, in this course you will design a blended or online unit for your class. If a grade level team at the same school decides to divide up the curriculum such that each teacher\n    designs a separate social studies unit for his\/her grade level team, then the grade level team’s projects would closely relate while not becoming a single group project. Think professional development jigsaw activity!<\/p>\n\n<p>Don’t worry if you don’t have a colleague to work with, you can take this class alone. Really you will never be alone! You could harness Google Hangouts or Skype to work with someone you meet in the discussion forums. Don’t be bashful!<\/p>\n\n<p><b>Scheduling<\/b><\/p><p>To help you plan your time, here is the expected weekly workload:<br>Week 1: (5 hours)&nbsp;January 13 – 19<br>Week 2:&nbsp;(5 hours)&nbsp;January 20 – 26<br>Week 3:&nbsp;(5 hours)&nbsp;January 27&nbsp;– February 2<br>Week 4: (5 hours)&nbsp;February 3&nbsp;– 9<br>Week 5: (10 hours)&nbsp;February 10 – 16<br>Week 6:&nbsp;(10 hours)&nbsp;February 17 – 23<br>Week 7:&nbsp;(10 hours)&nbsp;February 24 – March 2<br>Week 8:&nbsp;(&lt;2 hours)&nbsp;March 3 – March 10<br><br>If you are taking this course with your professional learning network or grade-level team, we recommend setting aside 1-2 hours each week to meet face-to-face or synchronously to discuss key points, individual progress, resources, and to give peer feedback.<br><\/p>",
    "estimatedClassWorkload": "2-10 hours\/week",
    "recommendedBackground": "While the course is designed with in-service K12 teachers in mind, this course is taught for anyone interested in K12 education such as preservice teachers, homeschool teachers, and other community members. Consider reviewing educational terminology before beginning the course by reading all the suggested readings before the first day of class.&nbsp;<br><br>",
    "links": {

    }
}