{
    "id": 115,
    "shortName": "edc",
    "name": "E-learning and Digital Cultures",
    "language": "en",
    "shortDescription": "This course will explore how digital cultures and learning cultures connect, and what this means for the ways in which we conduct education online. The course is not about how to ‘do’ e-learning; rather, it is an invitation to view online educational practices through a particular lens – that of popular and digital culture. Follow this course on Twitter at #edcmooc.",
    "aboutTheCourse": "<p>E-learning and Digital Cultures is\naimed at teachers, learning technologists, and people with a general interest\nin education who want to deepen their understanding of what it means to teach\nand learn in the digital age. The course is about how digital cultures\nintersect with learning cultures online, and how our ideas about online\neducation are shaped through “narratives”, or big stories, about the\nrelationship between people and technology. We’ll explore some of the most\nengaging perspectives on digital culture in its popular and academic forms, and\nwe’ll consider how our practices as teachers and learners are informed by the\ndifference of the digital. We’ll look at how learning and literacy is\nrepresented in popular digital-, (or cyber-) culture, and explore how that\nconnects with the visions and initiatives we are seeing unfold in our\napproaches to digital education.<\/p>\n\n<p>This course will not be taught via a\nseries of video lectures. Rather, a selection of rich resources will be provided\nthrough which you can begin to engage with the themes of the course. While the\nteachers will be present in the discussion forums and in various other media\nenvironments, there will be an emphasis on learner-led group formation, and the\nuse of social media to build personal learning networks and communities of\npeers. On this course, you will be invited to think critically and creatively\nabout e-learning both as a process and as a topic of study; you will be able to\ntry out new ideas in a supportive environment, and gain fresh perspectives on\nyour own experiences of teaching and learning. &nbsp;This course is also intended to be an exploration &nbsp;of the MOOC format itself. &nbsp;Rather than approaching this course with the expectation of exacting teaching methods or precise learning routines, we invite all participants to collectively experiment with what the MOOC experience might be.<\/p>\n\n<p>The course assessment will involve you\ncreating your own digital artefact: something that is designed to be\nexperienced digitally, on the web. It will be likely to contain a mixture of text,\nimage, sound, video, links, and can be created in the environment of your\nchoice. The artefact will be a representation of any of the themes encountered during the course, and you‘ll have\nthe opportunity to use digital spaces in new ways to present this work. Our\ndefinition of ‘digital artefact’ is intentionally imprecise to invite\nexperimentation and creativity: it will be evaluated via guided peer-assessment.<\/p><p>This course has been developed collaboratively by a team of experienced teachers and researchers in online education, who run the international <a target=\"_blank\" href=\"http:\/\/online.education.ed.ac.uk\/\">MSc in Digital Education<\/a> distance programme at the University of Edinburgh.<br><\/p>",
    "targetAudience": 0,
    "courseSyllabus": "",
    "estimatedClassWorkload": "5-7 hours\/week",
    "recommendedBackground": "<p>No background knowledge or skills are\nrequired, though we recommend an interest in and some experience of\nusing the social web to form personal learning networks, engage in discussion,\nand respond independently to course themes.<\/p>",
    "links": {}
}