{
    "id": 2397,
    "shortName": "creativity",
    "name": "Cracking the Creativity Code: Part 1- Discovering Ideas",
    "language": "en",
    "shortDescription": "Creativity is an acquired skill that improves with practice. Creativity changes the world and enriches people’s lives. It takes two skills:  “discovery” - discovering new ideas, and “delivery” – implementing ideas, using proven tools and methods. \nThis course, on “discovery”, will provide proven tools that will help you discover an endless stream of creative ideas.",
    "aboutTheCourse": "<strong>Course Description<\/strong><br>Skill at discovering new ideas, and delivering them, may be one of the most important practical job skills, in today’s and tomorrow’s job market. Creativity is an acquired skill, one that improves with practice. This course aims to empower individuals who believe they have lost their innate creativity, because they, their employers or teachers prefer the three R's: replication, repetition and rote, to innovation. We show how to re-ignite rusty creative powers.During the four-week course, students will learn proven tools, frameworks and concepts useful for discovery– generating an endless stream of new ideas implementing at least some of those ideas with skill and persistence, based on books and articles written by the instructors. <p>In the first two weeks of the course, students will learn a proven structured method for generating and implementing world-changing ideas known as ‘Zoom in, Zoom out, Zoom in’&nbsp; that makes creativity more accessible to everyone. They will practice the method and use it to tackle challenging real-world needs. In the following two weeks, students will learn practical proven tools useful for delivering ideas by employing the basic principles of business and management.<\/p><p><\/p><p><strong>Course Learning Outcomes<\/strong><br><\/p><p>\n\n<\/p><p>On successfully completing this four-week course, you\nwill be able to:<\/p>\n\n<p><\/p><ul><li>Manage a process to generate an\nunending stream of creative ideas <\/li><li>Lead a process of innovation and\nimplement ideas through all phases from discovery to delivery.<\/li><li>&nbsp;Apply creativity to a wide range of strategic\nmanagement issues. <\/li><li>Solve problems with a high degree of\ninnovation, creative thinking and risk taking.<\/li><li>Use and apply proven structured\nmethod for generating and implementing world-changing ideas known as ‘Zoom in,\nZoom out, Zoom in’.<\/li><li>Develop and implement an innovation\nin your own practice.<\/li><li>Identify new and unfamiliar challenges\nand reflect on these challenges from a creative point of view, action they\nrequire and service they provide.<\/li><li>\n\n<span>Demonstrate creative problem solving skills for\ndefining, structuring and solving real world operations management problems.<b>\n<\/b><\/span><\/li><\/ul>",
    "courseSyllabus": "<p><b><span>Week\nOne: <u>What is Creativity?<\/u> - <\/span><\/b><span>Your Creative Brain is a muscle: Use it!<b> <\/b>Definition of\ncreativity; First encounter with the ZiZoZi (zoom in, zoom out, zoom in)\nmethods; Creativity self-test; “Discover” and “Delivery” self-test; The imagination\nelevator; ZiZoZi in action; How to build your creativity ‘muscles’.<\/span><\/p>\n\n<p><b><span>Week Two:\n<u>Zoom in, Zoom out, Zoom in<\/u>: <\/span><\/b><span>More<b> <\/b>ZiZoZi in action; Creativity research; Approaches to\nCreativity; Model for Creative thinking; Do we foster creativity among\nchildren; Pablo Picasso – make creativity autotelic; On becoming Walter Mitty;\nInnovating by breaking the rules; Thomas Edison; George Bizet – Carmen; Best practice\nbenchmarking; The power of Zoom Out<\/span><\/p>\n\n<p><b><span>Week Three:\n<u>Creativity in practice<\/u><\/span><\/b>: The role of accidental discovery and serendipity; sharpening\nobservation skills; Empathetic discovery; the role of failure in enhancing\nsuccess. Zoom out: Collecting data through direct observation; The IDEO\napproach; taming wild ideas; How to ‘sell’ your ideas; How to be creative in\nlarge organizations; what is your ‘story’? Building powerful narratives. Case\nstudies.<\/p>\n\n<p><b>Week\nFour<\/b><span>: <b><u>Reinventing yourself<\/u><\/b>:\nCreativity exercises; Research about creativity you can use; On reinventing\nyourself and your career; Secrets of Einstein, da Vinci and Edison; Humble\nmasterpiece: Stories of creative breakthroughs; Ideas proposed by students;\nCourse summary.<\/span><br><\/p>",
    "estimatedClassWorkload": "2-4 hours\/week",
    "recommendedBackground": "No background is required; all are welcome!<br>",
    "links": {

    }
}