{"id":329,"shortName":"introstats","name":"Statistics: Making Sense of Data","language":"en","shortDescription":"This course is an introduction to the key ideas and principles\nof the collection, display, and analysis of data to guide you in making\nvalid and appropriate conclusions about the world.","aboutTheCourse":"<p>We live in a world where data are increasingly available, in ever larger quantities, and are increasingly expected to form the basis for decisions by governments, businesses, and other organizations, as well as by individuals in their daily lives. To cope effectively, every informed citizen must be statistically literate. &nbsp;<\/p><p>This course will provide an intuitive introduction to applied statistical reasoning,&nbsp; introducing fundamental statistical skills and acquainting students with the full process of inquiry and evaluation used in investigations in a wide range of fields.&nbsp; In particular, the course will cover methods of data collection, constructing effective graphical and numerical displays to understand the data, how to estimate and describe the error in estimates of some important quantities, and the key ideas in how statistical tests can be used to separate significant differences from those that are only a reflection of the natural variability in data.<\/p>","targetAudience":0,"courseSyllabus":"<p><b>A first look at data<\/b>\n<br>Weeks 1-2: Summary statistics and graphical displays for a single categorical or quantitative variable and for relationships between two variables.<\/p>\n<p><b>Collecting data<\/b>\n<br>Week 2:&nbsp; Sampling.&nbsp; Observational studies and experiments.&nbsp; The effect of confounding and concluding causation.<\/p>\n<p><b>Probability<\/b>\n<br>Week 3:&nbsp; Probability models, the normal distribution, the Law of Large Numbers, the Central Limit Theorem, sampling distributions.<\/p>\n<p><b>Confidence Intervals<\/b>&nbsp;<br>Week 4: Confidence intervals and sample size estimation for proportions and means.<\/p>\n<p><b>Tests of&nbsp;significance<\/b>&nbsp;<br>Week 5: Tests of significance, power and sample size estimation for proportions and means<\/p><p><b>Two samples<\/b><br>Week 6: Tests of significance and confidence intervals for proportions and means in the two sample case.<\/p>\n<p><b>Simple linear regression<\/b>\n<br>Week 7: Method of least squares, evaluating model fit, the effects of outliers and influential observations.<\/p>\n<p><b>The process of statistical inquiry<\/b>\n<br>Week 8: Capstone case study.<\/p>","courseFormat":"The course will consist of lecture videos containing integrated quiz questions. There will also&nbsp;be a quiz every week. &nbsp;At the end of weeks 4&nbsp;and 8 there will be a short homework assignment.&nbsp; Optional extra videos are available for students who wish to learn to do their own statistical analyses using the R statistical computing package (<a title=\"Link: http:\/\/www.r-project.org\/\" target=\"_blank\" href=\"http:\/\/www.r-project.org\/\">http:\/\/www.r-project.org\/)<\/a>; however, no computing is required to complete the course.<br><br>New material will be posted each week, and it is recommended that it be completed during the 7 day period until more material is posted. &nbsp;While it is recommended that all evaluations be completed in the week they are posted,&nbsp;all evaluations will have a Hard Deadline that is one week later, in order to accommodate variation in students' schedules.<br><br>","suggestedReadings":"","instructor":"Alison Gibbs and Jeffrey Rosenthal","estimatedClassWorkload":"6-8 hours\/week","recommendedBackground":"Students should be comfortable with basic high-school-level mathematics.<br><br>","links":{}}