{"id":1543,"shortName":"healthliteracy","name":"Health Literacy and Communication for Health Professionals","language":"en","shortDescription":"In the United States, two-thirds of the population read at an eight-grade level or below. When it comes to health information, most Americans have the ability to read and write at the fifth-grade level.  This inter-professional course aims to give health professionals the tools needed to improve upon their health literacy and communication skills.","aboutTheCourse":"<p>This\ninter-professional course will help educate a variety of health professionals\nabout health literacy efforts and improved communication skills. It will\nrequire your active participation in creating health literate interactions at\nvarious organizational levels. This course will provide the opportunity to\nreinforce existing opportunities to work together as a multidisciplinary team\nor fill a gap if you haven’t had an opportunity to do so yet! <\/p>\n\n<p>Upon completion\nof the course, you will be able to:<\/p>\n\n<p>1. &nbsp; &nbsp; Define health literacy and how it applies to all health disciplines.&nbsp;<\/p><p>2. &nbsp; &nbsp; List the varied factors that influence health literacy and health communication.&nbsp;<\/p><p>3. &nbsp; &nbsp; Identify who is affected by health literacy and health communication.&nbsp;<\/p><p>4. &nbsp; &nbsp; Recognize the consequences of limited health literacy and poor health communication.&nbsp;<\/p><p>5. &nbsp; &nbsp; Determine the stakeholders in health literacy and health communication.&nbsp;<\/p><p>6. &nbsp; &nbsp; Recognize the role of health literacy in meeting core health service across disciplines.&nbsp;<\/p><p>7. &nbsp; &nbsp; &nbsp;Apply strategies to improve health literacy at the group, organizational, community, and policy levels<\/p>\n\n<p>In addition to these\ncourse objectives, it is key to the success of the student that participants\nunderstand their responsibilities of working as a part of an inter-professional\nhealth care team. The basis of patient-centered care and the foundation of the\nmedical home model is that health professionals will learn and implement skills\nto meet the community’s health needs in the context of the community’s daily\nlives—which is their reality! That includes recognizing the social determinants\nof health, such as complex social, economic, environmental, and political\nfactors, that impact both the public’s wellness and their health literacy, too.\n<\/p>\n\n<p>One initial\nstep – a recommended prerequisite to beginning this online course – is to first\ncomplete the Centers for Disease Control and Prevention’s self-directed online\ntraining, “Health Literacy for Public Health Professionals”. It\nprovides a good foundation about health literacy in three brief, interactive\nlessons which will take about 1.5-2 hours to complete. <\/p>\n\n<p>We are also\nusing the Institute of Medicine’s Roundtable on Health Literacy discussion\npaper, “Ten Attributes of Health Literate Health Care Organizations” as a guide. &nbsp;This online course will assist its participants in understanding that health\nliteracy needs to be an organizational value and embraced as part of the\norganization’s core business.&nbsp; <\/p>\n\n<p>A phrase that we often like to use is “help a person connect the dots”. By this we mean we\nneed to make sure that understanding of health information exists. An example\nof this would be thinking if someone is advised they need to take a\nmedication, or told they need to change daily choices and behaviors\nto improve health that it will simply happen as directed. But, there are\nmany necessary steps, strategies, and skills in communication for the advice being given to actually happen. &nbsp;Often, current health\nprofessionals and health care settings often assume that “one size fits all”\nwhen it comes to communicating health messages. &nbsp;This course will focus on\nsome approaches to becoming a health literate health care organization by using\nscenarios with actors based on patient experiences, by also letting patients\nshare their experiences in their own words, and by offering suggestions\nfor improvement in health communication.<\/p>\n\n<p>We hope you join us and become an agent of change both in your own discipline and as a\nmember of an inter-professional team in health care organizations going\nforward!<\/p>","courseSyllabus":"<p>The course\nconsists of the following eight modules:<\/p>\n\n<ol>\n <li><b><u>L<\/u><\/b>iteracy: Its role in\n     health care organizations<\/li>\n <li><b><u>I<\/u><\/b>nitiation: Preparing the\n     health care workforce<\/li>\n <li><b><u>T<\/u><\/b>hey: Who are we serving?<\/li>\n <li><b><u>E<\/u><\/b>quipped: Using the best\n     tools for communication<\/li>\n <li><b><u>R<\/u><\/b>esults: Evaluating our\n     efforts<\/li>\n <li><b><u>A<\/u><\/b>ccess: Providing plain\n     information<\/li>\n <li><b><u>T<\/u><\/b>ransferring Information:\n     Using the best channels <\/li>\n <li><b><u>E<\/u><\/b>ssential Skills:\n     Communicating high risk and care transitions<\/li>\n<\/ol>\n\n<p>Each module in\nthis course will focus on one or two attributes to guide you in exploring an action in your discipline as well as how being a member of an\ninter-professional team has advantages for improving organizational responses\nto health literacy.<br><\/p>","courseFormat":"<p>This course keeps things very simple because that is the\nmessage of what health literacy and good communication of health messaging is\nall about!<\/p><p>The course provides many resources for your reference, but\ndoes not require the use of a particular textbook. Instead, there are online\ndocuments, online trainings, and online audio\/video files that we incorporate;\nall of which are either in the public domain or have granted permission to be\nused for this course. <\/p><p><i>The framework for the\ncourse is based on these core resources:<\/i><\/p><p>·&nbsp;Healthy People 2020 <\/p><p>· Centers for Disease Control and Prevention’s Training\nCourse “Health Literacy for Public Health Professionals” <\/p><p>· Institute of Medicine’s discussion paper,\n“Ten Attributes of Health Literate Health Care Organizations” (2012) <\/p><p>· National Action Plan to Improve Health\nLiteracy (2010) <\/p><p>·&nbsp;The Calgary Charter on Health Literacy:\nRationale and Core Principles for the Development of Health Literacy Curricula\n(2008) <\/p><p><i>In addition to these\nquality resources, this course incorporates:<\/i><\/p><p>·&nbsp;Weekly video lectures <i><\/i><\/p><p>·&nbsp;&nbsp;Video vignettes based on actual patient\nexperiences to demonstrate examples of both poor and improved health\ninformation communication exchanges (scripted actors)<i><\/i><\/p><p>·&nbsp;‘On-the-street’ intercept interviews with\nstudent volunteers from a variety of health care disciplines\n(“pre-professionals”)<i><\/i><\/p><p>·&nbsp;Interviews with health professional faculty\n(guided discussions)<i><\/i><\/p><p>·&nbsp;Patient perspectives;&nbsp; patient experiences in their own words<i><\/i><\/p><p>·&nbsp;Standardized patient focus groups (facilitated\ndiscussions)<i><\/i><\/p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p><p>Students will be asked to participate in discussion forums,\ncomplete a quiz for each module, and complete multiple peer reviewed\nassessments throughout the course.&nbsp;<\/p>","suggestedReadings":"<p>·&nbsp;<a href=\"http:\/\/www.healthypeople.gov\" target=\"_blank\">Healthy People 2020<\/a> <\/p>\n\n<p>· Centers for Disease Control and Prevention’s\nTraining Course <a href=\"http:\/\/www.cdc.gov\/healthliteracy\/training\/\" target=\"_blank\">“Health Literacy for\nPublic Health Professionals”<\/a> <\/p>\n\n<p>· Institute of Medicine’s discussion paper,\n<a href=\"http:\/\/www.iom.edu\/Global\/Perspectives\/2012\/HealthLitAttributes.aspx\" target=\"_blank\">“Ten Attributes of Health Literate Health Care Organizations” <\/a>(2012) <\/p>\n\n<p>·&nbsp;<a href=\"http:\/\/www.health.gov\/communication\/hlactionplan\/\">National Action\nPlan to Improve Health Literacy<\/a>&nbsp;(2010)<\/p><p><\/p><p><\/p>\n\n<p>·&nbsp;&nbsp;<a href=\"http:\/\/www.centreforliteracy.qc.ca\/health_literacy\/calgary_charter\" target=\"_blank\">The Calgary Charter on Health Literacy:\nRationale and Core Principles&nbsp; for the\nDevelopment of Health Literacy Curricula<\/a> (2008)<\/p>","estimatedClassWorkload":"3-6 hours\/week","recommendedBackground":"Anyone interested in Health\nLiteracy and Communication is encouraged to enroll.&nbsp;&nbsp;<br>","links":{}}