{
    "id": 3219,
    "shortName": "newchinahistory2",
    "name": "Understanding China, 1700-2000: A Data Analytic Approach, Part 2",
    "language": "en",
    "shortDescription": "The purpose of this course is to summarize new directions in Chinese history and social science produced by the creation and analysis of big historical datasets based on newly opened Chinese archival holdings, and to organize this knowledge in a framework that encourages learning about China in comparative perspective.",
    "aboutTheCourse": "<p>Our course demonstrates how a new scholarship of discovery is redefining what is singular about modern China and modern Chinese history. Current understandings of human history and social theory are based largely on Western experience or on non-Western experience seen through a Western lens. This course offers alternative perspectives derived from Chinese experience over the last three centuries. <strong>We present specific case studies of this new scholarship of discovery divided into two stand-alone parts, which means that students can take any Part without prior or subsequent attendance of the other Part.<\/strong><\/p>\n<p><a href=\"https:\/\/www.coursera.org\/course\/newchinahistory1\" target=\"_blank\">Part One<\/a> focuses on comparative inequality and opportunity and addresses two related questions ‘Who rises to the top?’ and ‘Who gets what?’. Please note that Part One was\npreviously named ‘A New History for a New China, 1700-2000: New Data and New\nMethods, Part 1’.<\/p><p><strong>Part Two turns to an arguably even more important question ‘Who are we?’ as seen through the framework of comparative population behavior - mortality, marriage, and reproduction – and their interaction with economic conditions and human values. We do so because mortality and reproduction are fundamental and universal, because they differ historically just as radically between China and the West as patterns of inequality and opportunity, and because these differences demonstrate the mutability of human behavior and values.<\/strong><\/p>Hao Dong co-teaches this course with Prof James Lee. Hao is a PhD candidate in Social Science at the Hong Kong University of Science and Technology and Hong Kong PhD Fellowship recipient. His research compares East Asian and Western historical populations to study the influence of family, kin, and socioeconomic contexts on individuals. His publications include such learned journals as Social Science &amp; Medicine, Demography, and Historical Research.<br>",
    "targetAudience": 0,
    "courseSyllabus": "<p>Part 2 covers the following subjects:<\/p>\n<ol><li>Who Are We<\/li>\n<li>Who Survives<\/li>\n<li>Who Reproduces<\/li>\n<li>Who Marries<\/li>\n<li>Who Cares<\/li>\n<li>Conclusion<\/li><\/ol>",
    "estimatedClassWorkload": "3-4 hours\/week",
    "recommendedBackground": "No requirements. Everyone is welcome.",
    "links": {}
}