{"id":855,"shortName":"dementiacare","name":"Living with Dementia: Impact on Individuals, Caregivers, Communities and Societies","language":"en","shortDescription":"Health professionals and students, family caregivers, friends of and affected individuals, and others interested in learning about dementia and quality care will benefit from completing the course. Led by Drs. Nancy Hodgson and Laura Gitlin, participants will acquire foundational knowledge in the care of persons with Alzheimer’s Disease and other neurocognitive disorders in this 5-week course.","aboutTheCourse":"<p><b>ABOUT THE COURSE<\/b><br><\/p><p>In this state of the art course we will be discussing the global challenge of living with dementia for individuals, their families, communities and society. &nbsp;We start by examining the brain of a person with dementia to provide a basic overview of disease pathology as well as current diagnostic criteria, the stages of dementia, and the trajectory of illness. Next, we consider the consequences of the disease for individuals and examine specific strategies for helping people remain engaged and with quality of life. We then focus on the impact of the disease on family members, communities and societies at large. &nbsp;Theoretical and practical frameworks are discussed to help inform ways to support and care for individuals \"living with\" dementia and their caregivers.<\/p><p>Health professionals and students, family caregivers, friends of patients, and others interested in learning about dementia and quality care will acquire in this five-week course foundational knowledge in the care of persons with Alzheimer’s Disease and other neurocognitive disorders. Through course exercises and on-line discussions with others, you will have the opportunity to identify the prevalence of dementia in your country, consider the resources available to advance a meaningful approach to support families contending with this disease, and exchange ideas concerning care strategies in various settings such as the home, community and social service agencies, hospitals or other clinical settings<\/p>","targetAudience":1,"courseSyllabus":"<p>WEEK I: <b>The Brain<\/b><\/p><ul><li>Framework of Dementia&nbsp;<\/li><li>Global impact of dementia&nbsp;<\/li><li>History of Alzheimer’s Disease and Related Dementias&nbsp;<\/li><li>Pathophysiology of Dementia<\/li><li>The New Trajectory of Dementia<\/li><li>The Challenge of Diagnosis<\/li><\/ul>WEEK 2: <b>The Person<\/b><br><ul><li>Personhood of Individuals with Dementia&nbsp;<\/li><li>Unmet Needs<\/li><li>Unmet Needs: Continuum of Needs of Persons with Dementia and Potential Interventions&nbsp;<\/li><li>Behaviors, Trajectory and Change Over Time of Dementia<\/li><li>Assessing the Role of the Home and Community Environment in Supporting Families Living with Dementia<\/li><li>Activity for Persons with Dementia&nbsp;<\/li><li>Palliative Care&nbsp;<\/li><li>Pharmacological Treatment Options&nbsp;<\/li><\/ul>WEEK 3: <strong>The Caregiving and the Home Environment <\/strong>&nbsp;<br><ul><li>Family Unmet Needs<\/li><li>Psychosocial Processes&nbsp;<\/li><li>Environmental Model&nbsp;<\/li><li>The Role of Technology in Dementia Care<\/li><\/ul>WEEK 4:&nbsp;<strong>The Community Level&nbsp;<\/strong><br><ul><li>Dementia Friendly Communities&nbsp;<\/li><li>It Takes a Team: The Role of the Interprofessional Team in a Collaborative Care Model<\/li><\/ul>WEEK 5: <strong>Overview of National Plans and Policies&nbsp;<\/strong><br><ul><li>National Plans and Policies&nbsp;<\/li><li>Assessing Dimensions of Comprehensive Dementia Care&nbsp;<\/li><li>Q &amp; A \"Ask us anything\"<\/li><\/ul><br>","courseFormat":"<p><span>Each week will be divided into multiple video segments that\ncan be grouped as three  or four lectures\nor viewed separately. Weekly discussion board questions and structured\nexercises will be designed to challenge students to advocate for a new and more\nhumane approach to dementia care.<\/span><\/p>","suggestedReadings":"<p>As a student enrolled in this course, you will have free\naccess to selected content for the duration of the course. All readings were\nselected by the instructors specifically for this course.<\/p><p>The following readings are suggested but not required:<\/p><p><span>Mace,\nN.L. &amp; Rabins, P.V. (2011).&nbsp; <i>The 36-hour day:&nbsp; A family guide to caring for people who have\nAlzheimer disease, related dementias, and memory loss <\/i>(5th ed.)<i>.&nbsp; <\/i>Baltimore,\nMD, JHU Press.<\/span><\/p><p><a href=\"http:\/\/www.caminobooks.com\/BookDetails.aspx?pid=136&amp;add=0\" target=\"_blank\" title=\"Link: http:\/\/www.caminobooks.com\/BookDetails.aspx?pid=136&amp;add=0\">Gitlin, L.N. &amp; Piersol, V.P. (2014).&nbsp;<em>A Caregiver's Guide to Dementia: Using Activities and Other Strategies to Prevent, Reduce and Manage Behavioral Symptoms.<\/em> (1st ed.). Philadelphia, PA; Camino Books.<\/a><\/p>\n\n<p><span>Rabins,\nP.V., Lyketsos, C.G. &amp; Steele, C.D.&nbsp;\n(2006).&nbsp; <i>Practical dementia care. <\/i>(2nd ed.). New York, NY:&nbsp; Oxford University Press.&nbsp;&nbsp;<\/span><\/p>","estimatedClassWorkload":"3-5 hours\/week","recommendedBackground":"<p><span>This material is appropriate for anyone who is personally\ntouched by dementing illnesses including health professionals, students in the\nhealth professions, or families and loved ones of persons with dementia. No\nspecial background is required other than knowledge of English.<\/span><\/p>","links":{}}