{"id":1218,"shortName":"gametheory2","name":"Game Theory II: Advanced Applications","language":"en","shortDescription":"This advanced course considers how to design interactions between agents in order to achieve good social outcomes. Three main topics are covered:  social choice theory (i.e., collective decision making), mechanism design, and auctions.","aboutTheCourse":"<div>\n\n<p><span>Popularized by movies such as\n\"A Beautiful Mind\", game theory is the mathematical modeling of\nstrategic interaction among rational (and irrational) agents.  Over four weeks of lectures, this <b>advanced<\/b> course considers how to design\ninteractions between agents in order to achieve good social outcomes. Three\nmain topics are covered:  social choice\ntheory (i.e., collective decision making), mechanism design, and auctions. <\/span><\/p>\n\n<\/div>\n\n<span>In the first week we consider the problem of\naggregating different agents' preferences, discussing voting rules and the\nchallenges faced in collective decision making. We present some of the most\nimportant theoretical results in the area: notably, Arrow's Theorem, which\nproves that there is no \"perfect\" voting system, and also the Gibbard-Satterthwaite\nand Muller-Satterthwaite Theorems.  We\nmove on to consider the problem of making collective decisions when agents are\nself interested and can strategically misreport their preferences. We explain\n\"mechanism design\" -- a broad framework for designing interactions\nbetween self-interested agents -- and give some key theoretical results. Our\nthird week focuses on the problem of designing mechanisms to maximize aggregate\nhappiness across agents, and presents the powerful family of\nVickrey-Clarke-Groves mechanisms.  The\ncourse wraps up with a fourth week that considers the problem of allocating\nscarce resources among self-interested agents, and that provides an\nintroduction to auction theory. <\/span>","targetAudience":1,"courseSyllabus":"<div>\n\n<p><span>There will be four weeks of materials consisting of online\nvideos and problem sets. We recommend that you complete the problem set for\neach week within that week, although the hard deadline is two weeks from the\nrelease date. On the fifth week, we will have a final exam.<b><\/b><\/span><\/p>\n\n<p><b>Week 1.<\/b> Social Choice<\/p>\n\n<p><b>Week 2.<\/b> Mechanism Design<\/p>\n\n<p><b>Week 3.<\/b> Efficient Mechanisms<\/p>\n\n<p><b>Week 4.<\/b> Auctions<\/p>\n\n<p><b>Week 5-6<\/b>. Final exam and final problem set.<\/p>\n\n<\/div>","courseFormat":"<div>\n\n<p>· <b>Videos<\/b>. \nThe lectures are delivered via videos, which are broken into small\nchunks, usually between five and fifteen minutes each. There will be\napproximately one and a half hours of video content per week. You may watch the\nlecture videos at your convenience. Lower-resolution videos are also available\nfor those with slow Internet connections.<\/p>\n\n<p>· <b>Slides<\/b>. \nWe have made available pdf files of all the lecture slides.<\/p>\n\n<p>· <span><b>Quizzes.<\/b>  There will be non-graded short\n\"quiz\" questions that will follow some of the videos to help you\ngauge your understanding.<\/span><\/p>\n\n<p>· <span><b>Online Lab Exercises. <\/b> After some of the videos, we will ask you to\ngo online to play some games. These are entirely optional, and are designed to\nillustrate some of the concepts from the course.<\/span><\/p>\n\n<p>· <b>Problem Sets<\/b>.  There will also be graded weekly problem sets\nthat you will also answer online, but may work through offline; those must be\ncompleted within two weeks of the time that they are posted in order to be\ngraded for full credit. If you miss a problem set deadline, you may complete it\nbefore the end of the course for half credit. You may discuss problems from the\nproblem sets with other students in an online forum, without providing explicit\nanswers.<\/p>\n\n<p>· <b>Final Exam<\/b>.  There will be an online final exam that you\nwill have to complete within two weeks of its posting. Once you begin the exam,\nyou will have four hours to complete it.<\/p>\n\n<p>· <b>Screen-side Chats<\/b>.  We will hold occasional online chats where we answer  questions and discuss\ntopics relevant to the course.<\/p>\n\n<\/div>","suggestedReadings":"<div>\n\n<p>The following background readings\nprovide more detailed coverage of the course material:<\/p>\n\n<p><a href=\"http:\/\/www.masfoundations.org\/\">Multiagent Systems: Algorithmic, Game-Theoretic, and\nLogical Foundations<\/a>, by Yoav Shoham and Kevin Leyton-Brown; Cambridge\nUniversity Press, 2009. This book has the same structure as the course, and\ncovers most of the same material. It is available as a free PDF download from\nthe link above or for sale as a physical book from (e.g.) <a href=\"http:\/\/www.amazon.com\/Multiagent-Systems-Algorithmic-Game-Theoretic-Foundations\/dp\/0521899435\/ref=sr_1_1?ie=UTF8&s=books&qid=1208931730&sr=1-1\">amazon.com<\/a>.<\/p>\n\n<p><a href=\"http:\/\/papers.ssrn.com\/sol3\/papers.cfm?abstract_id=1968579\">A Brief\nIntroduction to the Basics of Game Theory<\/a>, by Matthew O.\nJackson. These notes offer a quick introduction to the basics of game theory;\nthey are available as a free PDF download.<\/p>\n\n<\/div>","estimatedClassWorkload":"5-7 hours\/week","recommendedBackground":"<p>You must be comfortable with mathematical thinking and rigorous arguments. Relatively little specific math is required; the course involves lightweight probability theory (for example, you should know what a conditional probability is) and very lightweight calculus (for instance, taking a derivative).<\/p>","links":{}}