{
    "id": 449,
    "shortName": "antimicrobial",
    "name": "Antimicrobial Stewardship: Optimization of Antibiotic Practices",
    "language": "en",
    "shortDescription": "Internet Enduring Material Sponsored by:  Stanford University School of Medicine \/\/ Presented by: The Division of Infectious Diseases in the Department of Medicine at Stanford University School of Medicine ",
    "aboutTheCourse": "<b><br>Presented by:<\/b><ul>The Division of Infectious Diseases in the Department of Medicine at Stanford University School of Medicine<br><br><\/ul><h2><b>&nbsp;&gt;&gt;&gt;&gt; NEWS FLASH ! &lt;&lt;&lt;<br><br>This course is now OPEN for ENROLLMENT<\/b><b> at:<br><br><a target=\"_blank\" href=\"https:\/\/med.stanford.edu\/cme\/courses\/online\/antimicrobial.html\">https:\/\/med.stanford.edu\/cme\/courses\/online\/antimicrobial.html<\/a><\/b><\/h2><ul><br><\/ul><b>Dates &amp; Durations:<\/b><ul><li><strong>Ongoing registration for this self-paced course is available until<\/strong><br><strong>November 22nd&nbsp;, 2015<\/strong><br><\/li><li>Estimated Time to Complete: Six hours<br><\/li><li>CME Processing Fee: $20<\/li><li>CME Credits Offered: 6.0<\/li><\/ul><br><b>To Obtain CME Credits*:<\/b><ul><li>Review the information below, then click the <strong>Join for Free<\/strong> button to register and&nbsp;access the course material. If you have already registered for this activity, click the <strong>Go to Course<\/strong> button.<br><\/li><li>View all of the videos, then follow the link at the end of the last video to register for CME&nbsp;and pay the $20 CME Processing Fee.<br><\/li><li>Complete the CME course evaluation, CME post-assessment and CME post-test.<\/li><li>75% of case-based post-test questions must be answered correctly in order to receive a CME certificate that will be emailed to the address provided within 2 weeks from the date of receipt.<br><\/li><li>Learners will have 3 attempts to pass the post-test.<br><\/li><li>The Stanford University School of Medicine designates this enduring material for a maximum of 6.0&nbsp;<i>AMA PRA Category 1 Credit(s)™.<\/i>&nbsp;Physicians should claim only the credit commensurate with the extent of their participation in the activity.<br><\/li><li>*Participation in discussion forums, chat rooms, homework assignments and additional readings are not certified for&nbsp;<i>AMA PRA Category 1 Credit™.<\/i><\/li><\/ul><br><b>Intended Audience<\/b><br>This course will offer a practical approach to prescribing antibiotic therapy and development of antimicrobial stewardship to physicians and pharmacists across all specialties and settings.<br><br><b>Course Description<\/b><br>Antibiotics are among the most frequently prescribed classes of drugs and it is estimated that approximately 50% of antibiotic use, in both the outpatient and inpatient settings, is inappropriate. At the same time, in contrast to any other class of drugs, every antibiotic use has a potential public health consequence – inappropriate use may not harm only the individual patient, but contributes to societal harm by exerting an unnecessary selective pressure that may lead to antibiotic resistance among bacteria. This course will offer a number of illustrative cases, recognizable to the practicing physician in his or her practice to engage the learners in the thought processes that lead to optimal decision making, improved outcomes of individual patients, and harm reduction vis-a-vis the bacterial ecology.<br><br><b>Learning Objectives<\/b><ul><li>Develop skills to apply IDSA guidelines in treating common infections such as acute rhino-sinusitis.<br><\/li><li>Apply evidence based antibiotic management to treat sepsis.<br><\/li><li>Implement principles of antimicrobial stewardship when providing care to special populations and in various settings.<br><\/li><li>Apply evidence based antibiotic management to surgical patients requiring antibiotic prophylaxis.<br><\/li><li>Apply evidence based antibiotic stewardship program in the outpatient setting.<\/li><\/ul><b>Accreditation Statement<\/b><br>The Stanford University School of Medicine is accredited by the Accreditation Council for Continuing Medical Education (ACCME) to provide continuing medical education for physicians.<br><br><b>AMA Credit Designation Statement<\/b><br>The Stanford University School of Medicine designates this enduring material for a maximum of 6.0&nbsp;<i>AMA PRA Category 1 Credit(s)™.<\/i>&nbsp;Physicians should claim only the credit commensurate with the extent of their participation in the activity.<br><br><b>Disclosures<\/b><br><b>The following Course Director has indicated that he has a relationship with industry to disclose relative to the content of this activity during the planning phase. This relationship no longer exists and as a faculty member he has nothing to disclose:<\/b><br>Stan Deresinski, MD FIDSA<br>Pfizer: Advisory Board member<br>Clinical Professor, Medicine<br>Infectious Disease<br>Antimicrobial Stewardship Program Medical Director&nbsp;<br>Stanford University<br><br><br><b>The following speakers have indicated that they have a relationship with industry to disclose relative to the content of this activity:<\/b><br>Thomas File, Jr MD MACP FIDSA FCCP<br>Professor of Internal Medicine<br>Head ID Section<br>Northeastern Ohio Universities Colleges of Medicine and Pharmacy<br>Rootstown, Ohio<br>Chief, Infectious Disease Service<br>Summa Health System Akron, Ohio<br><br>Astellas Pharma, Cubust, Durata, GSK, Merck: Advisory Board member<br>Pfizer, Boehringer Ingelheim, Gilead, Tobotec: Research<br>Bayer AG, DalishSankyo, Forest: Consulting<br><br><br>Jason Newland, MD<br>Medical Director, Patient Safety and System Reliability; Associate Professor of Pediatrics,<br>University of Missouri-Kansas City School of Medicine<br>Children’s Mercy Hospital Kansas City<br><br>Pfizer: Research<br><br><b>The following planners, speakers and authors have indicated that they have no relationships with industry to disclose relative to the content of this activity&nbsp;<\/b><br>Stan Deresinski, MD FIDSA\t<br>Clinical Professor, Medicine<br>Infectious Disease<br>Antimicrobial Stewardship Program Medical Director<br>Stanford University<br>Speaker<br><br>Lucy Tompkins, MD PhD FIDSA<br>Hospital Epidemiologist<br>Infectious Disease<br>Co-Course Director, Content Reviewer, and Speaker<br><br>Elizabeth Robilotti, MD MPH<br>Instructor, Infectious Diseases<br>Antimicrobial Stewardship Program&nbsp;<br>Principal Planner and Speaker<br><br>Emily Mui, PharmD, BCPS<br>Infectious Disease Pharmacist<br>Antimicrobial Stewardship Program<br>Stanford University<br>Planner<br><br>Niaz Banaei MD<br>Assistant Professor of Pathology and Medicine (Infectious Diseases)<br>Director, Clinical Microbiology Laboratory<br>Speaker<br><br>Anne Liu MD<br>Clinical Assistant Professor, Pediatrics - Immunology and Allergy<br>Clinical Assistant Professor, Medicine - Infectious Diseases<br>Pediatric Allergy &amp; Immunology Clinic<br>Speaker<br><br>Kavita Trivedi MD\t<br>Public Health Medical Officer<br>Healthcare Associated Infections Program<br>Center for Health Care Quality<br>California Department of Public Health<br>Collaborator and Speaker<br><br>Sasha Madison, MPH&nbsp;<br>Manager, Infection Prevention and Control Department&nbsp;<br>Stanford Hospital and Clinics<br>Speaker&nbsp;<br><br>R. Michael Buckley, M.D.<br>Executive Director<br>Pennsylvania Hospital<br>Professor of Clinical Medicine<br>Perelman School of Medicine<br>University of Pennsylvania<br>Speaker<br><br>Conan MacDougall, PharmD, MAS, BCPS<br>Associate Professor of Clinical Pharmacy<br>University of California San Francisco School of Pharmacy<br>Speaker<br><br>Kristi Kuper, PharmD, BCPS<br>GSPC Clinical Pharmacy Manager<br>VHA Performance Services<br>Speaker<br><br>Preeti N. Malani, MD, MSJ<br>Associate Professor of Internal Medicine<br>Divisions of Infectious Diseases and Geriatric and Palliative Medicine<br>University of Michigan Medical School<br>Veterans Affairs Ann Arbor Healthcare System<br>Speaker<br><br><b>Technical Design and Development<\/b><br>Mike McAuliffe<br>Stanford EdTech&nbsp;<br>Pauline Becker<br>Stanford EdTech&nbsp;<br>Relly Brandman<br>Coursera<br><br><br><b>Contact Information<\/b><br>For further information regarding the content, CME credit or if you experience any technical difficulties with this enduring material please send an email to&nbsp;<a target=\"_blank\" href=\"mailto:cmeonline@stanford.edu\">cmeonline@stanford.edu<\/a><br><br><b>Commercial Support Acknowledgement<\/b><br>Stanford University School of Medicine has received and has used undesignated program funding from Pfizer, Inc. to facilitate the development of innovative CME activities designed to enhance physician competence and performance and to implement advanced technology. A portion of this funding supports this activity.<br><br><b>California Assembly Bill 1195 – Cultural and Linguistic Competency<\/b><br>California Assembly Bill 1195 requires continuing medical education activities with patient care components to include curriculum in the subjects of cultural and linguistic competency. It is the intent of the bill, which went into effect July 1, 2006, to encourage physicians and surgeons, CME providers in the State of California and the Accreditation Council for Continuing Medical Education to meet the cultural and linguistic concerns of a diverse patient population through appropriate professional development. The planners and speakers of this CME activity have been encouraged to address cultural issues relevant to their topic area. The Stanford University School of Medicine Multicultural Health Portal also contains many useful cultural and linguistic competency tools including culture guides, language access information and pertinent state and federal laws. You are encouraged to visit the portal:&nbsp;<a target=\"_blank\" href=\"http:\/\/lane.stanford.edu\/portals\/cultural.html\">lane.stanford.edu\/portals\/cultural.html<\/a><br><br><br><b>Privacy<\/b><br><a target=\"_blank\" href=\"http:\/\/cme.stanford.edu\/policies\/privacy.html\">cme.stanford.edu\/policies\/privacy.html<\/a><br><br><br><b>Terms of Use<\/b><br><a target=\"_blank\" href=\"http:\/\/www.stanford.edu\/site\/terms\">www.stanford.edu\/site\/terms<\/a><br><br><br>",
    "targetAudience": 2,
    "courseSyllabus": "<b>Unit 1: The Basic Clinical Science of Antimicrobial Use:<\/b><ul><br>•\tIntroduction to Antimicrobial Stewardship<br>•\tThe Story of Penicillin<br>•\tPrinciples of Antimicrobial Use<br>•\tPrinciples of Antibacterial Pharmacokinetics &amp; Pharmacodynamics<br>•\tSepsis Case Study: Application of Principles<br>•\tIntroduction to Bacterial Resistance<br>•\tAntibiotic Resistance: Gram Positive Resistance Beyond PCN<br>•\tAntimicrobial Resistance: Mycobacterial, Viral and Fungal Resistant&nbsp;<br>•\tAcute Bacterial Skin and Skin Structure Infections<br>•\tAntibiotic Allergies<br>•\tCystitis<br>•\tUpper Respiratory Tract Infections<br>•\tCommunity Acquired Pneumonia in the Outpatient Setting<\/ul><br><b>Unit 2: Practical Aspects of Antimicrobial Stewardship and Application to Special&nbsp;Circumstances and Populations:<\/b><ul><br>•\tAntibiotic Stewardship Interventions<br>•\tConvincing the C-Suite<br>•\tMeasurements and Metrics<br>•\tIncorporating Clinical Decision Support into Stewardship<br>•\tDiagnostics&nbsp;<br>•\tInfection Prevention and Antimicrobial Stewardship<br>•\tSurgical Site Prophylaxis&nbsp;<br>•\tOut-Patient Parenteral Therapy<br>•\tAntimicrobial Stewardship in Pediatrics&nbsp;<br>•\tAntimicrobial Stewardship and Transplant Infectious Diseases<br>•\tAntimicrobial Stewardship: Long-term Care<br>•\tAntimicrobial Use at the end of life<br>•\tConclusion<\/ul>",
    "estimatedClassWorkload": "1-2 hours\/week",
    "recommendedBackground": "",
    "links": {

    }
}