{"id":2760,"shortName":"algorithmicthink1","name":"Algorithmic Thinking (Part 1)","language":"en","shortDescription":"Experienced Computer Scientists analyze and solve computational problems at a level of abstraction that is beyond that of any particular programming language.  This two-part class is designed to train students in the mathematical concepts and process of \"Algorithmic Thinking\", allowing them to build simpler, more efficient solutions to computational problems.\n","aboutTheCourse":"<div>When presented with a problem from a scientific domain, a Computer Scientist goes through a set of steps in order to provide a solution for the problem. These steps include: (1) understanding the problem; (2) formulating the problem mathematically; (3) designing an algorithm; (4) implementing the algorithm; and (5) solving the original scientific problem. This course will train students in how to employ algorithmic thinking by following these five steps to solve real-world problems.&nbsp;<\/div><div><br><\/div><div>Understanding the problem entails holding conversations with domain experts to understand the parameters of the problem, what data they can provide to the computer program, what answers they expect, etc. Formulating the problem mathematically is basically the step of turning the problem from an English description to a mathematical description that is amenable to further computational analyses.&nbsp;<\/div><div><br><\/div><div>While the course emphasizes implementing the algorithms and solving the original problems that gave rise to the need for these algorithms in the first place, much of this two-part course (part 2 is available <a href=\"https:\/\/www.coursera.org\/course\/algorithmicthink2\">here<\/a>) will be devoted to the third step, namely, algorithm design. Here, the course will introduce students to different algorithm design strategies, as well as mathematical tools for reasoning about the correctness and efficiency of algorithms. &nbsp;<\/div>","targetAudience":0,"courseSyllabus":"Our course syllabus can be viewed at <a href=\"http:\/\/www.codeskulptor.org\/coursera\/algorithmicthinking.html\">www.codeskulptor.org\/coursera\/algorithmicthinking.html<\/a>.","courseFormat":"The first part of this course will consist of two two-week modules. Each module is comprised of a set of video lectures along with three assignments.  The first assignment, a homework, emphasizes the mathematical portion of the module.  The second assignment, a programming project, covers the programming aspects of the module.  Finally, the third assignment, a peer assessment, focuses on a practical application that ties the mathematical and programming aspects of the module together.","suggestedReadings":"","estimatedClassWorkload":"7-10 hours\/week","recommendedBackground":"Prior mathematical and programming experience at the level of <a href=\"https:\/\/www.coursera.org\/course\/principlescomputing\">\"Principles of Computing\"<\/a> (PoC). Students that have not taken PoC are welcome, but should be comfortable writing intermediate size &nbsp;(300+ line) programs in Python and have a basic\n    understanding of searching, sorting, and recursion. Students should also have a solid math background that includes algebra, pre-calculus and a familiarity with the <a href=\"http:\/\/www.codeskulptor.org\/coursera\/principlescomputing.html\">math concepts<\/a> covered in PoC. The first week of class will include material designed to help students accurately assess whether they have the necessary background to take this class.","links":{}}