{"id":3386,"shortName":"apafrique","name":"Gestion des aires protégées en Afrique","language":"fr","shortDescription":"Ce Mooc parle de conservation de la nature, d’Afrique, de parcs, et de réserves. Découvrir et comprendre comment améliorer la gouvernance et la gestion de ces territoires uniques, c’est son objectif. ","aboutTheCourse":"<p>Chaque\nsemaine pendant sept semaines, nous aborderons un thème clef&nbsp; relatif à la\nconservation de la nature au travers des aires protégées. Nous verrons les\nconcepts à comprendre au préalable, la planification, à toutes ses échelles, la\ngouvernance et ses multiples ressorts, l’efficacité de la gestion pour de\nmeilleurs impacts, les techniques à employer sur le terrain, le financement de\nla conservation et enfin l’actualité brûlante du moment.&nbsp; Nous parlerons d’aménagement du territoire, de\ntransfrontalier, de connectivité, de surveillance, de restauration des sites, d’éducation\nenvironnementale, d’équité, de services des écosystèmes, de populations\nlocales, de tourisme, de climat, d’aires marines protégées, de conventions\ninternationales… bref de tout ce qu’il faut connaître pour pouvoir conserver\ndurablement ces aires protégées.<\/p>\n\n\n\n<p>\n\n<p>De nombreux intervenants prendront la parole et viendront\nillustrer par leur expérience de terrain les cours coordonnés par les quatre\nintervenants principaux, partenaires du RESCIF&nbsp;: Paul Ndiaye, de l’UCAD à\nDakar, Paul Ouedraogo, du secrétariat de la Convention RAMSAR, Sylvie Goyet qui\na dirigé la Fondation Internationale du Banc d’Arguin et Geoffroy Mauvais, qui\nest de l’Union Internationale pour la Conservation de la Nature (UICN-Papaco)\net collaborateur externe au Collège des Humanités de l’EPFL. Le MOOC est\n&nbsp;coproduit par André Hoffmann, UICN-Papaco et l’EPFL.<\/p>\n\n<\/p>","targetAudience":1,"courseSyllabus":"","courseFormat":"<p>Le Mooc s’organise en 7 semaines et chaque semaine s’articule\nautour de 6 ou 7 courtes vidéos, de 5 à 10 mn chacune, traitant spécifiquement\nd’un sujet. S’y ajoutent des documents à lire pour approfondir chaque thème, des\nsites à consulter pour plus d’info, des quizz pour se tester, un blog animé\ntous les jours, des débats… tout cela nous permet de progresser tous ensemble\net de constituer un réseau actif d’échange d’expériences qui se prolongera\naorès la fin du Mooc. Chaque semaine se termine par une animation récapitulant\nles acquis hebdomadaires et par un devoir dirigé (optionnel, si vous souhaitez\nobtenir l’attestation de succès au Mooc).<\/p>\n\n<br><br>","suggestedReadings":"","estimatedClassWorkload":"5-5 hours\/week","recommendedBackground":"<p>Il n’y\na pas de prérequis pour vous inscrire. Il faut juste s’intéresser à la\nconservation de la nature en Afrique&nbsp;!<\/p>\n\n<br><br><br><br>","links":{}}