{"id":1327,"shortName":"apstat","name":"Preparing for the AP* Statistics Exam","language":"en","shortDescription":"This course is designed for high school students preparing to take the AP* Statistics Exam.\n\n* AP Statistics is a registered trademark of the College Board, which was not involved in the production of, and does not endorse, this product.","aboutTheCourse":"This course reviews the topics for the AP Statistics Exam. Each week of the six week review will include review videos for an important block of material, complete with videos of worked example problems and exam tips. There will also be an extensive online quiz given each week, with multiple problem versions that students can use to practice, along with a practice test to help students prepare for the AP* Statistics Exam.<br><br>* AP Statistics is a registered trademark of the College Board, which was not involved in the production of, and does not endorse, this product.<br>","targetAudience":3,"courseSyllabus":"<p>Week 1:      Univariate Data and Probability<\/p>\n<p>Week 2:      Discrete and Continuous Distributions<\/p>\n<p>Week 3:      Bivariate Data, Sampling and Experiments<\/p>\n<p>Week 4:      Estimation and Confidence Intervals and Begin Tests of Significance<\/p>\n<p>Week 5:      Tests of Significance<\/p>\n<p>Week 6:      Exam Practice and Tips<\/p>","courseFormat":"This class will consist of several lecture videos over content taught in high school AP* Statistics.  There will be quizzes over the content reviewed each week as well as optional stand alone homework assignments.  We will also make full use of the class discussion forum to check for understanding and prepare you for the AP* Statistics Exam given in May.  There will be a practice exam given at the end of the course.","suggestedReadings":"There is no required reading.","estimatedClassWorkload":"8-10 hours\/week","recommendedBackground":"Concurrent or prior enrollment in high school AP* Statistics.<span id=\"_wysihtml5-undo\" class=\"_wysihtml5-temp\"><\/span>","links":{}}