{
    "id": 591,
    "shortName": "jerusalem",
    "name": "The Fall and Rise of Jerusalem",
    "language": "en",
    "shortDescription": "The destruction of the First Temple in Jerusalem and the Babylonian Exile were a great catastrophe in the history of the Jewish Nation.  What really happened during that dark, fateful age, and how did new opportunities arise from the ashes?",
    "aboutTheCourse": "<p>The fall\nof Jerusalem and the destruction of the First Temple, the conquest of Judah by\nthe armies of Babylon and the resulting Exile are remembered to this day as a\nmomentous crisis – both national and religious – in the history of the Jewish People.\nEven today, more than 25 centuries after their occurrence, the impact of these\nevents can be discerned in Judaism – as a faith, an identity and a world\noutlook. This course tells the riveting story of the century between the demise\nand rise of Judah, from the unique and comprehensive perspective of modern\nresearch.<\/p>\n\n<p>In this course we will review the dramatic events in Judah during the sixth century BCE, and\nconstruct a broad and balanced picture of this turbulent period. To do this, it\nwill rely upon the combined efforts of several academic disciplines: History, drawing\nupon ancient Babylonian and Egyptian sources, as well as extensive knowledge\naccumulated through the ages; Archaeology, which unravels secrets preserved\nwithin the earth for countless generations; and Biblical Studies, examining and\nanalyzing the textual accounts of the events in the Old Testament. &nbsp;<br><\/p>\n\n<p>Bringing\nall these angles together, the course will provide you with a new, fresh outlook on an age-old\ntrauma: it will present the destruction of the First Temple as the most\ndecisive turning point in the history of Judah, the Jewish people and Judaism during\nthe first millennium BCE; it will explain how the terrible calamity gave rise\nto great historical opportunities, which transformed the leadership, society\nand daily lives of the Judeans, reshaped their national and theological\nperceptions, and forever altered the essence of Judaism; and it will portray\nthe Babylonian conquest and rule over Jerusalem and Judah - one of the darkest\ntimes in the history of the Jewish nation – as a bridge to the renewal and prosperity\nof the Second Temple period.&nbsp;<br><\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<b>Week One<\/b><br>Introduction and the Turmoil of the Seventh Century BCE<br><b><br>Week Two<\/b><br>Judah under Babylonian rule&nbsp;&nbsp;<br><br><b>Week Three<\/b><br>The days of the destruction of Jerusalem<br><br><b>Week Four<\/b><br>Gedaliah son of Ahikam<br><br><b>Week Five<\/b><br>Archaeology of the sixth century BCE<br>",
    "estimatedClassWorkload": "3-4 hours\/week",
    "recommendedBackground": "Curiosity and passion for Biblical literature, archaeology and history.",
    "links": {

    }
}