{"id":1589,"shortName":"cybersecuritycapstone","name":"Cybersecurity Capstone Project","language":"en","shortDescription":"This course presents an intensive experience during which students build a software system they intend to be secure, and then attempt to show that other students' projects are insecure, by finding flaws in them.","aboutTheCourse":"This course is the capstone of the Cybersecurity specialization offered by the University of Maryland.&nbsp;The aim is to give learners hands-on experience, building on what they have learned during the specialization courses.&nbsp;<br><br>The task of the Capstone is to&nbsp;design and build a secure system, and expose weaknesses in systems built by other teams. The capstone follows the format of the&nbsp;Build-it Break-it Fix-it&nbsp;security&nbsp;contest developed at the University of&nbsp;Maryland, described at&nbsp;<a href=\"https:\/\/coursera.builditbreakit.org\/\" title=\"Link: https:\/\/builditbreakit.org\/\">https:\/\/coursera.builditbreakit.org\/<\/a>.&nbsp;<br><br>Participating in the course gives learners the chance to be part of research on understanding how to better build secure software. They may also submit resumes accessible to corporate sponsors, for potential internship and employment opportunities.<br>","targetAudience":1,"courseSyllabus":"The capstone course lasts six weeks:<ol><li>Week 1, Background, preliminaries: Re-capping prior course knowledge, forming teams,&nbsp;additional preparation<\/li><li>Weeks 2-3, Developing a secure system: Students will design and implement a secure system according to a provided specification, with points awarded for performance and functionality<\/li><li>Weeks 4-5, Auditing: Teams will be tasked with finding flaws\/bugs in other teams' code, with points awarded for each (unique) flaw found<\/li><li>Week 6, Fixing: Teams may fix flaws in their own code, found by others, in order to gain points back<\/li><\/ol>After the sixth week, the winners are declared, with separate categories for the best \"builders\" and the best \"breakers\".<br>","courseFormat":"The class consists of intense programming and code reviewing tasks carried out at home, in teams, with work submitted to, and assessed by, the contest web site.","suggestedReadings":"","estimatedClassWorkload":"10-20 hours\/week","recommendedBackground":"","links":{}}