{"id":1565,"shortName":"wrongfulconviction","name":"Presumed Innocent? The Social Science of Wrongful Conviction","language":"en","shortDescription":"The United States criminal justice system is typically an accurate and efficient system—although, as a human creation, it is not perfect. This course will employ a social scientific perspective to understand why innocent people are sometimes convicted of crimes they did not commit. In this course we will discuss wrongful convictions, their causes, and their solutions.","aboutTheCourse":"<p>According to\nthe National Registry of Exonerations, a joint project of Michigan Law and\nNorthwestern Law, over 1,600 individuals in the United States have been\nexonerated after being convicted for crimes they did not commit. These are the\nknown cases of wrongful conviction—the actual number is much higher. Some of\nthese individuals have served years, even decades, in prison for these\ncrimes. Often, real offenders\nhave escaped justice as a result of the wrong person being accused and convicted. <\/p>\n\n<p>As noted, we\nwill approach this topic from a social scientific perspective. Social science\nis a broad field that seeks to understand social interactions between\nindividuals, groups, and institutions. The field includes academic disciplines\nsuch as sociology, criminology, psychology, economics, anthropology, political\nscience, and other related disciplines.&nbsp;<\/p>\n\n<p>In this\ncourse we will explore wrongful convictions answering several key questions:<\/p>\n\n<ul>\n <li><i>What do we mean by\n     “wrongfully convicted,” and how common are wrongful convictions?<\/i><\/li>\n <li><i>Who are wrongfully\n     convicted?<\/i><\/li>\n <li><i>Where in the\n     criminal justice system do things go wrong to lead to wrongful\n     convictions?<\/i><\/li>\n <li><i>Why do wrongful\n     convictions occur? <\/i><\/li>\n <li><i>How can social\n     science contribute to understanding, and preventing wrongful convictions?<\/i><\/li>\n<\/ul>\n<p>&nbsp;<\/p><h2>For-credit option:<\/h2><p>This course will also be offered for Penn State credit.  This course option will require a heavier workload and offer instructor feedback and assessment on completed work.  <\/p> <div><a target=\"_blank\" href=\"http:\/\/elearning.la.psu.edu\/crim\/201\">More info here<\/a><\/div>","targetAudience":0,"courseSyllabus":"<p>Each week we\nwill cover two lessons in the course. Each lesson, while related, will be considered independently.<br><\/p>\n\n<p><b>Week One:<\/b><br>\n<i>Introduction to the Criminal Justice System<\/i><br>\n<i>Social Science and Public Policy: Due Process and Crime Control<\/i><\/p>\n\n<p><b>Week Two: <\/b><br>\n<i>Wrongful Conviction Defined<\/i><br>\n<i>Wrongful Conviction Demographics and Statistics<\/i><\/p>\n\n<p><b>Week Three: <\/b><br>\n<i>Wrongful Conviction and the Criminal Justice Process—Where do things go wrong?<\/i><br>\n<i>Causes of Wrongful Conviction: Eyewitness Misidentification—An Introduction<\/i><\/p>\n\n<p><b>Week Four: <\/b><br>\n<i>Causes of Wrongful Conviction: Eyewitness Misidentification—System Variables<\/i><br>\n<i>Causes of Wrongful Conviction: Eyewitness Misidentification—Estimator Variables<\/i><\/p>\n\n<p><b>Week Five: <\/b><br>\n<i>Causes of Wrongful Conviction: False Confessions<\/i><br>\n<i>Causes of Wrongful Conviction: Jailhouse Snitches and Informants<\/i><\/p>\n\n<p><b>Week Six: <\/b><br>\n<i>Causes of Wrongful Conviction: Government Misconduct and Poor Defense<\/i><br>\n<i>Myths and Misconceptions of Decision-Makers: Judges, Juries, and the Public<\/i><\/p>\n\n<p><b>Week Seven: <\/b><br>\n<i>Using Social Science to Prevent Wrongful Convictions<\/i><br>\n<i>What can you do?<\/i><\/p>","courseFormat":"<p>Each lesson\nwill consist of written text and approximately 10-12 minutes of video content.\nThe video content will include both lecture by the instructor (Tim Robicheaux)\nand interviews with social scientists, legal scholars, and individuals active in the\ncriminal justice system. Lessons will include rich legal and social science\ncontent, as well as anecdotes of wrongful convictions. <\/p>\n\n<p>We will also include links to supplementary readings and videos for your own reading and viewing. Each lesson will conclude with a quiz to demonstrate your understanding of course topics, as well as discussion forums to share your thoughts. Students are also expected to complete a peer-assessed activity applying the content to actual cases.<\/p>","suggestedReadings":"","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"A basic understanding of the United States criminal justice system would be\nhelpful, but we have included a summary lesson at the beginning of the course.","links":{}}