{"id":1305,"shortName":"predmachlearn","name":"Practical Machine Learning","language":"en","shortDescription":"Learn the basic components of building and applying prediction functions with an emphasis on practical applications. This is the eighth course in the Johns Hopkins Data Science Specialization.","aboutTheCourse":"One of the most common tasks performed by data scientists and data analysts are prediction and machine learning. This course will cover the basic components of building and applying prediction functions with an emphasis on practical applications. The course will provide basic grounding in concepts such as training and tests sets, overfitting, and error rates. The course will also introduce a range of model based and algorithmic machine learning methods including regression, classification trees, Naive Bayes, and random forests. The course will cover the complete process of building prediction functions including data collection, feature creation, algorithms, and evaluation.","courseSyllabus":"Upon completion of this course you will understand the components of a machine learning algorithm. You will also know how to apply multiple basic machine learning tools. You will also learn to apply these tools to build and evaluate predictors on real data.","courseFormat":"Weekly lecture videos and quizzes and a final project that will be both objectively assessed and peer graded.<br><br>As part of this class you will be required to set up a&nbsp;<a href=\"https:\/\/github.com\" target=\"_blank\">GitHub account<\/a>. GitHub is a tool for collaborative code sharing and editing. During this course and other courses in the Specialization you will be submitting links to files you publicly place in your GitHub account as part of peer evaluation. If you are concerned about preserving your anonymity you will need to set up an anonymous GitHub account and be careful not to include any information you do not want made available to peer evaluators.<br>","suggestedReadings":"","estimatedClassWorkload":"4-9 hours\/week","recommendedBackground":"<a href=\"https:\/\/www.coursera.org\/course\/datascitoolbox\" target=\"_blank\">The Data Scientist’s Toolbox<\/a>,&nbsp;<a href=\"https:\/\/www.coursera.org\/course\/rprog\" target=\"_blank\">R Programming<\/a>,&nbsp;<a href=\"https:\/\/www.coursera.org\/course\/regmods\" target=\"_blank\">Regression Models<\/a>, and&nbsp;<a href=\"https:\/\/www.coursera.org\/course\/exdata\" target=\"_blank\" title=\"Link: https:\/\/www.coursera.org\/course\/exdata\">Exploratory Data Analysis<\/a><br>","links":{}}