{"id":1275,"shortName":"totalleadership","name":"Better Leader, Richer Life","language":"en","shortDescription":"The Total Leadership approach will help you become a better leader by having a richer life and have a richer life by becoming a better leader.  Learn a practical, proven method for how to articulate your core values and vision; build trust with your most important people; and achieve \"four-way wins\" -- improved performance at work or in school, at home with your family, in your community, and for your self (mind, body, spirit).  It's not about \"work\/life balance\"; it's about creating harmony among the different parts of your life as a leader in all of them. ","aboutTheCourse":"<p><span>Life is a zero-sum game,\nright?&nbsp; The more you strive to win in one\ndimension (such as your work or school), the more you have to sacrifice in the\nother dimensions (family, community, and the private self). &nbsp;Described in the best-selling, award-winning\nbook <i><a href=\"http:\/\/www.amazon.com\/Total-Leadership-Better-Leader-Richer\/dp\/1422103285\/ref=tmm_hrd_title_0?ie=UTF8&amp;qid=1384022569&amp;sr=8-1\" target=\"_blank\">Total Leadership: Be a Better\nLeader, Have a Richer Life<\/a><\/i> (Harvard Business, 2008)&nbsp;<\/span>and in the soon-to-be published <a href=\"http:\/\/www.amazon.com\/Leading-Life-You-Want-Integrating-ebook\/dp\/B00MSYQ08M\/ref=sr_1_1?ie=UTF8&amp;qid=1408492935&amp;sr=8-1&amp;keywords=leading+the+life+you\" target=\"_blank\">Leading the Life You Want: Skills for Integrating Work and Life<\/a>&nbsp;(Harvard Business, 2014), this course teaches you a proven\nmethod that shows how you don’t always have to make trade-offs between life’s\nmost important domains, and certainly not as often as you think. &nbsp;Nor should you! &nbsp;A trade-off mindset makes people feel all\nmanner of stress – unfocused, resentful, and overwhelmed.&nbsp; It hurts those you care about and prevents you\nfrom performing effectively to produce results that matter in every part of your\nlife.&nbsp;<\/p>\n\n<p>In this course you learn how to articulate your values and personal leadership vision, cultivate supportive relationships with people\n    who matter most in all parts of your life, and continually experiment with how you get things done to better align your actions with your values -- and so produce positive sustainable change. &nbsp;This step-by-step method for pursuing what professor Stew Friedman calls \"four-way wins\" has enabled people all over the world to become more successful and satisfied leaders in all parts of life: work (or school), home, community, and the private self (mind, body, and spirit). &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<br><\/p><p>This practical course has been taught to thousands of students at Wharton and elsewhere by Friedman since 2001. Over 94,000 enrolled in our first two sessions of this course in 2014, and the instructor rating for it was second-highest of all University of Pennsylvania courses on Coursera. &nbsp;Here is a&nbsp;<a href=\"http:\/\/www.totalleadership.org\/wp-content\/uploads\/2015\/01\/Better-Leader-Richer-Life-Student-Feedback_081414.pdf\" target=\"_blank\">detailed analysis of course outcomes<\/a>&nbsp;from Session 1. &nbsp;Below are a few quotes from Coursera students:<\/p><p>I absolutely enjoyed this course. I have some wonderful new tools for my leadership toolbox and I plan to continue my experiments. Thank you Professor Friedman for your compassionate lectures. This was a great course. Very inspiring!&nbsp;-- M. W.<\/p><p>There is so much goodness in this course, I have been touched to see so many good people showing care and sensitivity to others through peer feedback and discussion forums that I find it soul cleansing. &nbsp;The professor has been taking so much efforts to participate in so many discussion forums as well as conduct office hours to help us in our lives. I have found great learning from each of the discussion forums and have got different perspectives.  Peer feedback is a wonderful opportunity for us to help others.&nbsp;-- V. S.&nbsp;<\/p><p>Through your constant nurturing and defining of principles for being a better leader and leading a richer life I think we have all gained knowledge to be leaders in our lives, and it is through this kind of nurturing that all things are possible.  Thank you for putting me back in touch with what makes greatness, the small wins that add up over time.  Your methodology is simple, it is not always easy, but it is worthwhile. -- C.<\/p><p>Learn more at <a href=\"http:\/\/www.totalleadership.org\/\" target=\"_blank\">Total Leadership<\/a> and the&nbsp;<a href=\"http:\/\/worklife.wharton.upenn.edu\/\" target=\"_blank\">Wharton Work\/Life Integration Project<\/a>. &nbsp;Like us on&nbsp;<a href=\"https:\/\/www.facebook.com\/pages\/Total-Leadership\/50869121075\" target=\"_blank\">Facebook<\/a>&nbsp;and follow on Twitter <a href=\"https:\/\/twitter.com\/StewFriedman\" target=\"_blank\">@StewFriedman<\/a>. &nbsp;<br><\/p>","courseSyllabus":"<p>This course is about growing as a leader in all parts of your life and having fun while doing so.  You watch video lectures, do weekly assignments (including conversations with important people in your life and real-world actions you take to improve your performance in all parts of your life), and take a final exam.&nbsp;<\/p><p>You have the option of doing this course on your own (Individual Track) or in concert with others (Community Track). In the Individual Track you answer assignment questions in a journal for your own use.  In the Community Track you post answers to these same questions and exchange feedback on them with your classmates. <\/p><p><b>Week 1: &nbsp;Starting Total Leadership<\/b><br><\/p>\n<p><\/p>\n<ul>\n    <li>1.1: Launch your Total Leadership experience\n        <br>\n    <\/li>\n    <li>1.2: Learn the Total Leadership principles and method<br>\n    <\/li>\n    <li>1.3: Assess your skills and define your goals<\/li>\n    <li>1.4: Review our course plan\n        <br>\n    <\/li>\n<\/ul>\n<p><\/p>\n\n\n\n\n\n\n\n\n\n<p><b>Week 2: &nbsp;Clarifying What's Important<\/b><\/p><ul><li>2.1: Tell the story of your values&nbsp;<br><\/li>\n    <li>2.2: Share your leadership vision\n        <br>\n    <\/li>\n    <li>2.3: Take the four-way view\n        <br>\n    <\/li>\n    <li>2.4: Give and receive coaching&nbsp;<\/li>\n<\/ul>\n<p><\/p>\n\n\n\n\n\n\n\n\n\n\n\n<p><b>Week 3: &nbsp;Seeing Your Life as a System<\/b><\/p><ul>\n    <li>3.1: Identify key stakeholders\n        <br>\n    <\/li>\n    <li>3.2: Understand performance expectations\n        <br>\n    <\/li>\n    <li>3.3: See your life as a system you can change&nbsp;\n        <br>\n    <\/li>\n    <li>3.4: Consider the media you use<br>\n    <\/li>\n<\/ul>\n<p><\/p>\n\n\n\n\n\n\n\n\n\n<p><b>Week 4: &nbsp;<\/b><b>Talking to Your Stakeholders<\/b><br><\/p>\n\n<p><\/p>\n<ul>\n    <li>4.1: Understand the purpose of stakeholder dialogues &nbsp;&nbsp;\n        <br>\n    <\/li>\n    <li>4.2: Chart your course and then adjust it &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<br>\n    <\/li>\n    <li>4.3: Look through their eyes and find common ground &nbsp;\n        <br>\n    <\/li>\n    <li>4.4: Build and restore trust\n        <br>\n    <\/li>\n<\/ul>\n<p><\/p>\n\n\n\n\n\n\n\n<p><b>Week 5: &nbsp;Thinking About Creating Change<\/b><br><\/p><ul><li>5.1: Glean insights from dialogues&nbsp;<br><\/li>\n    <li>5.2: Learn about Total Leadership experiments\n        <br>\n    <\/li>\n    <li>5.3: Generate ideas for your experiments &nbsp;&nbsp;<\/li>\n<\/ul>\n<p><\/p>\n\n\n\n\n\n\n\n<p><b>Week 6: &nbsp;Designing Experiments<\/b><br><\/p>\n\n<p><\/p>\n<ul>\n    <li>6.1: Choose the most promising idea&nbsp;<br>\n    <\/li>\n    <li>6.2: Set your game plan and scorecard<br>\n    <\/li>\n    <li>6.3: Get in the game!&nbsp;<\/li>\n<\/ul>\n<p><\/p>\n\n\n\n\n\n\n\n\n\n<p><b>Week 7: &nbsp;Bringing Others Along With\nYou<\/b><br><\/p>\n\n<p><\/p>\n<ul>\n    <li>7.1: Be artfully political &nbsp; &nbsp;<\/li>\n    <li>7.2: Build social capital\n        <br>\n    <\/li>\n    <li>7.3: Make a difference, beyond what you can see\n        <br>\n    <\/li>\n<\/ul>\n<p><\/p>\n\n\n\n\n\n\n\n<p><b>Week 8: &nbsp;Leading the Life You Want<\/b><\/p><ul><li>8.1:&nbsp;Learn how exemplary leaders\nintegrate work and life&nbsp;&nbsp;<br><\/li><li>8.2:&nbsp;Choose the skills you want to focus\non next&nbsp;&nbsp;<\/li><\/ul>\n<p><\/p>\n\n\n\n\n\n<p><b>Week 9: &nbsp;Looking Back, Looking\nForward<\/b><\/p>\n\n<p><\/p>\n<ul>\n    <li>9.1: Reflect on your progress and distill lessons<\/li>\n    <li>9.2: Tell your leadership story&nbsp;\n        <br>\n    <\/li>\n<\/ul>\n<p><\/p>\n\n\n\n\n\n<p><b>Week 10: &nbsp;Continuing the Journey<\/b><br><\/p>\n\n<p><\/p>\n<ul>\n    <li>10.1: Share the big ideas &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<\/li>\n    <li>10.2: Commence &nbsp; &nbsp;<\/li>\n<\/ul>\n<p><\/p>","courseFormat":"<p>Our 10-week course consists of short\nlecture videos (two to four each week), weekly assignments (including\nconversations with important people in your life and real-world action to\nimprove performance in all parts of your life), and a multiple-choice final\nexam that is an assessment of your knowledge of the content covered in the\nvideo lectures.<\/p>\n\n<p>You have the opportunity to do\npractical exercises that help you clarify your values and vision, determine who\nmatters most in your life and clarify expectations with them, and design\nexperiments to create positive change in all parts of your life.&nbsp;&nbsp;<\/p>\n\n<p>Students in the Community Track exchange\nfeedback on weekly assignments with other students.&nbsp; Students in the Individual Track do not exchange\nfeedback but complete short weekly quizzes about the lectures instead.<\/p>","suggestedReadings":"We highly recommend (but do not require) that you read the books&nbsp;<i><a href=\"http:\/\/www.amazon.com\/Total-Leadership-Better-Leader-Richer\/dp\/1422103285\/ref=tmm_hrd_title_0?ie=UTF8&amp;qid=1384022569&amp;sr=8-1\" target=\"_blank\">Total Leadership: Be a Better\nLeader, Have a Richer Life<\/a><\/i> (Harvard Business, 2008),&nbsp;<i><a href=\"http:\/\/www.amazon.com\/Leading-Life-You-Want-Integrating-ebook\/dp\/B00MSYQ08M\/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1408426913&amp;sr=1-1&amp;keywords=leading+the+life+you+want\" target=\"_blank\">Leading the Life You Want: Skills for Integrating Work and Life<\/a><\/i>&nbsp;(Harvard Business, 2014), and <span><a href=\"http:\/\/wdp.wharton.upenn.edu\/books\/babybust\/\" target=\"_blank\"><i><\/i><\/a><i><a href=\"http:\/\/wdp.wharton.upenn.edu\/books\/babybust?utm_source=coursera&amp;utm_medium=email&amp;utm_campaign=babybust \" target=\"_blank\">Baby Bust: New Choices for Men and Women in Work and\nFamily<\/a><\/i><\/span>&nbsp;(Wharton Digital Press, 2013) for details on the ideas and methods in our course.","estimatedClassWorkload":"3-8 hours\/week","recommendedBackground":"<span>No technical background is needed\nfor you to have a fun and rewarding experience in our course. &nbsp;You need an open mind, a willingness to look inside yourself, and an\neagerness to try to enhance your capacity to perform in ways that improve your work, your home, your community,<i> and <\/i>your private self.&nbsp;<\/span>","links":{}}