{"id":393,"shortName":"theriogenology","name":"Canine Theriogenology for Dog Enthusiasts","language":"en","shortDescription":"This course will help anyone who loves dogs to better understand their dog’s reproductive health and how to control its reproduction. This includes understanding the pros and cons of having your dog spayed or castrated, and understanding at what age that surgery can be performed.","aboutTheCourse":"Every dog owner should have some understanding of reproduction, whether they intend to breed that dog or just want to have their dog spayed or castrated. As a dog enthusiast, you want to know what is best for your dog and to understand your veterinarian’s recommendations. This course is intended to give you the background knowledge necessary to help you achieve those goals. <br><br>Students in this course will learn the basics of anatomy and reproductive physiology necessary to understand reproduction control, and the diagnosis and management of reproductive tract disease in male and female dogs. My goal is to provide you with background information that will help you work with your veterinarian to make the best decisions for your dog.<br><br><br>","targetAudience":0,"courseSyllabus":"Week 1: Female dog anatomy \/ The estrous cycle<br><br>Week 2: Breeding management \/ Pregnancy and whelping<br><br>Week 3: Female dog reproductive tract disorders<br><br>Week 4: Male dog anatomy \/ Semen collection and evaluation \/ Artificial insemination<br><br>Week 5: Male dog reproductive tract disorders<br><br>Week 6: Contraception and sterilization of female and male dogs<br><br>","courseFormat":"I will start each session with a case for you to think about, provide a couple of brief video lectures (5-15 minutes in length) followed by short activities to check your understanding. We'll conclude each session with a review of the most important points and an explanation of the case with which we started. For more advanced students, a question will be posted that will require you to find your own resources. I will also provide references to written materials that may help you better understand the concepts or to learn more about topics of particular interest to you.<br><br>I will be using correct veterinary terminology throughout the course, both in written materials and in video presentations. That means that I will refer to an unspayed female dog as a bitch. I also will be using correct terms for anatomy. This is not intended to be shocking or unsettling. Use of correct terminology ensures clear understanding. Similarly, some images may be graphic but they are used to demonstrate a disease state or correct performance of a procedure and are intended for your education.<br>","suggestedReadings":"Much of the material for this course will be taken from <u><a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=theriogenology&isbn_ean=9781416031390\">The Dog Breeder’s Guide to Successful Breeding and Health Management<\/a><\/u> (ISBN:1-4160-3139-1). Another text that is very helpful for dog breeders is <u><a href=\"http:\/\/www.amazon.com\/Canine-Reproduction-Breeders-Phyllis-Holst\/dp\/1577790286\/ref=sr_1_1?s=books&ie=UTF8&qid=1361421689&sr=1-1&keywords=canine+reproduction\">Canine Reproduction<\/a><\/u> by Phyllis Holst (ISBN 978-1-57779-114-0). Students with purebred dogs also may find much information on the website from their national breed club, especially for those with breeds registered with the American Kennel Club (AKC). Finally, all students should feel free to contact their veterinarian with questions or concerns about any dog for which you are responsible. <br>","instructor":"Margaret V. Root","estimatedClassWorkload":"2-4 hours\/week","recommendedBackground":"Participants should have a basic grasp of biology and general familiarity with dog anatomy and normal dog behavior. <br>","links":{}}