{
    "id": 1174,
    "shortName": "industorg",
    "name": "Теория отраслевых рынков (Industrial Organization)",
    "language": "ru",
    "shortDescription": "Курс посвящен закономерностям конкуренции, рассматриваемой в рамках концепции стратегического взаимодействия продавцов, включая олигополистическую конкуренцию и решения укоренившегося продавца, сталкивающегося с опасностью входа.\nExplore the factors that determine firm size and market structures by analyzing the strategic decisions made by market participants.",
    "aboutTheCourse": "Курс\nпосвящен факторам, влияющим на размер компаний и структуру рынка. Почему на\nодной группе рынков преобладают малые компании, а на другом крупные? Продавцы\nпринимают решения стратегически, однако их стимулы в свою очередь зависят от\nструктуры рынка и от предшествующих решений. Как разделить между зоной\nпредопределенных и свободных решений? <br>Cпособны ли укоренившиеся на рынке продавцы препятствовать входу новичков, защищая свою рыночную долю и свою прибыль? Как в этих условиях должна быть организована государственная политика (антитраст и регулирование)? Каковы лучшие способы предотвращения ценовых сговоров продавцов? Нужно ли (или по крайней мере желательно) запрещать или ограничивать слияния между крупными продавцами? Как в этих условиях должна быть\nорганизована государственная политика (антитраст и регулирование)?<br><br>The course\nexplores the factors that determine firm size and market structure. Why do small firms\ndominate in one group of the market and very large firms in the others? Market\nparticipants make decisions strategically, but their incentives are affected by\nmarket structure as well as their past choices. How do we distinguish between\ndetermined and ‘free choice’ areas in competition and market structures? How should public policy (including antitrust and regulation) be designed? ",
    "targetAudience": 0,
    "courseSyllabus": "<p>Неделя 1. Размер фирмы и его объяснение. Технологическая,\nинституциональная, стратегическая теория фирмы, их пределы<\/p>\n\n<p>Неделя 2. Монополия, естественная монополия и регулирование.\nНеэффективность  регулирования\nестественных монополий<\/p>\n\n<p>Неделя 3. Парадокс Бертрана и факторы олигополистической\nконкуренции. Повторяющиеся взаимодействия, дифференциация продукта,\nограниченность мощностей. <\/p>\n\n<p>Неделя 4. Сговор. Факторы, способствующие поддержанию явного\nи молчаливого сговора. Государственная политика против сговора<\/p>\n\n<p>Неделя 5. Вертикальные ограничивающие контракты. Поддержание\nрыночной власти или обеспечение эффективности? Антимонопольная политика в\nотношении вертикальных ограничивающих контрактов<\/p>\n\n<p>Неделя 6. Дифференциация продукта и реклама. Выбор\nдифференциации: влияние конкуренции и влияние на конкуренцию. Реклама и её\nобъяснения<\/p>\n\n<p>Неделя 7. Вход, выход и формирование структуры рынка. Рынки с\nэкзогенными и эндогенными издержками входа. Предотвращение входа со стороны\nукоренившегося продавца<\/p>\n\n<p>Неделя 8. Инновации и конкуренция. Сетевые эффекты\nпотребления и их влияние на рынки<\/p>",
    "estimatedClassWorkload": "6-8 hours\/week",
    "recommendedBackground": "<span>Знание\nмикроэкономической теории на промежуточном уровне (ориентир – учебник Х.Вариан.\nМикроэкономика: промежуточный уровень) <\/span>",
    "links": {

    }
}