{
    "id": 1349,
    "shortName": "univteaching101",
    "name": "University Teaching 101",
    "language": "en",
    "shortDescription": "Higher education professionals, new PhD graduates, newly hired university educators and research scientists, and others interested in enhancing their teaching techniques in a university setting will acquire in this six-week course the foundational knowledge of the science of teaching and learning and develop skills and strategies for teaching at the university level. ",
    "aboutTheCourse": "<p><b>ENROLLMENT OPTIONS<br><\/b><br>Those interested in participating in this&nbsp;course have two options:<\/p>\n<ol>\n    <li><b>Free Enrollment:&nbsp;<\/b>&nbsp;Click “Sign Up” to enroll in course for FREE and earn a statement of accomplishment upon completion.<\/li>\n    <li><b>Signature Track Enrollment:&nbsp;<\/b>&nbsp;Click “Signature Track” and follow the enrollment steps.&nbsp; You will be required to pay a $49 non-refundable fee.&nbsp; Upon course completion you will receive a verified certificate, which employers\n        can search.&nbsp;<a href=\"http:\/\/help.coursera.org\/customer\/portal\/articles\/1167998-what-is-a-verified-certificate-how-can-i-use-it-\" target=\"_blank\">What’s this?<\/a>\n    <\/li>\n<\/ol>\n<p><b>ABOUT THE COURSE<\/b>&nbsp;<br><br>Not too long ago, it was believed that anyone who graduated from a doctoral program was capable of teaching. In recent years, however, it has become apparent that teaching is not an intuitive behavior. In addition to content, teaching also involves a complex intellectual process, and to develop the “art” of teaching, professors require guidance and support. As the roles and responsibilities of university-level educators have evolved and expanded in recent years, the preparation of emerging university&nbsp;faculty leaders must focus on the development of the knowledge, skills, and strategies for teaching and learning in higher education. This short course is designed to introduce the strategies and exemplars of university teaching skills necessary to meet these new professional demands for teaching at a university level. &nbsp;<\/p>",
    "targetAudience": 2,
    "courseSyllabus": "<strong>Week 1: The Science of Teaching and Learning<br><\/strong>Exploration of the science of teaching and learning, the role of neuroscience in teaching and learning, how to respond to learner differences, and technology and support for next generation learning.<br><ul><li>Teaching with the Science of Learning<\/li><li>Neuro-Education: The Role of Neuroscience in Teaching and Learning<\/li><li>Understanding Learners and Responding to their Differences<\/li><li>Technology and Support for Next Generation Learning<\/li><li>The Science of Learning at Work in Practice<\/li><\/ul><strong><\/strong><strong>Week 2: Principles of Best Practices in Education<\/strong><br>Examination of evidence-based teaching as well as strategies and approaches for integrating the principles of best practices. Discussion of the application of the principles of best practices and how they are used in action in the classroom.<br><ul><li>Evidence-Based Teaching<\/li><li>Strategies and Approaches to Integrate the Principles of Best Practice<\/li><li>Application of Principles of Best Practice in Developing Your Course<\/li><li>Principles of Best Practice in Action<\/li><\/ul><strong>Week 3: Knowing Your Audience<\/strong><br>Overview of how to \"know your audience,\" including examination of needs assessment, motivation of learners, learners' readiness to learn, and learning styles.<br><ul><li>Learning Needs Assessment<\/li><li>Motivation of Learners<\/li><li>Readiness to Learn<\/li><li>Learning Styles<\/li><\/ul><strong>Week 4: Developing an Effective Instructional Plan<\/strong><br>Exploration of how to develop an effective instructional plan, including examination of how to write and craft goals, objectives, and course descriptions, as well as a learner-centered syllabus.<br><ul><li>Needs Assessment and Goals and Objectives<\/li><li>Course Description and Objectives<\/li><li>Defining Your Teaching Methods and Content to be Learned<\/li><li>constructing Your Learner-Centered Course Syllabus<\/li><\/ul><strong>Week 5: Planning and Facilitating for Effective Small Group Learning<\/strong><br>Examination of rationale and benefits of small group learning as well as how to plan for effective small group learning. Exploration of how to facilitate small group learning and review of common challenges that occur when facilitating small groups.<br><ul><li>Small Group Learning<\/li><li>Planning for Effective Small Group Learning<\/li><li>Facilitation Strategies for Effective Small Group Learning<\/li><li>Small Group Learning: Common Challenges in Facilitating Small Groups and Strategies to Address Them<\/li><\/ul><strong>Week 6: Online Teaching and Learning<\/strong><br>Overview of online teaching and learning, including the design of online courses and multimedia in online courses, course development using the ADDIE model, online course quality and why it matters, as well as accessibility considerations.<br><ul><li><strong><\/strong>The Power of Online Learning<\/li><li>Online Course Design - Structure and Content<br><\/li><li>Online Course Design - Communication &amp; Engagement<br><\/li><li>Online Course Design - Assessment &amp; Evaluation<br><\/li><li>Multimedia in Online Courses<\/li><li>The ADDIE Model<br><\/li><li>Why Quality Matters Online<br><\/li><li>Accessibility in Online Learning<\/li><\/ul><strong><\/strong>",
    "estimatedClassWorkload": "2-4 hours\/week",
    "recommendedBackground": "",
    "links": {}
}