{"id":1256,"shortName":"frenchrev","name":"The French Revolution","language":"en","shortDescription":"The French Revolution was one of the most important upheavals in world history. This course examines its origins, course and outcomes.\n\n","aboutTheCourse":"The French Revolution is one of the great turning-points in history.<br><br>In 1789 huge numbers of French peasants, urban workers and middle-class people successfully rebelled against absolute monarchy and the privileges of the nobility. But the struggle over what social and political system should replace the 'Old Regime' was to divide French people and finally the whole of Europe. This subject examines the history of the French Revolution from its origins to 1799.<br><br>The French Revolution continues to fascinate us, to inspire us, at times to horrify us. Never before had the people of a large and populous country sought to remake their society on the basis of the principles of liberty and equality. The drama, success and tragedy of their project has attracted students to it for more than two centuries. Its importance and fascination for us are undiminished as we try to understand revolutions in our own times.","targetAudience":0,"courseSyllabus":"The subject will cover the following major topics:<br><ul><li>The old regime in France: society, economy, politics.<\/li><li>The Revolution of 1789: causes and narrative.<\/li><li>The Revolutionary remaking of France, 1789-92: Church and State.<\/li><li>The Revolution in crisis, 1792-93: republic and military invasion.<\/li><li>Ending the Terror of 1793-94 and ending the Revolution.<\/li><li>Change and continuity: How revolutionary was the revolution?<\/li><\/ul>","courseFormat":"This course will run for eight weeks, including two weeks of assessment at the end. There will be six short video lectures each week as well as quiz questions, discussion groups and short assignments.","suggestedReadings":"The course readings and maps provided to you on a weekly basis as you complete <strong>The French Revolution<\/strong> MOOC are also available as an eBook. While all these materials will progressively be made available to your during the course, you may like to obtain them prior to the course as an eBook to preliminary reading. It may also be a useful resource for you to keep after you have completed the course. <br>If you would like your own copy of The French Revolution eBook by Peter McPhee, please visit the Melbourne University Press website <strong><a href=\"https:\/\/www.mup.com.au\/items\/9780522869149\" target=\"_blank\" title=\"null\">here<\/a><\/strong><strong>&nbsp;<\/strong>This eBook will work on your eReader (Kindle, iPad, Kobe, etc.) and is available to order and download for $9.99.<br>&nbsp;<br>Students who have access to library resources and wish to do further reading, may find it useful to consult one or more of these general texts<br><ul><li>David Andress,&nbsp;<i>The French Revolution and the People<\/i><\/li><li>Peter McPhee,&nbsp;<i>The French Revolution 1789-1799<\/i><\/li><li>William Doyle,&nbsp;<i>The Oxford History of the French Revolution<\/i><\/li><li>Simon Schama, <i>Citizens: A Chronicle of the French Revolution<\/i><\/li><li>Donald Sutherlan<i>d, The French Revolution and Empire<\/i><\/li><\/ul>","estimatedClassWorkload":"6-7 hours\/week","recommendedBackground":"No background required; all are welcome","links":{}}