{"id":869,"shortName":"ushealthcare","name":"Understanding and Improving the US Healthcare System","language":"en","shortDescription":"In this course, you will learn about the structure, accomplishments, and shortcomings of the US healthcare system, and how those have prompted attempts at health policy and reform.  You will also take part in a unique, national group exercise, designed to help you understand questions about the 2010 Affordable Care Act and how you can improve the US healthcare system.","aboutTheCourse":"<p>Health is important to everyone.&nbsp; For most people, that means that\nunderstanding the healthcare system is important.&nbsp; As a patient or a caregiver for a loved one,\nyour understanding of the system can mean everything from getting the right\nhelp, to economic stress in paying medical bills, to medical misadventures and\neven worse.&nbsp; And if you’re a healthcare\nprofessional (or are in training or want to be a healthcare professional someday),\nunderstanding the system is a critical – but often under-developed – part of\noptimizing the help you can provide your community.<\/p>\n\n<p>&nbsp;<\/p>\n\n<p>Despite this importance, confident understanding of the US\nhealthcare system is alarmingly rare.&nbsp;\nThis course is designed to change that – by helping students understand\nthe core structure and accomplishments of the system, the recurring\nshortcomings, and attempted remedies through policy reform.&nbsp; Rather than emphasizing complexity (a focus\nof many other courses about healthcare policy), the lessons in this course will\nhighlight central themes that learners can take away from the course and apply\nto their own experiences – and other coursework – with confidence.&nbsp; Moreover, students who seek more advanced\ncontent will have ample opportunity to tailor their learning accordingly.<\/p>\n\n<p>&nbsp;<\/p>\n\n<p>In addition, through a unique, coursewide group exercise\nthat will serve as a keystone of this course, all learners will have the\nopportunity to learn how they can improve the US healthcare system.&nbsp; Whether as individuals, in groups, or as future\narchitects of system reform, students in this course will enjoy a premier\nopportunity to understand the US healthcare system – and their options for addressing\nproblems in the system – as they never have before. &nbsp;<\/p><p><br><\/p><p>This course was co-developed by the course director, Matthew Davis, MD, MAPP, and course producer, Michael Rubyan, MPH. &nbsp;Davis is a senior faculty member and longtime teacher regarding health policy at the University of Michigan Medical School, School of Public Policy, and School of Public Health. &nbsp;Rubyan is a doctoral student at the University of Michigan School of Public Health.<\/p>","targetAudience":1,"courseSyllabus":"<a href=\"https:\/\/docs.google.com\/document\/d\/1jAzgODVpuAu3A4D7l3aMevpue0SUeH9i5zhERvnWwrI\/pub\" target=\"_blank\">Syllabus<\/a>","courseFormat":"<p>In general, each week will consist of approximately 60\nminutes of didactic material, delivered in 8- to 15-minute video segments\ncomprised of lecture, thought exercises, and rare archival footage.&nbsp; Students will be expected to view the video\nmaterials, which will include segments that can be tailored to students’\nparticular interests (including advanced learners).&nbsp; Each week will also include some work outside of video viewing – to include homework assignments\nfocused on reflecting about and sharing thoughts on the US healthcare system, limited readings assigned by the instructor, and self-assessments.<\/p>\n\n<p>&nbsp;<\/p>\n\nThe\nexception to this time allotment will occur in Weeks 4 and 5, when students\nwill be randomly assigned to groups for purposes of the group exercise.&nbsp; In Weeks 4 and 5, the students will view instructions about the group exercise and then conduct the exercise by working on the assignment themselves and then sharing their work with others in their groups via the course discussion forums.","suggestedReadings":"A\nsmall number of primary source readings from the health policy literature will\nbe posted online for students to read to complement weekly video materials.","estimatedClassWorkload":"2-3 hours\/week","recommendedBackground":"<p>No prerequisites required. &nbsp;All are welcome, as this\ncourse will bring principles and challenges of the US healthcare system to\nlearners in an accessible way, and will encourage them to examine their own\nassumptions and experiences as they learn-through-innovation.&nbsp; The materials are designed to meet the needs\nand expectation of learners with a broad array of prior experiences in, and\nknowledge about, the healthcare system. &nbsp;<\/p>","links":{}}