{"id":1374,"shortName":"aoo","name":"面向对象技术高级课程（The Advanced Object-Oriented Technology）","language":"zh-cn","shortDescription":"通过大量、丰富、完整、不同领域、应用不同技术的案例，深入、完整地讲解当今主流的面向对象软件开发方法的分析、设计及实现方法。","aboutTheCourse":"<p>课程介绍视频可以访问<a href=\"http:\/\/video.study.163.com\/edu-video\/nos\/mp4\/2014\/01\/23\/332113_hd.mp4\" target=\"_blank\">这里<\/a>。<\/p>\n<ul>\n    <li>\n\n<p>【课程简介】第二次MOOC开课介绍<\/p>\n\n<p><i>如果将软件开发人员看作行走江湖的武侠，那么各种软件开发技术就是武侠赖以傍身的武术秘籍。有的秘籍以易学灵巧见长，练习者很快掌握，并有立竿见影的功效，但失之厚重持久；有的秘籍初学乍练顿显困难，虽冥思苦解仍不得要领，需坚持不断的内功修炼方成正果，却是成为武林大侠必备的至宝。本课程有些类似于后者。<\/i><\/p>\n\n<p>《面向对象技术高级课程》深入、系统、完整地讲解当今主流的面向对象软件开发方法的分析、设计、实现及重构方法，深入讲解UML语言的高级技术细节，以及近年来面向对象方法最新的发展趋势。课程集百家之所言，并结合主讲者最新的研究成果，并通过大量、丰富、完整、不同领域、应用不同技术的案例将其中的关键知识点串联起来，便于理解和应用。<\/p>\n\n<p>本课程并不拘限于某一特定的面向对象的编程语言的编程技巧，但却包含了基于当前主流的面向对象编程语言的多项完整案例。本课程引导选课同学从更为抽象和共性的模型角度描述现实世界和软件世界,即构建分析与设计模型，之后再将其落实到软件编程实现。这种工程化的理念对于开发大型、复杂、困难、攸关软件系统是非常必要的，也是作为高级程序员、系统分析师、软件架构师等高级软件技术职位所必需具有的素质。<\/p>\n\n<p>作为一门面向广大受众的中文MOOC课程，本次课程力求向不同需求和背景的朋友呈现中华文化氛围、生动有趣的案例、跨专业的广阔的视野、以及深入实用的技术综合。<\/p>\n\n<p>同时作为一门传授软件专门知识的MOOC课程，本次课程将为具有编程能力的同学带来有趣的软件开发项目作业，在实际的软件开发中感受学以致用的快乐，体会面向对象方法学的深刻内涵。<\/p>\n\n<p>本次课程仍将邀请面向对象领域著名学者北京大学信息科学技术学院邵维忠教授和麻志毅副教授讲解某些章节，并对面向对象方法学中的某些关键问题进行讨论。<\/p>\n\n<\/li>\n\n<\/ul>","targetAudience":1,"courseSyllabus":"<b>第1周： 绪论:软件开发方法的演化与最新趋势<\/b>\n<br>介绍贯穿于课程始终的基本概念：系统、模型、方法学、方法、语言等，回顾软件开发方法学的历史、现状，并展望未来\n<br><b>第2周： 面向对象技术概论\n<\/b><br>讲述面向对象方法学中的原则与发展历史以及问题\n<br><b>第3周：面向对象分析与设计引例（空战游戏）\n<\/b><br>以一个完整的案例示范完整的面向对象的需求分析、系统分析和系统设计的过程和模型。\n<br><b>第4周：面向对象的需求分析：Usecace图\n<\/b><br>介绍面向对象需求分析模型的语义与建立过程，示例，并讨论其中的深入话题\n<br><b>第5周：面向对象的系统分析：类图\n<\/b><br>介绍类图的语义与建立过程，示例，并讨论其中的深入话题\n<br><b>第6周：面向对象的系统分析：交互图<\/b>\n<br>介绍交互图的语义与建立过程，示例，并讨论其中的深入话题\n<br><b>第7周：面向对象的系统分析：状态图\n<\/b><br>介绍状态图的语义与建立过程，示例，并讨论其中的深入话题\n<br><b>第8周：面向对象的系统设计：概述与问题域部分的设计\n<\/b><br>介绍面向对象设计的范围界定、概要与组成部分，以及其中问题域部分的设计方法与策略\n<br><b>第9周：面向对象的系统设计：控制驱动部分的设计\n<\/b><br>介绍控制驱动部分的设计方法与策略与案例\n<br><b>第10周：面向对象的系统设计：人机交互部分与数据管理部分的设计\n<\/b><br>介绍人机交互部分与数据管理部分的设计方法与策略与案例\n<br><b>第11周：面向对象的系统设计：构件与部署的设计\n<\/b><br>介绍构件与部署分与数据管理部分的设计方法与策略与案例\n<br><b>第12周：面向对象分析与设计完整案例\n<\/b><br>介绍各种类型的面向对象分析与设计完整案例","courseFormat":"本课程有12周的课程组成，每周3~4小时，每周的课程包括若干个视频，每个视频的长度小于15分钟。每个视频包含1~2个集成测试问题。还有单独的作业和测试题，最后是期末测试。","suggestedReadings":"<div>邵维忠、杨芙清，面向对象的分析与设计，清华大学出版社，2013<\/div><div>麻志毅、邵维忠，面向对象方法基本教程， 高等教育出版社，2004<\/div><div>Martin Fowler著，徐家福译，UML精粹（第3版）清华大学出版社， 2005<\/div><div>Grady Booch等著，邵维忠等译， UML用户指南（第2版 ）人民邮电出版社， 2006<\/div><div>Joshua Kerievsky著， 杨光等译 重构与模式 人民邮电出版社， 2013.1<\/div><div>Martin Fowler著，陈师(注释)， Analysis Patterns: Reusable Object Models ，人民邮电出版社，2007<br> <\/div>","estimatedClassWorkload":"3-5 hours\/week","recommendedBackground":"<p>面向广大软件开发爱好者，并不局限专业与学历层次。最佳选课者为计算机科学和软件工程专业的大学生和硕士研究生。选课者最好具有一门面向对象的编程语言的基本知识和软件工程的基本知识。<\/p>","links":{}}