{"id":347,"shortName":"writing2","name":"Writing II: Rhetorical Composing","language":"en","shortDescription":"Rhetorical Composing engages you in a series of interactive reading, research, and composing activities along with assignments designed to help you become more effective consumers and producers of alphabetic, visual and multimodal texts.\n\nJoin us to become more effective writers... and better citizens.","aboutTheCourse":"<p>Rhetorical Composing is a course where writers exchange words, ideas,\n    talents, and support. You will be introduced to a variety of rhetorical\n    concepts—that is, ideas and techniques to inform and persuade audiences—that\n    will help you become a more effective consumer and producer of written,\n    visual, and multimodal texts. The class includes short videos, demonstrations,\n    and activities.<\/p>\n<p><\/p>We envision Rhetorical Composing as a learning community that includes\nboth those enrolled in this course and the instructors. We bring our expertise\nin writing, rhetoric and course design, and we have designed the assignments\nand course infrastructure to help you share your experiences as writers,\nstudents, and professionals with each other and with us. These collaborations\nare facilitated through WEx, The Writers Exchange, a place where you will\nexchange your work and feedback\n<br>","targetAudience":1,"courseSyllabus":"<b>Thinking Rhetorically:&nbsp;<\/b>Introducing Ourselves, Introducing\nRhetoric\n<br><b>Responding Rhetorically:&nbsp;<\/b>The Writers Exchange (WEx) and Peer\nReview\n<br><b>Arguing Rhetorically:&nbsp;<\/b>Analyzing as a Means of Framing Argument\n<br><b>Seeing Rhetorically:&nbsp;<\/b>Analyzing and Composing (with) Images\n<br><b>Researching Rhetorically:&nbsp;<\/b>Composing with Sources in Evidence-based\nTexts\n<br><b>Revising Rhetorically:&nbsp;<\/b>Reflecting on, Reviewing, and Publishing\nYour Work&nbsp;\n<br>","courseFormat":"<p>Rhetorical Composing emphasizes active participation in the composing,\n    editing, and assessment activities in WEx, The Writers’ Exchange. &nbsp;<\/p>\n<p>After online training, you’ll participate in a peer review process in\n    which you create substantive feedback about other’s writing using sets\n    of defined criteria.<\/p>\n<p>We have created and collected a range of rich resources to support this\n    class: short videos, demonstrations, readings, and activities.<\/p>You will\nhave many opportunities to interact with each other through discussion\nboards, WEx, and social networking technologies.\n<br>","suggestedReadings":"No advanced reading is required for Rhetorical Composing.","instructor":"Susan Delagrange, Cynthia Selfe, Kay Halasek, Ben McCorkle and Scott  Lloyd  DeWitt","estimatedClassWorkload":"6-10 hours\/week","recommendedBackground":"<p>Anyone who is interesting in improving their writing can take this course. If you have had some formal writing instruction in the past, you will likely find Rhetorical Composing accessible.<\/p>The course emphasizes developing your understanding of the\nways that digital media shape and are shaped by reading, writing, and research processes--but you don’t need extensive knowledge of digital composing practices or technologies to succeed in and enjoy the course.\n<br>\n<br>As a helpful resource for this class, the faculty recommend the textbook The Everyday Writer, which can be purchased <a href=\"http:\/\/www.amazon.com\/Everyday-Writer-Andrea-Lunsford\/dp\/1457600048\" target=\"_blank\" title=\"Link: http:\/\/www.amazon.com\/Everyday-Writer-Andrea-Lunsford\/dp\/1457600048\">here<\/a>.","links":{}}