{
    "id": 637,
    "shortName": "braintargeted",
    "name": "The Brain-Targeted Teaching® Model for 21st Century Schools",
    "language": "en",
    "shortDescription": "Improve the outcomes in your classroom through practical applications of neuro- and cognitive science research. ",
    "aboutTheCourse": "<p>New findings from the neuro- and cognitive sciences have the potential to inform classroom instruction and influence educational practices for children at all developmental levels. &nbsp;Translating this research to practice, however, is often challenging for educational practitioners. &nbsp;This course will offer practical application of research by linking it with the Brain-Targeted Teaching® Model (BTT)—a pedagogical framework for using research in the neuro- and cognitive sciences as well as research-based effective instruction to guide teachers in planning, implementing, and assessing a sound program of instruction for all learners.&nbsp;<\/p><p>Participants in\nthe course will examine research from the brain sciences that can inform\neducational practice and be able to implement research findings using the\ninstructional framework, The Brain-Targeted Teaching® Model. This model\npresents six stages, or “brain targets” of the teaching and learning process.\nThe components include (1) establishing the emotional climate for learning, (2)\ncreating the physical learning environment, (3) designing the learning\nexperience, (4) teaching for the mastery of content, skills, and concepts, (5)\nteaching for the extension and application of knowledge, and (6) evaluating\nlearning. A central theme of the model is the integration of the arts to foster\nretention of new information, conceptual development, and higher-order thinking\nand creative problem-solving.<\/p><p><u><b>Course\nobjectives:<\/b><\/u><\/p><p><\/p><ul><li>Describe themes in brain research that can inform\neducational practice consistent with the Brain-Targeted Teaching® Model.<\/li><li>Describe how emotional and physical learning\nenvironments affect learning.<\/li><li>Identify themes in brain research\nthat educators can apply as they design instruction; teach for mastery of\ncontent, skills, and processes; design activities to apply and extend\nknowledge; and evaluate learning.<\/li><\/ul><p><\/p>\n\n<p><\/p>",
    "courseSyllabus": "<b>Sessions 1 &amp; 2: &nbsp;Course o<\/b><b>verview; Introduction to the science of learning and the\nBrain-Targeted Teaching® Model; ABCs of brain anatomy; BTT Learning Unit<\/b><br><ul><li>The professional development content will begin with an overview of the\nmajor themes in the new study of the science of learning. A variety of\n“neuro-myths” will be described (e.g. brain development is complete by age 3).\nThe Brain-Targeted Teaching® Model will be introduced, and the six brain\ntargets will be briefly described.<\/li><li>Basic information about brain anatomy and cognitive functions will be\npresented as foundational knowledge.&nbsp;<br><\/li><\/ul><p><\/p><b>Sessions 3 &amp; 4:&nbsp;\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe Emotional Climate for Learning<\/b><br><ul><li>This session will focus on strategies to create a positive emotional\nclimate in classrooms–an environment in which students feel connected to school\nand motivated to learn. Through presentations, video, and simulation\nactivities, participants will learn techniques as well as underlying research\nthat support promoting an emotional connection to content to increase\nmotivation for learning. Examples include classroom routines and rituals,\nspecific praise techniques, ways to disengage and redirect aberrant behaviors,\nand strategies that engage students emotionally in content.<br><\/li><\/ul><p><\/p><p><b>Sessions 5 &amp; 6:&nbsp;The Physical Learning Environment; The Learning Unit Design<\/b><\/p><ul><li>Content will include how environmental factors influence attention learning\nconsistent with the tenets of BT-2. Participants will brainstorm ways to use\nnovelty and environmental factors such as lighting, sound, scent, and movement\nto promote student attending behaviors.<\/li><li>Participants will identify ways they can change classrooms to align with\ncreating a stimulating environment that supports students’ attending behaviors\nand engagement in learning.<\/li><li>Participants will review underlying research associated with the\ncognitive processes of patterning and “big picture thinking” and will be able\nto articulate how concept mapping improves understanding and retention of\ncontent (BT-3).<\/li><li>Participants will design concept maps and graphic organizers to be used\nas the foundation for planning learning units to promote global understanding\nof key lesson topics and objectives. They will use Common Core State Standards\nto design learning units that include all components of BTT, including\nactivities to reinforce content through arts and technology integration.&nbsp;<\/li><\/ul><b>Session 7 &amp; 8:&nbsp;The Learning Unit Design; Teaching for Mastery of Content, Skills, and\nConcepts<\/b><br><ul><li>Participants will engage in an in-depth examination of the research and\nbest practices associated with BT-4-- Teaching for Mastery. A wide array of\nresearch findings related to memory will be presented, and practical implications\nfor the classroom will be described. The important role of arts integration in\nreinforcing memory for content will be outlined, as will the possibility of\n“transfer” from arts to non-arts domains. Technology innovations will also be\ndiscussed as a way to reinforce classroom objectives.<\/li><li>Participants will complete the BTT planning guide to describe and\nimplement BT-4 activities. Participants will reflect on how the activities\nenhanced instructional practice.<\/li><\/ul><b>Sessions 9 &amp; 10:&nbsp;Teaching for Mastery of Content, Skills, and Concepts; Teaching for the\nApplication of Knowledge in Creative Problem-Solving Activities<\/b><br><ul><li>Participants will be presented with research and best practices\nassociated with BT-5--Teaching for the Application of Knowledge. The\npresentation will include research on executive function and the cognitive\nprocesses of creative and divergent thinking. Through simulated activities,\nparticipants will explore ways that creativity is important for the kind of\nreal-world problem solving that is important for preparing students to be\ncollege and career ready.<\/li><li>Participants will be able to design and use instructional strategies\nthat promote rigor and deep understand of content through the application and\nextension of knowledge in real-world learning activities. They will extend\nstudents’ mastery of content by designing activities delivered in the BTT\nlearning unit that require higher-order thinking, divergent thinking skills,\nand problem-solving in authentic learning tasks.<\/li><\/ul><b>Sessions 11 &amp; 12:&nbsp;Teaching for the Application of Knowledge in Creative Problem-Solving\nActivities; Evaluation Learning<\/b><br><ul><li>Participants will be able to use effective and appropriate techniques\nfor evaluating students’ learning throughout each BTT learning unit. Evaluation\nis considered not only as a means of measuring student progress, but also as a\ntool for increasing learning.<\/li><li>Research will describe how feedback, active retrieval of information,\nand spacing of learning events influence both learning and retention of\ninformation. Through demonstrations and simulated activities, participants will\nexplore the use of multiple probes to evaluate learning including performance\nassessment, student portfolios and reflective journals. They will be able to\nuse assessment data to modify learning activities.&nbsp;<\/li><\/ul><b>Sessions 13 &amp; 14:&nbsp;Evaluating Learning; The BTT Learning Unit<\/b><br><ul><li>Demonstration of BTT Learning Units: During this session, expert\nteachers who have designed learning units will demonstrate their field-tested\nBTT learning units. These expert teachers will present the process of learning\nunit design and assist participants in designing their own units. Techniques\nfor arts integration will be demonstrated. &nbsp; &nbsp;<\/li><\/ul><b>Session 15: Presentation of Learning Units<\/b><br>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><\/p><ul><li>Individuals and\/or collaborative teams will have developed and\nfield-tested BTT learning units, including instructional activities and\nevaluations.<\/li><li>Each participant will be expected to turn in a learning unit and a\nPowerPoint presentation describing the unit, the implementation process, and\nstudent outcomes.<\/li><li>Participants will have the option of providing feedback to other participants.\nParticipants have the option of publishing their units on the BTT website.<br><\/li><\/ul><p><\/p>",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": "Course content is\nrelevant to educators at any level, PK through higher education.",
    "links": {}
}