{
    "id": 1157,
    "shortName": "philsci",
    "name": "Philosophy and the Sciences",
    "language": "en",
    "shortDescription": "Learn about the historical and philosophical foundations of contemporary science. \nExplore cutting-edge debates in the philosophy of the physical sciences and philosophy of the cognitive sciences.",
    "aboutTheCourse": "<p>\n    <span>What is the <i>origin<\/i> of our universe? What are <i>dark matt<\/i>er and <i>dark energy<\/i>? What is our role in the universe as human agents capable of knowledge? What makes us intelligent <i>cognitive agents<\/i> seemingly endowed with <i>consciousness<\/i>? <br><\/span>\n<\/p>\n<p>Scientific research across both the physical sciences and the cognitive sciences has raised pressing questions for philosophers. The goal of this course is to introduce you to some of the main areas and topics at the key juncture between philosophy and\n    the sciences. The course is structured around two broad areas:&nbsp;<\/p>\n<p>\n\n<\/p>\n<ol>\n    <li>Philosophy and the Physical Sciences<\/li>\n    <li>Philosophy and the Cognitive Sciences\n        <br>\n        <br>\n    <\/li>\n<\/ol>\n<p>Each week we will introduce you to some of these important questions at the forefront of scientific research. We will explain the science behind each topic in a simple, non-technical way, while also addressing the philosophical and conceptual questions\n    arising from it. Areas you’ll learn about will include:\n<\/p>\n<ul>\n    <li>\n        <b>Philosophy of cosmology<\/b>, where we’ll consider questions about the origin and evolution of our universe, the nature of dark energy and dark matter and the role of anthropic reasoning in the explanation of our universe.<\/li>\n<\/ul>\n<ul>\n    <li><b>Philosophy of psychology<\/b>, among whose issues we will cover the evolution of the human mind and the nature of consciousness.<\/li>\n<\/ul>\n<ul>\n    <li><b>Philosophy of neurosciences<\/b>, where we’ll consider the nature of human cognition and the relation between mind, machines, and the environment.\n        <br>\n        <br>  \n    <\/li>\n<\/ul>\n  \n<b>Learning Objectives<\/b>\n<p>\n    Gain a fairly well-rounded view on selected areas and topics at the intersection of philosophy and the sciences\n<\/p>\n<p>\n    Understand some key questions, and conceptual problems arising in the natural sciences and cognitive sciences.\n<\/p>\n<p>\n    Develop critical skills to evaluate and assess these problems.\n<\/p>    \n<br>\n<div><p>The development of this MOOC has been led by the University of Edinburgh's <a href=\"http:\/\/eidyn.ppls.ed.ac.uk\/\" target=\"blank\"><b>Eidyn<\/b><\/a> research centre.<\/p><p><a href=\"http:\/\/eidyn.ppls.ed.ac.uk\/\" target=\"blank\">\n<img src=\"https:\/\/d396qusza40orc.cloudfront.net\/philsci\/EIDYN%20logo.png\" style=\"width:20%\" alt=\"EIDYN logo\"><\/a>\n<\/p><\/div><br>",
    "targetAudience": 0,
    "courseSyllabus": "<p><b>Week 1.&nbsp;<\/b><b>Introduction to the course<\/b>\n    <br>\n<\/p>\n<p>(Michela Massimi and Duncan Pritchard)<\/p><p>In this Introductory session, we introduce you to the broad field of 'philosophy of science' and clarify some of the central questions that philosophers ask about science. In particular, we briefly review the nature of scientific knowledge and debates about the scientific method, from induction to Karl Popper's falsification. We also discuss the problem of underdetermination, and Thomas Kuhn's view of scientific knowledge—both central to our following lectures on philosophy of cosmology.<\/p>\n<p><b>PART I. PHILOSOPHY AND THE PHYSICAL SCIENCES<\/b>\n<\/p>\n\n<p><span>Week 2.<b> The origin of our universe <\/b><br><\/span>\n<\/p>\n<p>(Michela Massimi and John Peacock)<\/p>\n\n<p><span>How did our universe form and\nevolve? Was there <i>really<\/i> a Big Bang,\nand what came before it? In this class, we take you through the history of\ncontemporary cosmology and we look at how scientists arrived at the current\nunderstanding of our universe. We look at the history of astronomy, with the\nnebular hypothesis back in the eighteenth century, and in more recent times,\nEinstein’s general relativity and the ensuing cosmological models. Finally, we\nexplain the current Standard Model and early universe cosmology and the\nexperimental evidence behind it. &nbsp;<\/span>\n<\/p>\n\n<p><span>Week 3.<b> What are dark matter and dark energy? <\/b><br><\/span>\n<\/p>\n<p><span>(Michela Massimi and John\nPeacock) <br><\/span>\n<\/p>\n<p>According to the currently accepted model in cosmology, our universe is made up of 5% of ordinary matter, 25% cold dark matter, and 70% dark energy. But what kind of entities are dark matter and dark energy? In this class, we take you through a fascinating\n    journey at the frontiers of contemporary cosmology and particle physics. We also look at alternative theories that explain the same experimental evidence without recourse to the hypothesis of dark matter and dark energy and we discuss the rationale\n    for choosing between rival research programs.<b>&nbsp;<\/b>\n<\/p>\n\n<p><span>Week 4.<b> The Anthropic Reasoning in Philosophy and Cosmology <br><\/b><\/span>\n<\/p>\n<p><span><b><\/b>(Alasdair Richmond\nand John Peacock) <\/span>\n<\/p>\n\n<p>Anthropic reasoning attempts to understand peculiarities of the physical universe via context-sensitive observers in a multiverse of different distinct universes. Anthropic reasoning can explain the dimensionality of space (and time), the ratio of gravitational\n    and electromagnetic forces, the valency of carbon bonds, and the ages of the stars we observe in the night sky. Other anthropic explanations suggest that our universe ought to be a gigantic time machine and that we may live inside a ‘Matrix’-style\n    computer-simulated reality. In this class, we review the problems and prospects of anthropic reasoning by drawing on cutting-edge research in galaxy formation.<\/p>\n\n<p>\n    <br>\n<\/p>\n\n<p><b>PART II. PHILOSOPHY AND THE COGNITIVE SCIENCES<\/b>\n<\/p>\n<p><span>Week 5.<b> <\/b><\/span><b>Stone-age minds in modern skulls:\nevolutionary theory and the philosophy of mind <br><\/b>\n<\/p>\n<p><b><\/b>(Suilin Lavelle and Kenny Smith)\n<\/p>\n\n<p>This week, we will explore scientific interpretations of how our minds evolved, and some of the methodologies used in forming these interpretations. &nbsp;We will relate evolutionary debates to a core issue in the philosophy of mind, namely, whether all\n    knowledge comes from experience, or whether we have ‘inborn’ knowledge about certain aspects of our world.<\/p>\n<p><span>Week 6.<b> What is consciousness? <\/b><br><\/span>\n<\/p>\n<p>(Mark Sprevak and David Carmel)<\/p>\n\n<p><span>One of the hardest problems in\nscience is the nature of consciousness. We know that we have consciousness. We\ndo not just blindly process information, make discriminations, take actions. It\nalso <i>feels<\/i> a certain way to do so\nfrom the inside. Why do creatures with brains like ours have consciousness?\nWhat makes certain bits of our mental life conscious and others not? These\nquestions form the heart of <i>consciousness\nscience<\/i>, an exciting field to which psychologists, neuroscientists and\nphilosophers contribute. This session will explore these questions, and\nintroduce some recent progress that has been made towards answering them.<\/span>\n<\/p>\n<p><span>Week 7.<b> Intelligent machines and the human brain <\/b><br><\/span>\n<\/p>\n<p>(Mark Sprevak and Peggy Series)<\/p>\n\n<p><span>How does one make a clever\nadaptive machine that can recognise speech, control an aircraft, and detect\ncredit card fraud? Recent years have seen a revolution in the kinds of tasks\ncomputers can do. Underlying <a><\/a><a>these advances <\/a>is the burgeoning\nfield of <i>machine learning<\/i> and\ncomputational neuroscience. The same methods that allow us to make clever\nmachines also appear to hold the key to understanding ourselves: to explaining\nhow our brain and mind work. We explore this exciting new field and some of the\nphilosophical questions that it raises.<\/span>\n<\/p>\n<p><span>Week 8.<b> <\/b><\/span><b>Embodied\nCognition <br><\/b>\n<\/p>\n<p><b><\/b>(Andy Clark and Barbara Webb)<span> <br><\/span>\n<\/p>\n<p><span>Cognitive Science has recently\ntaken a strongly 'embodied turn', recognizing that biologically evolved\nintelligence makes the most of the opportunities provided by bodily form,\naction, and the material and social environment. This session explores the way\nthis impacts our vision of minds, brains, and intelligent agents, and asks\nwhether there can be&nbsp;a fundamental science of the embodied mind.<a><\/a><\/span>\n<\/p>\n\n\n\n\n\n<br>",
    "estimatedClassWorkload": "1-3 hours\/week",
    "recommendedBackground": "No background required.<br><br>",
    "links": {

    }
}