{
    "id": 1905,
    "shortName": "uvg",
    "name": "Understanding Video Games",
    "language": "en",
    "shortDescription": "An 11-lesson course teaching a comprehensive overview of analytical theory pertaining to video game media. Topics covered: play and game, emergence versus progression, game mechanics, story, interpretive theory, the culture of games, violence, sex and race in games, and finally, serious games. Estimated workload: 3-5 hrs\/wk for non-credit; 7-10 hrs\/wk for credit.",
    "aboutTheCourse": "<div>Video games are a globally entrenched entertainment medium that entertains, informs and challenges us. These games are defined by, and define our modern culture. In this course, students will learn how to study games and engage in informed discussions about them. Ultimately, this course is about understanding the literacy of video games.<br><br>Understanding Video Games was created with the help of world&nbsp;renowned video game developer,&nbsp;<a href=\"http:\/\/bioware.com\/en\" target=\"_blank\">BioWare<\/a><span><a href=\"http:\/\/bioware.com\/en\" target=\"_blank\">&nbsp;Corp<\/a>, located in <a href=\"http:\/\/edmonton.ca\" target=\"_blank\">Edmonton, Alberta<\/a>.<\/span><br><\/div><div><br><\/div><div>The three main parts of the course are: <br><br>1) developing the terminology that enables us to talk about video games; <br><br>2) exploring how these terms are used in theoretical frameworks to interpret games, and; <br><br>3) turning these theories toward cultural aspects of games in order to understand how the medium has impacted society. One of the most important insights students will gain from the course will be an understanding of the interplay between video game designers, players and the games themselves.<\/div><div><br><\/div><div>Course material is delivered in a student-friendly short-form fashion, with numerous formative feedback sections. Students will gain access to a number of special interactive modules designed specifically for this course. These modules will give users the opportunity to design their own video game avatar, as well as explore the short but fascinating history of video game releases. This course's unique lesson delivery, combined with classic quiz structure, will enable students to quickly gain a solid foundational understanding of video games within the context of modern culture.&nbsp;<\/div><div><br><\/div><div><a href=\"http:\/\/uofa.ualberta.ca\/courses\/understanding-video-games\/student-signup\" target=\"_blank\" title=\"Link: http:\/\/uofa.ualberta.ca\/courses\/understanding-video-games\/student-signup\">UAlberta students can earn course credit: Learn how<\/a>.<br><br>For information on how non-UAlberta students can earn course credit, please see the FAQs below on this page.<\/div><div><br><\/div><div>Understanding Video Games is part of an ongoing program of research into digital learning conducted by the University of Alberta and therefore anonymized data provided by Coursera and survey information can be made accessible to the researchers.<\/div>",
    "targetAudience": 1,
    "courseSyllabus": "<div><strong>Lesson 1: Introduction<\/strong><\/div><div>In this short lesson, students will learn what to expect from the course, and will be introduced to our avatar creation module.<\/div><div><br><\/div><div><strong>Lesson 2: Play and Games<\/strong><\/div><div>Here, students will gain an appreciation for the differences between play and games. Game taxonomy and a definition of rules will be covered.<\/div><div><br><\/div><div><strong>Lesson 3: Emergent and Progressive Gameplay<\/strong><\/div><div>This lesson focuses on the difference between two major gameplay types, and how they impact our experience of video games.<\/div><div><br><\/div><div><strong>Lesson 4: Game Mechanics<\/strong><\/div><div>Students are introduced to the concepts of ludology, structuralism and the mechanics-dynamics-aesthetics approach to game analysis<\/div><div><br><\/div><div><strong>Lesson 5: Story and Games<\/strong><\/div><div>We explore the concept of games as stories, as well as the importance of narrative in video game presentation. Campbell's monomyth theory is thoroughly explained and applied to game stories. &nbsp;<\/div><div><br><\/div><div><strong>Lesson 6: Interpreting Games<\/strong><\/div><div>How can structuralist and post-structuralist analysis lead us to a better understanding of \"how games mean?\" This lesson will introduce students to a number of theoretical frameworks for analyzing games.<\/div><div><br><\/div><div><strong>Lesson 7: Gaming Culture<\/strong><\/div><div>Here students will be introduced to the concept of semiotics and how language is used in inclusionary and exclusionary game community practices. Indie game producers and modding groups are also discussed during this lesson.<\/div><div><br><\/div><div><strong>Lesson 8: Violence and Games<\/strong><\/div><div>Discussions around violence and games seem to go hand-in-hand. Why is this? What purposes are served by violence and its portrayal in video games? These are some of the questions engaged by this lesson.<\/div><div><br><\/div><div><strong>Lesson 9: Sex and Games<\/strong><\/div><div>In this lesson, the subjects of sexuality, gender and the portrayal of sex are discussed. In addition, there is a module on women in the game industry.<\/div><div><br><\/div><div><strong>Lesson 10: Race and Games<\/strong><\/div><div>The subjects of race and racial stereotypes are explored in this lesson. The student will discover that race and racial conflict drive gameplay and narrative in numerous game genres, yet is a subject seldom broached in scholarly discussions.<\/div><div><br><\/div><div><strong>Lesson 11: Serious Games<\/strong><\/div><div>Games can be used for teaching and training, and this genre is called serious games. Here, students will learn about industry's co-opting of game theory and practice as they endeavour to engage their workforce. Methods of player retention are explored in this lesson.<\/div><div><br><\/div>",
    "estimatedClassWorkload": "3-5 hours\/week",
    "recommendedBackground": "No background is required; all are welcome.&nbsp;",
    "links": {}
}