{
    "id": 1218,
    "shortName": "gametheory2",
    "name": "Game Theory II: Advanced Applications",
    "language": "en",
    "shortDescription": "This advanced course considers how to design interactions between agents in order to achieve good social outcomes. Three main topics are covered:  social choice theory (i.e., collective decision making), mechanism design, and auctions.",
    "aboutTheCourse": "<div>\n\n<p><span>Popularized by movies such as\n\"A Beautiful Mind\", game theory is the mathematical modeling of\nstrategic interaction among rational (and irrational) agents.  Over four weeks of lectures, this <b>advanced<\/b> course considers how to design\ninteractions between agents in order to achieve good social outcomes. Three\nmain topics are covered:  social choice\ntheory (i.e., collective decision making), mechanism design, and auctions. <\/span><\/p>\n\n<\/div>\n\n<span>In the first week we consider the problem of\naggregating different agents' preferences, discussing voting rules and the\nchallenges faced in collective decision making. We present some of the most\nimportant theoretical results in the area: notably, Arrow's Theorem, which\nproves that there is no \"perfect\" voting system, and also the Gibbard-Satterthwaite\nand Muller-Satterthwaite Theorems.  We\nmove on to consider the problem of making collective decisions when agents are\nself interested and can strategically misreport their preferences. We explain\n\"mechanism design\" -- a broad framework for designing interactions\nbetween self-interested agents -- and give some key theoretical results. Our\nthird week focuses on the problem of designing mechanisms to maximize aggregate\nhappiness across agents, and presents the powerful family of\nVickrey-Clarke-Groves mechanisms.  The\ncourse wraps up with a fourth week that considers the problem of allocating\nscarce resources among self-interested agents, and that provides an\nintroduction to auction theory. <\/span>",
    "targetAudience": 1,
    "courseSyllabus": "<div>\n\n<p><span>There will be four weeks of materials consisting of online\nvideos and problem sets. We recommend that you complete the problem set for\neach week within that week, although the hard deadline is two weeks from the\nrelease date. On the fifth week, we will have a final exam.<b><\/b><\/span><\/p>\n\n<p><b>Week 1.<\/b> Social Choice<\/p>\n\n<p><b>Week 2.<\/b> Mechanism Design<\/p>\n\n<p><b>Week 3.<\/b> Efficient Mechanisms<\/p>\n\n<p><b>Week 4.<\/b> Auctions<\/p>\n\n<p><b>Week 5-6<\/b>. Final exam and final problem set.<\/p>\n\n<\/div>",
    "estimatedClassWorkload": "5-7 hours\/week",
    "recommendedBackground": "<p>You must be comfortable with mathematical thinking and rigorous arguments. Relatively little specific math is required; the course involves lightweight probability theory (for example, you should know what a conditional probability is) and very lightweight calculus (for instance, taking a derivative).<\/p>",
    "links": {

    }
}