{"id":1076,"shortName":"edref","name":"American Education Reform: History, Policy, Practice","language":"en","shortDescription":"Discover what shapes how we talk about schools today by exploring the history of U.S. education reform. Engage with the main actors, key decisions, and major turning points in this history. See how social forces drive reform. Learn about how the critical tensions embedded in U.S. education policy and practice apply to schools nationally, globally— and where you live.","aboutTheCourse":"<p>Since 1983 and the National Commission on Educational Excellence’s publication of <i>A Nation at Risk<\/i>, education reform has been a national preoccupation, marked by a succession of reform strategies and plethoric innovations. &nbsp;Catchphrases such as “reforming again and again,” “waves [or cycles] of reform,” and (more cynically) “spinning wheels” and “policy churn” capture the persistence and frenetic nature of contemporary education reform. &nbsp;<\/p>\n<p>This course provides a survey of the history of American education reform from the colonial period to the present. &nbsp;Through an examination of the forces that have shaped our national discourse about educational change, we seek to answer the following questions: What visions, rationales, and assumptions guided education reformers in the past? What social forces spurred particular reforms and counter-reforms? How did the American curriculum adapt to changing times and how are contemporary reforms fundamentally different or similar to earlier efforts to revitalize public schools? What conceptual lenses does this history provide for understanding schooling and school reform on a global level? <br><\/p>","targetAudience":1,"courseSyllabus":"<div><strong>Week 1: &nbsp;The Colonial Period and Early Republic<\/strong><\/div><div>Introduction to the MOOC, Education in a New World, Literacy in the Colonial Period, Institutions of Colonial Education, Schooling in the Early Republic, Early Republic Proponents of Common Schools, Benjamin Franklin’s Academy<\/div><div><br><\/div><div><strong>Week 2: &nbsp;The National Period<\/strong><\/div><div>The National Market Economy, the Second Great Awakening, Social Innovations of the National Period, the Common School Movement, Horace Mann: Avatar of Common Schools, Protestants and Catholics in the Arena, Education of African Americans and Native Americans, Secondary Schooling (the Academy)<\/div><div><br><\/div><div><strong>Week 3: &nbsp;The Postbellum Period<\/strong><\/div><div>Introduction, Expansion of the Common School, Education of African Americans in the Reconstruction South, Industrial Education in the South’s Organic Society, Jim Crow and the Radical Segregation of African Americans, Boarding Schools for Native Americans, Rise of the American High School<\/div><div><br><\/div><div><strong>Week 4: &nbsp;The Progressive Era&nbsp;<\/strong><\/div><div>Progressive Seedbeds of Education Reform, Rise of the Administrative Progressives in American School Reform, the Psychological Testing Movement, Social Efficiency Schooling, the Committee of Ten, Cardinal Principles of Secondary Education, the Southern Education Movement, Rosenwald Schools and County Training Schools<\/div><div><br><\/div><div><strong>Week 5: &nbsp;John Dewey and the Pedagogical Progressives<\/strong><\/div><div>The Laboratory School of the University of Chicago, Dewey’s Theory of Knowledge, Dewey’s Idea of the School as a Social Center, Dewey: Missing in Action, the Pedagogical Progressives, a Neo-Deweyan Critique of the Pedagogical Progressives<\/div><div><br><\/div><div><strong>Week 6: &nbsp;The Depression Era<\/strong><\/div><div>The Great Depression and a New Deal for America’s Youth, High Schools in Hard Times, Social Reconstruction and the Schools, Antecedents to Community Schools: Social Centers and Community Centers, Nambé Community School, Arthurdale Community School, Leonard Covello’s Community High School in East Harlem<\/div><div><br><\/div><div><strong>Week 7: &nbsp;Post-World War II<\/strong><\/div><div>The Cold War: McCarthyism and the Public Schools, Waging the Cold War in Schools: Federal Support for Academic Rigor, “Radical Romanticists” of the 1960s, Education and the Civil Rights Movement: From <i>Plessy<\/i> to <i>Brown<\/i>, the Last Hurrah of Jim Crow Schools, Busing Goes North: The Limits of Racial Integration, Community Control and Teacher Unions, Title IX and the “Hidden Injuries of Class”<\/div><div><br><\/div><div><strong>Week 8: &nbsp;Post-1983<\/strong><\/div>The Expanded Federal Role in Education: From the Elementary and Secondary Education Act (1965) to <i>A Nation at Risk<\/i> (1983), Ramping Up Reform: The Rise of Standards and Accountability, No Child Left Behind: Still Leaving Children Behind?, Charter Schools, School Choice Run Amok: Diverse Providers and Portfolio Management Models<ul><ul>\n          <\/ul>\n      <\/ul>","courseFormat":"The course features eight weekly modules, each consisting of six to ten video lectures, or “episodes.”  A short quiz drawn from the video lectures follows each module. Links to suggested readings are provided. <br><br><strong>Statement of Accomplishment:<\/strong> Students who desire a Statement of Accomplishment for this course must complete the eight weekly quizzes and two additional essay assignments with peer reviews.<br><br><strong>Verified Certificate:<\/strong>&nbsp;<span>This\ncourse also offers a <a href=\"https:\/\/www.coursera.org\/signature\/course\/edref\/971807\" target=\"_blank\">Verified Certificate<\/a>.&nbsp;You can start verifying your work for free and pay\nanytime before the final week of the course. <\/span><span><a href=\"https:\/\/www.coursera.org\/signature\/guidebook\/aid\" title=\"Link: https:\/\/www.coursera.org\/signature\/guidebook\/aid\">Coursera\nFinancial Aid<\/a><a href=\"https:\/\/www.coursera.org\/signature\/guidebook\/aid\"> <\/a><\/span>is also available for learners with limited\neconomic means.","suggestedReadings":"Though not required, we recommend David F. Labaree’s book <em>Someone Has to Fail: The Zero-Sum Game of Public Schooling<\/em> as a general resource and as background reading for the course. &nbsp;&nbsp;","estimatedClassWorkload":"6-8 hours\/week","recommendedBackground":"No background is necessary. &nbsp;All are welcome!","links":{}}