{
    "id": 205,
    "shortName": "scientificthinking",
    "name": "Science from Superheroes to Global Warming",
    "language": "en",
    "shortDescription": "Explore how science works and what constitutes \"good\" science through case studies drawn from a wide spectrum of people's experience, for example superheros, movies, and real world issues such as global warming. ",
    "aboutTheCourse": "Have you ever wondered if Superman could really fly? What was \nSpiderman's spidey sense? How did Wonder Woman's invisible jet work? \nWhat does it really mean for something to be a scientific \"fact\"? \nExplore how science works and what constitutes \"good\" science through \ncase studies drawn from a wide spectrum of people's experience, for \nexample superheros, movies, and real world issues such as global \nwarming. The case studies will provide the chance to act as science \ncritics as the students develop a better appreciation for science and \nthe scientific method.<br><br>This course won the 2011 \"Best OCW User Experience\" Award from Education Portal and was featured in the <a href=\"http:\/\/www.nytimes.com\/2010\/04\/18\/education\/edlife\/18superhero-t.html\">New York Times<\/a>. <br>",
    "targetAudience": 0,
    "courseSyllabus": "<i>Week One<\/i>:&nbsp; Science Literacy. Analyze an argument explaining a particular natural phenomenon and determine if it is based on modern science or Aristotelian views. Explain the limits of modern science techniques.<br><br><i>Week Two<\/i>: Numbers and Equations. Determine the accuracy and precision of a measurement. Analyze a numerically based argument in a news article. Interpret a graph.<br><br><i>Week Three<\/i>:&nbsp; Science Methodology. Execute a quantitative experiment. Propose an explanation of the results of the experiment. Propose further tests of the explanation.<br><br><i>Week Four<\/i>: Scientific Community. Determine if a particular method of analysis is scientific or not. Discuss the sociology of the practice of science. <br><br><i>Week Five<\/i>: Classical Mechanics. Describe the motion of an object in terms of its position, velocity, and acceleration.Analyze a physical situation to determine when there is a net force on \nan object from either a description of its motion or the interactions it\n has with other objects. Identify “correct” and “incorrect” physical motions and interactions in video clips.<br><br><i>Week Six<\/i>: Superhero Week! Design your own superhero,Justify the origin and powers of a self-designed superhero. Rate the origin and powers of the other superheroes.<br><br><i>Week Seven<\/i>: More Science. Explain the range of applicability of a scientific theory. Explain the difference between disproving a theory and expanding a theory.<br><br><i>Week Eight<\/i>: Science Fiction or Science Fact? Identify fundamental versus technological limits. Use your understanding of these limits to evaluate the likelihood of various technologies.<br><br><i>Week Nine<\/i>: Science and Society. Explain the arguments presented in the case studies in Chapter 6. Provide your own analysis of at least one of the case studies.<br><br><i>Week Ten<\/i>: Evaluate whether or not Intelligent Design is a scientific theory. Evaluate the issue of global warming using the criteria developed in this class.<br>",
    "estimatedClassWorkload": "6-9 hours\/week",
    "recommendedBackground": "There are no specific prerequisites for this course. However, it will rely heavily on your everyday experience with the physical world!<br>",
    "links": {

    }
}