{
    "id": 1378,
    "shortName": "usablesec",
    "name": "Usable Security",
    "language": "en",
    "shortDescription": "This course focuses on how to design and build secure systems with a human-centric focus. We will look at basic principles of human-computer interaction, and apply these insights to the design of secure systems with the goal of developing security measures that respect human performance and their goals within a system.",
    "aboutTheCourse": "<span><p>In many systems, human users are a critical part of the security process. They create passwords, follow security protocols, and share information that can maintain or destroy the security of a system. However, many secure systems are designed with little to no attention paid to people's cognitive abilities, workflow, or tasks. As a result, people find ways around the security obstacles that get in the way of their work.<br><\/p><p>This course focuses on how to design and build secure systems with a human-centric focus. We will look at basic principles of human-computer interaction, including the basics of humans' cognitive abilities, principles of usability, design techniques, and evaluation methods. We will then apply these insights to the design of secure systems with the goal of developing security measures that respect human performance and their goals within a system.<\/p><p>Through hands-on exercises designing, building, evaluating, and critiquing systems, students will learn how to integrate usability into secure software. The course will specifically focus on authentication mechanisms, browsing security, privacy and social media, and mobile security.<\/p><\/span>",
    "targetAudience": 0,
    "courseSyllabus": "<span><p>Syllabus<\/p><p><b>Introduction to HCI, usable security, and design<\/b><\/p><ul><li>Usability<br><\/li><li>Mental and psychological models<br><\/li><li>Design methodology<\/li><\/ul><\/span><b>Measuring and evaluating usability<\/b><span><br><ul><li>Usability studies<br><\/li><li>Iterative design<\/li><\/ul><\/span><b>Authentication<\/b><span><br><ul><li>Password systems<br><\/li><li>Two-factor authentication and other alternative schemes<br><\/li><li>Biometrics<\/li><\/ul><\/span><b>Web browsing and security<\/b><span><br><ul><li>Tracking<br><\/li><li>Anonymous browsing<br><\/li><li>Secure browsing<br><\/li><\/ul><\/span><b>Usability and Privacy<\/b><span><br><ul><li>Personal data sharing<br><\/li><li>Privacy policies \/ data sharing<br><\/li><li>Personal trait Inference<br><\/li><\/ul><\/span><br>",
    "estimatedClassWorkload": "3-5 hours\/week",
    "recommendedBackground": "<ul><li><p>Sophomore\/junior-level undergraduate students (and beyond)<\/p><p>No programming experience is required.<\/p><\/li><\/ul>",
    "links": {

    }
}