{
    "id": 3461,
    "shortName": "lawinaction",
    "name": "International Law in Action",
    "language": "en",
    "shortDescription": "This course is a guide to the international courts and tribunals in The Hague. The Hague is the international judicial capital of the world. It is home to more than half a dozen international courts and tribunals that contribute to international justice. This course maps the unique roles played by these institutions and explains how they promote peace and global justice. ",
    "aboutTheCourse": "International Law in Action explains the functions of each international court and tribunal present in The Hague, and it looks at how these institutions address contemporary problems. On the basis of selected cases, and through interviews with judges and lawyers, you will explore the role of these courts and tribunals and their potential to contribute to global justice.<p dir=\"ltr\">The first module of the course will investigate how judicial settlement is different from other more political forms of dispute settlement, such as negotiation and mediation. It offers a brief historical overview and introduces the judicial and arbitral bodies based in The Hague. In the remaining modules you will learn about the functions of these courts and tribunals, and some of the challenges and prospects that they face. Three cross-cutting themes tie together all of these modules: (i) The interaction between law and politics; (ii) The continuing role of State consent; and (iii) The ability of international courts and tribunals to protect the public interest and global values.<\/p><p dir=\"ltr\">This course offers you an opportunity to gain a better insight into the functions and features of the courts and tribunals present in The Hague. You will gain a familiarity with each court or tribunal. You will develop realistic expectations of their capacity to address contemporary problems and an awareness of their limitations. You will also be able to discuss some of their most prominent cases.<\/p><p>If you would like to have a better understanding of international law in action in The Hague, this is definitely the course for you!<br><\/p><p>Image Peace Palace&nbsp;©&nbsp;UN Photo\/ICJ\/Jeroen Bouman<\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<span><p dir=\"ltr\">Module 1: An introduction to the International Courts and Tribunals in The Hague<\/p><p dir=\"ltr\">Module 2: The International Court of Justice (ICJ)<\/p><p dir=\"ltr\">Module 3: The Arbitration of International Disputes<\/p><ul><li><p dir=\"ltr\">Discussing the Permanent Court\nof Arbitration (PCA), inter-state arbitration and investor-state arbitration<\/p><\/li><\/ul><p dir=\"ltr\">Module 4: International Criminal Courts and Tribunals<\/p><ul><li><p dir=\"ltr\">Discussing the International Criminal Tribunals for the former Yugoslavia and Rwanda (ICTY and ICTR), the Special Court for Sierra Leone (SCSL), the International Criminal Court (ICC), and the Special Tribunal for Lebanon (STL)<\/p><\/li><\/ul><\/span>",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": "<span><p dir=\"ltr\">No specific background is required for participation in this course.<\/p>Anyone who is interested in international law and who would like to learn more about international courts and tribunals based in The Hague is welcome to join us in our exploration of international law in action.<\/span>",
    "links": {

    }
}