{
    "id": 3299,
    "shortName": "responsiblemgmnt",
    "name": "Managing Responsibly: Practicing Sustainability, Responsibility and Ethics",
    "language": "en",
    "shortDescription": "Work on your competence to solve tasks and problems related to sustainability, responsibility and ethics. Translate this competence to management practices in your area of expertise and learn to navigate the complexities, struggles and paradoxes that can occur when changing practices at multiple levels from individuals to organizations and systems.\n",
    "aboutTheCourse": "<p>Managers are\nincreasingly confronted with issues of sustainability, responsibility, and\nethics. Managing responsibly is an integrative approach to\nsustainability, responsibility, and ethics, which allows you as a manager to\ndeal competently with such challenges. This course will facilitate your\nlearning process to engage in changing practices to make them more sustainable,\nresponsible, and ethically informed. <\/p>\n\nWe\nwill first introduce the context of the trend towards responsible management practices\n(week 1). We then explore the basics of each set of issues, sustainability\n(week 2), responsibility (week 3), and ethics (week 4). In week 5 you will work\non an own responsible management issue\/task and explore responsible management\npractices in an area of professional interest (e.g. strategy, entrepreneurship,\ninnovation, organization, operations, supply chain, human resources, marketing\nand communication, international management, accounting and finance). In week 6\nwe will try to understand and experience what managing responsibly means in\npractice, including opportunities and challenges, and with a focus on transformative\nchange. During these last two weeks you will work in a problem-oriented way,\nbased on a challenging topic you have come across in your own management\npractice.<br><br>In the course we will form multicultural teams to learn about problems you bring forward. The course also facilitates the formation of peer networks that allow you to continue this learning experience after finalizing the MOOC. The MOOC is an initiative in collaboration with the UN-supported Principles for Responsible Management Education (PRME) initiative.<br><br>",
    "targetAudience": 0,
    "courseSyllabus": "<p><b>1. Responsible management?<\/b><\/p><p>We will explore the context and\nimportance of managing responsibly and how it relates to sustainability,\nresponsibility, and ethics. Adopting a systemic perspective, we will also look\ninto what kinds of competences managers might need to develop responsible\nmanagement practices.<\/p><p><br><\/p>\n\n<p><b>2. Sustainability<\/b><\/p>\n\n<p>After an introduction of the roots\nof (un)sustainability, we will have a look at concepts of sustainability, such\nas social, environmental and economic dimensions, and the importance of time. We\nwill then focus on sustainability in a business context by looking at prominent\nmanagement tools, such as impact assessment, footprinting, and life-cycle\nmanagement.<\/p>\n\n<p>&nbsp;<\/p>\n\n<p><b>3. Responsibility<\/b><\/p>\n\n<p>We will\nexplore the roots of responsible business practices and different approaches to\nresponsibility in organizations, such as corporate social responsibility,\nsocial entrepreneurship, or corporate citizenship. We will then look at typical\nmanagement applications such as stakeholder management and corporate social\nperformance.<\/p>\n\n<p>&nbsp;<\/p>\n\n<p><b>4. Ethics<\/b><\/p>\n\n<p>We will\nlook at behavioural ethics and moral philosophy as main approaches to business\nethics. These will then be applied to address moral issues, and to develop practices\nfor acting ethically in challenging situations. We will also learn how to apply\ncommon ethics management instruments, such as ethics hotlines, codes of ethics,\nor ethics trainings.<\/p>\n\n<p>&nbsp;<\/p>\n\n<p><b>5.\nResponsible management issues\/tasks and management profession(s) <\/b><\/p>\n\n<p>In this week you will self-select\ngroups of people with similar responsible management issues and tasks to\ndiscuss coping approaches. You will also pick an area of professional interest\n(e.g. strategy, entrepreneurship, organization, operations, supply chain, human\nresources, marketing and communication, international management, accounting,\nfinance), to further explore and to innovate responsible management practices\nin the professional context.<\/p>\n\n<p><b>&nbsp;<\/b><\/p>\n\n<p><b>6. Innovating managerial practices\nat multiple levels<\/b><\/p>\n\n<p>This last week\nof the course will be dedicated to the preparation for real-life challenges of\nmanaging responsibly and responsible innovation. We will learn how to critically\nreflect upon and challenge the status quo; to attend to systemic complexity,\npower struggles, paradoxes and inertia; and to translate these considerations\ninto transformative action.<\/p><p><br><\/p>",
    "estimatedClassWorkload": "3-6 hours\/week",
    "recommendedBackground": "<p>While\nthis course is primarily designed for executives who want to work on particular\nresponsible management issues and create responsible management practices, also\nadvanced business students will find it helpful.<\/p><p><br><\/p>",
    "links": {

    }
}