{
    "id": 1738,
    "shortName": "hha",
    "name": "Foundations for Assisting in Home Care",
    "language": "en",
    "shortDescription": "This course is intended as a self-study course for those interested in exploring a career as a Home Health Aide or Personal Care Aide.",
    "aboutTheCourse": "This\ncourse is intended as a self-study course for those interested in exploring a\ncareer as a Home Health Aide or Personal Care Aide. This course consists of 12\nmodules which provide an overview of the responsibilities of the home health\ncare worker. It includes the concepts and skills involved in working with patients with mental illness, developmental, and\nphysical disabilities, throughout the lifespan from infancy to death.\nTopics covered include nutrition, food planning, budgeting, safety, infection\ncontrol, basic first aid skills, the use of proper body mechanics, and the\nprovision of personal care. The course includes reading materials, interactive games, quizzes, and\nvideos. This\ncourse will help introduce those interested in pursuing a career in the home\nhealth field to the basic knowledge and skill competencies required of a Home\nHealth Aide and Personal Care Aide.",
    "targetAudience": 3,
    "courseSyllabus": "<p><b>Module 1:<\/b> This\nmodule focuses on what home care is, the history of home care, and who is part\nof the home care team. You will be introduced to the variety of tasks a Home\nHealth Aide\/Personal Care Aide may perform and the important role they play on\nthe home care team.<\/p>\n\n<p><b>Module 2:<\/b> This\nmodule has three sections. The first section focuses on the physical and\npsychological needs of human beings, and the influence culture has on the\nbehavior, values, and health care practices of people. In the second section,\nyou will&nbsp; you will learn how to\neffectively communicate with and develop a positive working relationship with\npatients. You will also learn how to properly document care provisions. In the\nfinal section, you will learn&nbsp; the types\nof and signs of abuse and how to protect patient rights, such as the right to\nprivacy and confidentiality.<\/p>\n\n<p><b>Module 3: <\/b>This\nmodule addresses the special needs facing the elderly patient. You will learn\nhow societal attitudes about aging influences the well-being and care of\nelderly patients. You will also learn about the physical and psychological\nchanges that occur as people age and how to best meet the needs of the elderly\npatient.<\/p>\n\n<p><b>Module 4:<\/b> This\nmodule focuses on the unique needs of children who receive home care services.\nYou will learn about the physical and psychological changes that occur\nthroughout development from infancy to adolescence. You will also learn how to\nhelp children and teens cope with stress and to develop positive coping skills.<\/p>\n\n<p><b>Module 5: <\/b>This\nmodule examines what mental health and mental illness are. Specific mental\nhealth issues such as anxiety, depression, and schizophrenia are addressed,\nwith special focus on how to help the Home Health Aide\/Personal Care Aide\neffectively work with people who have a mental illness.<\/p>\n\n<p><b>Module 6: <\/b>This\nmodule discusses what a developmental disability is, what some of the causes\nare, and how functioning is affected in the person with a developmental\ndisability. Special attention is paid to learning about intellectual\ndisabilities, cerebral palsy, autism, and neurological impairments. You will\nlearn how to effectively work with patients who have a developmental disability\nto help them be as independent as possible.<\/p>\n\n<p><b>Module 7:<\/b> This\nmodule examines what a physical disability is, the various causes of physical\ndisabilities, and the difference between a physical and developmental\ndisability. You will learn about the special adaptations people with physical\ndisabilities may need to make and how the Home Health Aide\/Personal Care Aide\ncan best work with people with a physical disability.<\/p>\n\n<p><b>Module 8:<\/b> This\nmodule addresses the basics of nutrition. You will learn about the important\nrole the major nutrients such as carbohydrates, protein, and fats play in\npeople's physical well-being. You will learn how to plan nutritious meals using\nthe USDA's ChooseMyPlate guidelines. The various diets such as low salt, low\nfat, vegetarian, gluten-free, and mechanical diets for people with swallowing\ndifficulties will be covered. You will also learn food preparation techniques\nand about food safety.<\/p>\n\n<p><b>Module 9:<\/b> This\nmodule examines how the Home Health Aide\/Personal Care Aide can help patients\neffectively manage their money and develop a budget. You will learn how to help\na patient track expenses, and plan a budget based on their income and household\nexpenditures. You will also learn guidelines for helping patients cut grocery,\nhousehold, and energy costs.<\/p>\n\n<p><b>Module 10: <\/b>The\nfocus of this module is on the importance of and how to perform housekeeping as\na Home Health Aide\/Personal Care Aide. You will learn how to use proper body\nmechanics to prevent injury and how to develop task lists and to prioritize\ntasks. You will also learn about various cleaning products and how to perform\nspecific housekeeping tasks in each room of the home, including: the kitchen,\nbathroom, bedroom, living room, and how to launder clothing.<\/p>\n\n<p><b>Module 11:<\/b> This\nmodule examines the types of injuries that can happen in the home, including:\nfalls, burns, cuts, poisoning, choking, and fires. You will learn guidelines\nfor preventing these types of injuries as a Home Health Aide\/Personal Care Aide.\nYou will learn basic first aid information for handling these types of\ninjuries. Special attention will be paid to learning how to deal with serious\nmedical emergencies, such as heart attacks, seizures, and strokes.<\/p>\n\n<p><b>Module 12:<\/b> This\nmodule focuses on how to provide personal care for the home care patient. The\nimportance of infection control and the role of the Home Health Aide\/Personal\nCare Aide in preventing infection transmission is discussed. Tasks including\nbathing, teeth and mouth care, dressing and grooming, assisting with eating,\ntoileting, transferring from a bed to a wheelchair, and assisting patients with\nthe self-administration of medication are covered. You will also learn how to\ncare for an infant during handling, feeding, and bathing.<\/p>",
    "estimatedClassWorkload": "3-6 hours\/week",
    "recommendedBackground": "No background is required; all are welcome.",
    "links": {

    }
}