{"id":492,"shortName":"modelsystems","name":"Everything is the Same: Modeling Engineered Systems","language":"en","shortDescription":"This introduction to engineering course will help you learn modeling and analysis techniques for electrical, mechanical, and chemical systems and discover how engineered systems that seem very different are actually very similar.  ","aboutTheCourse":"Students\n in this class will learn modeling and analysis techniques applicable to\n electrical, mechanical, and chemical systems.  This “systems” view, \nthat focuses on what is common to these different physical systems, has \nbeen responsible for much of the progress in the last several decades in\n aeronautics, robotics, and other engineering disciplines where there \nare many different technologies working together.  <br><br>Starting\n with algebraic descriptions of individual components (such as \nresistors), the class develops tools for modeling engineered systems.  Differential \nequations are key ingredients, so we will spend significant time \nlearning how to derive differential equations from component descriptions. \n One of the key ideas in this class is that electrical, mechanical, and \nchemical systems may seem very different from each other but often have \nvery similar behavior, allowing us to draw powerful analogies between \nthem.  Case studies from several areas of engineering will be used to \nillustrate the modeling techniques, including examples from robotics, \npower networks, exoskeletons, biomechanics, system identification, and active sensing.  Students will be encouraged to do hands-on \nexperiments that demonstrate the techniques.  <br><br>","targetAudience":0,"courseSyllabus":"<b>Topics:<\/b><br>1. What does it mean to model a physical system?<br>2. Newton's laws<br>3. Mechanical components connected together<br>4. Chemical diffusion<br>5. Laws governing electrical behavior<br>6. Circuits and electrical components connected together<br>7. Analogies between physical systems<br>8. Diffusion is everywhere<br>","courseFormat":"The class will consist of 24 lecture videos, all of which are 4-8 minutes long.  Each week has three lectures, each paired with course notes and exercises to reinforce the class material.  Moreover, each week will have a homework set that will be graded as part of the course.  Lastly, weeks 3-8 will have demonstrations that apply the ideas in class to real-world engineering applications.   Half of these demonstrations can be built at home while the other half are based on current research in my laboratory.<br>","suggestedReadings":"The online class notes follow the lectures, but will include additional material to help clarify the lecture material.  These notes will be updated in response to questions students post during the class, so they will change as the class evolves.<br>","instructor":"Todd D. Murphey","estimatedClassWorkload":"5-7 hours\/week","recommendedBackground":"Familiarity with some high school calculus (e.g., derivatives and integrals) is required. <br>","links":{}}