{"id":1960,"shortName":"globaltheatre","name":"Theatre and Globalization","language":"en","shortDescription":"Learn how theatre and globalization have affected each other over the past century, and how to conduct your own research on global theatre histories. ","aboutTheCourse":"<p>In\nthis course we will discuss how theatre, a European cultural practice, spread\nrapidly around the world in the late 19th and early 20th centuries. The modules\nwill engage with both theoretical and historical perspectives on what is a\nrelatively new area of theatrical research. Globalisation is a highly controversial\nconcept that has provoked extreme reactions. It also tends to be discussed as a\nphenomenon post-dating the end of the Cold War in 1989. In this course we will\nargue that globalization, even as we understand it today, in fact goes back at\nleast to the mid- to late 19th century when the existence of colonial empires\ncreated the conditions for mass migration, the rapid transportation of goods and\npeople, the invention of new technologies such as steam shipping, railways and\ntelegraphy, which all helped to facilitate the spread of theatre. We will\nengage with research that has emerged in the context of global and\ntransnational history and apply these findings to theatre. We will look at how\ncertain plays, operas and ballets quite literally went global. We will look at\ntheatre buildings, at the cosmopolitan audiences that emerged as well as the\nactors, agents and managers who facilitated the movement of theatre around the\nworld. The final two modules will focus on the post-1945 and 1989 developments,\neach of which represent globalisation of different kinds.<\/p>","targetAudience":1,"courseSyllabus":"<strong>Week one<\/strong>: Introductions with definitions of&nbsp;&nbsp;'theatre' and 'globalization'; cenceptualizing 'global theatre histories'; overview of online resources for researching the history of theatre during the late 19th and 20th centuries.&nbsp;<br><br><strong>Week two<\/strong>:&nbsp;Theatre on the Move;&nbsp;how we can relate migration and mobility to the dissemination of theatre.<br><br><strong>Week three<\/strong>: &nbsp;Actors, Managers, and Theatrical Agents; with a&nbsp;focus on the people who organized the global\nmigration of theatre.&nbsp;<br><br><strong>Week four<\/strong>: Theatre Buildings as 'Cultural Hubs' and 'Contact Zones'; methodologies and concepts for approaching theatres as places where&nbsp;different people, languages, and cultures met and exchanged.&nbsp;<br><br><strong>Week five<\/strong>: Theatre and the Cold War; theatre as a site of the&nbsp;rivalry\n  between\n  East and West.&nbsp;<br><br><strong>Week six<\/strong>: Festivals, Megamusicals, and Livestreaming; how contemporary types of theatre reflect globalization and new technologies.&nbsp;<div><span><span><span>\n <\/span>\n<\/span><\/span>\n\n<\/div>","courseFormat":"<p>Each class will consist of the following elements:&nbsp;<\/p><p><b>Video\nlectures<\/b>: Most of the course\ncontent is delivered through video lectures. Each video runs 10-12 minutes<\/p>\n\n<p><b>Discussion\nforums<\/b>: This class thrives on\ndiscussion. Multiple discussion forums are designed to develop out of the\nlectures. You will have the ability to articulate your own views on\nglobalization as well as learn from your fellow students from around the world.<\/p>\n\n<p><b>Quizzes<\/b>: Many video lectures have short quizzes\nembedded that allow you to check your grasp of basic knowledge as the course\nproceeds.<\/p>\n\n<p><b>Peer\nAssessment Assignments:<\/b>&nbsp;There are peer assessment activities available for this course. &nbsp;By\nparticipating in these, and reading and responding to the work of others, you\ncan also help improve your own learning and understanding.<\/p>","suggestedReadings":"<p><span>Matthew Sparke, <i>Introducing Globalization: Ties, Tensions and\nUneven Integration<\/i>&nbsp;(Oxford: Wiley-Blackwell, 2013)<\/span><\/p>\n\n<p>Alex MacGillivray,&nbsp;<i>A Brief History of <\/i><i>Globalization<\/i>&nbsp; (London: Robinson, 2006)<\/p>\n\n<p>Dan Rebellato,&nbsp;<i>Theatre &amp; <\/i><i>Globalization<\/i>&nbsp;(Basingstoke: Palgrave Macmillan, 2009)<\/p><div><br><\/div>","estimatedClassWorkload":"2-4 hours\/week","recommendedBackground":"<p>There are no prerequisites for this course. That said, an\ninterest in common media depictions of globalization will help you understand\nthe main arguments more quickly.&nbsp;Relatedly, reading and writing\ncomfortably in English at the undergraduate college level will enable your more\nactive engagement in course discussion forums and peer assessment exercises.&nbsp;A\nbasic understanding of theatre history, especially in the 20th century, would\nbe advantageous.<\/p>","links":{}}