{"id":91,"shortName":"analyticalchem","name":"Analytical Chemistry \/ Instrumental Analysis","language":"en","previewLink":"https:\/\/class.coursera.org\/analyticalchem-001\/lecture\/preview","shortDescription":"If chemistry is the science of stuff, then analytical chemistry answers the question: what is it? And how much of it do you have? This course teaches how to do this with instrumental analysis! ","aboutTheCourse":"This course covers about a half a semester of instrumental analysis which is a standard part of the undergraduate chemistry curriculum. Any chemist has to understand how to analyze samples - whether they are water samples, blood samples or bits of a painting. Most often chemists do this using instruments of some sort. Machines like mass spectrometers or gas chromatographs can indicate both what's in a sample (qualitative) as well as how much of something there is(quantitative). If you are fascinated by shows like CSI, and have enough basic chemistry, this course would be great for you. However, the course is first and foremost designed for chemistry students working towards their degree.<br><div>Students who complete this class will understand that analytical instruments are not black boxes, but rather complex tools whose utility depends in detail on how analysts both configure and apply them. Towards that end there are three pimary objectives. First, students will learn facts about major classes of instruments commonly used in chemical analysis. Their knowledge will be captured by the ability to block diagram these complex pieces of equipment, and tailor the specifications to the measurement needs. Second, the course will cover the basics of instrumental calibration and quality control. Analysts will develop the ability to apply calibration curves, internal standards and the method of standard addition as needed for various measurement problems. Finally, students must learn how to select and tailor the best instrumental method given a particular measurement need. This higher level skill involves critical evaluation of the strengths and limitations of the various method, and the ability to understand the context behind a measurement need.<\/div>","targetAudience":1,"courseSyllabus":"Description: This course will provide students with a background in modern analytical chemistry with an emphasis on instrumentation. Applications of instrumental analytical chemistry in medicine, forensics and materials science will be presented. Course objectives:<ul><li>To reinforce chemical principles central to analytical chemistry.<\/li><li>To introduce instrumental techniques for chemical measurement.<\/li><li>To develop critical thinking for interpreting analytical data.<\/li><li>To select instrumentation appropriate to the measurement need.<\/li><\/ul>Week 1: Overview of instrumental analysis and basic chemistry review Week 2: Atomic spectroscopies and the analysis of metals Week 3: Calibration, QA\/QC, and improving instrumental analysis Week 4: The basic principles of chromatography Week 5: Gas chromatography Week 6: Liquid chromatography Week 7: Vibrational spectroscopies Week 8: Electronic and optical sensors","courseFormat":"This class will consist of lecture videos, between 8 and 12 minutes in length. Most will include 1-2 integrated quiz questions per video; in addition, optional standalone quizzes will be provided to reinforce video lecture material and any additional reading. Not optional weekly problem sets will be the primary way to assess learning in the class. To develop critical thinking skills, three case studies will be provided throughout the class and the results will be assessed by course peers. A non-optional final problem set will evalaute integrated knowledge and retention of material. Every week there will be 6 to 8 short, usually less than 15 minutes, video lectures sometimes including interactive quizzes.&nbsp; In addition every week there will be a problem set, and 1 to 3 quizzes which cover the material in the lectures.&nbsp; Reading material will be provided each week from the web and to support the development of case studies.&nbsp;","suggestedReadings":"This course is loosely based on Skoog, West, Holler and Crouch, <a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=analyticalchem&isbn_ean=9780030355233\">Fundamentals of Analytical Chemistry<\/a>\n<img width=\"1\" src=\"http:\/\/www.assoc-amazon.com\/e\/ir?t=coursera-20&amp;l=as2&amp;o=1&amp;a=0030355230\" height=\"1\" style=\"margin: 0px !important; border: currentColor !important;\">, 8th edition.&nbsp;","instructor":"Vicki Colvin","estimatedClassWorkload":"6-8 hours\/week","recommendedBackground":"You should be familiar with freshman chemistry including balancing chemical\nequations, chemical equilibria, acid and base chemistry, stoichiometric\ncalculations, reduction and oxidation chemistry and interaction of light\nwith matter.","links":{}}