{"id":24,"shortName":"comparch","name":"Computer Architecture","language":"en","shortDescription":"In this course, you will learn to design the computer architecture of complex modern microprocessors.","aboutTheCourse":"This course forms a strong foundation in the understanding and design of modern computing systems. Building on a computer organization base, this course explores techniques that go into designing a modern microprocessor. Fundamental understanding of computer architecture is key not only for students interested in hardware and processor design, but is a foundation for students interested in compilers, operating systems, and high performance programming. This course will explore how the computer architect can utilize the increasing number of transistors available to improve the performance of a processor. Focus will be given to architectures that can exploit different forms of parallelism, whether they be implicit or explicit. This course covers architectural techniques such as multi-issue superscalar processors, out-of-order processors, Very Long Instruction Word (VLIW) processors, advanced caching, and multiprocessor systems.","targetAudience":1,"courseSyllabus":"","courseFormat":"The course will be made up of lectures (about 80 minutes each), two exams, and in-lecture assessments","suggestedReadings":"<p><b>Highly Recommended:<\/b> <\/p>\n<p><a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=comparch&isbn_ean=9780123838728\" title=\"Link: http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=comparch&isbn_ean=9780123838728\">Computer Architecture, Fifth Edition: A Quantitative Approach (The Morgan Kaufmann Series in Computer Architecture and Design)<\/a> (5th Edition), 2011. <\/p>\n<p>John L. Hennessy and David A. Patterson <\/p>\n<p>The 5th edition is new and very different than previous editions. USE THE 5TH EDITION. Approximately $45 on Amazon <br>ISBN: 978-0123838728 <\/p>\n<p><i>The 5th edition is also available from the publisher in both <\/i><a href=\"http:\/\/store.elsevier.com\/specialOffer.jsp?offerId=EST_COMP&utm_source=EMAP&utm_medium=text_link&utm_content=computer_architecture&utm_campaign=Coursera#oid=1005_5\"><i>text and e-book<\/i><\/a><i> formats for a discount of up to 40%. Chapters may be purchased individually from the <\/i><a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=comparch&isbn_ean=9780123838728\/\"><i>e-book site<\/i><\/a><i>.<\/i><br><\/p>\n<p><b>Optional Additional Text:<\/b> <br>\n<a href=\"http:\/\/www.amazon.com\/gp\/product\/1478607831\/ref=as_li_tf_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0070570647&linkCode=as2&tag=coursera-20\" title=\"Link: http:\/\/www.amazon.com\/gp\/product\/1478607831\/ref=as_li_tf_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0070570647&linkCode=as2&tag=coursera-20\">Modern Processor Design: Fundamentals of Superscalar Processors (Waveland Press)<\/a> (1st Edition), 2005, reissued 2013. <br>\nJohn P. Shen and Mikko H. Lipasti <br>\nApproximately $75 on Amazon <br>\nISBN: 1478607831<\/p>\n<p>Available in e-book via <a href=\"https:\/\/play.google.com\/store\/books\/details?id=ffQqAAAAQBAJ\">Google Play<\/a> and <a href=\"https:\/\/www.kno.com\/book\/details\/productId\/txt9781478610773\">Kno<\/a>.<\/p>","instructor":"David Wentzlaff","estimatedClassWorkload":"5-8 hours\/week","recommendedBackground":"This course is targeted at senior-level undergraduates and first-year graduate students. Students should have a good working understanding of digital logic, basic processor design and organization, pipelining, and simple cache design.","links":{}}