{
    "id": 78,
    "shortName": "vacctrials",
    "name": "Vaccine Trials: Methods and Best Practices",
    "language": "en",
    "shortDescription": "This course will explore the process of evaluating investigational vaccines in clinical trials including informed consent, recruitment, enrollment, safety evaluation, and quality data collection.",
    "aboutTheCourse": "<div>Vaccines are evaluated through a series of clearly defined controlled\n    studies to assess these investigational products for safety, immunogenicity\n    and efficacy before they are approved for licensure. &nbsp;All clinical\n    vaccine trials are bound by international ethical guidelines and, in the\n    case of US trials, Food and Drug Administration (FDA) regulations.<\/div>\n<div>&nbsp;<\/div>\n<div>Good Clinical Practice is defined by the International Conferences on\n    Harmonization (ICH) as: “A standard for the design, conduct, performance,\n    monitoring, auditing, recording, analysis, and reporting of clinical trials\n    that provides assurance that the data and reported results are credible\n    and accurate, and that the rights, integrity and confidentiality of trial\n    subjects are protected.”<\/div>\n<div>&nbsp;<\/div>\n<div>That’s a tall order, so how is it done? &nbsp;Individuals who enroll as\n    subjects in these trials play an essential role in the development and\n    evaluation of new and improved candidate vaccines. &nbsp;They are average\n    citizens who volunteer to roll up their sleeves and, in the process, make\n    a tremendous difference in society. &nbsp;So why do they volunteer and\n    what safeguards do we put in place to protect their rights, safety and\n    well-being while in the trial? &nbsp;What are the responsibilities of the\n    investigators, sponsors and ethics committees who conduct and oversee these\n    trials?&nbsp;<\/div>\n<div>&nbsp;<\/div>\n<div>Along with our colleagues, we will introduce you to how GCP is applied\n    in clinical vaccine trials to ensure proper and ethical scientific conduct.\n    The course will use examples from real vaccine trials to demonstrate the\n    application of the FDA Code of Federal Regulations and ICH GCP Guidelines\n    to explore methods and best practices involved in implementing phase I\n    and II vaccine clinical trials. &nbsp;This short course offering through\n    Coursera is based on our work at the Center for Immunization Research and\n    an in-depth graduate course taught at the Johns Hopkins Bloomberg School\n    of Public Health.<\/div>\n<div>&nbsp;<\/div>\n<div>We hope it inspires you to work in this exciting field.<\/div>\n<br><br>\nDeveloped in collaboration with <a href=http:\/\/www.jhsph.edu\/offices-and-services\/center-for-teaching-and-learning\/our-services\/open-education-lab\/index.html>Johns Hopkins Open Education Lab<\/a>.",
    "targetAudience": 1,
    "courseSyllabus": "This course will cover the following topics: A brief review of vaccine\nhistory and types; how vaccine trials are conducted, including which data\nare collected and how those data are managed and evaluated; appropriate\nprocesses to ensure human subjects protection and informed consent; methods\nfor recruitment and enrollment of participants; and vaccine safety assessment.\nUpon successfully completing this course, students will be able to:\n<br>\n<br>\n<ul>\n    <li>Describe the types of vaccines in use today<\/li>\n    <li>Describe how vaccines are evaluated in phase I and II clinical trials<\/li>\n    <li>Identify key regulatory requirements, considerations and ethical standards\n        for human subjects protection and informed consent.&nbsp;<\/li>\n    <li>Discuss how clinical trials are conducted with an emphasis on quality\n        data and protection of the rights, safety and well-being of volunteers.<\/li>\n<\/ul>",
    "estimatedClassWorkload": "3-5 hours\/week",
    "recommendedBackground": "<div>The pre-requisite for this class is a basic understanding of vaccines.\n    &nbsp;For those without this background, the CDC Epidemiology and Prevention\n    of Vaccine-Preventable Diseases (Pink book) is an available resource providing\n    information on routinely used vaccines and the diseases they prevent!\n    <a href=\"http:\/\/www.cdc.gov\/vaccines\/pubs\/pinkbook\/index.html\">http:\/\/www.cdc.gov\/vaccines\/pubs\/pinkbook\/index.html<\/a>\n        <br>\n        <br>\n<\/div>\n<div>A course on Vaccines is also taught by Paul Offit through Coursera which\n    may be helpful to those enrolling in this course but is not required.&nbsp;<\/div>",
    "links": {}
}