{"id":23,"shortName":"soc101","name":"Introduction to Sociology","language":"en","shortDescription":"In this class we will cover the essentials of sociology, to help you better understand your own life and situations far from your experience.","aboutTheCourse":"We live in a world that is changing very quickly. Sociology gives us the tools to understand our own lives and those quite remote from us. The premise of this class is that in order to benefit from the sociological perspective, we need to learn how to ask certain basic questions. We need to know how to seek answers through methods that strive to be systematic and generalizable.We will begin with some of the essential questions: How are the things that we take to be natural socially constructed? How do we live today? How determined is social life? Does the individual make a difference? How is social order possible? Then we will ask what techniques are available to make sense of these questions.  We will review comparative, historical, demographic, experimental, and ethnographic methods. Along the way, we will study core concepts including ethnocentrism, social networks, community, unanticipated consequences, social capital, race, class, and gender. <br><br> We will strive to understand how interaction in micro-level contexts affects larger social processes and how such macro-level processes influence our day to day lives. We will learn to conceive of inequality by asking how race, class, and gender work in tandem. We will address one of the crises of recent sociology -- whether we can actually isolate the effects of social context. We will think about how social science is changing at a time when we are literally swimming in oceans of data generated by the internet.","targetAudience":0,"courseSyllabus":"<div><strong>Week 1:<\/strong> The Sociological Imagination<\/div>\n<div><strong>Week 2:<\/strong> Three Sociological Questions<\/div>\n<div><strong>Week 3:<\/strong> Methods of Sociological Research<\/div>\n<div><strong>Week 4:<\/strong> Us and Them<\/div>\n<div><strong>Week 5:<\/strong> Isolation, Groups, and Networks<\/div>\n<div><strong>Week 6:<\/strong> Cities<\/div>\n<div><strong>Week 7:<\/strong> Social Interaction and Everyday Life<\/div>","courseFormat":"Each week, there will be two sessions. One will be a standard 50 minute lecture, segmented by interactive assessments, that refers to one or two readings, all of which are in the public domain. The other will be a live discussion session via a video chat room, in which eight students -- including some selected from the students in the online class and some here at Princeton -- will participate with me in a seminar about the readings. This session will be recorded so that if you are unable to watch it live, you can view it at your own convenience. It will be really nice to have at least some of you participating from around the world. And there will also be opportunities to contribute by asking questions and making comments on the course website. Some of my colleagues in the Princeton sociology department have agreed to join us for these sessions. A midterm examination will be available as will a final examination. These exams will consist of a combination of identification questions and short essay questions.","suggestedReadings":"All assigned readings are open source materials which can be found through the web. You do not need to purchase anything. Although the lectures are designed to be self-contained, I will be recommending additional readings throughout the course for those who wish to delve further into particular topics. Students wanting to expand their knowledge beyond what will be covered in this six week summer class can find a much more extensive coverage in my books <a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=soc101&isbn_ean=9780393932379\">Essentials of Sociology (Third Edition)<\/a><img width=\"1\" src=\"http:\/\/www.assoc-amazon.com\/e\/ir?t=coursera-20&l=as2&o=1&a=0393932370\" height=\"1\" style=\"border: none !important; margin: 0px !important;\"> and <a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=soc101&isbn_ean=9780393912135\">Introduction to Sociology (Eighth Edition)<\/a><img width=\"1\" src=\"http:\/\/www.assoc-amazon.com\/e\/ir?t=coursera-20&l=as2&o=1&a=0393912132\" height=\"1\" style=\"border: none !important; margin: 0px !important;\"> (both with Anthony Giddens, Richard P. Appelbaum, and Deborah Carr).","instructor":"Mitchell Duneier","estimatedClassWorkload":"5-7 hours\/week","recommendedBackground":"None; all are welcome.","links":{}}