{
    "id": 2776,
    "shortName": "hebrewpoetry1",
    "name": "Modern Hebrew Poetry   שירה עברית מודרנית  ",
    "language": "he",
    "shortDescription": "הקורס מציע מיפוי של השירה העברית החדשה למן תנועת ההשכלה דרך תקופת \"התחייה\" והמודרניזם שבא בעקבותיה, ועד לימינו. הקורס מציג באופן חי ונושם את המפנים הפואטיים ואת ההתפתחויות הסגנוניות והתמטיות בתחום השירה העברית, מראשיתה, באמצעות קריאות קרובות של טקסטים מן התקופות השונות, ומעמיד מאגר גדול ושופע של ידע תיאורטי, ספרותי  והיסטורי, לצד פרשנויות עמוקות, מאתגרות ומפתיעות. \n\n\n\n\n\n",
    "aboutTheCourse": "<p><\/p><p dir=\"RTL\"><br><\/p><p><strong>Course Subject<\/strong><\/p><p>The course dealt with Hebrew Poetry from “Rebirth” to Israeli poetry of the last generation. Professor Ariel Hirschfeld discussed the poetic revolution that took place in Hebrew culture at the end of the 19th Century, and specifically the poetry of Bialik and Shaul Tchernichovsky, who both radically changed the way the cultural agenda of Judaism was associated with the Hebrew language. We therefore followed the development of the Hebrew literary community until the Second World War, extending over three continents. The course described the dramatic dynamics that occurred within Israeli literary society around the nature of Hebrew poetry and its extraordinary poetic achievements, which is, without doubt, one of the most impressive poetic cultures in the modern world.<br><\/p><p><br><\/p><div><br><\/div><div><br><\/div>",
    "targetAudience": 0,
    "courseSyllabus": "<p dir=\"RTL\"><b>השירה העברית החדשה, פואטיקה, היסטוריה, תרבות<\/b><br><\/p>\n\n<p dir=\"RTL\"><b>&nbsp;<\/b><a href=\"https:\/\/d396qusza40orc.cloudfront.net\/hebrewpoetry1\/Course%20Description\/Syllabus%20-%20Ariel%20Hirschfeld.pdf\"><strong>רשימת שירים ורשימה ביבליוגרפית<\/strong><\/a><\/p>",
    "estimatedClassWorkload": "2-3 hours\/week",
    "recommendedBackground": "No background is required; all are welcome!<br>However, knowledge of the Hebrew language is necessary to understand the course.\n<br><br><br>",
    "links": {

    }
}