{
    "id": 74,
    "shortName": "communitychange",
    "name": "Community Change in Public Health",
    "language": "en",
    "shortDescription": "This course examines the community context of the changes needed to promote the public’s health.",
    "aboutTheCourse": "<div>In bringing about behavior change in public health, we often focus on\n    the individual mother, student, or farmer. We should not forget the community\n    structure and norms constrain for encouraging individual health behaviors.\n    This course examines the community context of the changes needed to promote\n    the public’s health. We begin by examining the various definitions of ‘community’\n    and the processes by which we ‘diagnose’ or seek to understand the structure\n    and characteristics of different types of communities. An appreciation\n    of community similarities and differences is necessary lest we fall into\n    the trap of designing one-size-fits-all interventions. We need to recognize\n    that no matter that outsiders may view a community as poor or neglected,\n    we can find strengths and capacities for improvement in each community.\n    Identifying community capacities and resources is the first step in facilitating\n    community change. Different practical and philosophical approaches to change\n    and therefore, examined. Specific to the change process is our recognition\n    of the need for communities to participate in the design, implementation\n    and evaluation of any intervention. We examine the concept of participation\n    in an effort to see how different levels of involvement may affect sustainability\n    of community change efforts. Finally a case study of a community participatory\n    approach to onchocerciasis control in Africa is presented. Community Directed\n    Intervention has subsequently been successfully applied to providing other\n    essential primary health care services by and in the community, such as\n    insecticide treated bednets, malaria treatment, vitamin A distribution,\n    deworming medicines, and pneumonia and diarrhea case management.\n    <br>\n    <br>\n<\/div>\n<br>Developed in collaboration with <a href=http:\/\/www.jhsph.edu\/offices-and-services\/center-for-teaching-and-learning\/our-services\/open-education-lab\/index.html>Johns Hopkins Open Education Lab<\/a>.",
    "targetAudience": 1,
    "courseSyllabus": "<div>\n    <div>After listening to, viewing, and studying the course materials, you will:<\/div>\n    <div>\n        <ul>\n            <li>Provide a definition of community<\/li>\n            <li>Identify community components, characteristics, and typologies<\/li>\n            <li>Outline and explain the components of a community diagnosis<\/li>\n            <li>Explain the concept of perceived community\/collective efficacy<\/li>\n            <li>Outline and describe the community competency model<\/li>\n            <li>Explain Rothman's model of community change<\/li>\n            <li>Note relationships of Rothman's model to other change models<\/li>\n            <li>Describe the levels of the political economy model<\/li>\n            <li>Give examples of a political economy interpretation to health problems<\/li>\n            <li>Define the concept of community coalitions<\/li>\n            <li>Identify the role of community participation in the Alma Ata Declaration<\/li>\n            <li>Provide examples of the effect of participation on program outcomes<\/li>\n            <li>Describe how coalitions can address urban health problems<\/li>\n            <li>Describe the levels of participation along a continuum<\/li>\n            <li>Distinguish between community-based and community-controlled programming<\/li>\n        <\/ul>\n    <\/div>\n<\/div>\n<div><\/div>",
    "estimatedClassWorkload": "5-8 hours\/week",
    "recommendedBackground": "<div>A basic understanding of public health program planning is helpful but\n    not required.&nbsp;<\/div>\n<div><\/div>",
    "links": {

    }
}