{
    "id": 1487,
    "shortName": "sanitation",
    "name": "Planning & Design of Sanitation Systems and Technologies ",
    "language": "en",
    "shortDescription": "Learn more about how to plan for urban sanitation at city and local\/community levels, different sanitation system and technology configurations and examples of successful and failed urban sanitation systems in low- and middle-income countries.\n",
    "aboutTheCourse": "Sanitation is one of\nthe most off-track MDGs and progress in urban sanitation is proving especially\ndifficult to achieve. The traditional response for\nimproving urban sanitation is typically based on a master planning approach\nwhich has widely failed to meet the needs of low-income communities living in\nslums, who cannot afford to pay the expected charges for service improvements. <br><p>In this course you will learn how to plan for affordable and context-specific\nsanitation solutions using some state-of-the-art sector planning tools and frameworks\nsuch as Sanitation 21, Community-Led Urban Environmental Sanitation (CLUES) and\nthe Sanitation Systems Approach. By using exercises and concrete examples,\nparticipants will learn how to choose appropriate sanitation systems and\ntechnologies for a variety of urban contexts.<\/p>\n\n<p>It is the 2nd MOOC of the series on \"Sanitation, Water and Solid Waste for Development\", which is an\ninitiative of <a title=\"Link: http:\/\/www.sandec.ch\/index_EN\" target=\"_blank\" href=\"http:\/\/www.sandec.ch\/index_EN\">Sandec\/Eawag<\/a>\nand <a target=\"_blank\" href=\"http:\/\/moocs.epfl.ch\/mooc-factory\">EPFL<\/a>.\nSandec\/Eawag develops and offers the series as <a target=\"_blank\" href=\"http:\/\/www.who.int\/collaboratingcentres\/en\/\">WHO\nCollaborating Centre<\/a>. The dissemination is supported by <a target=\"_blank\" href=\"https:\/\/fr.unesco.org\/\">UNESCO<\/a><strong>.&nbsp;<\/strong>The first MOOC of the series is entitled \"<a target=\"_blank\" href=\"https:\/\/www.coursera.org\/course\/hwts\">Introduction\nto Household Water Treatment and Safe Storage<\/a>\".<\/p><p><strong>Version française:<\/strong> <a target=\"_blank\" href=\"http:\/\/www.eawag.ch\/forschung\/sandec\/elearning\/dl\/planification_design.pdf\">Le cours en bref - Planification &amp; design des systèmes et technologies d’Assainissement<\/a><br><\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<p><b>WEEK 1: Introduction to sanitation planning &amp;\nsystems approach <\/b><br>About this course; Introduction to urban\nenvironmental sanitation in low- and middle-income countries; Main differences\nbetween rural and urban sanitation; The case for improved sanitation planning\n&amp; programming; Why enabling environments are a precondition for sector\nprogress; Examples of state of the art planning approaches.\n\n<\/p><p><b>WEEK 2: Sanitation systems &amp; technologies<\/b><br>Introduction to sanitation systems including\nsystem templates, functional groups and products. Difference between wet and\ndry systems; Using the eCompendium planning tool, participants will practice\ntheir skills in building a complete sanitation system from user interface to\ndisposal or re-use of products.\n\n<\/p>\n\n<p><b>WEEK 3: Sanitation systems &amp; technologies<\/b><br>Introduction to different technologies from each functional\ngroup: user interface; collection; conveyance; treatment and use\/reuse.\nFeaturing concrete examples from Africa, Asia and Latin America for a large\nvariety of technologies.\n\n<\/p>\n\n<p><b>WEEK\n4: Urban sanitation solutions - 3 case studies <\/b><span><br>Examples\nof complete sanitation system configurations: successful and failed examples.&nbsp; <\/span>Individual exercise: propose a sanitation system for a selected (slum) site.\n<\/p>\n\n\n\n<p><b>WEEK 5: Wrap-up and question &amp; answer-session<\/b><br>Q&amp;A\nsession: what are key elements for sustainable sanitation in urban\ncontexts?, Wrap-up module, final exam.\n\n<br><\/p>",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": "<p>A general background in environmental or civil engineering, urban planning\nor geography is suggested to fully benefit from this course.<\/p>",
    "links": {

    }
}