{"id":2147,"shortName":"origensdavida","name":"Origens da Vida no Contexto Cósmico","language":"pt-br","shortDescription":"A vida que conhecemos só ocorre na Terra ? Pode existir vida em outros lugares do Universo? Para conhecer melhor a vida faz-se necessário conhecer outras vidas. Este curso explora questões abertas sobre a origem da vida em um contexto astronômico.","aboutTheCourse":"<div>Para\nconhecer a vida é necessário conhecer outras ocorrências da vida.\nO avanço da tecnologia possibilitou, nas últimas décadas, a\ndescoberta de inúmeros planetas orbitando outras estrelas da nossa\ngaláxia. Hoje sabemos que o universo está infestado de planetas.\nEssas descobertas deram um novo fôlego à busca da vida em um\ncontexto mais amplo, em um contexto cósmico. Hoje em dia podemos nos\nperguntar se a vida é um milagre, ou um tipo de química comum em\noutros planetas e tentar buscar, através da astronomia, peças desse\ngrande quebra-cabeças na tentativa de entender se a origem da vida\nocorreu antes, durante ou depois da formação de nosso planeta. \n\n<p>\nEste\ncurso apresenta um panorama geral sobre as hipóteses relacionadas à\norigem da vida na Terra bem como sobre os blocos fundamentais para a\nformação da vida simples e complexa. A compreensão da vida no\ncontexto cósmico e as estratégias desenvolvidas para a busca da\nvida em outros planetas. A cada semana iremos abordar aspectos\nrelacionados a origem da vida, combinando conceitos chaves de\nastronomia, tecnologia e a visão de diversos especialistas da área.<\/p>\n\n<\/div><br>","targetAudience":0,"courseSyllabus":"<span><b>Semana\n1:<\/b> Nosso universo é extraordinariamente grande. Nessa imensidão\ncósmica podemos encontrar sistemas planetários de uma diversidade\nmuito mais ampla do que até então podíamos imaginar. A busca da\nvida é então uma questão a ser tratada em um contexto mais amplo.\nPor outro lado, a vida tal como a conhecemos hoje na Terra é muito\ncomplexa para ser entendida. Nessa semana faremos um panorama geral\nsobre o espetáculo da vida e das espécies. Iremos explorar os dois\ngrandes cenários da origem da vida que se contrapõem: o\ncriacionismo e o evolucionismo. Falaremos da árvore filogenética da\nvida e o ancestral comum e por fim, os problemas para a formação de\numa teoria geral da vida.<\/span>\n<p>\n<span><b>Semana\n2:<\/b> Nessa semana iremos explorar as teorias e hipóteses da origem\nda vida. A abiogênese da escola socrática difundida por\nAristóteles. A síntese de aminoácidos na Terra primitiva.\nDesenvolveremos os experimentos de Urey e Miller e discutiemos os\nproblemas para a ocorrência dessas reações na Terra primitiva. O\nprocesso de formação do nosso sistema planetário e a formação\ndos planetas rochosos e gasosos nos ajudará a entender as principais\ncaracterísticas do sistema solar hoje em dia e em sua origem, e com\nisso a origem extraplaentária de aminoácidos. <\/span>\n<\/p>\n<p><a><\/a>\n<span><b>Semana\n3:<\/b> Exploraremos um pouco mais o processo de formação\nplanetária, retrocedendo no tempo até o momento em que a vida\nsurgiu na Terra. Nessa semana discutiremos sobre a origem da vida em\nnosso planeta, reconstruindo a história da vida e da Terra primitive\ne os fatores ambientais (internos e externos) que propiciaram seu\nsurgimento. O surgimento da auto-organização molecular num “mundo\nRNA”, onde essa molecula exercia ao mesmo tempo, o papel de código\nreplicador e de função metabólica.<\/span><\/p>\n<p><span><b>Semana\n4.<\/b> Na última semana falaremos sobre a procura da vida fora da\nTerra. Falaremos sobre a origem dos elementos químicos biogênicos,\na energia estelar e sua importância. Os métodos de detecção de\nexoplanetas e as condições físico-quimicas da atmosfera de\nexoplanetas até agora descobertos. O conceito de habitabilidade\nplanetária e os fatores condicionantes da possibilidade de formação\nde vida em outros planetas: a zona de água líquida em torno das\nestrelas e a zona de habitab]ilidade Galáctica. Para finalizar\napresentaremos os telescópios da próxima geração e as\nperspectivas concretas de detecção de sinais de atividade biológica\nem exoplanetas. <\/span>\n<\/p>\n\n<br>","courseFormat":"Este curso tem duração de 4 semanas e é composto por uma série de vídeos com duração entre 10 a 15 minutos, textos para leitura e discussões no fórum, sendo necessário uma dedicação de 4 a 6 horas de estudo semanais.","suggestedReadings":"","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"Não é necessário ter conhecimentos prévios. O curso está aberto a todos os interessados.","links":{}}