{"id":1542,"shortName":"digitalaccessibility","name":"Information and Communication Technology (ICT) Accessibility ","language":"en","shortDescription":"Learn to address Information and Communication Technology (ICT) accessibility in this course covering challenges and strategies for organizations and individuals.  Whether corporate, governmental, or nonprofit, this course will enable you to identify ICT accessibility issues, analyze needs, and evaluate solutions for both employees and customers with disabilities.\n\n\n","aboutTheCourse":"In\nthis introductory course, learn how to measure an organization’s ICT accessibility and assess the importance of\nmaintaining an inclusive workplace for both employees and customers with\ndisabilities. This six-week course consists of modules detailing some of the\nprimary ICT accessibility obstacles facing organizations today. Each module is\ntaught by a subject matter expert through content-rich videos, activities, and discussion forums. \n<p>Whether\nyou work in the corporate, governmental or nonprofit sector, this course will\nenable you to identify ICT accessibility issues, analyze specific needs, and\nevaluate possible solutions. As the world becomes more technology-driven,\norganizations of all sizes and sectors touch ICT accessibility, whether through\nwebsite design, document creation, or multimedia utilization. Start outlining a\nplan to establish and maintain an accessible enterprise operation today. <\/p>\n<p>Join\nour instructors as we explore why, what, and how to integrate\naccessibility design elements into your ICT organizational roadmap to support\nequal access for all.<\/p>","targetAudience":1,"courseSyllabus":"<p>This course includes six modules, each having associated activities and a quiz:<\/p>\n\n<p><strong>Module 1<\/strong>: ICT\nAccessibility <br>\nThis module will provide an introduction to ICT accessibility as well as an overview of  the relevance the five subsequent modules in this course.<\/p>\n\n<p><strong>Module 2<\/strong>: ICT\nAccessibility Design<br>\nThis module will provide instruction on the importance of ICT accessibility in designing and procuring workplace applications.<\/p>\n\n<p><strong>Module 3<\/strong>: Assistive\nTechnology<br>\nThis module will provide instruction on the impact of assistive technology (AT) and mainstream technology on individuals with disabilities.<\/p>\n\n<p><strong>Module 4<\/strong>: Accessible Documents and Multimedia<br>\nThis module will provide instruction on the elements of an accessible document, accessibility standards, tools to check accessibility, multimedia captioning and audio description standards and guidelines.<\/p>\n\n<p><strong>Module 5<\/strong>: Web\nAccessibility Evaluation and Design <br>\nThis module will provide instruction on web accessibility through utilizing online evaluation and remediation tools using HTML5 and ARIA.<\/p>\n\n<p><strong>Module 6<\/strong>: ICT Accessibility Operations <br>This module will provide an overview of ICT accessibility\nmarket forces and organization challenges, and will outline how an ICT\nAccessibility Operation Model can help organizations address their challenges.<\/p>","courseFormat":"<p>This ICT accessibility course will consist of six modules over a six week term. Each module will consist of multiple video lessons. The lesson videos will include instructional content, resources, demonstrations, guest subject matter experts and personal interviews. There will be at least one weekly activity assignment, two discussion forum question postings and one graded ten question multiple-choice quiz at the end of each module.<br><\/p>\n\n<p><b>Activity Assignments<\/b>: Activity assignments provide students the opportunity to experience the content presented in the course. There will be at least one weekly activity assignment.<\/p>\n\n<p><b>Discussion Forums<\/b>: Discussion forums provide students the opportunity to interact with the instructors and other students enrolled in the course. There will be at least two discussion forum questions posted weekly. <br><\/p>\n\n<p><b>Quizzes<\/b>: The quizzes will be used to test the student understanding of the module content. There will be six quizzes.<br><\/p>\n\n<p><b>Final Exam<\/b>: The final exam will be used to test the student understanding of the course content. There will be graded final course exam (20 questions).<\/p>\n\n<p><b>Course Survey<\/b>: Surveys are used to provide course feedback to the instructors. There will be short multiple-choice course surveys that will follow each module. There will be an end of course survey. <br><\/p>\n\n<p><b>Material<\/b>: The course materials include lecture videos, PowerPoint presentations, activities, discussion forums, and quizzes.<\/p>","suggestedReadings":"<p>This course is self contained, but there are many online sources that can be used for reference. These can be found by searching key words: ICT accessibility, assistive technology, digital and web accessibility. Other online sources include: <a target=\"_blank\" href=\"http:\/\/g3ict.org\/resource_center\/publications_and_reports\/p\/productCategory_whitepapers\/subCat_7\/id_150\">G3ict Web Accessibility Policy Making: An International Perspective Publication<\/a>; <a target=\"_blank\" href=\"http:\/\/www.section508.gov\/section508-laws\">Section 508 of the Rehabilitation Act<\/a>; and the <a target=\"_blank\" href=\"http:\/\/www.un.org\/disabilities\/convention\/conventionfull.shtml\">Convention on the Rights of Persons with Disabilities<\/a>&nbsp;preamble,&nbsp;review <a target=\"_blank\" href=\"http:\/\/www-03.ibm.com\/able\/access_ibm\/execbrief.html#accommodating\">Accessibility at IBM: An integrated approach <\/a>and <a target=\"_blank\" href=\"http:\/\/www.ataporg.org\/summaryact.html\">The Assistive Technology Act of 1998, As Amended Public Law 108-364<\/a>.<\/p>","estimatedClassWorkload":"2-4 hours\/week","recommendedBackground":"<p>No previous knowledge is required. Participants are\nexpected to have a working knowledge of computer-based applications such as Microsoft\nOffice.<\/p>","links":{}}