{"id":315,"shortName":"adhd","name":"\"Pay Attention!!\" ADHD Through the Lifespan","language":"en","shortDescription":"This course reviews current scientific knowledge and clinical approaches to Attention-Deficit\/Hyperactivity Disorder (ADHD) and examines its impact on development, functioning and health outcomes.","aboutTheCourse":"It is estimated that 5-8% of school-aged children and 4% of adults in the United States suffer from some form of attention deficit disorder and that the incidence of the disorder is increasing in the population. Although it is the most widely studied behavior disorder of childhood, its etiology remains unclear, its outcome is variable, and its treatment is complex and moderately successful. Advances in neuroscience have provided new insights into the pathophysiology of ADHD, pointing to key neural circuits involved in attention, behavioral control, learning, and reward maintenance that appear to be underperforming in patients with the disorder. Moreover, the etiology of this heterogeneous disorder points to the key role of genetic and environmental interactions during prenatal and perinatal periods. Over the past decade, new diagnostic and interventional approaches have enabled clinicians to better diagnose and treat ADHD across the lifespan, while longitudinal studies have elucidated the long-term impact of the disorder on health and adaptive functioning.<br><br>This course is intended for students with a background in psychology and\/or neuroscience who are interested in learning more about the complexities of ADHD from both scientific and clinical perspectives. Scientific topics covered include prevalence and epidemiology, diagnostic criteria, clinical presentation at different ages, impact on development (intellect, academic, speech and language, emotional self control, motivation and executive functioning), health outcomes (risk taking, accidents, injuries, driving difficulties, unintended pregnancy), co-existing conditions (anxiety, mood, substance use disorders), and etiology (genetic, pre\/perinatal, neurodevelopmental, neuroanatomic, neuropsychological). Clinical topics covered include approaches to assessment, medication treatments (stimulant and non-stimulant), and non-medical interventions.","targetAudience":1,"courseSyllabus":"<b>Week 1: Basics<br><\/b><ul><li>Diagnostic Criteria<\/li><li>Prevalence, Epidemiology<\/li><li>Clinical Case Presentations - Children, adolescents, adults<\/li><\/ul><br><b>Weeks 2-5: Biology<br><\/b><ul><li>Genetic Factors<br><\/li><li>Prenatal and Perinatal Factors<\/li><li>Neuroanatomy<\/li><li>Neurochemistry<\/li><li>Summary of Neurobiology of ADHD<\/li><\/ul><br><b>Week 6: Psychology<br><\/b><ul><li>Intellectual Development<\/li><li>Learning Disabilities, Speech and Language Disorders<\/li><li>Emotional Self Control and Motivation<\/li><li>Executive Functioning - Working Memory, Organization Planning<\/li><\/ul><br><b>Week 7: Health &amp; Long Term Outcomes<br><\/b><ul><li>Health Status\/Sleep Problems<\/li><li>Risk Taking Behaviors (Smoking, Sexuality, Substance Abuse)<\/li><li>Accidents, Injuries, Driving Difficulties<\/li><li>Long Term Outcomes of ADHD<\/li><\/ul><b>Comorbid Conditions<br><\/b><ul><li>Externalizing Disorders (ODD, CD) and Substance Abuse<\/li><li>Internalizing Disorders (i.e. Mood and Anxiety Disorders)<\/li><\/ul><br><b>Week 8: Assessment<br><\/b><ul><li>Diagnostic Interviewing<\/li><li>Behavior Rating Scales, School Performance Measures<\/li><\/ul><br><b>Weeks 9-10: Medical Treatment<br><\/b><ul><li>Medications - Stimulants \/ Review of the Literature<\/li><li>Medications - Stimulants \/ Mechanisms of Action<\/li><li>Medications - Misuse and Abuse of Stimulants<\/li><li>Medications - Atomoxetine \/ Alpha Agonists<\/li><\/ul><br><b>Weeks 11-12: Treatment 2<br><\/b><ul><li>Behavior Management: Home and School<\/li><li>Exercise, Nutrition, Sleep Hygiene<\/li><li>Cognitive Behavioral Therapy<\/li><li>Neurocognitive Training<\/li><\/ul>","courseFormat":"The class will consist of lecture videos, which are between 20-30 minutes in length. These contain 2-3 integrated quiz questions per video. Students will be expected to conduct a critical article review, a case review, and a medication review in addition to completing quizzes.","suggestedReadings":"","instructor":"Anthony L. Rostain","estimatedClassWorkload":"2-4 hours\/week","recommendedBackground":"Prior experience in psychology and\/or neuroscience is encouraged, but all are welcome!","links":{}}