{"id":1123,"shortName":"warmerworld","name":"Turn Down the Heat: Why a 4°C Warmer World Must be Avoided","language":"en","shortDescription":"It is now clear that without action on climate change, the world may become 4°C warmer by the end of this century. Such an increase would threaten to roll back decades of development progress; thus, we are at a ‘make it or break it’ point in time. This course presents the most recent scientific evidence, as well as some of the opportunities for urgent action.","aboutTheCourse":"Under current pledges and commitments, the world is likely to reach 4°C degree warming by the end of the century and 2°C warming as early as 2040. This MOOC brings together renowned scientists and policymakers to provide a synthesis of the most recent evidence and presents an analysis of likely impacts and risks, with a focus on developing countries. It chronicles already observed changes in the climate system and their impacts, through the increase in carbon dioxide emissions, corresponding temperature increases and melting of glaciers and sea ice, and changes in precipitation patterns. This course also offers projections for the 21st century for droughts, heat waves and sea-level rise in different parts of the world, with implications for food and water security, as well as possible impacts on agriculture, water availability, ecosystems and human health.\n<br>\n<br>This MOOC presents an analysis of the likely impacts of a 4°C warming trajectory and stresses the need for decision makers and communities to take a serious look at their adaptation choices, while also signaling the urgency for mitigation action. Participants will also be introduced to the risks of triggering non-linearity, and tipping elements, such as the disintegration of the West Antarctic ice sheet and large-scale Amazon dieback. The course includes a discussion of the main policy choices needed to prevent warming above 2°C and ends with an assessment of climate risks to development across six geographic regions.","targetAudience":3,"courseSyllabus":"<div><p>  <strong>Overview<\/strong>\n    <br>This overview presents the main topics this course will cover, and provides a summary of the key impacts and challenges of a 4°C warmer world. \n    <br>\n    <br>\n    <strong>Week 1: Observed Climate Changes and Impacts: Hundreds of Thousands of Years to Now<\/strong>\n    <br>\n   This module outlines the historical observed changes in the climate system leading up to the present day and the impacts that can now be attributed to human-induced climate change. It examines the rise of greenhouse gas emissions since pre-industrial times, while explaining the link between CO2 concentrations and the rising global mean temperature, ocean heat storage and sea-level rise, as well as uncertainties in the scientific evidence. It also describes the trends of increasing loss of ice in Greenland and Antarctica, increasing loss of Arctic sea ice, melting mountain glaciers, increased heat waves and extreme temperatures, and drought and aridity trends.\n    <br>\n    <br>\n    <strong>Week 2: Possible 21st Century Climates<\/strong>\n    <br>\n    This module provides an overview of the projected changes in climate leading up to the end of the 21st century. It describes the likelihood of a 4°C warmer world by 2100 AD and enables a deeper understanding of various climate models with different projections and key areas of uncertainty. It also reviews possible responses from natural systems, explaining how the projected climatic changes from 2°C to 4°C warming could result in sea-level rise, heat waves and extreme temperatures, and ocean acidification.\n    <br>\n    <br>\n    <strong>Week 3: Life in a 4°C Warmer World<\/strong>\n    <br>\nThis module presents an overview of current and projected climate impacts across key human support systems, such as agriculture and food production, water resources, ecosystems and biodiversity, and human health. Each of these human support systems will be negatively impacted by climate change under a 4°C warming scenario, resulting in adverse consequences for development, such as: diminishing crop yields, which threaten food production and human health; loss of biodiversity; the spread of vector-borne diseases; and water scarcity. The module also highlights the risks of nonlinear and cascading impacts and the risk of crossing critical thresholds for nonlinear tipping elements of the Earth system, which could dramatically increase vulnerability to climate change and impose multiple stresses on development.\n   \n    <br>\n    <br>\n    <strong>Week 4: What Can We Do About it? The Choice is in Your Hands (Discussion)<\/strong>\n    <br>\nAfter having outlined the scientific evidence in previous modules, the fourth module goes beyond the <i>Turn Down the Heat<\/i> report and provides a discussion on what mitigation and adaptation action is needed to help avoid a 4°C world, while also decreasing vulnerability to climate change impacts and building climate resilience. To do this, the module will draw on key experts involved in the implementation of different policy instruments. As no single policy solution exists, this module shares perspectives on what can be done at the global, national, and subnational levels, as well as at the individual level, to help transition towards a low-emissions, climate-resilient development path. By discussing the rationale for acting now, acting together and acting differently, the module presents examples and the expected benefits of mitigation and adaptation policies, considering both contributions to global emission reductions and local development opportunities.\n<br>\n<br>\n <strong>Week 5: Regional Impacts on Development Prospects<\/strong>\n    <br>\nBased on the scientific findings of the second report in the <i>Turn Down the Heat <\/i>series, this module will explore the climate trends and impacts on key development sectors across six geographic regions:\n<\/p><ul>\n<li>Latin America and Caribbean<\/li>\n<li>Sub-Saharan Africa<\/li>\n<li>Middle East and North Africa<\/li>\n<li>Eastern Europe and Central Asia<\/li>\n<li>East Asia and Pacific<\/li>\n<li>South Asia<\/li>\n<\/ul>\nThe module will examine the likely impact of present day (0.8°C), 2°C and 4°C warming above pre-industrial temperatures in the regions, through a focus on agricultural production, water resources, ecosystem services, and coastal vulnerability for affected populations. In some regions, these risks have the potential to reverse hard-won development gains and potentially trap millions in poverty, illustrating the need for urgent action now.\n\n<h2>Choose Your Course Track<\/h2>\nDepending on your particular interest, you can choose to participate in one of two tracks as an optional activity.<br>\n <ul><li>Track 1: Climate Champions (General Public)<\/li><li>Track 2: Policy and Leadership<\/li><\/ul>\n <br>\n<strong>Track 1: Climate Champions (General Public)<\/strong><br><br>\n \n\n<ul><strong>Target Audience<\/strong><br>\nThe ‘Climate Champions’ track is suitable for anyone with an interest in climate change, and provides more insight into the science behind climate change and opportunities to further expand your knowledge of key areas.<br>\n <br>\n <strong>Common objective<\/strong><br>\n\nTo understand observed changes in the climate system, their causes and immediate consequences, and projected medium- to long-term impacts on development.<br>\n<br>\n<strong>Track-specific objectives<\/strong><br>\n<ul>\n      <li>To describe the climate context under the current level of 0.8° warming and recognize how projected changes in climate (under 2°C to 4°C warming) could affect such sectors as agriculture, water resources, ecosystems and health.<\/li>\n      <li>To realize how your lifestyle contributes to changes in the climate system and outline the actions you can take to reduce your climate impact or carbon footprint.<\/li>\n    <\/ul><br>\n<strong>Assignments<\/strong>\n<ul>\n      <li>Assignments focus on facilitating a basic understanding of the science.<\/li><li>You will learn how to apply the knowledge you have gained to your everyday lives.<\/li>\n    <\/ul>\n\n<\/ul>\n<br>\n <strong>Track 2: Policy and Leadership<\/strong><br><br>\n \n\n<ul><strong>Target Audience<\/strong><br>\nThe ‘Policy and Leadership’ track involves connecting with others in similar positions (e.g., policymakers, provincial and national government personnel, representatives of civil society, academia) around the world, and developing new networks of practice around climate change issues.<br>\n <br>\n <strong>Common objective<\/strong><br>\n\nTo understand observed changes in the climate system, their causes and immediate consequences, and projected medium- to long-term impacts on development.<br>\n<br>\n<strong>Track-specific objectives<\/strong><br>\n<ul>\n      <li>To critically interpret different climate projections and recognize how these changes in climate (under 2°C to 4°C warming as opposed to a current warming level of 0.8°C) could affect such sectors as agriculture, water resources, ecosystems and human health.<\/li><li>To discuss and distinguish between suitable policy options that countries\/organizations need to take to help mitigate and adapt to climate change.<\/li>\n    <\/ul><br>\n<strong>Assignments<\/strong>\n<ul>\n      <li>Assignments focus mostly on policy intervention for sectors that need urgent climate action, and connecting with others in similar positions.<\/li><li>You will be able to apply the knowledge you have gained to your specific country and policy context.<\/li>\n    <\/ul>\n\n<\/ul>\n<h2>Connect<\/h2>\nCommunicate and share resources via Twitter using hashtag <a target=\"_blank\" href=\"https:\/\/twitter.com\/search\/?q=%23wbheat\">#WBHeat<\/a>. Sign up for a free account at <a target=\"_blank\" href=\"https:\/\/twitter.com\/\">http:\/\/twitter.com<\/a>.\n<p><\/p><\/div>","courseFormat":"This MOOC has a week-by-week structure, with resources, activities and exercises for you to engage in during each of the five weeks of the course. Each week, you will find a variety of course material, including:\n<br><br>\n    <ul>\n\n                 <li><span>A <b>Climate film fest<\/b> – 30 interactive video talks by renowned climate scientists and practitioners<\/span><\/li>\n\n           <li><span><b>Resources:<\/b> Core, optional (deep dive) and fun interactives on the week’s theme<\/span><\/li>\n              <li><span><b>Quizzes<\/b> that check your knowledge, reinforce the lesson’s material and provide immediate feedback<\/span><\/li>\n               <li><span><b>Assignments<\/b> that will sharpen your skills of analysis, reflection and communication<\/span><\/li>\n               <li><span><b>Discussion forums and social media<\/b> that enable collaboration with others from around the world, enriching interaction among participants<\/span><\/li>\n               <li>\n               <span>A live interactive <strong>Google Hangout on Air<\/strong> with international experts, who will engage in a Q&amp;A session on climate change<\/span><\/li>\n               <li>\n               <span>As a final project, you will create a <b>digital artifact<\/b><\/span>\n               <\/li>\n             <\/ul>\n\nIf you successfully complete the course requirements, you will receive a Coursera Statement of Accomplishment. Course requirements include gaining a cumulative score of 50% in the following required activities: four quizzes, one peer review assignment and a final project. You will receive a distinction if you score 80% or over. These core resources and assignments will take around three hours per week to complete. More details will be provided after the course begins.\n<br>\n<br>You can also go much further than this, engaging in optional exercises, networking, discussion forums and diving deeper into our rich selection of additional resources. We also will use e-discussions, Google Hangout and other tools to facilitate dialogue between the learners and experts.","suggestedReadings":"›&nbsp;&nbsp;<a target=\"_blank\" href=\"http:\/\/climatechange.worldbank.org\/sites\/default\/files\/Turn_Down_the_heat_Why_a_4_degree_centrigrade_warmer_world_must_be_avoided.pdf\">World Bank, 2012, <i>Turn Down the Heat: Why a 4°C World Must Be Avoided<\/i><\/a><br><br>\n\n\n›&nbsp;&nbsp;World Bank, 2012, <i>Turn Down the Heat: Why a 4°C World Must Be Avoided<\/i>, &nbsp;&nbsp;&nbsp;Executive Summary in <a target=\"_blank\" href=\"http:\/\/www-wds.worldbank.org\/external\/default\/WDSContentServer\/WDSP\/IB\/2013\/03\/26\/000445729_20130326120429\/Rendered\/PDF\/632190WP0Turn000Box374367B00PUBLIC0.pdf\">English<\/a>, <a target=\"_blank\" href=\"http:\/\/www-wds.worldbank.org\/external\/default\/WDSContentServer\/WDSP\/IB\/2013\/03\/26\/000333037_20130326142304\/Rendered\/PDF\/632190WP0Turn000Box374367B00PUBLIC0.pdf\">Spanish<\/a>, <a target=\"_blank\" href=\"http:\/\/www-wds.worldbank.org\/external\/default\/WDSContentServer\/WDSP\/IB\/2013\/03\/26\/000445729_20130326121410\/Rendered\/PDF\/632190WP0Turn000Box374367B00PUBLIC0.pdf\">French<\/a>, <a target=\"_blank\" href=\"http:\/\/www-wds.worldbank.org\/external\/default\/WDSContentServer\/WDSP\/IB\/2013\/05\/22\/000356161_20130522114206\/Rendered\/PDF\/632190GERMAN0100Box377313B00PUBLIC0.pdf\">German<\/a>, <a target=\"_blank\" href=\"http:\/\/www-wds.worldbank.org\/external\/default\/WDSContentServer\/WDSP\/IB\/2013\/03\/26\/000445729_20130326122236\/Rendered\/PDF\/632190WP0Turn000Box374367B00PUBLIC0.pdf\">Arabic<\/a> or <a target=\"_blank\" href=\"http:\/\/www-wds.worldbank.org\/external\/default\/WDSContentServer\/WDSP\/IB\/2013\/03\/26\/000333037_20130326141416\/Rendered\/PDF\/632190WP0Turn000Box374367B00PUBLIC0.pdf\">Portuguese<\/a><br><br>\n\n\n\n›&nbsp;&nbsp;<a target=\"_blank\" href=\"http:\/\/www-wds.worldbank.org\/external\/default\/WDSContentServer\/WDSP\/IB\/2013\/06\/14\/000445729_20130614145941\/Rendered\/PDF\/784240WP0Full00D0CONF0to0June19090L.pdf\">World Bank, 2013, <i>Turn Down the Heat: Climate Extremes, Regional Impacts, and &nbsp;&nbsp;&nbsp;the Case for Resilience<\/i><\/a><br><br>\n›&nbsp;&nbsp;<a target=\"_blank\" href=\"http:\/\/www-wds.worldbank.org\/external\/default\/WDSContentServer\/WDSP\/IB\/2014\/11\/20\/000406484_20141120090713\/Rendered\/PDF\/927040v20WP00O0ull0Report000English.pdf\">World Bank, 2014, <i>Turn Down the Heat: Confronting<\/i><\/a> <i>the New Climate Normal<\/i><br><br>\n\n›&nbsp;&nbsp;<a target=\"_blank\" href=\"http:\/\/www.ipcc.ch\/pdf\/assessment-report\/ar5\/syr\/AR5_SYR_FINAL_SPM.pdf\">IPCC Fifth Assessment Report 2014, Summary for Policymakers<\/a><br><br>\n\n›&nbsp;&nbsp;<a target=\"_blank\" href=\"http:\/\/www.climatechange2013.org\/images\/uploads\/WGI_AR5_SPM_brochure.pdf\">Working Group I Contribution to the IPCC Fifth Assessment Report: Climate &nbsp;&nbsp;&nbsp;Change 2013: The Physical Science Basis, Summary for Policymakers<\/a><br><br>\n\n\n›&nbsp;&nbsp;<a target=\"_blank\" href=\"http:\/\/report.mitigation2014.org\/spm\/ipcc_wg3_ar5_summary-for-policymakers_approved.pdf\">Working Group III Contribution to the IPCC Fifth Assessment Report Climate &nbsp;&nbsp;&nbsp;Change 2014: Mitigation of Climate Change, Summary for Policymakers<\/a><br><br>\n\n›&nbsp;&nbsp;<a target=\"_blank\" href=\"http:\/\/ipcc-wg2.gov\/AR5\/images\/uploads\/WG2AR5_SPM_FINAL.pdf\">Working Group II Contribution to the IPCC Fifth Assessment Report  Climate &nbsp;&nbsp;&nbsp;Change 2014: Impacts, Adaptation, and Vulnerability<\/a>","estimatedClassWorkload":"3-5 hours\/week","recommendedBackground":"","links":{}}