{"id":1975,"shortName":"statistics101","name":"Introduction to Statistics for the Social Sciences","language":"en","shortDescription":"This course exposes students to the logic of statistical reasoning and its application in the quantitative social sciences. It is meant as a thorough but accessible introduction to the topics of descriptive statistics, probability theory, and statistical inference with hands-on exercises.","aboutTheCourse":"Statistics is the lingua franca of modern science, including the social sciences. It is also of ever greater importance in daily life, as data of all sorts are now ubiquitous. Statistical literacy is hence of great value, both for academic purposes and for our daily routines. This course offers a solid foundation in statistical reasoning and its uses in the quantitative social sciences.<br><br>Learning statistics can be a daunting experience. There is a plethora of statistical concepts to master and many of them come with a hefty dose of mathematical notation. The goal of the present course is to develop a clear path through the conceptual forest and to explain each concept both in its narrow meaning and as a part of the larger enterprise of statistical reasoning. Mathematical skills are not taken for granted; instead, we shall review the necessary mathematical tools so that you will not get stuck on this aspect.<br><br>The field of statistics is sometimes divided into descriptive and inferential statistics, with probability theory forming a bridge between the two. In this course, we start out descriptively, by considering different ways in which we can learn from data. We then delve into the subject of probability theory, to end with a discussion of statistical inference. The emphasis in this part is on learning how to draw conclusions about populations with the help of data from a sample.<br><br>By the end of this course, you should have a good feeling for descriptive statistics, statistical inference, and probability theory. You should also understand the interplay of these elements in the broader enterprise of statistical reasoning. And you should feel more comfortable reading about statistics and using them in your own work.","targetAudience":0,"courseSyllabus":"MODULE I: DESCRIPTIVE STATISTICS<br>Week 1: Understanding the properties of a single variable through visualization<br>Week 2: Understanding the properties of a single variable through summary statistics<br>Week 3: Understanding associations between variables<br><br>MODULE II: PROBABILITY THEORY<br>Week 4: Understanding and computing with probabilities<br>Week 5: Random variables and distributions<br>Week 6: Commonly used statistical distributions<br><br>MODULE III: INFERENTIAL STATISTICS<br>Week 7: Understanding sampling<br>Week 8: A primer of estimation theory<br>Week 9: The theory of hypothesis testing<br>Week 10: Commonly used statistical tests","courseFormat":"Each week consists of multiple topics, which are organised cumulatively. Each topic is addressed in a self-contained video, which also includes a quiz. There are three kinds of topical video:<br><ul><li>The <strong>bird's eye view<\/strong> provides a broad overview of a course module, its significance, and its relationship to other modules.<\/li><li>The <strong>math help desk<\/strong> addresses selected mathematical concepts and ideas that are used in the course. These are meant to help out students who require assistance in this area.<\/li><li><strong>Focus on statistics<\/strong> videos form the meat of the course. They focus on statistical ideas, concepts, and applications. They are organized cumulatively, so that later videos assume that you grasp the contents of earlier videos.<\/li><\/ul>Each module starts with a bird's eye view presentation. It is useful to start a module by watching this video. Upon completing an entire module, it may also be useful to return to this video because you may now watch it through a different lens. Having watched the bird's eye view, you can jump in with the first focus on statistics video. When you are satisfied you understand its contents, you can move on to the next video, etc. If a focus on statistics video includes significant mathematical content, then you will be prompted to watch the relevant math help desk video.","suggestedReadings":"Blalock--Social Statistics; De Groot--Probability and Statistics; Hays--Statistics; or any other introductory text in statistics. In each week, readings relevant for that week's topics will be suggested.","estimatedClassWorkload":"2-4 hours\/week","recommendedBackground":"There are no prerequisites for this course.","links":{}}