{"id":83,"shortName":"drugsandbrain","name":"Drugs and the Brain","language":"en","previewLink":"https:\/\/class.coursera.org\/drugsandbrain-002\/lecture\/preview","shortDescription":"The neuroscience of drugs for therapy, for prevention, and for recreation.  Drug addiction and drug abuse. You’ll learn the prospects for new generations of medications in neurology, psychiatry, aging, and treatment of substance abuse.\n","aboutTheCourse":"What happens in the body when a person smokes a cigarette? After several weeks of smoking? When a person takes antidepressant or antipsychotic medication? A drug for pain, migraine, or epilepsy? A recreational drug? Neuroscientists are beginning to understand these processes. You’ll learn how drugs enter the brain, how they act on receptors and ion channels, and how “molecular relay races” lead to changes in nerve cells and neural circuits that far outlast the drugs themselves. “Drugs and the Brain” also describes how scientists are gathering the knowledge required for the next steps in preventing or alleviating Parkinson’s, Alzheimer’s, schizophrenia, and drug abuse.","targetAudience":0,"courseSyllabus":"Week 1. Beginning 4 January 2014\n<p>Introduction and summary of the course. What is a drug? Types of drug molecules. Drug entry into nervous system. Drug receptors. Introduction to mammalian brains. Botulinum toxin. Origin of the resting potential. Electrophysiology.<\/p>\nWeek 2. Beginning 11 January\n\n<p>Drugs activate ion channels. Drugs block ion channels. Drugs activate and block G protein pathways.<\/p>\nWeek 3. Beginning 18 January\n<p>Drugs block neurotransmitter transporters. Pharmacokinetics. Recreational drugs<\/p>\nWeek 4. Beginning 25 January\n<p>Drug addiction and Drug abuse.Nicotine Addiction.Opiate Addiction.<\/p>\nWeek 5. Beginning 1 February\n<p>Drugs for neurodegenerative diseases: Alzheimer's disease, Parkinson's disease.<\/p>\nWeek 6. Beginning 8 February\n<p>Drugs for epilepsy and migraine. Drugs for anxiety.<\/p>\nWeek 7.Beginning 15 February\n<p>Drugs for psychiatric diseases: Depression, Bipolar Disorder, Schizophrenia. Prospects for better drugs.<\/p>\n\n<br>","courseFormat":"The class consists of lecture videos, 8 - 15 minutes in length. These contain 2-3 integrated quiz questions per video. There are standalone quizzes each week.  Total lecture time is ~ 14 hours.<br>","suggestedReadings":"We recommend (but do not require) that students read <i><a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=drugsandbrain&isbn_ean=9780071481274\">Molecular Neuropharmacology: A Foundation for Clinical Neuroscience<\/a><\/i> (Second Edition)<br>by Eric Nestler, Steven Hyman, and Robert Malenka.<br><br>The instructors and students provide additional appropriate links to reading on molecular biology, genomics, physiology, pharmacology, cell biology, biophysics, organic chemistry, psychiatry, neurology, and electrical circuits.","instructor":"Henry A. Lester","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"Neuroscience, the most interdisciplinary science of the 21st century, receives inputs from many other fields of science, medicine, clinical practice, and technology. Previous exposure to one or more of the subjects listed in \"Suggested Readings\" will provide a good vantage point, as we introduce material from these subjects.","links":{}}