{"id":1657,"shortName":"visualpercepbrain","name":"Visual Perception and the Brain","language":"en","previewLink":"https:\/\/class.coursera.org\/visualpercepbrain-002\/lecture\/preview","shortDescription":"The course will consider how what we see is generated by the visual system, and what visual perception indicates about how the brain works.  The evidence will be drawn from neuroscience, psychology, science history and philosophy. Although the discussions will be informed by visual system anatomy and physiology, the focus is on perception. \n\n","aboutTheCourse":"The purpose of the course is to consider how what we see is generated by the visual system.<br><br>In the 1960s and for the following few decades, it seemed all but certain that the rapidly growing body of information about the electrophysiological and anatomical properties of neurons in the primary visual pathway of experimental animals would reveal how the brain uses retinal stimuli to generate perceptions and appropriate visually guided behaviors. But despite the passage of more than fifty years, this expectation has not been met. In retrospect, the missing piece is understanding how stimuli that cannot specify the properties of physical sources can nevertheless give rise to perceptions and behaviors that are routinely successful.<br><br>Most concepts of vision propose, explicitly or implicitly, that successful visual behavior depends on recovering the sources of stimulus features either directly or by a process of statistical inference. However, given the inability of the visual system to access the physical properties of the world, these conceptual frameworks cannot account for the behavioral success of biological vision. The alternative is that the visual system automatically links simple, recurrent stimulus patterns with reproductive success, without ever recovering real world properties.<br><br>This strategy provides a different way of studying the relationship between the objective world and subjective experience, and offers a way of understanding the operating principles of visual circuitry without invoking feature detection, image representation in the brain, and\/or probabilistic inference.<br><br>Thus the objectives of the course are:<br>- To introduce you to some fascinating perceptual phenomenology<br>- To make you think about how this phenomenology can be explained<br>- To make you consider what possible explanations imply about brain function<br><br><div><\/div>","targetAudience":1,"courseSyllabus":"<span><p dir=\"ltr\"><strong>Introduction<\/strong><strong><\/strong><\/p><p dir=\"ltr\"><strong>Module #1: The Phenomenology of What We See<\/strong><br><\/p><p dir=\"ltr\">1.1 Introduction&nbsp;<\/p><p dir=\"ltr\">1.2 The Strange Way We See Things<\/p><p dir=\"ltr\">1.3 Why We Don't See the World the Way It Really Is: The Inverse Problem&nbsp;<\/p><p dir=\"ltr\"><strong><br>Module #2: Organization of the Visual System<\/strong><br><\/p><p dir=\"ltr\">2.1 Visual Stimuli<\/p><p dir=\"ltr\">2.2 Organization of the Visual System: Eye and Retina&nbsp;<\/p><p dir=\"ltr\">2.3 Organization of the Visual System: The Primary Visual Pathway<\/p><p dir=\"ltr\"><strong><br>Module #3: Conceptions of How Vision Works<\/strong><br><\/p><\/span><span><p dir=\"ltr\">3.1 Introduction<\/p><p dir=\"ltr\">3.2 Vision as Feature Detection<\/p><p dir=\"ltr\">3.3 Vision as Inference<\/p><p dir=\"ltr\">3.4 Vision as Efficient Coding<\/p><p dir=\"ltr\">3.5 Vision as a Way of Contending with the Inverse Problem&nbsp;<\/p><p dir=\"ltr\"><strong><br>Module #4: Seeing Lightness and Brightness<\/strong><br><\/p><p dir=\"ltr\">4.1 Introduction<\/p><p dir=\"ltr\">4.2 The Discrepancies between Luminance and Lightness<\/p><p dir=\"ltr\">4.3 Some More Complex Examples<\/p><p dir=\"ltr\">4.4 An Empirical Explanation Based on Reproductive Success<\/p><p dir=\"ltr\"><strong><br>Module #5: Seeing Color<\/strong><br><\/p><p dir=\"ltr\">5.1 Introduction<\/p><p dir=\"ltr\">5.2 More about the Nature of Light<\/p><p dir=\"ltr\">5.3 A Review of Some Relevant Retinal Biology<\/p><p dir=\"ltr\">5.4 Why We Have Color Vision<\/p><p dir=\"ltr\">5.5 The Strange Way We See Color: Color Contrast and Color Constancy&nbsp;<\/p><p dir=\"ltr\"><strong><br>Module #6: Seeing Geometry<\/strong><br><\/p><p dir=\"ltr\">6.1 The Phenomenology of Perceived Geometry<\/p><p dir=\"ltr\">6.2 Line Length: An Example of How Perceived Geometry Can be Explained<\/p><p dir=\"ltr\">6.3 The Perception of Angles&nbsp;<\/p><p dir=\"ltr\">6.4 The Perception of Object Size<\/p><p dir=\"ltr\"><strong><br>Module #7: Seeing Distance and Depth<\/strong><br><\/p><p dir=\"ltr\">7.1 Introduction<\/p><p dir=\"ltr\">7.2 Monocularly Perceived Distance<\/p><p dir=\"ltr\">7.3 Binocularly Perceived Depth (Stereopsis)<\/p><p dir=\"ltr\">7.4 Explaining Stereopsis<\/p><p dir=\"ltr\">7.5 Random Dot Stereograms and the Correspondence Problem<\/p><p dir=\"ltr\">7.6 How and Where Does Information from the Two Eyes Come Together?<\/p><p dir=\"ltr\"><strong><br>Module #8: Seeing Motion<\/strong><br><\/p><p dir=\"ltr\">8.1 Introduction<\/p><p dir=\"ltr\">8.2 Perceived Speed: The Flash-Lag Effect<\/p><p dir=\"ltr\">8.3 Perceived Direction: Aperture Effects<br><\/p><p dir=\"ltr\"><b>Summing Up<\/b><\/p><p dir=\"ltr\"><b><br><\/b><\/p><\/span>","courseFormat":"<span><p dir=\"ltr\">The content will be presented in 8 modules through video lectures, supplemented diagrams, examples of illusions and other illustrations. The modules are:<br><\/p><p dir=\"ltr\">Introduction<br><\/p><p dir=\"ltr\">1. The Phenomenology of What We See<\/p><p dir=\"ltr\">2. Organization of the Visual System<\/p><p dir=\"ltr\">3. Conceptions of How Vision Works <\/p><p dir=\"ltr\">4. Seeing Lightness and Brightness<\/p><p dir=\"ltr\">5. Seeing Color<\/p><p dir=\"ltr\">6. Seeing Geometry<\/p><p dir=\"ltr\">7. Seeing Distance and Depth<\/p><p dir=\"ltr\">8. Seeing Motion<\/p><p dir=\"ltr\">Summing Up<\/p><p dir=\"ltr\">Each module will have a related quiz consisting of ten relatively basic multiple-choice questions that will be machine graded.<br><\/p><p dir=\"ltr\">A final paper (1-2 pages), to be peer graded, will also be assigned near the conclusion of the course. The peer assessment will run over a two-week period (submissions will be first week and evaluation the second). Students will evaluate the papers of 5 peers. &nbsp;A qualitative and quantitative rubric will be supplied to assist students in these evaluations. &nbsp;<\/p><p dir=\"ltr\">Quizzes will be worth 70% and the final paper 30% of the grade. &nbsp;Students need to receive a grade of 70% or better to earn a Statement of Accomplishment. &nbsp;&nbsp;<\/p><\/span>","suggestedReadings":"<span><p dir=\"ltr\">The following is a list of books in which the relevant material is discussed in more detail, but reading them is not required to understand the presentations.<br><\/p><p dir=\"ltr\">Howe CQ, Purves D (2005) Perceiving Geometry: Geometrical Illusions explained by Natural Scene Statistics. New York: Springer Press. <\/p><p dir=\"ltr\">Hubel DH, Wiesel T (2005) Brain and Visual Perception. A story of a 25-year collaboration. (Oxford University Press, New York). &nbsp;<\/p><p dir=\"ltr\">Land MF, Nilsson DE (2002) Animal Eyes. Oxford Animal Biology Series. (Oxford University Press, New York).&nbsp;<\/p><p dir=\"ltr\">Purves D. (2010) Brains: How They Seem to Work. New York: Pearson\/ Financial Times Press<\/p><p dir=\"ltr\">Purves D, Augustine GA, Fitzpatrick D, Hall W, LaMantia A-S, McNamara JO, Williams SM (2011) Neuroscience, 5th edition. Sunderland, MA: Sinauer Associates<\/p><p dir=\"ltr\">Purves D, Cabeza R, Huettel SA, LaBar KS, Platt ML, and Woldorff M (2012) Principles of Cognitive Neuroscience, 2nd edition. Sunderland, MA: Sinauer Associates<\/p><p dir=\"ltr\"> <\/p><p dir=\"ltr\">Purves D, Lotto RB (2011) Why We See What We Do Redux. Sunderland, MA: Sinauer Associates<\/p><p dir=\"ltr\"> <\/p><div>References to original papers and reviews are provided in an extensive bibliography for students who may want to dig still deeper. <br><br>A glossary is also be available to consult when terms are unfamiliar.&nbsp;<br><br><\/div><\/span>","estimatedClassWorkload":"3-4 hours\/week","recommendedBackground":"Some background in neuroscience is desirable, but not necessary. We will consider basic visual system anatomy and physiology as needed.&nbsp;<br><br>","links":{}}