{
    "id": 450,
    "shortName": "recoveringthepast",
    "name": "Recovering the Humankind's Past and Saving the Universal Heritage",
    "language": "en",
    "shortDescription": "Archaeology has as its objective the recovery and revival of humankind's past, and as its aim the rescue and preservation of cultural heritage. In this course, we will learn about the practical recovery of ancient traces in the field, the study and interpretation of artifacts, and how we can preserve these sites and objects digitally for future generations. Digital archaeology is an emerging area of study, and critically important for preserving knowledge for the future.",
    "aboutTheCourse": "Archaeology\nis, among human sciences, the discipline with the strongest importance for the\nrediscovery, but also for the preservation and protection of cultural heritage,\nas Humankind’s universal patrimony. You will be introduced to the way we\nourselves reflect on and are engaged with the study of human past: from the\npractical and material recovery of ancient traces in the field to the study and\ninterpretation. On the other hand, the discovery of human\npast implies the correct conservation and presentation for both experts and\ngeneral public: the study and protection of the past we share every day prevent\nfrom any possible destruction, misuse, abuse and thus cancellation of human\nmemory.\n\n<p><span>“Recovering\nthe Humankind's Past and Saving the Universal Heritage” presents to a large\npublic Archaeology as a historical discipline: through an inter-disciplinary\nperspective you will follow the evolution and change of archaeology to the\nmoment when natural sciences contributed to make the historical reconstructions\nscientifically sound; the aid of informatics and of virtual reconstructions\ngives new fascination to the already strong suggestion of Archaeology, as the\ndiscipline of discovery <i>par excellence<\/i>.\nWithin this frame, Ebla, which is the glory of the Sapienza school of Oriental archaeology,\nwill have an exemplary meaning in the course development as a long lasting\nexperience on the field and an excellent example of the scientific results of\ncombined researches and disciplines. <\/span><\/p>\n\n<p dir=\"ltr\">Moreover, the course will focus on actual, innovative instruments to preserve, monitor and give value to cultural heritage through a multidisciplinary approach, based on a deep archaeological and historical knowledge but also on ICT technologies. The wide adoption of ICT technologies in our daily life is also impacting in the way in which we interact with our cultural heritage in particular in terms of preservation and dissemination of cultural objects.<\/p>In this course you will &nbsp;learn the basic techniques &nbsp;to digitize cultural objects and obtain 3D digital copies of a physical objects such as statues, vases or archaeological sites. &nbsp;We will also discuss how to structure the raw data in order to facilitate and make effective the access to digital contents. In particular, we will present the Europeana Data Model, a framework for collecting, connecting and enriching data on cultural objects provided by a number of museum, archives, sites and libraries in Europe. <br>",
    "targetAudience": 1,
    "courseSyllabus": "<p><\/p><p>\n\n<\/p><p>Course\nProgram and Goals of the week<\/p>\n\n<p><\/p>\n\n<p><strong><\/strong><\/p>\n\n<p><b>Module 1 <\/b><span><strong>(first week<\/strong>)<\/span><b><span>:The recovery of the human past and\nthe protection of the universal heritage. <br><\/span><\/b><\/p><p>\n\n<\/p><p><span>We will start our enquiry by\ndiscussing how ancient societies kept memory of their own past, an aspect which,\nin fact, was fundamental to their identity. Shifting towards modern times, we\nwill then reflect how the material past is preserved and how we refer to it. <br>\n<\/span><\/p>\n\n\n\n<p>Homework available since 27 Nov.: Quiz 1<br><\/p><p>\n\n<\/p><p><b>Module 2 : (second week)<\/b>: <b>The birth of archaeology and its role in the contemporary world. <\/b><\/p>\n\n<p>The\nstudy of the past of the planet marked the first serious reflections on humankind’s\npast, although<b> <\/b>archaeology was in fact considered the practice to collect objects.\n“New Archaeology” represents the first major revolution, promptly followed by\nthe more structured and aggressive “Processual Archaeology\". The opening towards\ndifferent disciplines implied the “loss of innocence” for archaeology, bringing\nat the same time scientific methods into the reconstructions of the past.<\/p>\n\n<p><\/p>\n\n\n\n<p>Homework available since 4 Dic.: Quiz week 2<\/p><p>\n\n<\/p><p><b>Module 3 (third week)<\/b>: <b>The fascination of archaeology in its\npractices and in interpretation<\/b><\/p>\n\n<p><span>Field archaeology entails discovery,\nbut is a matter of fact that discovering brings a great responsibility because\nit is a process of destruction. Digging means observing, recording,\ninterpreting. Archaeological excavation\nis an harmonious trade-off between an intellectual and a manual labor. In fact,\narchaeological interpretation is a path shifting between identity and alterity.<br>\n<\/span><\/p>\n\n\n\n<p>Homework available since 11 Dic.: Quiz week 3<\/p><p>\n\n<\/p><p><b>Module 4 (fourth week)<\/b>: <b>Archaeology in research practice<\/b><\/p>\n\n<p>Material\nremains of the past and their state of recovery vary according also to\nenvironments. Surface surveys lead to a more intense knowledge of territories,\nvisualizing archaeologicallandscapes in a variety of ecological\nsituations.&nbsp; The objectives of\narchaeological research have been moulded in the historical development of the\ndiscipline. Historical sources have always been a sourceof inspiration for\nresearch, opening new problems. Chronology is a construct depending on dating\ntools, and scientific methods have been employed in determining an absolute\nchronology.<\/p><p>Homework available since 18 Dic.: Quiz week 4<\/p><p>\n\n<\/p><p><b>Module 5 (fifth week): <\/b><b>Contemporary archaeology and public perception<\/b><br><\/p><p>\n\n<\/p><p>This\nmodule focuses on scientific research and knowledge dissemination.The\nspecificities of the past pose a problem in respect of popularization and\nsimplification. The operational chain is made of exploration, dig, publication,\nconservation, dissemination, protection. However, the need for a legitimacy of\nthe present has led also to political readings of the retrieval of the past. Present cultural identity is grounded in the retrieved past. The “past of the\nother” has often been refused throughout history down to modern times. Our\nperception of the past is made manifest in its material and virtual\nreconstruction starting from ruins. Further, “excessive exploitation” of the\npast represent a modern destruction. The archaeological excavation of Ebla\n(Syria) will be analyzed as case study. It is in fact an example of a research\nframed within historical archaeology, which, in the course of fifty years of\nresearch, turned into a global perspective.<\/p>\n\n<p>Homework available since 25 Dic.: Quiz week 5<\/p><p>\n\n<\/p><p><b>Module 6 (six week)<\/b><span>: <b>Digitizing Cultural Objects and 3D virtual reconstruction<\/b><\/span><\/p>\n\n<p dir=\"ltr\">In\n this module, Emanuel Demetrescu will explain us the last \nmethodologies and techniques in the field of 3D acquisition and \nreconstruction of cultural heriatage. These applications improve the \nknowledge and preservation and have a central role in the way we can \ncommunicate cultural heritage to the society. Making digital copies from\n real objects now has several very fun and precise technologies that are\n also available to everybody at very low cost budget. Demetrescu will \nshow us how to use these tools to make our own models and share them \nwith others. The virtual reconstruction of no-more-exstant objects (like\n a lost temple) will be the argument of the last part of the module: a \nstate of the art of the methodologies will help us to understand how to \napproach such a process from a scientific point of view (archaeological \nmethod). <\/p>\n\n\n\n<p>Homework available since 1 Jan.: Quiz week 6<\/p><p>\n\n<\/p><p>\n\n<\/p><p><b>Module 7 (seventh week)<\/b><span>: <b>Sharing Digital Cultural Objects over the Internet<\/b><\/span><br><b><\/b><\/p>\n\nIn\n this module, Andrea Vitaletti will show us the basic techniques \nto effectively manage the &nbsp;unprecedented amount of digital contents on \ncultural objects nowadays offered by cultural heritage providers. Raw \ndata, &nbsp;need to be organized in structured information in order to \neffectively support advanced functionalities, such as &nbsp;indexing and \nsearching. We will &nbsp;present the basic techniques to structure the data \nin order to facilitate the access to digital contents and we will focus \non &nbsp;the Europeana Data Model, a framework for collecting, connecting and\n enriching data on cultural objects provided by a number of museum, \narchives, sites and libraries in Europe.\n\n\n\n<p>Homework available since 8 Jan.: Quiz week 7<\/p><p>\n\n<\/p><p><b>Module 8 (eight week)<\/b>: <b>The past as a universal heritage of\nhumankind<\/b><span><br>\nThis module deals with some basic issues and principles. All heritages are\n“equal among them”. Heritages are a property of humankind and not of the single\ncountries. Heritages need to be protected and preserved in their context. But\nmany threats are posed to heritages: illegal digging is a serious risk, as well\nas actions due to hatred for the “other” and his heritage. <\/span>As a consequence of\nwhat stated above, damages to heritage are a crime against all humankind. International Organizations are engaged in protecting the heritage, the future\nof which represents a contribution to dialogue and peace.<\/p><p>Homework available since 15 Jan.: Quiz week 8<br><\/p>\n\n<strong>Final Exam<\/strong>. Due by Feb. 2.<p>\n\n<\/p>",
    "estimatedClassWorkload": "2-4 hours\/week",
    "recommendedBackground": "<p>The course is\naimed at anyone interested in the preservation of cultural heritage and teaches\nthe methods and techniques to achieve it. In this respect, the course requires\nonly basic knowledge, which will be acquired by the end of the first cycle and\nit can be used at different levels by specialists, university students or\nmerely interested public. For this reason, the course can be useful for\napproaching these issues even in high school and, in particular, may contribute\nto the orientation towards the choice of university studies.<br><\/p>",
    "links": {

    }
}