{
    "id": 1827,
    "shortName": "magnacarta",
    "name": "Freedom and protest: Magna Carta and its legacies",
    "language": "en",
    "shortDescription": "This course was previously called: The Magna Carta and its Legacy.\n\nThis course aims to lead students into a greater appreciation for and an understanding of Magna Carta and its significance around the globe, as we approach the 800th anniversary of its sealing. The course examines why Magna Carta was radical in its day, why it has been a source of numerous debates, and why this anniversary is being celebrated in the present.",
    "aboutTheCourse": "In 1215, King John sealed Magna\nCarta by the Thames at Runnymede in Surrey, a charter between the monarch and his\nBarons placing limits on his power over freeborn men in the kingdom. Magna Carta\nenshrined the principle that all people should be bound by the rule of law,\nincluding the monarch, and that the processes of justice must be applied to\nall. Many political thinkers have celebrated Magna Carta as the first example\nof a bill of rights, an ancient constitution.&nbsp;<br><br><p><span>This introductory course, based on a new level 5\ncourse <i>Commemorating the Past<\/i> that\nwill be offered for the first time in 2015-16, examines the historical roles\nthat Magna Carta has played, and the importance of Magna Carta today. Members\nof the History Department at Royal Holloway, a college of the University of\nLondon, will deliver the course. In addition to the lectures with an explicit\nhistorical focus, the lectures in week fours and five will explore the continuing\ninternational significance of Magna Carta, and of Runnymede, through video segments produced by lecturers in the Geography Department and the Politics and International\nRelations Department.<\/span>&nbsp;<\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<b>Week 1<\/b><span><span><span>\n  <p>Magna Carta, Parliament and the Law 1215-1300 (Lecturers: Nigel Saul and Jonathan Phillips)<\/p>\n  <p><i>Learning outcome: to set the scene for studying Magna Carta; to show how Magna Carta became embedded in practice\n  in England<\/i><\/p>\n  <\/span>\n <\/span>\n <span>\n  <span>\n  <p><b>Week 2<\/b><\/p>\n  <p>The reinvention of Magna Carta, 1508-1642 (Lecturer: Justin Champion)<\/p>\n  <p><i><span>Learning outcomes: to understand how the significance of &nbsp;the Magna Carta was reinvented in the\n  context of the conflict between monarchy and parliament; to explore the use\n  of Magna Carta in political cartoons<b><\/b><\/span><\/i><\/p>\n  <\/span>\n <\/span>\n <span>\n  <span>\n  <p><b>Week 3<\/b><\/p>\n  <p>The Whig Ancient Constitution, 1642-1776 (Lecturer: Justin Champion)<\/p>\n  <p><i>Learning Outcomes: to understand, and examine, how the ‘idea’ rather than\n  the ‘event’ of Magna Carta became used by conservative and radical political\n  groups; to understand the export of the tradition of Magna Carta into the\n  American colonies<\/i><\/p><p><strong>Week 4<\/strong><\/p><p>Magna Carta and the wider world: constitution making (Lecturer: Emm\nJohnstone with others)<\/p><p>Learning outcomes include: to\nunderstand the significance of Magna Carta and its ideals in the establishment\nof constitutions and bills of human rights over the past two centuries<\/p><p><strong>Week 5<\/strong><\/p><p>Public history: memorialisation and memorials (Lecturer: Graham Smith\nand others)<\/p><p>Learning outcomes include\nexamining the purposes of commemoration in modern society.<\/p><p><strong>Week 6<\/strong><\/p><p>Magna Carta: A History of an Argument c.1800-2015 (Lecturer: Graham\nSmith)<\/p><p>Learning outcomes include: to\nappreciate the complex and contested uses of Magna Carta in contemporary\ndebates about human rights and the rule of law.&nbsp;<\/p><\/span><\/span><\/span>",
    "estimatedClassWorkload": "2-5 hours\/week",
    "recommendedBackground": "No background is required; all are welcome!",
    "links": {

    }
}