{"id":1508,"shortName":"ntuecom","name":"Foundations of E-Commerce ","language":"en","shortDescription":"The aim of this course is to understand issues that companies need to address when moving from being offline to online and learn how companies can craft business models where IT is embedded as an integral part of products, processes and customer interactions. You would get to appreciate how IT is changing the way companies create value through networks and coopetition.","aboutTheCourse":"<p>This\nis a course about the fundamentals of the online\/digital world.&nbsp; It’s aim to provide a set of concepts and\ntools with which to view online developments.&nbsp;\nThese concepts are the language and the vocabulary which can explain and\nalso predict how technology impacts different industries.<\/p><p>The\ncourse is not an overview of EC or IT developments but rather ways in which we\ncan make sense of EC and IT developments.&nbsp;\nThus, the emphasis is not on the “what” but on the “why.”<\/p><p>In\nthe first 5 weeks, different concepts and their significance are explained. &nbsp;The role of these concepts in explaining the\nsuccess of dominant, marquee companies is also discussed.<\/p><p>\n\n\n\n\n\n<\/p><p>In\nthe 6th and final week, participants observe how these concepts apply\nto different contexts.&nbsp; These contexts\nare case studies of multiple companies. Actual class discussions are shown to\nillustrate how the concepts can be used to understand and predict IT-driven\ntransformations.<\/p><p><\/p>","targetAudience":3,"courseSyllabus":"<p><strong>Topic 1: Digital Business Models - Opportunities and Challenges<\/strong><\/p>\n<strong>Week 1 -&nbsp; Market Friction<br><\/strong>\n<p><\/p>\n<ul><li>When and how do digital business models add value?&nbsp;<br><\/li>\n<li>What are the pain points that can be eliminated going digital?<\/li><li>What is the best way to analyze an industry to understand opportunities for IT-driven solutions?<\/li><li>What are some major challenges that existing Bricks-and-Mortar (BAM) companies face when they move online?<\/li><li>How can they cope with these challenges to compete with pure-play competitors?&nbsp;<br><\/li>\n<li>How will competition unfold between pure-play and BAM companies in future?&nbsp;<\/li><\/ul>\n<p><\/p>\n\n<p><br><\/p>\n<p><strong>Topic 2: Strategies for Disrupting Industries and Markets<\/strong><\/p>\n<strong>Week 2 -&nbsp; Disruptive Technologies<br><\/strong>\n<p><\/p>\n<ul><li>How are new entrants compete with incumbents and existing players who have long dominated an industry?<\/li><li>What are the blind spots that new entrants can exploit?<\/li><li>What kinds of new innovations have a tendency to displace existing products and services?<\/li><li>Why is it that incumbents fall prey to new innovations?<\/li><li>What can they do to ensure sustainability?<\/li><li>Faced with new innovations, what strategies should incumbents deploy?<br><\/li>\n<li>Overall, what are some technology-based strategies to disrupt existing industries and counter-strategies combat them?<br><\/li><\/ul>\n<p><\/p>\n\n<p><br><\/p>\n<p><strong>Topic 3: Architectures - A New Source of Competitive Advantage<\/strong><\/p>\n<strong>Week 3 - Online Architectures<br><\/strong>\n<p><\/p>\n<ul><li>What advantages do technology architectures provide and why does infrastructure make a difference in the online world (especially when the latter is considered akin to a utility)?<\/li><li>What are some companies whose enduring basis of competitive advantage is technology architecture?<\/li><li>Why are such advantages enduring?<br><\/li><li>What second- and higher-order benefits do the underlying architecture enable?<\/li><\/ul>\n<p><\/p>\n\n<p><br><\/p>\n<p><strong>Topic 4: Networks and their Dynamics<\/strong><\/p>\n<strong>Week 4 -&nbsp; Network Effects<br><\/strong>\n<p><\/p>\n<ul><li>Why is it that most online contexts seem to be characterized by a winner-takes-all dynamics?<br><\/li><li>Why do online companies scale and grow so fast?<\/li><li>How is the value of a network-based business different from a traditional company?<\/li><li>how can traditional companies become more like networks?<\/li><li>How can they morph from being product-based to networks to platforms?<\/li><\/ul>\n<p><\/p>\n\n<p><br><\/p>\n<p><strong>Topic 5: Democratization of Everything<\/strong><\/p>\n<strong>Week 5 -&nbsp;Social Media<\/strong><strong><br><\/strong>\n<p><\/p>\n<ul><li>How do we understand the phenomenon of democratization in which the crowds are challenging established institutional structures?<br><\/li><li>When can crowds be a sustainable and transformation force?<\/li><li>What can companies do to tap this emerging social resource?<\/li><li>While social media and its power are well-known, what lessons can we learn from it to understand the broader notion of social transformation?<\/li><\/ul>\n<p><\/p>\n\n<p><br><\/p>\n<p><strong>Topic 6: Interpretive and Predictive Power of Concepts<\/strong><\/p>\n<strong>Week 6 -&nbsp;Application of Concepts<br><\/strong>\n<p><\/p>\n<ul><li>Application of the various concepts and tools studied to different industries and companies - case studies<\/li><li>Appreciate how the concepts capture the competitive dynamics of an industry and explain the competitive jockeying taking place both currently and in the past&nbsp;<br><\/li><\/ul>\n<p><\/p>","courseFormat":"<p>The class will consist of:<\/p>\n\n<p><\/p><ul><li>Lecture videos of about 8-30 minutes in length<br><br><\/li>\n<li>5 Reflections (20% of total grade)<br><br><\/li>\n<li>2 Open-Ended Assignments, involving Peer Assessment&nbsp;(40% of total assessment)<br><br><\/li>\n<li>1 Final Open-Ended Assignment, solely Instructor graded (40% of total\nassessment)<br><\/li><\/ul>","suggestedReadings":"","estimatedClassWorkload":"5-7 hours\/week","recommendedBackground":"<ul><li>No specific background required.<\/li><li>A general interest in technology and technology enabled business would be helpful.<\/li><\/ul>","links":{}}