{"id":940,"shortName":"warhol","name":"Warhol","language":"en","shortDescription":"An introduction to the life and work of Andy Warhol, one of the world’s most famous artists, through exploration of five thematic framings of his life and career: celebrity, sex, money, death and time.","aboutTheCourse":"<p>This course will\nintroduce you to the life and work of Andy Warhol, one of the world’s most\nfamous artists. It will:<\/p>\n\n<ul><li>Explore\nwhy Warhol has international standing both within and beyond the art establishment;\n<\/li><li>Examine\nhow artistic worth and value is constructed and attributed;<\/li><li>Interrogate\nsome of Warhol’s main thematic concerns and major creative innovations;<\/li><li>Position Warhol in relation to major artistic movements of the 20th\ncentury (Dada, minimalism, Pop Art, structuralism, etc).<\/li><\/ul>\n\n\n\nThis course has been\ndeveloped as part of the ARTIST ROOMS research partnership between the\nUniversity of Edinburgh, Tate, and the National Galleries of Scotland. It is delivered by staff and teaching assistants based in History of Art and the School of Design at Edinburgh College of Art.<br>\n\n\n\n<br><br><br>","targetAudience":0,"courseSyllabus":"<p><b>Week 1: Celebrity<\/b><\/p>\n\n<p>Subjects to\nbe explored will include:<\/p>\n\n<ul><li>Warhol’s early investment\nin stars and celebrities;<\/li><li>Warhol’s screenprints of\nstars, based on appropriated mass media images: Marilyn Monroe, Elvis Presley, Jackie Kennedy, etc.;<\/li><li>Warhol’s creation of his\nown group of ‘superstars’, especially through his filmmaking activities;<\/li><li>Warhol’s move from the\nsubcultural scene in the 1960s to mainstream celebrity circles in the 1980s.<\/li><\/ul>\n\n<p><b><br><\/b><\/p><p><b>Week 2: Sex<\/b><\/p><p>Subjects to\nbe explored will include:<\/p><ul><li>The common misconception of\nWarhol as an asexual machine;<\/li><li><span>The regular appearance of\nhomoerotic imagery throughout Warhol’s work: line drawings of boys; ‘tease’ content of films such as <i>My Hustler<\/i> and <i>Blow Job<\/i>;<\/span><\/li><li><span>Coded sexual content in\nseemingly banal material (e.g., the World’s Fair mural <i>Thirteen Most Wanted Men<\/i>);<\/span><\/li><li>Warhol and censorship.<\/li><\/ul>\n\n<p><b>&nbsp;<\/b><\/p>\n\n<p><b>Week 3: Money<\/b><\/p>\n\n<p>&nbsp;Subjects to be explored will include:<\/p>\n\n<ul><li>The value of Warhol’s art in the market;<\/li><li>Warhol’s drawings and paintings of money, including dollar bills and the dollar sign;<\/li><li>Warhol’s successful career as a commercial artist;<\/li><li>Warhol’s own arguments about 'business art'.<\/li><\/ul>\n\n\n\n<p><b>&nbsp;<\/b><\/p>\n\n<p><b>Week 4: Death<\/b><\/p>\n\n<p>Subjects to be explored will include:<\/p>\n\n<ul><li>The <i>Death\nand Disaster<\/i> series of screenprints;<\/li><li>Valerie Solanas’ attempted assassination of\nWarhol in 1968, and the impact this had on his work;<\/li><li>Echoes of mortality in Warhol’s later works,\nincluding screenprints of guns and skulls, self-portraits with skulls, etc;<\/li><li>Arguments by Thomas Crow (‘Saturday Disasters’)\nand Stephen Koch (<i>Stargazer<\/i>) about\nthe centrality of death in Warhol’s work.\n\n<\/li><\/ul><p><b>&nbsp;<\/b><\/p>\n\n<p><b>Week 5: Time<\/b><\/p>\n\n<p>Subjects to be explored will include:<\/p>\n\n<ul><li>The lasting status of Warhol’s most iconic\nworks;<\/li><li>Stillness and slowness in some of Warhol’s films\nand photographs, such as <em>Empire<\/em> and the <em>Screen Tests<\/em> series;<\/li><li>Warhol’s Time Capsules;<\/li><li>Repetition and boredom as central tropes in\nWarhol’s work.<\/li><\/ul>\n\n\n\n\n\n<br>","courseFormat":"This course will be delivered in five thematic blocks of\nmaterial, which allow distinct framings of Warhol’s life, career, and work. The\nfive themes are celebrity, sex, money, death and time.<br><br>Each week you will be provided with a number of new learning resources, including short videos, audio interviews and reading extracts. Video interviews with experts will provide insights into working with Andy Warhol's estate and archive. All of these resources will provide the basis for discussion in the course forums. Additional useful materials will be linked to using the course Twitter account (<a href=\"https:\/\/twitter.com\/warholmooc\" target=\"_blank\" title=\"Link: https:\/\/twitter.com\/warholmooc\">@warholmooc<\/a>).<br><br>The course assessment has four components: a practical assignment (which can be done using either analogue or digital materials and methods), a written assignment, a quiz, and contributions to the course forums. Other activities - for fun, not for assessment - will be included in the course content as it unfolds.<br><br>","suggestedReadings":"There is no set text for this course, but recommendations will be made each week that relate to the theme being explored.<br><br>For those new to studying Warhol, Wayne Koestenbaum's biography <a href=\"http:\/\/www.amazon.com\/Warhol-Penguin-Lives-Wayne-Koestenbaum\/dp\/0670030007\" target=\"_blank\" title=\"Link: http:\/\/www.amazon.com\/Warhol-Penguin-Lives-Wayne-Koestenbaum\/dp\/0670030007\">Andy Warhol<\/a> provides a thorough introduction to the artist. For those interested in Warhol's films, the introduction to Glyn Davis and Gary Needham's <a href=\"http:\/\/www.palgrave.com\/products\/title.aspx?pid=476866\" target=\"_blank\" title=\"Link: http:\/\/www.palgrave.com\/products\/title.aspx?pid=476866\">Warhol in Ten Takes<\/a> provides a comprehensive overview of this aspect of his career and output. Bradford R. Collins' book <a href=\"http:\/\/uk.phaidon.com\/store\/art\/pop-art-9780714862439\/\" target=\"_blank\">Pop Art<\/a> offers a detailed survey of the art movement.<br>","estimatedClassWorkload":"2-3 hours\/week","recommendedBackground":"No background required.<br><br>","links":{}}