{"id":110,"shortName":"equinenutrition","name":"Equine Nutrition","language":"en","shortDescription":"This course will cover many aspects of equine nutrition ranging from anatomy and physiology of the gastrointestinal tract to dietary management of horses\/ponies affected with nutrition-related disorders. \n\n\nThis is course is designed for self-directed study with minimal tutor input, and as such emphasis is placed upon peer discussions of the topics presented in each section of the course.  This course is not designed to have a large amount of tutor input as this is an open access course that attracts tens of thousands of participants.  However, tutors will endeavour to answer the main queries relating to the understanding of the lecture materials and to provide a summary of the key questions raised in each of the weekly topics and clarification of any misunderstandings. ","aboutTheCourse":"This course is designed to provide knowledge of equine digestion and nutrition for those with an interest in this area. The anatomy and physiology of the equine alimentary canal will be studied to provide students with an understanding of the equine digestive system.  Nutrient sources for horses will be discussed, with emphasis placed on the health and welfare issues surrounding the inclusion of various types of feedstuffs in equine diets.  Students will also discuss recommendations on rations for horses and ponies performing various activities and should feel better equipped to make judgements on rations for horses and ponies, in health and disease.","targetAudience":0,"courseSyllabus":"<b>Week 1: Anatomy and physiology of the equine gastrointestinal tract<\/b><br> The expectation is that the course participants will come from varied backgrounds in relation to their previous experience of gastrointestinal tract anatomy and physiology.  Consequently, this course begins with consideration of digestive anatomy and physiology in equids and will consider nutrient digestion in the various segments of the equine gastrointestinal tract. <br><br> <b>Week 2: Feed Composition<\/b><br> The learning materials during this period will focus on the composition of feedstuffs for horses and the factors that affect the composition of feedstuffs.  There will also be information on how feedstuffs are evaluated.  Discussion should focus on how the composition of feedstuffs affects their digestibility.  <br><br> <b>Week 3: Equine nutrient sources <\/b><br> This part of the course will consider various nutrient sources for equids. Various feedstuffs that are used in equine diets will be discussed, with emphasis placed on the health and welfare issues surrounding the inclusion of these in equine diets. <br><br> <b>Week 4: Equine dietary management<\/b><br> This week of the course will explore the dietary management of equids.  Discussions should focus around considering how modern feeding practices do not always consider the anatomy and physiology of the equine digestive tract. <br><br> <b>Week 5: Equine clinical nutrition<\/b><br> This part of the course will focus on feeding strategies for the management and prevention of some nutrition-related diseases\/disorders in equids; for example, obesity, laminitis, older horses with dental issues etc. Discussions should focus on the dietary management of individuals affected with nutrition-related problems.","courseFormat":"<div>The course will consist of 5 weeks of video lectures of approximately 1 hour in total (broken down into videos of between 10 and 20 minutes in length).  There will also be supporting notes and additional readings provided.   There will be quiz questions throughout the course to test your knowledge and understanding of the learning materials along with optional quiz assessments, should you wish to complete these.<\/div>\n<div><\/div>","suggestedReadings":"<div>Although the course is designed to be self-contained, students who are looking to expand their knowledge beyond what is covered in the course will find further information in the following texts:<\/div>\n<div><\/div>\n<div>• FRAPE D. 2010. <a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&amp;AFID=301076&amp;ADID=1088031&amp;SID=equinenutrition&amp;isbn_ean=9781405195461\">Equine Nutrition and Feeding<\/a><img width=\"1\" src=\"http:\/\/www.assoc-amazon.com\/e\/ir?t=coursera-20&amp;l=as2&amp;o=1&amp;a=1405195460\" height=\"1\" style=\"border: none !important; margin: 0px !important;\"> Longman Scientific, UK.<\/div>\n<div>• ELLIS, A.D. and Hill, J. 2005. <a href=\"http:\/\/www.amazon.com\/gp\/product\/1897676468\/ref=as_li_tf_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=1897676468&amp;linkCode=as2&amp;tag=coursera-20\">Nutritional Physiology of the Horse<\/a><img width=\"1\" src=\"http:\/\/www.assoc-amazon.com\/e\/ir?t=coursera-20&amp;l=as2&amp;o=1&amp;a=1897676468\" height=\"1\" style=\"border: none !important; margin: 0px !important;\"> Nottingham University Press, Nottingham, UK.&nbsp;<\/div>\n<div>• LEWIS, L.D. 1995. <a href=\"http:\/\/www.amazon.com\/gp\/product\/0683049623\/ref=as_li_tf_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=0683049623&amp;linkCode=as2&amp;tag=coursera-20\">Equine Clinical Nutrition: Feedings and Care<\/a><img width=\"1\" src=\"http:\/\/www.assoc-amazon.com\/e\/ir?t=coursera-20&amp;l=as2&amp;o=1&amp;a=0683049623\" height=\"1\" style=\"border: none !important; margin: 0px !important;\"> &nbsp;Williams and Wilkins, USA<\/div>\n<div>• NATIONAL RESEARCH COUNCIL 2007. <a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&amp;AFID=301076&amp;ADID=1088031&amp;SID=equinenutrition&amp;isbn_ean=9780309102124\">Nutrient Requirements of Horses: Sixth Revised Edition (Animal Nutrition Series)<\/a><img width=\"1\" src=\"http:\/\/www.assoc-amazon.com\/e\/ir?t=coursera-20&amp;l=as2&amp;o=1&amp;a=030910212X\" height=\"1\" style=\"border: none !important; margin: 0px !important;\"> The National Academies Press, Washington, USA.<br><br>For most recent but advanced level Information we recommend:&nbsp;<br>Geor, R., Harris, P. And Coenen M. (Eds.) 2013. <a href=\"http:\/\/www.amazon.co.uk\/Equine-Applied-Clinical-Nutrition-Performance\/dp\/0702034223\" target=\"_blank\">Equine Applied and Clinical Nutrition<\/a>, Saunders, Elsevier<br><\/div>\n<div><\/div>","instructor":"Jo-Anne Murray","estimatedClassWorkload":"3-4 hours\/week","recommendedBackground":"No background in equine nutrition is required.&nbsp; <br>","links":{}}