{
    "id": 41,
    "shortName": "fantasysf",
    "name": "Fantasy and Science Fiction: The Human Mind, Our Modern World",
    "language": "en",
    "shortDescription": "We understand the world — and our selves — through stories. Then some of those hopes and fears become the world.\n\n",
    "aboutTheCourse": "Fantasy is a key term both in psychology and in the art and artifice of\nhumanity. The things we make, including our stories, reflect, serve, and\noften shape our needs and desires. We see this everywhere from fairy tale\nto kiddie lit to myth; from \"Cinderella\" to <i>Alice in Wonderland <\/i>to <i>Superman<\/i>;\nfrom building a fort as a child to building ideal, planned cities as whole\nsocieties. Fantasy in ways both entertaining and practical serves our persistent\nneeds and desires and illuminates the human mind. Fantasy expresses itself\nin many ways, from the comfort we feel in the godlike powers of a fairy\ngodmother to the seductive unease we feel confronting Dracula. From a practical\nviewpoint, of all the fictional forms that fantasy takes, science fiction,\nfrom <i>Frankenstein<\/i> to <i>Avatar<\/i>, is the most important in our modern\nworld because it is the only kind that explicitly recognizes the profound\nways in which science and technology, those key products of the human mind,\nshape not only our world but our very hopes and fears. This course will\nexplore Fantasy in general and Science Fiction in specific both as art\nand as insights into ourselves and our world.\n<br>\n<br>\n\n<h2>Work Expectations<\/h2>\nFor further information about the coursework, please see the <a href=\"http:\/\/spark-public.s3.amazonaws.com\/fantasysf\/Documents\/WorkExpectations.html\"> Work Expectations<\/a> page.",
    "targetAudience": 1,
    "courseSyllabus": "This course comprises ten units. Each will include a significant reading, typically a novel or a selection of shorter works. I will offer video discussions of each of the readings and also of more general topics in art and psychology that those readings help illuminate. Each unit will include online quizzes and ask you to write a brief essay offering your own insights into the reading. In order, the units are:<ol>\n<li>Grimm — <i>Children's and Household Tales<\/i><\/li>\n<li>Carroll — <i>Alice's Adventures in Wonderland<\/i> and <i>Through the Looking-Glass<\/i><\/li>\n<li>Stoker — <i>Dracula<\/i><\/li>\n<li>Shelley — <i>Frankenstein<\/i><\/li>\n<li>Hawthorne & Poe — Stories and Poems<\/li>\n<li>Wells — <i>The Island of Dr. Moreau<\/i>, <i>The Invisible Man<\/i>, \"The Country of the Blind,\" \"The Star\"<\/li>\n<li>Burroughs & Gilman — <i>A Princess of Mars<\/i> & <i>Herland<\/i><\/li>\n<li>Bradbury — <i>The Martian Chronicles<\/i><\/li>\n<li>LeGuin — <i>The Left Hand of Darkness<\/i><\/li>\n<li>Doctorow — <i>Little Brother<\/i><\/li>\n<\/ol>\n<p>In Unit I, the specific stories are the ones in the Lucy Crane translation (1886) which was published by Dover and is available online through Project Gutenberg. In Unit V, the specific readings are: Hawthorne's \"The Birthmark,\" \"Rappaccini's Daughter,\" \"Dr. Heidegger's Experiment,\" and \"The Artist of the Beautiful\"; Poe's \"The Fall of the House of Usher,\" \"The Tell-Tale Heart,\" \"The Black Cat,\" \"The Oval Portrait,\" \"The Facts in the Case of M. Valdemar,\" \"The Bells,\" \"The Raven,\" \"Annabel Lee.\" All the readings except Ray Bradbury's <i>The Martian Chronicles<\/i> and Ursula K. LeGuin's <i>The Left Hand of Darkness<\/i> will be available online at no charge.<\/p>",
    "estimatedClassWorkload": "8-12 hours\/week",
    "recommendedBackground": "There are no prerequisites for this course.  However, the course\nwill be conducted at the level expected of advanced undergraduate students.\n Therefore, for all participants, reading comfortably in English at\nthe undergraduate college level is desirable.  For those also participating\nin the writing and written responses, which is recommended, some experience\nin writing about literature is desirable. (<a href=\"https:\/\/s3.amazonaws.com\/spark-public\/fantasysf\/Documents\/ReadingWritinginTranslation.html\" target=\"_blank\">A Note on Reading in Translation.<\/a>)",
    "links": {

    }
}