{"id":1299,"shortName":"rprog","name":"R Programming","language":"en","shortDescription":"Learn how to program in R and how to use R for effective data analysis. This is the second course in the Johns Hopkins Data Science Specialization.","aboutTheCourse":"In this course you will learn how to program in R and how to use R for effective data analysis.&nbsp;You will learn how to install and configure software necessary for a statistical programming environment and describe generic programming language concepts as they are implemented in a high-level statistical language. The course covers practical issues in statistical computing which includes programming in R, reading data into R, accessing R packages, writing R functions, debugging, profiling R code, and organizing and commenting R code. Topics in statistical data analysis will provide working examples.<br>","targetAudience":1,"courseSyllabus":"<p>The course will cover the following material each week:<\/p>\n\n<ul><li><p>Week 1: Overview of R, R data types and objects, reading and writing data<\/p><\/li><li><p>Week 2: Control structures, functions, scoping rules, dates and times<\/p><\/li><li><p>Week 3: Loop functions, debugging tools<\/p><\/li><li><p>Week 4: Simulation, code profiling<\/p><\/li><\/ul>","courseFormat":"There will be weekly lecture videos, quizzes, and programming assignments.&nbsp;<div><br><div>As part of this class you will be required to set up a <a href=\"https:\/\/github.com\" target=\"_blank\">GitHub account<\/a>. GitHub is a tool for collaborative code sharing and editing. During this course and other courses in the Specialization you will be submitting links to files you publicly place in your GitHub account as part of peer evaluation. If you are concerned about preserving your anonymity you will need to set up an anonymous GitHub account and be careful not to include any information you do not want made available to peer evaluators.<\/div><\/div><div><br><\/div>","suggestedReadings":"The e-book <i><a href=\"http:\/\/bit.ly\/rprogrammingcoursera\" target=\"_blank\">R Programming for Data Science<\/a><\/i> covers all of the material presented in this course. It is available for download from Leanpub.","estimatedClassWorkload":"7-9 hours\/week","recommendedBackground":"Some familiarity with programming concepts will be useful as well basic knowledge of statistical reasoning; <a href=\"https:\/\/www.coursera.org\/course\/datascitoolbox\" target=\"_blank\">Data Scientist's Toolbox<\/a>","links":{}}