{"id":1153,"shortName":"unethicaldecision","name":"Unethical Decision Making in Organizations","language":"en","shortDescription":"This course 'Unethical decision making in organizations : A seminar on the dark side of the force' will teach you how strong organizational contexts push good people towards unethical decisions. You will also learn how to protect yourself and your organization against such forces lurking in the dark.","aboutTheCourse":"This course teaches how narrow frames and strong contexts can push good people towards unethical decisions and how they can protect themselves and their organization against ethical blindness. <br><br>The goal of this course is to empower the participants to analyze the risks of unethical or illegal behavior that might be triggered by powerful contexts. It draws from various disciplines such as management, psychology, sociology, philosophy, and literature, in order to learn what these disciplines contribute to a better understanding of unethical behavior. The course also analyzes some of the most prominent organizational scandals of the recent decades through the lenses of these disciplines.<br><br>Whenever we hear about ethical scandals, we tend to believe that unethical or illegal behaviour in organizations is driven by character deficiencies of individual actors. Put differently, we simply assume that bad things are done by bad people. However, numerous corporate scandals have demonstrated that even people with a high level of integrity can break the rules if they are put into a strong context. <br><br>A better understanding of why and under what conditions good people make bad ethical decisions will enable us to better protect individuals as well as their respective organizations against the potentially overwhelming power of the context. It will also enable us to cure societies from problems like corruption. <br><br>At the end of the course, the participants are able to:<br><br>- Explain the impact of social context on individual decision making using various theories (Management, Sociology, Psychology, and Philosophy)<br>- Apply these theories to the analysis of some of the most prominent organizational scandals of the recent decades<br>- Assess ethical risks in their own organizational context<br>- Design interventions to reduce such risks for themselves and their organization<br><br>","targetAudience":1,"courseSyllabus":"Broad outline of the topics covered in the seminar:<br><ol><li>&nbsp;Introduction to ethical and unethical decision making<\/li><li>&nbsp;Introduction to unethical decisions in organizations<\/li><li>&nbsp;The power of frames: How people construct their reality<\/li><li>&nbsp;The power of routines<\/li><li>&nbsp;The power of strong situations<\/li><li>&nbsp;The power of institutions<\/li><li>&nbsp;The wind of change: How to fight ethical blindness<\/li><\/ol><br><br>","courseFormat":"The course will consist of video lectures (with and without interactive quiz questions), live discussions combining live webcast and Twitter, and discussion forums in which students will discuss questions related to the course. Students are encouraged to provide their own stories and experiences with regards to unethical organizational decisions. A selection of those stories and experiences will be discussed by the two teachers in weekly reflections on course progress. <br><br>The final grade will be based on the students’ performance on weekly homework assignments, which will include essays in which the students reflect upon the ideas presented in the course, for instance, by relating these ideas to their own context.<br>","suggestedReadings":"All the material will be provided electronically (and free of charge) at the beginning of the course.","estimatedClassWorkload":"2-5 hours\/week","recommendedBackground":"No background expertise is required. The course is open for interested layperson as well as experts who work on related topics, be it as researchers or practitioners (e.g., compliance managers in corporations).<br>","links":{}}