{"id":3554,"shortName":"whartonaccountinges","name":"Introducción a la Contabilidad Financiera","language":"es","shortDescription":"Domina las habilidades técnicas necesarias para analizar estados financieros y declaraciones. Después podrás aplicar estas habilidades a un reto empresarial del mundo real como parte de la Programa Especializado de Fundamentos Empresariales de Wharton.","aboutTheCourse":"<p><strong>PARTE DE LA&nbsp;PROGRAMA ESPECIALIZADO&nbsp;DE<\/strong><strong> FUNDAMENTOS EMPRESARIALES DE WHARTON<\/strong><\/p><p> <a href=\"http:\/\/youtu.be\/Y1UlXveNj_g\">Aquí<\/a> podrás ver como Geoffrey Garrett, Decano de la Wharton School, habla sobre la Programa Especializado.<\/p><p dir=\"ltr\">La contabilidad es el lenguaje de los negocios. Aprender este lenguaje es fundamental para cualquiera que tenga que tomar decisiones basándose en información financiera. En este curso, los estudiantes desarrollarán las habilidades &nbsp;técnicas necesarias para analizar estados financieros y declaraciones, y aprenderán cómo las normas de contabilidad y los incentivos de gestión afectan al proceso de emisión de información financiera. El curso se centra en entender cómo los acontecimientos financieros tales como las actividades operativas, las inversiones corporativas y las transacciones financieras se registran en los tres estados financieros principales (el estado de resultados, el balance financiero y el estado de flujos de efectivo).<\/p><p dir=\"ltr\">Completa este curso como parte de la Programa Especializado de Fundamentos Empresariales de Wharton, y tendrás la oportunidad de realizar el Proyecto Final y de preparar un análisis estratégico y proponer una solución a un reto empresarial real de compañías dirigidas por Wharton, como Televisa o a un reto al que se enfrente tu propia compañía u organización. El personal capacitado de Wharton evaluará las mejores tareas, y los equipos directivos de Televisa revisarán los proyectos preparados para sus compañías con las puntuaciones más altas.<\/p><p dir=\"ltr\">Para aprender más sobre la Serie de Fundamentos de Wharton en Coursera puedes ver este vídeo:<\/p><p dir=\"ltr\"><a href=\"http:\/\/www.youtube.com\/watch?v=SgS3AJCe6i8\">http:\/\/www.youtube.com\/watch?v=SgS3AJCe6i8<\/a><\/p><p dir=\"ltr\">Para más información sobre los cursos online que ofrece Wharton, puedes visitar<\/p><p><a href=\"http:\/\/online.wharton.upenn.edu\/\">online.wharton.upenn.edu<\/a><\/p>","targetAudience":1,"courseSyllabus":"<p dir=\"ltr\">Entre los temas principales encontramos:<\/p><ul><li><p dir=\"ltr\">Introducción al Balance Financiero<\/p><\/li><li><p dir=\"ltr\">Contabilidad de Ejercicio y el Estado de Resultados<\/p><\/li><li><p dir=\"ltr\">Flujos de Efectivo<\/p><\/li><li>Análisis de Ratios<\/li><\/ul>","courseFormat":"Este curso es una combinación de vídeo lecciones, cuestionarios y debates.","suggestedReadings":"<span><p dir=\"ltr\">El curso está diseñado para ser autónomo. Los estudiantes que quieran ampliar sus conocimientos, más allá de lo que se cubre en este curso, o que quieran más problemas prácticos o explicaciones más en profundidad pueden consultar cualquier &nbsp;libro de texto de Introducción a la Contabilidad Financiera orientado a estudiantes de MBA. Y como el material del curso no ha sido casi modificado durante los últimos años, se puede usar cualquier edición anterior de libros de texto.<\/p><div><br><\/div><\/span>","estimatedClassWorkload":"6-8 hours\/week","recommendedBackground":"<span><p dir=\"ltr\">El curso está recomendado para estudiantes con poco o ningún conocimiento previo en contabilidad financiera, que quieren mejorar sus conocimientos sobre la materia. No se necesitan prerrequisitos académicos para el curso. Aunque trabajaremos con números, el único conocimiento sobre matemáticas que se requiere es la suma, resta, multiplicación y división.<\/p><div><br><\/div><\/span>","links":{}}