{"id":914,"shortName":"microcontroleurs","name":"Comprendre les Microcontrôleurs","language":"fr","shortDescription":"Ce cours donne les bases théoriques et pratiques nécessaires à une bonne compréhension et utilisation des microcontrôleurs. De nombreux exemples seront abordés. Des exercices seront proposés, compatibles avec les cartes à microcontrôleurs Arduino ou LaunchPad MSP430G.","aboutTheCourse":"Les microcontrôleurs sont devenus assez simples à mettre en\noeuvre, grâce en particulier à des environnements de développement comme\nl'Arduino. Mais seule une compréhension en profondeur permet de tirer parti au\nmaximum de leur potentiel dans de nombreuses applications, tant dans le cadre\nd'un hobby que dans un cadre industriel. <br><br>","targetAudience":0,"courseSyllabus":"<ol><\/ol>\n\n<ul><li>Rappel d'électricité et électronique<\/li><li>Systèmes logiques et architecture<\/li><li>Machines binaires<\/li><li>Programmation en C<\/li><li>Entrées-sorties<\/li><li>Applications<\/li><li>Mise au point <\/li><li>Timers, interruptions<\/li><li>Signaux analogiques<\/li><li>Affichages<\/li><li>Communications<\/li><li>\n\nRobotique <\/li><\/ul>","courseFormat":"Chaque semaine, 5 ou 6 vidéos de 10 à 20 minutes seront mises en ligne. \nDes exercices&nbsp; seront proposés, avec leur corrigés. Des évaluations \nhebdomadaire, comportant des question sur le cours et des exercices de \nprogrammation, permettront de totaliser les points qui donneront droit à \nune attestation (70%) et même une mention (90%).\n<br>Pour pouvoir être corrigés automatiquement, les exercices de \nprogrammation devront respecter les contraintes matérielles des cartes \nArduino ou LaunchPad MSP430G. Nous encourageons les étudiants à en avoir \npour faire de la pratique : elles sont peu coûteuses et faciles à se \nprocurer. Des informations seront données par \ne-mail aux participants. Des points de vente seront organisés dans plusieurs villes \nd'Afrique francophone, dont Abidjan, Cotonou, Ouagadougou, Lomé, Douala, \nYaoundé, Brazzaville et Kinshasa.\n<br><br>","suggestedReadings":"<a href=\"http:\/\/fr.wikipedia.org\/wiki\/Microcontroleur\">http:\/\/fr.wikipedia.org\/wiki\/Microcontroleur<\/a> <br><a href=\"http:\/\/www.epsitec.ch\/dauphin\/\">http:\/\/www.epsitec.ch\/dauphin\/<\/a><br><br><br>","estimatedClassWorkload":"4-7 hours\/week","recommendedBackground":"<p>Quelques notions en électronique générale, systèmes logiques et \nmicroprocesseurs sont utile pour suivre le cours, mais ne sont pas \nindispensable. Un rappel de ces connaissances sera donné durant la \npremière semaine, sans toutefois avoir la prétention de mettre à niveau \nun débutant. <br>Concernant la programmation, le fait d'avoir pratiqué un langage de \nprogrammation facilitera l'apprentissage. Ceux qui n'ont pas cette \nexpérience devront passer davantage de temps et progresseront grâce aux \nexercices qui seront proposés.<br><\/p>","links":{}}