{"id":882,"shortName":"behaviorprinciples","name":"Applying Principles of Behavior in the K-12 Classroom","language":"en","shortDescription":"In this class you will learn how to conduct a functional behavior assessment (FBA) and apply principles of behavior in the public school classroom in order to promote positive classroom behavior and intervene effectively when faced with challenging behavior.  ","aboutTheCourse":"<p>\nTeachers\nin the classroom today have to be equipped with a variety of tools.  Not only do they need to have subject\nknowledge and the ability to effectively teach, they must also have excellent\nclassroom management skills.  When challenging\nbehavior in the classroom becomes a barrier to instruction, teachers who\nunderstand the fundamental principles behind functional behavior assessment\n(FBA) are prepared to address the behavior before it becomes so disruptive\nadditional resources outside the classroom are needed.   Have you ever had a student who is constantly talking out, getting out of his seat, and disturbing his classmates while you are trying to teach?  No matter how many times you say something to him the behavior persists or gets worse?    You continually ask yourself… Why does David do that?\nIn this course you will learn\nhow to determine “Why?” a student engages in challenging behavior and develop\ninterventions that promote positive behaviors, replacing challenging\nbehavior. <\/p><p>\n\n<\/p>\n\n<p>Whether teaching in a general education or special education setting, the key to\neffective behavior intervention is the functional behavior assessment.   There are various forms of the functional behavior assessment.  We will focus on how teachers can use the direct method of functional behavior assessment as part of their classroom routine.  In this\ncourse you will learn how to conduct an FBA.  You will learn how to analyze the FBA to determine the antecedents that set the stage for challenging behavior, and determine the function of the behavior. You will also be able to use what you learn about principles of\nreinforcement,  to create a function based intervention addressing the antecedents, consequences and promoting replacement behaviors.   What you learn in\nthis course will help you intervene with challenging behaviors in\nyour classroom before they escalate into behaviors that require involvement of additional\nschool faculty and staff beyond your classroom. \n<\/p>","targetAudience":1,"courseSyllabus":"Week One:  Introduction to Principles of Reinforcement and Punishment including an overview of concepts surrounding positive and negative reinforcement to increase or maintain behavior and punishment to decrease behavior.  \n\n<br><br>Week Two:  Foundations of Functional Behavior Assessment includes a discussion on what constitutes functions of behavior and an introduction to the direct method of functional behavior assessment.\n\n<br><br>Week Three:&nbsp; Conducting and Analyzing&nbsp;the Functional Behavior Assessment where you will&nbsp;learn&nbsp;how to conduct your own functional behavior assessment&nbsp;and analyze the results.<br><br>Week Four:&nbsp; Developing Function Based Intervention Methods includes a discussion of how changes to antecedents and consequences&nbsp;of challenging behavior can be made and how to reinforce replacement behaviors.","courseFormat":"The course consists of video lectures, readings, quizzes and discussions.","suggestedReadings":"Readings will come from open source websites and articles freely available on the internet.","estimatedClassWorkload":"2-4 hours\/week","recommendedBackground":"Experience working in a PreK-12 classroom.","links":{}}