{
    "id": 1578,
    "shortName": "ghresponder",
    "name": "Foundations for Global Health Responders",
    "language": "en",
    "shortDescription": "As the world grows more socially and economically interdependent, Global Health has developed from an ethical dimension to an issue that now dominates global security. A diverse team of experts has designed an introductory course to give you a primer of the field and a dazzling view of one of the emerging disciplines of the 21st century.  \n\nThis course also serves as a prerequisite to the hands-on 'Global Health Responder' certification from the CU School of Medicine.",
    "aboutTheCourse": "<p><span>This course is a <strong>global health primer<\/strong><\/span>&nbsp;for people who seek the knowledge\nand skills needed to effectively participate in global health\nventures. &nbsp;It is designed for all-comers:&nbsp;aspiring engineers, NGO and nonprofit&nbsp;workers,&nbsp;agricultural scientists, people interested in the effects of climate change,&nbsp;university students and faculty,&nbsp;government officials, as well as those&nbsp;providing direct patient care.<\/p><p>Global health workers and volunteers are often exposed to unfamiliar situations\nfor which they are unprepared. This course provides foundational knowledge on\nglobal health to better contextualize experiences, optimize self-reliance and situational awareness, and allow learners to be more effective in their work in\nlow- to middle-income countries. &nbsp;It also will provide basic competencies for organization or university members traveling abroad with a goal toward mitigating institutional risk.<\/p><p>We have harnessed world class experts to break down and clarify the complex interactions in the world of global health. They bring a wealth of knowledge and experience from the Harvard School of Public Health, Weill Cornell Medical College, the FXB Center for Health and Human Rights, the US Agency for International Development, the Centers for Disease Control and Prevention, and the University of Colorado.<\/p><p><br><\/p><p><u><strong>Additional certification<\/strong><\/u>: This course is a stand-alone introduction to global health, but also serves as the first step toward a more advanced certification. &nbsp;For those wishing to obtain additional hands-on skill sets, we invite you to participate in an in-person three day course offered throughout the world in 2015 to be certified as a <strong>Global Health Responder<\/strong>&nbsp;through the University of Colorado School of Medicine. &nbsp;<\/p><p>Because advanced first aid skills will be the core of this additional certification, this course will require in-person attendance&nbsp;and will be taught by CU medical school faculty, leaders in austere care medical education.&nbsp;Details, including dates and locations, can be found at the workshop website at&nbsp;<a href=\"http:\/\/coloradowm.org\/MOOCnation.html\">http:\/\/coloradowm.org\/MOOCnation.html<\/a>.<\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<u><br>Week One<\/u>: an introduction to <strong>global health concepts<\/strong> with a look at <strong>changing trends<\/strong> in the 21st century; urbanization, environmental stress and resource scarcity<br><br><u>Week Two<\/u>:&nbsp;<strong>global health security:<\/strong>&nbsp;food, water, energy, and the threats of a changing climate<br><br><u>Week Three<\/u>:&nbsp;the&nbsp;<strong>global burden of disease<\/strong>,<strong>&nbsp;<\/strong>infectious disease, the rise of non-communicable diseases, mental health, and access to care<br><br><u>Week Four<\/u>:&nbsp;<strong>stakeholders<\/strong> in global health: NGOs, governments, non-state actors; understanding where the money comes from, how it is allocated and the challenges of measuring results; <strong>human rights:&nbsp;<\/strong>what are they and how are they protected?<br><br><u>Week Five<\/u>:&nbsp;<strong>complex humanitarian emergencies:<\/strong>&nbsp;forced migrations, wars, response standards, and the&nbsp;<strong>legal basis<\/strong>&nbsp;for interventions<br><br><u>Week Six<\/u>:&nbsp;being an <strong>effective participant--caring for yourself:<\/strong>&nbsp;pre-travel preparation, understanding risks when traveling outside your home country, physiologic vulnerability<br><h2>Course Faculty<\/h2><p><span><b>Frederick \"Skip\" M. Burkle Jr., M.D., MPH, DTM, FAAP, FACEP&nbsp;<\/b>is a senior fellow and scientist with the Harvard Humanitarian \nInitiative and a Senior International Public Policy Scholar at the \nWoodrow Wilson Center for International Scholars in Washington, DC. He \nhas published over 200 scientific articles and book chapters. <\/span>Dr.\n Burkle served as the interim minister of health in Iraq and deputy assistant administrator for the Bureau of Global Health at the U.S. \nAgency for International Development (USAID). He is a member of the board of directors of the International Rescue Committee, serves on the Science \nAdvisory Board for the American Red Cross, as the elected chair of the \nNational Disaster life Support Consortium for the American Medical \nAssociation, and recipient of multiple awards including the&nbsp;William \nCrawford Gorgas Medal&nbsp;for distinguished work in preventative medicine<i>.<\/i><b><span><br><br>Satchit Balsari, M.D., MPH&nbsp;<\/span><\/b>is\n chief of the Global Emergency Medicine Division at Weill Cornell. He is\n an Assistant Professor and practicing emergency physician at New York Presbyterian Hospital (NYP). Dr. Balsari co-founded the iLAB@Cornell \nED, serves on Cornell University's Internationalization Council, and is \nfaculty at the FXB Center for Health and Human Rights and associate \nfaculty at the Harvard Humanitarian Initiative.<br><br><b>Stephen Berman, M.D., FAAP&nbsp;<\/b>is\n the Director of the Center of Global Health in the Colorado School of \nPublic Health. Dr. Berman is a past president of the American Academy of\n Pediatrics. He is a professor of pediatrics at the University of Colorado\n School of Medicine and School of Public Health and holds an endowed \nchair in Academic General Pediatrics at the Children's Hospital Colorado. He<span> has served as a special adviser to the World Health \nOrganization (WHO), the Pan American Health Organization (PAHO), and the \nUnited States Agency for International Development (USAID). He has also \nserved as a consultant to the Ministry of Health of several nations.<br><\/span><br><b>Tracy Cushing M.D., MPH, FACEP, FAWM&nbsp;<\/b>i<span>s\n the fellowship director for the Wilderness Medicine Fellowship at the \nUniversity of Colorado. She is the associate editor of&nbsp;Wilderness and \nEnvironmental Medicine, has been a contributor to Wilderness Medicine \nmagazine and co-editor of the seventh edition of Auerbach's Wilderness \nMedicine textbook. She is a member of Colorado's Disaster Medical \nAssistance Team (DMAT).<br><br><\/span><b>Christopher Davis, M.D., DTMH <\/b>is\n an emergency physician at the University of Colorado. He serves as the co-director for the&nbsp;Travel, Expedition and Altitude Medicine Clinic&nbsp;at \nthe University of Colorado and is also the assistant fellowship director\n for Wilderness Medicine. <br><\/p><p><b>Arlan Fuller, J.D., M.A.<\/b>&nbsp;is Executive Director of the FXB Center for Health and Human Rights at \nHarvard University and a research associate at the Harvard School of \nPublic Health. He was the legislative assistant for international \nrelations and trade policy to Congressman Sherrod Brown, at the time a \nsenior member of the House International Relations Committee. Mr. Fuller\n also worked for Senator Edward Kennedy, serving on the Senator’s \nHealth, Education, Labor and Pensions Committee staff.<\/p><p><b>Renee King M.D., MPH&nbsp;<\/b>is\n an emergency physician and Assistant Professor in emergency medicine at\n the University of Colorado School of Medicine. She has served as \ndirector for the global health track at University of Colorado School of\n Medicine as well as an executive board member for the CU Denver Center for \nGlobal Health. Her work has included projects in India, Thailand, \nGuatemala, Nicaragua, and Haiti.<\/p><p><b>Deborah Keyek-Franssen, Ph.D.,<\/b>&nbsp;is Associate Vice President for Digital Education and Engagement at the University of Colorado System Office. Deborah works with colleagues across the system to establish national leadership for CU in the areas of teaching and learning with technology, online education, massive open online courses (MOOCs), access to higher education, and student success. As a resource to the University of Colorado's campuses, and in collaborative support of their efforts, Deborah assists with the campuses' implementation of digital and online education solutions, including MOOCs and other teaching modalities and initiatives. From 2007-2013, Deborah served as the director of academic technology on the CU Boulder campus, where she oversaw strategic planning for the use, implementation, and evaluation of educational technologies, and the evaluation of emerging technologies for potential use in teaching and learning. She serves as the director of the Colorado Learning and Teaching with Technology (COLTT) Conference, and is a co-director of the Colorado Coalition for Gender &amp; IT, which undertakes research and develops programs to increase the number of girls, women, and underrepresented minorities in IT education and work. Deborah is a graduate of Dartmouth College and completed her Ph.D. in German Literature at the University of Michigan, where she also earned a master's degree in Higher Education Administration from the Center for the Study of Higher and Postsecondary Education, and a graduate certificate in Women's Studies.<br><\/p><p><b>Jay Lemery, M.D., FACEP, FAWM <\/b>is an Associate Professor and Chief of the \nSection of Wilderness and Environmental Medicine, and an emergency \nphysician at the University of Colorado School of Medicine. He is the past-President of the Wilderness Medical Society. He is a Consultant for the Climate and Health Program at the CDC and a Fellow of\n the FXB Center for Health and \nHuman Rights at the Harvard School of Public Health. He\n sits on the Institute of Medicine's Roundtable on Environmental Health \nSciences, Research, and Medicine and serves as a term member of the \nCouncil on Foreign Relations. <strong>Twitter:<\/strong> <strong>@JayLemery<\/strong><br><\/p><p><b>Nee-Kofi Mould-Millman, M.D., FACEP&nbsp;<\/b>is\n an emergency physician and Assistant Professor of emergency medicine at\n the University of Colorado School of Medicine. He is dual fellowship \ntrained in emergency medical services (EMS) and global emergency \nmedicine. His global health efforts are focused on pre-hospital emergency\n care systems, predominantly in sub-Saharan Africa. <br><\/p><p><b>Ryan Paterson, M.D.&nbsp;<\/b>is\n an emergency physician at the University of Colorado and assistant \ncourse director of the Wilderness Medical Society and Universities of \nColorado and Utah's Diploma in Mountain Medicine Course. He is the \ncurrent United States delegate to the International Society of Mountain \nMedicine and serves as an SAEM National Ethics Committee member focused \nin International\/Global Health Ethics.&nbsp;<\/p><p><b>David Richards, M.D., FACEP&nbsp;<\/b>is&nbsp;an\n emergency physician and Assistant Professor in the Department of \nEmergency Medicine at Denver Health Medical Center. He has spent over a \ndecade both providing and\nhelping to develop emergency medicine within the townships of Cape Town,\n South\nAfrica.<\/p><p><strong>Omeed Saghafi, M.D.&nbsp;<\/strong>is an emergency physician at Denver Health\nMedical Center and instructor at the University of Colorado with clinical experience with several international NGOs.<br><strong><\/strong><\/p><p><b>Dan Silverstein&nbsp;<\/b>is\n the managing member of Heuristic Management, LLC, a private sector and \ncapital markets consulting firm. He is an adviser to The&nbsp;Catherine A. \nBertini Fund for Girls' \nEducation&nbsp;and serves on the board of&nbsp;Palms For Life Fund&nbsp;and&nbsp;The \nCaribbean Education Initiative. He has&nbsp;served as a senior private sector\n and capital markets advisor to the Office of Markets and Partnership \ninnovations in the Bureau for Food Security at the U.S. Agency for \nInternational Development, and co-created USAID's&nbsp;Feed the Future \nPublic-Private Partnership Opportunity Explorer.<\/p>",
    "estimatedClassWorkload": "3-6 hours\/week",
    "recommendedBackground": "No background in global health or any related health field is required; all are welcome!",
    "links": {

    }
}