{"id":28,"shortName":"worldmusic","name":"Listening to World Music","language":"en","shortDescription":"Learn the ideas and vocabulary for listening to world music, and examine the music of several world music cultures and how they have entered into mainstream popular culture.","aboutTheCourse":"With the click of a mouse, now more than ever we are able to access sounds made by people from all around the world. And yet, most of us don't listen to the wide diversity of music available to us, probably because it sounds so strange. This class will open up the world of music to you. We begin with a brief history of recording technology, the music industry and the place of world music in that narrative; you are introduced to keywords for talking about music cross-culturally; and then proceed to half a dozen musical cultures around the world. In each of these musical cultures, we examine the ways in which music works in those distant cultures, how it sounds, what it means, who may perform it; and then we ask ourselves where this music has traveled and entered into the Western popular culture as entertainment, political discourse, or artistic purpose.","courseSyllabus":"<ul>\n<li><strong>Week One:<\/strong> Introductions with an overview of recording technology history and ties to world music and cultures; vocabulary for talking about world music and global cultural encounters, and a case study of “Chant,” the 1990s Gregorian chant recording that crossed over into the popular music market.<\/li>\n<li><strong>Week Two:<\/strong> Graceland, Paul Simon's \"collaborative\" album. We reflect on the two opposite meanings of the word \"appropriate,\" examine multitrack recording, and consider the \"collaborative\" process in world music production.<\/li>\n<li><strong>Week Three:<\/strong> Tuvan Throat Singers, we examine how nomadic pastoralists from the Russian republic called Tanna Tuva have become world music superstars because of a single field recording made by an ethnomusicologist in the late 1980s.<\/li>\n<li><strong>Week Four:<\/strong> Pygmy Pop? We discuss \"pygmies\" in the western imagination, and uses of \"pygmy\" music in northern hemisphere popular culture to ask about the ethics of recorded music appropriations.<\/li>\n<li><strong>Week Five:<\/strong> Australian Aboriginal group Yothu Yindi embraced a discourse of cultural and musical reconciliation, and mixed the language of rock with traditional sounds as a successful political strategy in the 1990s.<\/li>\n<li><strong>Week Six:<\/strong> Kalahari Bushmen or Khoisan, are perhaps the oldest existing human communities. We discuss their traditional music, the 1970s Gods Must Be Crazy commercial film, and appropriation and reclamation of Khoisan heritage by South Africans in post-apartheid South Africa.<\/li>\n<li><strong>Week Seven:<\/strong> Cuba, the 1990s Buena Vista Social Club sound recording and documentary film, and a brief discussion of Cuban contemporary history and music are the subject of this final class.<\/li>\n<\/ul>","courseFormat":"The class will consist of lecture videos and discussions of youtube music clips, which are between 8 and 15 minutes in length. Video clips contain an integrated quiz question or short matching quiz.  There will also be standalone homework discussion forums that are not part of video lectures, and a (not optional) final exam.","suggestedReadings":"There is no single book published on this material, though reference is made to scholarly literature and recordings in the course of each lecture.","instructor":"Carol Muller","estimatedClassWorkload":"5-7 hours\/week","recommendedBackground":"Though it may be useful, you are not required to have any music theoretical knowledge to take the class.  You will learn not just about “music” as absolute sound, but about how music works in particular communities, and as a globally distributed, and often politically contested, entity.","links":{}}