{"id":1379,"shortName":"orgchem","name":"中级有机化学 Comprehensive Organic Chemistry","language":"zh-cn","shortDescription":"中级有机化学目标是提高学生在有机反应机理，有机合成方面的知识水平，并进一步培养学生在分析问题和解决问题方面的独立思考能力。\nComprehensive Organic Chemistry focuses on the mechanism of organic reactions and synthetic methodologies.\n","aboutTheCourse":"<p>课程介绍视频可以访问<a href=\"http:\/\/video.study.163.com\/edu-video\/nos\/mp4\/2014\/01\/14\/331780_hd.mp4\" target=\"_blank\">这里<\/a>。<\/p>\n<p>有机化学的重要研究对象包括有机反应机理，有机合成方法学及天然产物的全合成。有机反应机理是有机化学理论的重要组成部分，它通过对有机分子在其反应过程中的具体变化来研究有机反应的内在本质，从而对有机反应进行有效的掌控，提高反应的效率，深入学习和灵活掌握反应机理可使学生深化和进一步提高有机学科的理论知识水平。有机合成是有机化学的精髓部分，尤其是天然产物的全合成不仅需要学生拥有一定广度和一定深度的有机基础知识，而且需要学生具有严谨的科学推理方法的能力和灵活运用知识的技巧，因此讲述这方面的知识并对学生进行相关的训练是十分重要的。随着现代有机化学学科的迅速发展，本课程将不断更新讲授的知识内容以进一步提高学生在有机反应机理和有机合成方面的整体知识水平。<\/p>\n\n<p><i>(Intro Video is also available <a href=\"http:\/\/video.study.163.com\/edu-video\/nos\/mp4\/2014\/01\/14\/331780_hd.mp4\" target=\"_blank\">here<\/a> .)<\/i>\n<\/p>\n<p>Compressive organic chemistry is a main course for undergraduates in college of chemistry. To learn this course, you were assumed to have a solid basis of fundamental organic chemistry. The course is assigned for learners-on-web who will not enter the\n    realistic classroom. Therefore some exercises are compiled for the self-examination of understanding.\n    <br>\n<\/p>\n<br>","targetAudience":1,"courseSyllabus":"<p>第1周（2月24日） 有机合成的艺术性：串联反应在天然产物全合成中的应用<\/p><p>&nbsp;1-O -Methyllateriflorone: K. C. Nicolaou （2004）<\/p><p>第2周（3月3日） 螺环环化体系的构筑：金属催化剂在有机全合成中的作用<\/p><p>（±）-Platensimycin:K.C.Nicolaou （2006）<\/p><p>第3周（3月10日） 无保护基的全合成研究：高效的偶联反应<\/p><p>（+）-Ambiguine H:P.S.Baran（2007）<\/p><p>第4周（3月17日） 多环体系的抗生素：多组分反应在有机全合成中的应用<\/p><p>&nbsp;Cyanocycline A:P.Garner （2008）<\/p><p>第5周（3月24日） 期中考试<\/p><p>第6周（3月31日） 简捷明快的合成路线：桥环分子的构筑和分子内的反应<\/p><p>（+）-Upial: T. Honda （2008）<\/p><p>第7周（4月7日） 完美的环内双键和大环的构筑：烯烃复分解反应<\/p><p>（+）-Nakadomarin A: M.A.Kerr （2007）<\/p><p>第8周（4月14日） 科学探索的道路：分子马达的合成<\/p><p>&nbsp;Molecular Motors:T.R.Kelly （2007）<\/p><p>第9周（4月21日） 期末考试<\/p>","courseFormat":"学习者在学习该课程前，需掌握基本的有机化学知识，每节课后有一定数量供学生交流讨论的开放性讨论题。课程主要由视频组成，每周10-15个视频，每个10-15分钟。每周作为一个学习单元，并分为几个知识点，每个或每几个知识点后会有一个quiz作为复习。另外课程有额外的期中和期末考试。最终成绩期中考试占50%，期末考试占50%评定。<br><br>The class will consist of lecture videos, which are between 10 and 15 minutes in length，about 10-20 each week. Every week we will learn one chapter which is divided into several part, and you will need to finish a quiz after 1\/2 part. There will also be a mid-term exam and a final exam. These all account in your final grade.<br>","suggestedReadings":"<p>课程教材：中级有机化学，裴坚编著，北京大学出版社<\/p>\n\n参考书目：有机合成中命名反应的战略性应用，屈尔蒂著， 科学出版社有限责任公司","estimatedClassWorkload":"3-4 hours\/week","recommendedBackground":"<p>Organic\nChemistry<\/p>\n\n基础有机化学","links":{}}