{"id":2318,"shortName":"venturefinance","name":"New Venture Finance: Startup Funding for Entrepreneurs","language":"en","shortDescription":"Learn how to get your new venture funded. Understand capital structure for new ventures. Develop an understanding of investor pitches.","aboutTheCourse":"<p>This course is for aspiring or active entrepreneurs who wants to understand how to secure funding for their company.This course will demystify key financing concepts to give entrepreneurs and aspiring entrepreneurs a guide to secure funding.&nbsp;<\/p><p>Examine the many financing options available to get your new venture funded. Learn the basics of finance, valuations, dilution and non-dilutive funding sources. Understand capital structure for new ventures, term sheets and how to negotiate them, and the differences between early-stage versus later-stage financing. Develop an understanding of how to develop winning investor pitches, who and when to pitch, how to avoid common mistakes that limit the effectiveness of the pitch, and how to ‘get to the close’. Key questions answered within the course include:<\/p><p><\/p><ul><li>When to raise outside capital?<br><\/li><li>What kind of investors invest by stage and where to find them?<br><\/li><li>What are your fundraising options?<br><\/li><li>What are the key components of the term sheet?<br><\/li><li>How to perform company valuations?<br><\/li><li>How to pitch to investors?<br><\/li><li>What techniques help the entrepreneur ‘get to the close’?<br><\/li><\/ul>With this course, students experience a sampling of the ideas and techniques explored in the University of Maryland's&nbsp;<a href=\"http:\/\/mte.umd.edu\/\" target=\"_blank\">Online Master of Technology Entrepreneurship.<\/a><br>","targetAudience":0,"courseSyllabus":"<div><strong>Week One: The Early Stage Investment Landscape<\/strong><\/div><div><ul><li>Do you speak the language of raising start-up capital?<br><\/li><li>Why should you start with the business plan?<br><\/li><li>What financial statements do investors want to see?<br><\/li><li>How do you develop a balance sheet?<br><\/li><li>What should an income statement present?<br><\/li><li>What is the purpose of the cash flow statement?<br><\/li><li>What corporate structure should I use?<br><\/li><li>How do investors view your early stage venture?<\/li><\/ul><\/div><div><strong>Week Two: Sources of Capital for the Early Stage Company<\/strong><\/div><div><ul><li>Where to find investors?<br><\/li><li>Why consider friends and family as investors?<br><\/li><li>What’s bootstrapping?<br><\/li><li>Are incubators and accelerators a fit?<br><\/li><li>What are angel investors?<br><\/li><li>When to explore early-stage venture capital?<br><\/li><li>When are you ready for late-stage venture capital?<\/li><\/ul><\/div><div><strong>Week Three: &nbsp;Getting Funded – Steps in the Funding Process<\/strong><\/div><div><ul><li>What is due diligence?<br><\/li><li>What is your company worth?<br><\/li><li>How to negotiate a term sheet?<br><\/li><li>How to establish common stock?<br><\/li><li>When to use convertible notes?<br><\/li><li>What is preferred stock?<br><\/li><li>When to use alternative sources of capital?<\/li><\/ul><\/div><div><strong>Week Four: Pitching Investors and Closing the Round<\/strong><\/div><div><ul><li>What do investors need to see?<br><\/li><li>How to create the pitch deck?<br><\/li><li>How to tell your story?<br><\/li><li>What are the do’s and don’ts of the pitch?<br><\/li><li>How to close the round?<br><\/li><\/ul><\/div>","courseFormat":"<p>The\nclass will consist of a series of video lectures each week. Assignments are\nprovided to apply and reinforce learnings each week.<\/p>","suggestedReadings":"<p>Suggested readings are detailed within the course syllabus.<br><\/p>","estimatedClassWorkload":"3-5 hours\/week","recommendedBackground":"<p>This\nintroductory course is designed for the entrepreneur who wants to understand\nthe intricacies of what it takes to fund a new venture. While it does not\nrequire a background in finance or business, completing Coursera’s “Developing\nInnovative Ideas for New Ventures: The First Step in Entrepreneurship” before\nstarting this course is highly recommended.&nbsp;<\/p>","links":{}}