{
    "id": 703,
    "shortName": "inquirytechniques",
    "name": "Inquiry Science Learning: Perspectives and Practices 2 - Techniques for Success",
    "language": "en",
    "shortDescription": "This is the second in a series of four courses; each addressing a different set of skills science educators need to meet the demands of their career. In this course, teachers will engage in experiences designed to develop the skills needed to create a more powerful science learning environment in their classroom.",
    "aboutTheCourse": "<p>A revolution is underway in science classrooms. The demands of the new workplace and the ready access to information afforded by new technologies have radically changed the way we define a scientifically literate society. <\/p><p>More than ever teachers need professional development that provides them with the resources they need and empowers them to take the action required to build classrooms where the next generation of scientifically literate students will flourish. <\/p><p><i>Inquiry Science Learning: Perspectives and Practices<\/i> consists of four courses, each designed to address a different strand in the development of skills teachers need to meet the demands of their career, including the following.<\/p><p><\/p><ol><li><a href=\"https:\/\/www.coursera.org\/course\/scileadership\" target=\"_blank\">Science Leadership<\/a><br><\/li><li><b>Techniques for Success<\/b><br><\/li><li><a href=\"https:\/\/www.coursera.org\/course\/scicontentsurvey\" target=\"_blank\">Science Content<\/a><br><\/li><li><a href=\"https:\/\/www.coursera.org\/course\/scistudentinquiry\" target=\"_blank\">Student-Centered Inquiry<\/a><\/li><\/ol><p><\/p><p>In this second course we will focus on helping teachers master techniques and strategies that create a learning environment that will empower students and enhance their mastery of science content and skills.<\/p>",
    "targetAudience": 3,
    "courseSyllabus": "<p><b>Week 1:&nbsp;<\/b><b>Standards Dissection:<\/b><\/p><b><\/b><p>Participants will learn how to analyze the verbiage of their science standards in order to turn the concepts within into meaningful learning experiences<\/p><p><br><\/p>\n\n<p><b>Week 2:&nbsp;<\/b><b>Assessment That Informs Teaching:<\/b><\/p><p>Participants will learn how to evaluate and develop better multiple choice assessment items to provide useable data<\/p><p><br><\/p><p><b>Week 3:&nbsp;<\/b><b>Questioning Strategies:<\/b><\/p><b><\/b><p>Participant will learn how to construct rich questions that will encourage all learners to participate in the inquiry process<\/p><p><br><\/p><p><b>Week 4:&nbsp;<\/b><b>Prepared Environment:<\/b><\/p><b><\/b><p>Participants will learn easy ways to change their classroom environment in order to promote independent exploration<\/p><p><br><\/p><p><br><\/p>",
    "estimatedClassWorkload": "2-4 hours\/week",
    "recommendedBackground": "No previous coursework is recommended, but the course will be most helpful to teachers with 3 or more years of teaching experience who are willing to directly apply experiences in their schools. While the course was designed with the K-8 teacher in mind, the topics covered are appropriate for all teachers, including those teaching in high school.",
    "links": {

    }
}