{"id":54,"shortName":"healthcareinnovation","name":"Healthcare Innovation and Entrepreneurship","language":"en","shortDescription":"This interdisciplinary course focuses on sustainable innovation, introducing entrepreneurial students to the realities of problem identification and solution design within the complex world of healthcare.","aboutTheCourse":"Healthcare Innovation and Entrepreneurship applies a focused approach toward sustainable healthcare innovation. Students will be introduced to definitions and concepts that include the innovation process, design thinking, “intrapreneurship,” entrepreneurship, six sigma principles of process improvement, regulatory issues, patent law, and the market forces that impact the healthcare innovation process. All students will gain confidence in the basic elements of the initial discovery phase in the healthcare innovation process, including\n<ol>\n<li>Defining and describing key components of the healthcare innovation process.<\/li>\n<li>Becoming aware of challenges to the quality of healthcare delivery and the opportunity for improved patient care and cost reductions.<\/li>\n<li>Learning and practicing a step-by-step “needs finding” process and a “needs filtering” process for identifying and prioritizing real clinical problems and opportunities for innovation.<\/li>\n<li>Developing cross-disciplinary collaboration skills.<\/li>\n<li>Strengthening communication and leadership skills in advocating health systems change.<\/li>\n<\/ol>","targetAudience":1,"courseSyllabus":"<div><strong>Week One:&nbsp;Innovating in healthcare<\/strong><br>Introductions with an overview of how to identify problems in need of a solution within complex healthcare environments; vocabulary for talking about healthcare innovation and entrepreneurship, and systems thinking.<\/div>\n<div>&nbsp;<\/div>\n<div><strong>Week Two: Finding what's needed<\/strong>&nbsp;<br>How to prioritize, select and refine identified problems that can be tackled in a real-world environment through applied science.&nbsp;<\/div>\n<div>&nbsp;<\/div>\n<div><strong>Week Three: Prioritizing needs<\/strong>&nbsp;<br>We provide a process for identifying the currently available solutions in the market and for researching\/analyzing the size of the remaining market.&nbsp;<\/div>\n<div>&nbsp;<\/div>\n<div><strong>Week Four: Sizing up the market<\/strong>&nbsp;<br>&nbsp;We focus on our “freedom to operate,” or our ability to develop solutions within a host of existing constraints, which include the regulatory environment, the legal environment, the organizational policies and procedures in place, and our organizational culture.&nbsp;<\/div>\n<div>&nbsp;<\/div>\n<div><strong>Week Five: Designing an innovation<\/strong>&nbsp;<br>We consider the issues that arise with real-world deployment of an innovative solution, including questions of finance, business, work processes, and quality.<\/div>\n<div>&nbsp;<\/div>\n<div><strong>Week Six: Gaining commitment<\/strong>&nbsp; <br>Finally, we focus our attention on selling our solution, finding support while protecting intellectual property rights.<\/div>","courseFormat":"The class will consist of lecture videos, which are between 10 and 15 minutes in length. Standalone homework will be used to emphasize key points across one or more of the course units.","suggestedReadings":"Jeff Dyer, Hal Gregersen, Clayton Christensen. &nbsp;2011. <a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=healthcareinnovation&isbn_ean=9781422134818\">The Innovator's DNA: Mastering the Five Skills of Disruptive Innovators<\/a><img width=\"1\" src=\"http:\/\/www.assoc-amazon.com\/e\/ir?t=coursera-20&amp;l=as2&amp;o=1&amp;a=1422134814\" height=\"1\" style=\"border: none !important; margin: 0px !important;\"> Harvard Business Review Press (optional).","instructor":"Bob Barnes, Marilyn M. Lombardi","estimatedClassWorkload":"5-7 hours\/week","recommendedBackground":"Students should have an appreciation for healthcare and its challenges, but otherwise there are no prerequisites for the course.","links":{}}