{
    "id": 289,
    "shortName": "introeulaw",
    "name": "The Law of the European Union: An Introduction",
    "language": "en",
    "shortDescription": "The EU is the most successful supranational legal order to which 27 Member States have transferred sovereign rights. This course explores the functioning of the unique creature that is the EU, the impact of its laws on states, citizens and companies, and the current challenges it faces.",
    "aboutTheCourse": "<p><\/p>\n<p>In 2012, the EU received the Nobel Peace Prize for its decades-long contribution\n    to the advancement of peace and reconciliation, democracy and human rights\n    in Europe. War has become virtually unthinkable in the EU. When the first\n    steps towards supranational cooperation - primarily targeted at preventing\n    the rearmament of Germany - were made in the aftermath of World War Two,\n    the Founding Fathers of the European integration construct could never\n    have imagined this outcome in their wildest dreams. Over the years, the\n    supranational cooperation would widen - from the original European Communities\n    consisting of 6 Member States to the current Union of 27 Members – and\n    deepen – from the originally almost purely economically inspired Communities\n    to the current Union with a say in almost all areas of national competence.\n    At the same time, problems with the Euro have plunged the EU in one of\n    the biggest crises since its inception. This challenges lawmakers to tackle\n    difficult questions about the continued existence of the Euro and the future\n    direction of the European integration project.<\/p>\n<p>This course will give the students an insight into the law of the EU,\n    a vast and fascinating area of law which forms an integral part of the\n    legal systems of its 27 Member States. The course is divided into three\n    parts. In the first part, we will pay attention to the creation and the\n    development of the EU, its institutional structure and functioning, and\n    the specific nature and sources of EU law. In the second part, we will\n    examine how EU law impacts on the lives of EU citizens as well as on companies\n    that are established or provide services in the EU. In the final\n    part, we will tackle Europe’s common currency crisis, investigating causes,\n    effects and possible routes out of this existential crisis of the Union.<\/p>\n<p>If you are a student, lawyer, entrepreneur or simply interested in the\n    EU, its&nbsp;development and legal system, this course will provide you\n    with the foundations.&nbsp;The course is of interest to people both inside\n    and outside the European Union: EU citizens may learn how to benefit from\n    the rights contained in EU life; people from other parts of the world may\n    learn from the EU’s specific set-up, its functioning and the legal solutions\n    being applied in the European context.<\/p>",
    "targetAudience": 0,
    "courseSyllabus": "",
    "estimatedClassWorkload": "5-8 hours\/week",
    "recommendedBackground": "",
    "links": {}
}