{"id":1072,"shortName":"humantrafficking","name":"Human Trafficking","language":"en","shortDescription":"Did you know that human trafficking is a form of modern day slavery?  \n\nSlavery has been around since the beginning of civilization and still persists across our world today. As a human rights issue, it is important to increase awareness as a starting point down the journey toward freedom for all.","aboutTheCourse":"This course will provide a thorough discussion on domestic and global human trafficking from both a social work perspective and a general knowledge based lens. Students will be provided an opportunity to follow the general knowledge track as well as a social work track which will add additional materials focusing on human trafficking from the perspective and expectations of the social work professional. <br><br>Students who choose to focus on this course from a general knowledge point of view will be provided with a hefty dose of materials on human trafficking from a non-social work perspective.  <br><br>As a whole, students will become familiar with the forms, severity, and extent of various forms of trafficking that exist around the globe. Push and pull factors involved in trafficking as they relate to the major legal, political, social and economic factors that contribute to human trafficking will be discussed. Laws, anti-trafficking policies and rescue and restore programs on human trafficking will be highlighted.<br><br>An exploration of the characteristics and special needs of victims (adults and children), their life experiences, and their trafficking trajectories will be discussed. <br><br>Last, students will acquire introductory knowledge of the role of world citizens, politicians, law enforcement, the judicial systems, social workers, non-governmental organizations (NGO’s), and others in the resolution of human trafficking from a social work and a non-social work social justice perspective.","targetAudience":0,"courseSyllabus":"Week One: Introduction to Human Trafficking<br>Week Two: Laws and Policies<br>Week Three: The Impact on the Victim<br>Week Four: Interventions - From Victim to Survivor","courseFormat":"The class will consist of short lecture videos (5-10 minutes).&nbsp; Supplementary readings will also be assigned and may be used in online peer discussions. &nbsp;<br><br>To fully participate in this course, students will create one Public Service Announcement (PSA) project and complete two quizzes. &nbsp;<br><br>Discussions will be encouraged to help expand everyone's knowledge of human trafficking and brainstorm interventions to help rid the world of it.<br>","suggestedReadings":"There are many valuable resources to learn about the impact of Human Trafficking. Here are two to get started for now.  <br><br><ul><li><a href=\"https:\/\/www.govtrack.us\/congress\/bills\/113\/hr898\/text\" target=\"_blank\">H.R. 898: Trafficking Victims Protection Reauthorization Act of 2013<\/a><\/li><\/ul><ul><li><a href=\"http:\/\/www.unodc.org\/documents\/data-and-analysis\/glotip\/Trafficking_in_Persons_2012_web.pdf\" target=\"_blank\">Global Report on Trafficking in Persons - 2012<\/a><\/li><\/ul>Join the class and you'll have access to many more as we journey through this exploration together.","estimatedClassWorkload":"2-4 hours\/week","recommendedBackground":"No background is required; all are welcome to join in our exploration.","links":{}}