{
    "id": 762,
    "shortName": "mathematicalmethods",
    "name": "Mathematical Methods for Quantitative Finance",
    "language": "en",
    "shortDescription": "Mathematical Methods for Quantitative Finance covers topics from calculus and linear algebra that are fundamental for the study of mathematical finance. Students successfully completing this course will be mathematically well prepared to study quantitative finance at the graduate level.",
    "aboutTheCourse": "The Mathematical Methods for Quantitative Finance course reviews the mathematical methods fundamental for&nbsp;the study of quantitative and computational finance. The areas of focus include calculus and&nbsp;multivariable calculus, constrained and unconstrained\noptimization, and linear algebra.\n<br>\n\n<p>Topics covered include the following:\n<\/p>\n\n<ul>\n    <li>Functions and inverse functions<\/li>\n    <li>Limits, derivatives, partial derivatives, and chain rule\n    <\/li>\n    <li>Integrals and multiple integrals, changing the order of differentiation and integration<\/li>\n    <li>Taylor series approximations<\/li>\n    <li>Newton’s method<\/li>\n    <li>Lagrange multiplier method<\/li>\n    <li>Vector and matrix arithmetic, determinants, eigenvalue-eigenvector decomposition,&nbsp;singular value decomposition<\/li>\n    <li>Numerical methods for optimization\n        <br>\n    <\/li>\n<\/ul><b><u>Course goal<\/u>:<\/b><span><br>\nUpon completion of the course students will know the fundamental mathematical\nconcepts&nbsp;needed to effectively study quantitative finance areas such as\nfixed income, options and&nbsp;derivatives, portfolio optimization,\nand&nbsp;quantitative risk management.<\/span><b><u><br><br>Course Objectives<\/u><\/b>:\n<br>\n<p>\n    Upon completion of the course students will:<\/p>\n\n<ol>\n    <li>Understand the concept of a limit, differentiation, and integration;<\/li>\n    <li>Be able to compute partial derivatives and multiple integrals;<\/li>\n    <li>Understand the utility of matrix decompositions;<\/li>\n    <li>Be able to use Lagrange multipliers to solve constrained optimization problems; and\n        <br>\n    <\/li>\n    <li>Apply the above methods to problems arising in finance.\n        <br>\n    <\/li>\n<\/ol>",
    "targetAudience": 0,
    "courseSyllabus": "",
    "estimatedClassWorkload": "8-10 hours\/week",
    "recommendedBackground": "Students should have completed entry-level college calculus courses that include an introduction to multivariable differential calculus; additional introductory mathematics and statistics coursework is desirable.\n<br>",
    "links": {}
}