{"id":504,"shortName":"egypt","name":"Egiptología (Egyptology)","language":"es","shortDescription":"Este curso introduce a los estudiantes de grado y al público de habla hispana en general en los aspectos más relevantes de la lengua, la historia y la cultura del Egipto de los faraones.","aboutTheCourse":"<p>Este curso está dirigido a\nestudiantes de grado y a personas interesadas en las civilizaciones antiguas\nque deseen adquirir conocimientos fundamentales acerca de la lengua, la\nhistoria y la cultura del Egipto faraónico e introducirse en los métodos y las\nherramientas de la disciplina egiptológica para, a continuación, seguir\nprofundizando autónomamente o realizar ulteriores estudios académicos de grado\no de máster en el ámbito de la disciplina.<\/p>\n\n<p>Los objetivos del curso son los\nsiguientes:<\/p>\n\n<ul><li>Exponer los aspectos definidores de las principales\n     etapas de la historia y la cultura del antiguo Egipto, prestando especial\n     atención a las fuentes textuales, iconográficas y arqueológicas.<\/li><li>Explicar la adscripción y la historia de la lengua\n     egipcia, los cuatro sistemas de escritura egipcios, el desciframiento de\n     los jeroglíficos y las creaciones literarias más importantes que el\n     antiguo Egipto nos ha legado.<br><\/li><\/ul>","targetAudience":0,"courseSyllabus":"<p><u><strong>Primera semana<\/strong><\/u><span><strong>: Orígenes.<\/strong> Prolegómenos: introducción a la cronología\ny a la periodización de la historia de Egipto y a la geografía del Valle del\nNilo. Las culturas del Egipto neolítico y predinástico y el surgimiento del\nEstado faraónico: de Hieracómpolis a Abidos. El origen de la escritura\njeroglífica.<\/span><\/p>\n\n<p><u><strong>Segunda semana<\/strong><\/u><span><strong>: Pirámides. <\/strong>La pirámide: símbolo, mito y rito. La\ncosmogonía solar heliopolitana y los <i>Textos de las Pirámides<\/i>. Formación y\ndesarrollo histórico del Reino Antiguo egipcio o Edad de las Pirámides. La\nconstrucción de las grandes pirámides de Giza.<\/span><\/p>\n\n<p><u><strong>Tercera semana<\/strong><\/u><span><strong>:<\/strong> <b>Sinuhé. <\/b>&nbsp;La\nlengua egipcia: adscripción e historia. Las escrituras egipcias: jeroglífico,\nhierático, demótico y copto. La <i>Historia de Sinuhé<\/i> y la literatura\negipcia “clásica”. Constitución del Reino Medio tras el Primer Período\nIntermedio. Historia política, social y económica de Egipto durante el Reino\nMedio.<\/span><\/p>\n\n<p><u><strong>Cuarta semana<\/strong><\/u><span><strong>:<\/strong> <b>Hyksos.<\/b> Egipto, los semitas y el Sinaí desde los\norígenes hasta el Reino Medio. Los semitas del Sinaí y la invención del\nalfabeto: el legado de los jeroglíficos. Los semitas en Egipto: dominio y expulsión\nde los hyksos durante el Segundo Período Intermedio.<\/span><\/p>\n\n<p><u><strong>Quinta semana<\/strong><\/u><span><strong>: Amón.<\/strong> Dioses de Menfis, dioses de Tebas: de Ptah a\nAmón. Osiris y el mito osiríaco. El mundo funerario y el <i>Libro de la Salida\nal Día<\/i>. Los comienzos del Reino Nuevo: la XVIII dinastía y la construcción\ndel imperio egipcio. Tebas y sus templos: Karnak y Luxor. La necrópolis tebana\ny el Valle de los Reyes.<\/span><\/p>\n\n<p><u><strong>Sexta semana<\/strong><\/u><span><strong>: Amarna. <\/strong>Politeísmo, monoteísmo, henoteísmo. La\nreligión de Akhenaton y el <i>Himno a Aton<\/i><b>. <\/b>De Akhenaton a Tutankhamon:\nlos reyes de Amarna. El final de la XVIII dinastía.<\/span><\/p>\n\n<p><u><strong>Séptima semana<\/strong><\/u><span><strong>:<\/strong> <b>Ramsés.<\/b> Ramsés II y los hititas: la batalla de\nQadesh. Ramsés III, los “pueblos del mar” y el nuevo orden internacional. La\ncaída del Reino Nuevo.&nbsp;Libios, kushitas, saítas y persas en el Egipto del\nI milenio a.C. <\/span><\/p>\n\n<p><u><strong>Octava semana<\/strong><\/u><span><strong>: Rosetta.<\/strong> “El fin era el principio”: la piedra de\nRosetta. Jean François Champollion y el desciframiento de los jeroglíficos.\nFundamentos de la escritura jeroglífica egipcia. De Alejandro a Teodosio: griegos\ny romanos en Egipto. El ocaso de la civilización egipcia antigua.<\/span><\/p><p><\/p><p>Además de videos\ncomplementarios, y videos opcionales, en esta edición incluiremos entrevistas a\nreconocidos egiptólogos.<br><\/p>","courseFormat":"Curso de 8 semanas&nbsp;de duración, con&nbsp;una\ncarga lectiva&nbsp;de&nbsp;6\/8 horas&nbsp;semanales.<br><p>Las lecciones se facilitarán a través de\nuna serie de vídeos de entre 15 y 30 minutos de duración. Algunas semanas se\nfacilitarán también materiales complementarios escritos (en pdf). <br><\/p><p>Con el fin de\nque el alumno pueda evaluarse y medir los conocimientos adquiridos, cada semana\nse proporcionará un test que cubrirá el temario impartido en dicha semana.<\/p><p>Para\nsuperar el curso habrá que completar una prueba de síntesis final.<br><\/p><br>","suggestedReadings":"<p>A lo largo del curso se recomendarán\ntítulos que pueden conseguirse on-line, de modo que no suponen coste alguno\npara el estudiante.<\/p>\n\n<p>Sin embargo hay dos títulos que, si\nbien no son imprescindibles para seguir el curso, pueden ser un buen\ncomplemento tanto para los temas de lengua y literatura como para los de\nhistoria y cultura:<\/p>\n\n<ul><li><span>J. Cervelló Autuori, <i><a target=\"_blank\" href=\"http:\/\/publicacions.uab.es\/llibres\/fitxa_web_llibres.asp?ID=1939\">Escrituras, lengua y cultura en\n     el antiguo Egipto<\/a><\/i><a target=\"_blank\" href=\"http:\/\/publicacions.uab.es\/llibres\/fitxa_web_llibres.asp?ID=1939\">,<\/a> Bellaterra: Edicions UAB.<\/span><\/li><li><span>J. M. Parra (coord.), <i>El antiguo Egipto: sociedad,\n     economía, política<\/i>. Madrid: Marcial Pons, 2011.<\/span><br><\/li><\/ul>","instructor":"Josep Cervelló and Jose Lull","estimatedClassWorkload":"6-8 hours\/week","recommendedBackground":"Sin requisitos previos.","links":{}}