{"id":2436,"shortName":"welcomegametheory","name":"Welcome to Game Theory","language":"en","shortDescription":"This course provides a brief introduction to game theory. Our main goal is to understand the basic ideas behind the key concepts in game theory, such as equilibrium, rationality, and cooperation. A number of applications in economics, politics, and biology will be discussed.","aboutTheCourse":"<p>\n    Business competition, political campaigns, the struggle for existence by animals and plants, and so on, can all be regarded as a kind of “game,” in which individuals try to do their best against others. Game theory provides a general framework to describe\n    and analyze how individuals behave in such “strategic” situations.\n<\/p>\n<p>\n    This course focuses on the key concepts in game theory, and attempts to outline the informal basic ideas that are often hidden behind mathematical definitions. Game theory has been applied to a number of disciplines, including economics, political science,\n    psychology, sociology, biology, and computer science. Therefore, a warm welcome is extended to audiences from all fields who are interested in what game theory is all about.\n<\/p>","targetAudience":0,"courseSyllabus":"<ul>\n    <li>Week 1: Why do we need game theory, and what does it tell us?<\/li>\n    <li>Week 2: Understanding Nash equilibrium<\/li>\n    <li>Week 3: Rationality, knowledge, and evolution<\/li>\n    <li>Week 4: Sustaining cooperation<\/li>\n<\/ul>","courseFormat":"<p>\n    The class consists of lecture videos, homework exercises, and a final exam.\n<\/p>\n\n<ul>\n    <li>Lectures: Each week, approx. 1.5–2h lecture videos divided into short video clips are provided.<\/li>\n    <li>Homework exercises: Graded quizzes and problem sets are provided.<\/li>\n    <li>Final exam: The exam consists of quizzes and problem sets to assess overall understanding of what students have learned in this course.<\/li>\n<\/ul>","suggestedReadings":"","estimatedClassWorkload":"4-5 hours\/week","recommendedBackground":"<ul>\n    <li>No prior knowledge of economics or game theory is required.<\/li>\n    <li>No knowledge of math beyond simple arithmetic is required.<\/li>\n<\/ul>","links":{}}