{"id":2313,"shortName":"processimprovement","name":"Process Improvement","language":"en","shortDescription":"The Improving Business Finances and Operations Specialization will be discontinued in January 2016. Learners who wish to earn a Specialization Certificate must pass all courses by December 31, 2015, and complete the Capstone Project in January 2016. If you do not anticipate completing the Specialization within this time frame, please do not purchase the full access option. \n\nGain practical skills for analyzing and improving work processes and for organizing initiatives for continuous improvement of processes. Learn how to plan and execute process improvements with frameworks and techniques from Six Sigma and Lean Management initiatives.","aboutTheCourse":"<p>Any business can be viewed as a collection of various processes. Processes are used for all types of work, including new product development, and production and delivery of goods and services. This course will provide you a set of tools that you can use to <strong>improve work processes<\/strong>. <\/p>\n\n<p>You will learn to <strong>conduct systematic root-cause analysis<\/strong> to discover process improvements aimed at making processes more cost-effective, dependable, responsive, and flexible. You will also be introduced to <strong>techniques for setting organizational objectives<\/strong> and priorities for process improvement initiatives.<\/p>\n \n<p>The process improvement initiatives covered in this course, such as <strong>Six Sigma and Lean Management<\/strong>, are widely used by world-class organizations to achieve sustainable competitive advantage. These initiatives can also be used to explore and realize synergies among processes that <strong>cut across organizational boundaries<\/strong> of supply chain partners and merging companies.<\/p>","targetAudience":2,"courseSyllabus":"<p>This course will be broken up into 4 weekly modules covering the following topics:<\/p>\n<p><strong>Week 1: <\/strong>Process Thinking and Principles of Process Improvement<\/p>\n<p><strong>Week 2: <\/strong>Strategy Deployment and Organization of Improvement Initiatives<\/p>\n<p><strong>Week 3: <\/strong>Project Management and Root-Cause Analysis<\/p>\n<p><strong>Week 4: <\/strong>Sustaining Improvements and Managing Change<\/p>","courseFormat":"Each week will include readings, video lectures, and quizzes.","suggestedReadings":"","estimatedClassWorkload":"6-8 hours\/week","recommendedBackground":"Basic statistics knowledge, including the concepts of variation and distribution, is recommended.","links":{}}