{"id":1641,"shortName":"constitution","name":"Introduction to Key Constitutional Concepts and Supreme Court Cases","language":"en","shortDescription":"This course offers an introduction to the U.S. Constitution and landmark Supreme Court cases interpreting it. It explores the Constitution’s origins, its amendment over the years, and methods of constitutional interpretation. Topics include the nature and structure of the federal government, the powers of the federal government, and individual rights.","aboutTheCourse":"<p><\/p><p>\n\n<\/p><p>The\nUnited States Constitution is a statement of America’s highest law and its\ndeepest values. It is the document and the principles that make one nation and\none people out of the several states. But where did it come from? How has it\nchanged over the years? How do we know what it means?<\/p>\n\n<p>This\ncourse, which launches shortly after Constitution Day, explores those questions. It examines the Constitution’s origins, the\nproblems the Framers confronted and the solutions they adopted. It follows the\nConstitution’s changes over the years, from the initial burst of amendments\nthat brought us the Bill of Rights, through the bloody disruption of the Civil\nWar, and into the twentieth and twenty-first centuries. It discusses landmark\nSupreme Court cases that show how the Framers’ ideas have fared in the modern\nworld.<\/p>\n\n<p>The\ncourse provides a broad overview of the Constitution, including both the\nstructure and powers of the federal government and individual rights topics.\nCases discussed include Brown v. Board of Education, Gideon v. Wainwright,\nMiranda v. Arizona, Roe v. Wade, Korematsu v. United States, District of\nColumbia v. Heller, and NFIB v. Sibelius.<\/p><p>A study guide for teachers and students will be available.<\/p>","targetAudience":3,"courseSyllabus":"<strong>WEEK 1: Origin and Nature of the Constitution<\/strong><br>1.1 – Why We Needed a Constitution<br>1.2 – Creating the Constitution<br>1.3 – Interpreting the Constitution<br><strong><br>WEEK 2: The Three Branches of Government<\/strong><br>2.1 – Article I: Legislative Branch<br>2.2 – Article II: Executive Branch<br>2.3 – Article III: Judicial Branch <br><strong><br>WEEK 3:&nbsp; Amendments<\/strong><br>3.1 – The Bill of Rights<br>3.2 – The Reconstruction Amendments<br>3.3 – The Progressive Amendments<br><strong><br>WEEK 4: The First Amendment<\/strong><br>4.1 – Freedom of Speech<br>4.2 – Free Exercise of Religion Clause<br>4.3 – Establishment Clause<br><strong><br>WEEK 5: Criminal Procedure<\/strong><br>5.1&nbsp; – The Fourth Amendment<br>5.2 – The Fifth Amendment: The Right to Remain Silent<br>5.3 – The Sixth Amendment: The Right to Counsel\/Trial by Jury<br><strong><br>WEEK 6: Federalism and Nationalism<\/strong><br>6.1 – The Second Amendment<br>6.2 – The Ninth and Tenth Amendments<br>6.3 – The Civil War and Reconstruction<br><strong><br>WEEK 7: The Fourteenth Amendment<\/strong><br>7.1 – Equal Protection\/What is Discrimination?<br>7.2 – Women’s Equality and Abortion<br>7.3 – Sexual Orientation<br><strong><br>WEEK 8: Modern Controversies<\/strong><br>8.1 – War Powers<br>8.2 – Campaign Finance<br>8.3 – Health Care Reform<br>","courseFormat":"<p>This eight-week course consists of three lecture videos each\nweek; each lecture will run about 15 minutes and include the spoken lecture,\nvideo clips, photographs and other illustrative images. Supplemental videos,\nbook chapters and timelines are assigned to each lecture that will enhance the\nstudents’ learning experience. We encourage students to take advantage of these\nresources. Every two weeks, a short quiz will be available to help students\ntest their knowledge.<\/p>","suggestedReadings":"","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"No background is required. Everyone is welcome!<br>","links":{}}