{"id":1348,"shortName":"globalintrouslaw","name":"The Global Student's Introduction to U.S. Law","language":"en","shortDescription":"This course will provide students from around the world an introduction to the legal system of the United States.","aboutTheCourse":"<p>In this course, students will\nlearn basic concepts and terminology about the U.S. legal system and about\nselected topics in the fields of constitutional law, criminal law, and contract\nlaw. A team of outstanding teachers and scholars from the University of Florida\nfaculty introduces these subjects in an accessible and engaging format that\nincorporates examples from legal systems around the world, highlighting\nsimilarities to and differences from the U.S. system.  Students seeking an\nadvanced certificate study additional topics and complete assignments involving\nlegal research that are optional for basic level students. The course may be of\ninterest both to U.S. students contemplating law school and to global students\nconsidering further study of the U.S. legal system.<\/p>","targetAudience":0,"courseSyllabus":"<p>Course Features and Assignments<\/p><p>Please take a few minutes now to familiarize yourself with the navigation and features of this Coursera course.<\/p><ul><li><b>Weekly Modules<\/b>: the course material for each week is listed in the weekly pages.<ul><li>Generally, it is a good idea to do the work in the order it is listed.<\/li><\/ul><\/li><li><b>Video Lectures<\/b>: short presentations detail the key concepts for each week.<\/li><li><b>Supporting References<\/b>: references that are not required readings, but are to serve as additional sources should you choose to further research subjects that interest you.<\/li><li><b>Discussion Forums<\/b>: post, read, and respond in the forums to deepen your understanding of the concepts.<\/li><li><b>Quizzes<\/b>: check your understanding of the key concepts and terminology.<ul><li>Stand-alone quizzes that you'll take after reviewing the material for that week.<\/li><li><b>Please note that you will not be able to complete a quiz once the due date has passed. Quizzes will not be accepted late.<\/b><\/li><\/ul><\/li><li><b>Course Project:&nbsp;<\/b>The research projects are required if you wish to earn a Statement of Accomplishment with Distinction.<\/li><li><b>Peer Assessments<\/b>: peer evaluation of the project submissions.<ul><li>You are welcome to submit the research projects for peer assessment even if you do not intend to complete the Statement of Accomplishment with Distinction. However, please remember that in order to view the feedback from your peers, you must also provide feedback to your peers' project submissions.<\/li><li><b>Due to the nature of Peer Assessments, it is not possible to grant extensions. Peer Assessments will not be accepted late.<\/b><\/li><\/ul><\/li><\/ul><p><br><\/p>Completing this Course<p><strong>You are welcome to do any or all of the assignments outlined in this course. However, if you wish to earn a statement of accomplishment, you'll need to complete the following activities:<\/strong><br><\/p><strong><\/strong><ul><strong><\/strong><li><b>Statement of Accomplishment<\/b><br><strong>Students who earn an overall score of at least 70% based on:<\/strong><ul><strong><\/strong><li><strong>80% Quizzes<\/strong><\/li><strong><\/strong><li><strong>20% Discussion Posts out of one post per week<\/strong><\/li><strong><\/strong><\/ul><strong><\/strong><\/li><strong><\/strong><li><b>Statement of Accomplishment with Distinction<\/b><br><strong>Students who earn an overall score of at least 80% based on:<\/strong><ul><strong><\/strong><li><strong>70% Quizzes<\/strong><\/li><strong><\/strong><li><strong>15% Project and Peer Assessment (best score will be taken)<\/strong><\/li><strong><\/strong><li><strong>10% Discussion Posts out of one post per week<\/strong><\/li><strong><\/strong><li><strong>5% Discussion Comments out of two comments per week<\/strong><br><br><i>Note: There will be a 20% penalty on your project submissions if you do not complete three (3) peer evaluations<\/i>.<\/li><\/ul><\/li><\/ul>","courseFormat":"","suggestedReadings":"","estimatedClassWorkload":"5-10 hours\/week","recommendedBackground":"","links":{}}