{
    "id": 2231,
    "shortName": "renewableenergy",
    "name": "מבוא לאנרגיה מתחדשת Introduction to Renewable Energy ",
    "language": "he",
    "shortDescription": "הנפט, הפחם והגז מניעים כיום את גלגלי חיינו. האם וכיצד ניתן להחליפם במקורות אנרגיה נקיים ומתחדשים?\n",
    "aboutTheCourse": "<p><strong>Course language is Hebrew!<\/strong><br><\/p><p>The Hebrew course description will be followed by an English one.<\/p>\n<p dir=\"RTL\">השימוש בדלק לסוגיו הוא התשתית שעליה\nמבוססים החיים המודרניים. כבר יותר ממאה שנה אנו משתמשים בדלקים מאובנים שנאצרו\nבבטן האדמה – נפט, גז טבעי ופחם – כדי להניע את גלגלי עולמנו: תעשייה מתקדמת,\nתחבורה מהירה, בתים נוחים ועוד. בקורס זה ננסה לבחון אלטרנטיבות אפשריות לדלקים\nהמאובנים, הגורמים נזק לא מבוטל לסביבתנו ולבריאותנו. נתאר את המחקר המדעי\nהאינטנסיבי המתקיים בתחום, ונציג מגוון טכנולוגיות מתקדמות להפקת אנרגיה נקייה\nממקורות טבעיים ומתחדשים – כמו השמש, הרוח והמים – מקורות המצויים בשפע, אינם\nמזהמים, ואינם מתכלים.<br><\/p>\n<p dir=\"RTL\">קורס המבוא לאנרגיה מתחדשת ייפתח בשאלות\nהבסיס של תחום האנרגיה: מהם צורכי האנרגיה של האנושות כיום, ואילו משאבים עומדים\nלרשותה? אילו תהליכים אנו מכירים&nbsp; לאיסוף,\nהמרה וניצול של מקורות אנרגיה? מהן הבעיות שנוצרות עקב השימוש הנוכחי במקורות\nאנרגיה מאובנים? ואיזה שינוי נדרש במדיניות האנרגיה ובמשק האנרגיה של החברה\nהמודרנית? <\/p><p dir=\"RTL\">מכאן נעבור לתיאור הסוגים העיקריים של\nאנרגיה מתחדשת – מקורות אנרגיה טבעיים, זמינים ובלתי מתכלים, שאינם גורמים נזק\nסביבתי, ועשויים להחליף את הדלקים המאובנים. נדבר על אנרגיית השמש, אנרגיית הרוח,\nאנרגיית המים וביו-אנרגיה; ננתח את הטכנולוגיות הקיימות כבר היום לניצול המקורות\nהללו לצורכי האדם; נציג כלים בסיסיים לחישוב יעילות ההמרה של כל טכנולוגיה,\nוכמויות האנרגיה שניתן להפיק באמצעותה; ונביא דרכים להערכת הכדאיות הכלכלית של כל\nאחת מהשיטות.<br><\/p>\n<p dir=\"RTL\">במקביל, נדון בקשיים ובאתגרים הממתינים\nעדיין לפתרון, ונשאל מה יש לעשות כדי שהאנרגיות המתחדשות ייושמו בקנה מידה רחב –\nבתעשייה, בתחבורה, ובכל תחומי חיינו. נבחן מגוון טכנולוגיות מתקדמות להפקת אנרגיה\nממקורות נקיים; נסביר מדוע הן עדיין אינן תופסות את מקומם של הדלקים המאובנים;\nונציג כיווני מחקר עכשוויים ופיתוחים חדשניים שמשפרים ומייעלים לא הרף את השיטות\nהקיימות, במטרה להבטיח לכולנו עתיד בר-קיימא.<\/p><p dir=\"RTL\">&nbsp;<\/p><p><strong><u>Course language is Hebrew<\/u>! English subtitles are planned but not yet available.<\/strong><br><\/p><p>Fuels are the foundations of modern living. For over a\ncentury we have been drawing fossil fuels – oil, coal and natural gas – from\nthe depths of the earth, and using them to power our world: advanced\nindustries, fast transportation, comfortable homes and more. In this course we\nwill examine possible alternatives for these fuels - which have proved quite\ndamaging to both our health and our environment. We will describe the intensive\nworldwide efforts in this field of research, and present their encouraging\noutcome: a range of innovative technologies for generating clean energy from\nnatural, non-polluting and renewable sources – such as sunlight, wind\nand water.<\/p><p>The\ncourse will open with some fundamental questions on energy: What are the energy\nneeds of the global population today, and what will they be tomorrow? What are\nthe resources at our disposal? What are the known processes for harvesting,\nconverting and utilizing resources of energy? What are the problems generated by\nthe use of fossil fuels? In what ways must we change our energy policies and\nenergy economy? And most important of all: What are the alternatives to fossil\nfuels, and can they supply humanity's extensive and constantly growing energy\nneeds?<\/p><p>Subsequent\nlessons will introduce the main types of safe, clean, natural and renewable\nenergy sources available to us: solar energy, wind energy, water energy and\nbioenergy. We will speak of existing technologies that already harness these\nresources to the needs of humankind, and supply simple tools for computing\nconversion efficiencies, calculating the amounts of energy produced through the\nvarious methods, and assessing their economic feasibility.<br><\/p><p>In parallel,\nwe will discuss the remaining problems and challenges, and ask what must\nbe done to enable the large-scale use of renewable energy – in industry, in\ntransportation, and in every other sphere of our lives. We will examine several\nadvanced renewable energy technologies; explain why they have not yet taken the\nplace of fossil fuels; and present cutting-edge innovations and promising\nresearch directions – in the ongoing global effort to ensure a sustainable\nfuture for us all.<br><\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<p dir=\"rtl\"><strong>שבוע ראשון<\/strong>: מדוע צריך אנרגיה, משאבי אנרגיה מאובנים ומתחדשים; השפעות גומלין ובעיות בתחומי סביבה, בריאות, גיאופוליטיקה ובטחון אנרגטי; היבטים כלכליים של אנרגיה.<br><\/p>\n<p dir=\"rtl\"><strong>שבוע שני<\/strong>: מושגי יסוד באנרגיה: סוגי אנרגיה, הספק, חום ועבודה, המרה ושימור אנרגיה, יעילות.<\/p>\n<p dir=\"rtl\"><strong>שבוע שלישי<\/strong>: אנרגית שמש ותכונותיה, ריכוז קרינת שמש, עקרונות המרה פוטוולטאית, מערכות פוטוולטאיות.<\/p>\n<p dir=\"rtl\"><strong>שבוע רביעי<\/strong>: המרה תרמית של אנרגית שמש, קולטים לחימום מים, תחנות כוח סולריות תרמיות, אגירת אנרגיה תרמית.<\/p>\n<p dir=\"rtl\"><strong>שבוע חמישי<\/strong>: אנרגית רוח ותכונותיה, המרת אנרגית רוח לחשמל, טורבינות רוח, שיטת לאגירת חשמל.<br><\/p>\n<p dir=\"rtl\"><strong>שבוע ששי<\/strong>: אנרגית מים, המרה הידרו-חשמלית, ניצול גאות ושפל, אגירה שאובה.<\/p>\n<p dir=\"rtl\"><strong>שבוע שביעי<\/strong>: אנרגית ביומסה, בעירה ישירה, ביו-דלקים בהמרה כימית, ביו-דלקים בהמרה ביולוגית, סיכום הקורס.<\/p>\n<p dir=\"rtl\"><br><\/p>\n<p><strong>Week 1<\/strong>: Why do we need energy, energy resources, problems due to extensive use of fossil fuels.<\/p>\n<p><strong>Week 2<\/strong>: Basic concepts in energy: forms of energy, power, heat and work, conversion and conservation of energy, efficiency.<\/p>\n<p><strong>Week 3<\/strong>: Solar energy, concentration of solar radiation, principles of photovoltaic conversion, photovoltaic systems.<\/p>\n<p><strong>Week 4<\/strong>: Thermal conversion of solar energy, water-heating collectors, solar thermal power plants, thermal energy storage.<\/p>\n<p><strong>Week 5<\/strong>: Wind Energy, conversion of wind energy to electricity, wind turbines, methods of electricity storage.<\/p>\n<p><strong>Week 6<\/strong>: Types of water energy, hydroelectric conversion, tides energy, pumped storage.<\/p>\n<p><strong>Week 7<\/strong>: Biomass energy, direct combustion, chemical conversion to bio-fuels, biological conversion to bio-fuels, conclusion of course.<\/p>",
    "estimatedClassWorkload": "2-3 hours\/week",
    "recommendedBackground": "<p dir=\"rtl\">\nרקע קודם: אלגברה ופיסיקה ברמת תיכון.<\/p>\n<p dir=\"ltr\">Recommended background: high school algebra and physics<\/p>",
    "links": {

    }
}