{"id":228,"shortName":"digitalmedia","name":"Creative Programming for Digital Media & Mobile Apps","language":"en","shortDescription":"For anyone who would like to apply their technical skills to creative work ranging from video games to art installations to interactive music, and also for artists who would like to use programming in their artistic practice.","aboutTheCourse":"This course will teach you how to develop and apply programming skills to creative work. This is an important skill within the development of creative mobile applications, digital music and video games. It will teach technical skills needed to write software that make use of images, audio and graphics, and will concentrate on the application of these skills to creative projects.   Additional resources will be provided for students with no programming background.<br><br>","targetAudience":0,"courseSyllabus":"<div>Week 1: Introduction: sonic painter<\/div><div>Week 2: Interactive D\/VJ app<\/div><div>Week 3: Music player and sensor controlled visualiser<\/div><div>Week 4: Game with physical modelling and synthesis<\/div><div>Week 5: APIs accessing and processing social media data<\/div><div>Week 6: Music machine<\/div>","courseFormat":"<div>The course will consist of 2 elements: the development of technical&nbsp;skills for software design using a range of media, and the development&nbsp;of creative work that applies these skills. Each week will consist of:<\/div><div><br>● A lecture on a technical topic (e.g. writing image or audio&nbsp;processing software)<\/div><div>● A lecture on creative skills related to the technical topic (e.g.&nbsp;how to create better images through photography \/ editing or&nbsp;how to create more effective audio) as well as suggestions on&nbsp;project development.<\/div><div>● A set of exercises to practice the technical and creative skills&nbsp;covered in the lecture<\/div><div>● Week by week guidance for working on your creative projects<br>● An additional lecture for students with no programming&nbsp;background<\/div>","suggestedReadings":"There is no required reading. <br><br>If you would like a book, this book is an excellent introduction to Processing, the programming environment we are using. <br><br><a href=\"http:\/\/www.amazon.com\/books\/dp\/0123736021\" target=\"_blank\" title=\"Link: http:\/\/www.amazon.com\/books\/dp\/0123736021\">http:\/\/www.amazon.com\/books\/dp\/0123736021<\/a>","instructor":"Marco Gillies, Matthew Yee-King and Mick Grierson","estimatedClassWorkload":"5-10 hours\/week","recommendedBackground":"Most students are expected to have some background in programming and\/or computer science, and some experience of (possibly extra curricular) creative work. The course is also suitable for students new to computer programming but with a strong arts background, and a desire to develop skills in creative applications development.","links":{}}