{
    "id": 211,
    "shortName": "introbiology",
    "name": "Preparation for Introductory Biology: DNA to Organisms",
    "language": "en",
    "shortDescription": "Through this class you should be able to explain basic concepts in cellular and molecular biology using correct terminology, as well as develop critical thinking and problem-solving skills that can be applied to all of your studies of biology.",
    "aboutTheCourse": "<p>This course is designed for students who are taking or about\nto take introductory biology at the college level. &nbsp;Its focus will be providing the repeated\npractice and critical thinking activities that will enable students to be\nsuccessful in the class in which they are formally enrolled.<\/p><p><span><strong>WARNING: This course is more \"strict\" than many Coursera courses:<\/strong><\/span><\/p><ul><li><span><strong>It makes heavy use of peer assessment assignments. They are required to earn a Distinction certificate.<\/strong><\/span><\/li><li><span><strong>Quizzes are timed<\/strong><\/span><\/li><li><span><strong>All quizzes and peer assessments have weekly due dates<\/strong><br><\/span><\/li><\/ul><p><span>\n<br>\nThis course will\ncover the foundational concepts of cell biology and chemistry:<\/span><\/p><ul><li>Parts of a cell and its membrane<\/li><li>Polarity, charge and water<\/li><li>Membrane transport, rearranging the cell and&nbsp;&nbsp;cell movement<\/li><li>Biological macromolecules and their functional chemistry<\/li><li>Manufacturing and transporting of proteins<\/li><li>Membrane potentials and action potentials<\/li><li>Genes, alleles, mutations<\/li><li>Cellular respiration, photosynthesis as redox reactions<br><\/li><\/ul><br>This course is part of a research project to study student learning at UCI. The study information sheet is posted <a target=\"_blank\" href=\"https:\/\/d396qusza40orc.cloudfront.net\/introbiology%2FCourse%20Website%2F2010-7739_Study_Info_Sheet_%2528Summer%2529_4.12.13.PDF\">here<\/a>. You can opt out of your data being used as part of anonymous analysis by contacting Dr. Sun as listed on the information sheet.",
    "targetAudience": 0,
    "courseSyllabus": "<ul><li>Week One: Molecules, polarity, cell membranes and water movement<br><\/li><li>Week Two: Protein synthesis and localization<br><\/li><li>Week Three: Neurophysiology, genes and mutations<br><\/li><li>Week Four: Redox reactions, respiration and photosynthesis<br><\/li><\/ul>",
    "estimatedClassWorkload": "8-10 hours\/week",
    "recommendedBackground": "No background required.<br>Students who have had high school biology and algebra will find the class much easier.",
    "links": {

    }
}