{"id":1512,"shortName":"massiveteaching","name":"Teaching goes massive: new skills required","language":"en","previewLink":"https:\/\/class.coursera.org\/massiveteaching-001\/lecture\/preview","shortDescription":"The course offers a review of (at least) the business, legal, pedagogical and technical aspects of MOOCs, destined to higher education professionals who might feel threatened by them in terms of job security.","aboutTheCourse":"The course grew out of the author's experiences as an early adopter and advocate of newer technologies (such as Coursera) for online teaching.&nbsp;<br>During the past year, the author often came in contact with higher education professionals who felt lost in the new landscape, and unprepared technology-wise. This is an attempt to educate anyone in this situation, and thereby empower everyone to anticipate changes in the field and make better professional decisions.&nbsp;<br>Part of the emphasis will be to explain the technology, because it was and will be a catalyst of further evolutions in education.","targetAudience":3,"courseSyllabus":"There is no set syllabus for the course (see Course Format), beyond a proposition of covering the following topics:<br><ul><li>business: how companies and startups think;<br><\/li><li>legal: copyright and privacy issues;<\/li><li>pedagogical: how technology makes good teaching practical;<\/li><li>technological: Web 2.0, cloud services, interoperability standards, etc.<\/li><\/ul>The course might also include educated guesswork on what the next couple years might bring.<br><br>","courseFormat":"In the first week, we will provide a short summary of proposed content of the course.&nbsp;<br><br>The content of the later weeks will be decided on by the students, and should cover the proposed content and more.<br><ul><\/ul><div><br><\/div>","suggestedReadings":"\"Readings\" will come naturally during the course as basis for discussion.","estimatedClassWorkload":"1-2 hours\/week","recommendedBackground":"The course is mostly intended for higher education professionals: teachers, but also possibly administrators, e-learning staff, IT support, etc<br>People outside of this scope are also very welcome, as they can bring in new perspective to the discussion.","links":{}}