{
    "id": 896,
    "shortName": "mmds",
    "name": "Mining Massive Datasets",
    "language": "en",
    "shortDescription": "This class teaches algorithms for extracting models and other information from very large amounts of data.  The emphasis is on techniques that are efficient and that scale well.",
    "aboutTheCourse": "We introduce the participant to modern distributed file systems and MapReduce, including what distinguishes good MapReduce algorithms from good algorithms in general. &nbsp;The rest of the course is devoted to algorithms for extracting models and information from large datasets. &nbsp;Participants will learn how Google's PageRank algorithm models importance of Web pages and some of the many extensions that have been used for a variety of purposes. &nbsp;We'll cover locality-sensitive hashing, a bit of magic that allows you to find similar items in a set of items so large you cannot possibly compare each pair. &nbsp;When data is stored as a very large, sparse matrix, dimensionality reduction is often a good way to model the data, but standard approaches do not scale well; we'll talk about efficient approaches. &nbsp;Many other large-scale algorithms are covered as well, as outlined in the course syllabus.",
    "targetAudience": 1,
    "courseSyllabus": "<p>Week 1:<br>\nMapReduce<br>\nLink Analysis -- PageRank<\/p>\n<p>Week 2:<br>\nLocality-Sensitive Hashing -- Basics + Applications<br>\nDistance Measures<br>\nNearest Neighbors<br>\nFrequent Itemsets<\/p>\n<p>Week 3:<br>\nData Stream Mining<br>\nAnalysis of Large Graphs<\/p>\n<p>Week 4:<br>\nRecommender Systems<br>\nDimensionality Reduction<\/p><p><\/p>\n<p>Week 5:<br>\nClustering<br>\nComputational Advertising<\/p>\n<p>Week 6:<br>\nSupport-Vector Machines<br>\nDecision Trees<br>\nMapReduce Algorithms<\/p>\n<p>Week 7:<br>\nMore About Link Analysis -- &nbsp;Topic-specific PageRank, Link Spam.<br>\nMore About Locality-Sensitive Hashing<\/p>",
    "estimatedClassWorkload": "8-10 hours\/week",
    "recommendedBackground": "A course in database systems &nbsp;is recommended, as is a basic course on algorithms and data structures. &nbsp;You should also understand mathematics up to multivariable calculus and linear algebra.<br>",
    "links": {

    }
}