{
    "id": 430,
    "shortName": "globalhealthoverview",
    "name": "Global Health: An Interdisciplinary Overview",
    "language": "en",
    "shortDescription": "This course proposes an overview of current global health challenges drawing on the insights of several academic disciplines including medicine, public health, law, economics, social sciences and humanities. This interdisciplinary approach will guide the student into seven critical topics in global health.",
    "aboutTheCourse": "Course coordinators: Prof. Antoine Geissbuhler, MD, Prof. Louis Loutan,\nMD, Dr Slim Slama, MD and Dr Didier Wernli, MD, MA\n<br>Course director: Dr Samantha Battams, PhD<br>Course assistant: Dr Rafael Ruiz de Castaneda, PhD\n<br>\n<br>Our globalised world has posed new challenges for global health. Infectious diseases have the potential to travel quickly and spread widely\nacross countries (e.g. due to increased international travel). The determinants of health (such as the food system) are across country borders, leading to a growing burden in non-communicable diseases in both developed and developing countries. Issues\nin traditionally non health sectors such as climate change or trade\ncan have dramatic and worldwide effects on health and health systems.\n<br>\n<br>These short examples illustrate what Global Health is about:&nbsp; issues\nthat not only cross national boundaries but also disciplinary territories.\nIn our interdependent world, more and more health issues cannot be addressed\nby a country nor by a sector alone and require collaboration, coordination\nand integration.\n<br><br>The course will draw from academic personnel working across disciplines and the \nwider community in international Geneva (e.g. international \norganisations, NGOs). It will utilise an ecological or 'systems' perspective, along with a social determinants and human rights approach to health.<br>",
    "targetAudience": 0,
    "courseSyllabus": "Week 1. Introduction to global health concepts\n<br>Week 2. Emerging trends in global health: Infectious diseases\n<br>Week 3. Emerging trends in global health: Non-communicable diseases, mental disorders and disability\n<br>Week 4. Governance for global health, health systems and financing\n<br>Week 5. Foreign policy, trade and health\n<br>Week 6. Research, development, innovation and technology for global health\n<br>Week 7. The environment, sustainable development and health\n<br>Week 8. Summary and Assignments",
    "estimatedClassWorkload": "6-7 hours\/week",
    "recommendedBackground": "No background is required; all are welcome!\n<br>",
    "links": {}
}