{
    "id": 1423,
    "shortName": "neuraldata",
    "name": "Exploring Neural Data",
    "language": "en",
    "shortDescription": "Try your hand at understanding the brain by learning to analyze neural data yourself!  Working with real neural data sets from neuroscience research labs, you’ll learn data analysis techniques so you can discover for yourself how the brain works.",
    "aboutTheCourse": "<strong>Exploring Neural Data<\/strong> is an opportunity to learn about neuroscience research and explore questions related to how brains work. It is an introductory level course designed to help you understand the real-life challenges faced by neuroscientists as they work with the large amount of data they collect from the brain. Leading neuroscientists will give tours of their labs, describe their research, and explain their data analytic techniques. You will have the chance to explore actual data collected in these researchers' labs.<br><br>Throughout the course, you will gain knowledge in three main areas: basic principles of neuroscience and questions driving research in this field; programming with the open-source language Python; and essential techniques for data analysis. We will begin by exploring single neurons, then turn our attention to multiple neurons, and finally consider tools that sample from tens of thousands of neurons. At the end of the class, you will have the opportunity to investigate in detail a data set of your choice provided by one of the researchers whose work you've learned about.<br>",
    "targetAudience": 0,
    "courseSyllabus": "<strong>Module 1<br><\/strong>What does the brain tell us? Exploring neural responses<br><br><strong>Module 2<br><\/strong>Why are humans unique? Exploring motor control<br><br><strong>Module 3<\/strong><br>How do we make sense of our senses? Exploring visual objects<br><br><strong>Module 4<\/strong><br>What happens when we sleep? Exploring brain states<br><br><strong>Module 5<br><\/strong>Delving deeper: Final projects<strong><br><\/strong><strong><\/strong><strong><\/strong><strong><\/strong>",
    "estimatedClassWorkload": "5-8 hours\/week",
    "recommendedBackground": "There are no prerequisites for this class. We welcome anyone who is curious about the subject and wants to learn more about the collection and analysis of neuroscience data.<br><br>Knowledge of basic programming (arrays, loops, etc.) may help you get started quickly, but there is no expectation that you have prior experience with programming. Optional materials designed to help you get started with Python will be available at the beginning of the course.<br>",
    "links": {}
}