{"id":1032,"shortName":"probability","name":"Probability","language":"en","shortDescription":"How should we interpret chance around us?  Watch beautiful mathematical ideas emerge in a glorious historical tapestry as we discover key concepts in probability, perhaps as they might first have been unearthed, and illustrate their sway with vibrant applications taken from history and the world around.","aboutTheCourse":"<p>The renowned mathematical physicist Pierre-Simon, Marquis de Laplace wrote in his opus on probability in 1812 that “the most important questions of life are, for the most part, really only problems in probability”.&nbsp; His words ring particularly true today in this the century of “big data”.<\/p><p>\n\n<\/p><p>This introductory course takes us through the development of a modern, axiomatic theory of probability.&nbsp; But, unusually for a technical subject, the material is presented in its lush and glorious historical context, the mathematical theory buttressed and made vivid by rich and beautiful applications drawn from the world around us.&nbsp; The student will see surprises in election-day counting of ballots, a historical wager the sun will rise tomorrow, the folly of gambling, the sad news about lethal genes, the curiously persistent illusion of the hot hand in sports, the unreasonable efficacy of polls and its implications to medical testing, and a host of other beguiling settings.&nbsp; A curious individual taking this as a stand-alone course will emerge with a nuanced understanding of the chance processes that surround us and an appreciation of the colourful history and traditions of the subject.&nbsp; And for the student who wishes to study the subject further, this course provides a sound mathematical foundation for courses at the advanced undergraduate or graduate levels.&nbsp;<\/p>","targetAudience":0,"courseSyllabus":"<p>The course is divided into five topical segments which taken together constitute a self-contained introduction to mathematical probability.&nbsp; Read on for a bird's-eye view of these topics.<\/p><p><b>Topic I: Towards an axiomatic theory of chance<\/b><\/p><p>We begin with the stirrings of a mathematical theory in the 17th century in the resolution of a historical wager of the Chevalier de Méré and follow the developments in understanding leading to the modern axiomatic foundations of probability established in the 20th century.<\/p><p><b>Topic II: From side information to conditional probabilities<\/b><\/p><p>In this segment we shall encounter unanticipated challenges to intuition when presented with side information about a probability experiment and discover the subtle importance of additivity in a tongue-in-cheek exhortation on the survival of our species.<\/p><p><b>Topic III: Independence—the warp and the woof in the fabric of chance<\/b><\/p><p>The distinctive and rich intuitive content of the theory of probability and its link to observations in physical experiments is provided by the notion of statistical independence.&nbsp; We follow the progress from multiplication tables to a formal notion of independence, with enticing applications in a casino game, genetics, and sports psychology to whet the appetite.<\/p><p><b>Topic IV: From polls to bombs and queues—enter the binomial and the Poisson<\/b><\/p><p>We next turn to ruminations on the implausible efficacy of small polls in tracking sentiments of large populations and discover how the hugely important binomial distribution emerges from these considerations.&nbsp; We then retrace the historical discovery of a curious approximation to the binomial and stumble upon the fascinating Poisson distribution. &nbsp;We promptly explore applications ranging from the merely weighty to the diverting and macabre, the distribution of bomb hits in London in World War II being particularly memorable.<\/p><p><b>Topic V: The fabulous limit laws—the bell curve pirouettes into the picture<\/b><\/p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p><p><span>The law of large numbers is a cornerstone of probability responsible for much of its intuitive content and it is fitting that our gradual development concludes with it.&nbsp; Among its rich applications, we discover why polls work and the implications to medical testing.&nbsp; The remarkable bell curve now takes centre stage completing the triad of fundamental distributions and we discover why polls <i>really<\/i> work.<\/span><\/p><ol><i><ol><ol>\n\t\t<\/ol>\n\t<\/ol>\n<\/i><\/ol>","courseFormat":"<p>The main body of the course consists of 240 video lectures in total of which 20 video lectures contain review materials for students who wish to refresh their background and 71 video lectures contain optional, more theoretical material. &nbsp;A typical video lecture ranges between 5 minutes to 15 minutes in length. &nbsp;These lectures are grouped into twelve “tableaux”, each tableau consisting of a comprehensive exploration of a key idea, rather like a chapter in a book. Each of the topics listed above will be covered by two to three tableaux comprising one to two weeks of lectures.&nbsp; A serious student of a subject is not an idle spectator to a variety show but learns best by active engagement.&nbsp; There are accordingly seven standalone graded homework sets that are not part of the video lectures.<\/p><p>\n\n<\/p><p><span>Bonus lectures are scattered through the sequence: these take the form of optional “<i>dangerous bend<\/i>” tableaux and deal with topics that are informative digressions from the main theme.&nbsp; Think of these as fragrant, frequently exotic, and sometimes dangerous tributaries branching from the main course of the river of probability. &nbsp;A student can&nbsp;safely explore these at leisure, as time and inclination allow, either during the course as they arise or at a later time. &nbsp;&nbsp;(But she may well find the ideas explored in these tableaux too enticing to skip. This, at least, was the experience of the instructor when he first encountered these tempting topics.)&nbsp;<\/span><\/p>","suggestedReadings":"While the lectures are designed to be self-contained and there is no required textbook, for the student who likes to have a reference book handy, the material itself is drawn primarily from the first half of the book&nbsp;<strong><a href=\"http:\/\/www.amazon.com\/The-Theory-Probability-Explorations-Applications\/dp\/1107024471\" target=\"_blank\">The Theory of Probability: Explorations and Applications<\/a><\/strong>&nbsp;(publisher&nbsp;<a href=\"http:\/\/www.cambridge.org\/us\/academic\/subjects\/engineering\/communications-and-signal-processing\/theory-probability-explorations-and-applications\" target=\"_blank\">Cambridge University Press<\/a>). &nbsp;This expansive book contains an eclectic mixture of undergraduate and graduate material, all presented in the narrative spirit of this course. &nbsp;It is likely to be of most use for a student who is further along in her mathematics preparation with a solid calculus background and who wishes to make a deeper study of the theory and see an even richer cast of applications by self-study or by taking further courses in the subject. &nbsp;If used in conjunction with the course, the student should look at the suggestions on how to read the book on page xxi and, especially, the suggested chapters for undergraduates, before launching into it.","estimatedClassWorkload":"4-5 hours\/week","recommendedBackground":"<p><\/p><p><span>With all its historical context and diverse modern applications, <i>this is fundamentally a class on mathematical probability<\/i>.&nbsp; As background a student should have a solid exposure to at least one semester of calculus (as is typically covered in a freshman college class or in the AP or IB programmes).&nbsp; A student should be comfortable with algebraic and functional notation for variables, sets, and functions. She should be familiar with the ideas of sequences and limits and have seen the common convergent series. &nbsp;Exposure to differential and integral calculus is&nbsp;<i>not<\/i>&nbsp;essential for this course.<\/span><\/p>\n<p>In addition to basic calculus, we will need some elementary ideas from combinatorics and the language of sets.&nbsp; I've provided background review lectures on these topics. These are made available with the preview.<\/p>\n<p><i>Now, to be sure, all these things I've listed are necessary background elements but above all the most important things a student should bring with her are a liking for mathematical reasoning, a devouring curiosity about how things work, and a delight in intellectual discovery.<\/i><\/p>","links":{}}