{
    "id": 720,
    "shortName": "reasonandpersuasion",
    "name": "Reason and Persuasion: Thinking Through Three Dialogues By Plato",
    "language": "en",
    "shortDescription": "In this course we will study Plato's ancient art of blowing up your beliefs as you go, to make sure they're built to last. We spend six weeks studying three Platonic dialogues, then two more weeks pondering a pair of footnotes to Plato; that is, we will consider some contemporary manifestations of issues Plato discusses. Our focus will be: moral theory and moral psychology. ",
    "aboutTheCourse": "<p><i>\"The safest general characterization of the European\nphilosophical tradition is that it consists of a series of footnotes to Plato.”<\/i><\/p>\n\n<p>– A. N. Whitehead<\/p>It\nturns out: the more you blow up your beliefs as you go, the more they stay the same.<br><br>Why\n‘Reason and Persuasion’? The title is generic, and indicates that the course\nwill be - if this is what you are looking for - a general, introduction to\nphilosophy, as it tends to be taught at the university level. But the title\nalso points to a specific problem: reason without persuasion is useless;\npersuasion without reason is dangerous. Plato worried about it. So will we.<br><br>The\ncourse will be of interest to a wide variety of students. There are a variety\nof reasons why you might want to know at least a little about what Plato\nthought and wrote. I will do my best to teach in a way that accommodates as\nwide a range of likely interests in the subject as i can manage.",
    "targetAudience": 0,
    "courseSyllabus": "<strong>WEEK 1 – Introductions<\/strong><br><br>To the course; to philosophy; to Plato and Socrates; to the dialogue form; to Plato’s <i>Euthyphro<\/i>. Who are these people? Why are they interesting? <br><br><strong>WEEK 2 - Plato's <\/strong><i><strong>Euthyphro<\/strong><\/i><strong>: Two Problems<\/strong><strong><\/strong><br><br>One practical,\none definitional. 1) Euthyphro thinks his dad is a murderer. What should you do in a case like that? 2) what is holiness? Add a few thoughts about the ancient Athenian justice system. What would be an ideal justice system for handling such a case? Also, what good is it talking to Euthyphro\nif he isn't the sort of person who's ever going to listen? (Especially if you humiliate him like that.) <br><br><strong>WEEK 3 – Plato’s <\/strong><i><strong>Meno<\/strong><\/i><strong>: What is virtue?<\/strong><strong><\/strong><br><br>Final reflections on <i>Euthyphro<\/i>, with notes about Greek tragedy. What's our best guess\nabout what Plato is getting at, writing a dialogue that seems to go nowhere? Then, <i>Meno<\/i>: new characters and a new problem. What is virtue? Meno means\nsomething like this: what does it take to be a success? To be excellent! But soon Socrates has turned everything strange. Meno, like Euthyphro, is bad at this game. What are some basic ethical theories?<br><br><strong>WEEK 4 - Plato's <\/strong><i><strong>Meno<\/strong><\/i><strong>: Virtue - Geometry - Virtue. <\/strong><br><br>This dialogue has a funny\nstructure. A piece of math between two slices of virtue. Not to worry, reader! Meno finds it as unpalatable as you do. The key turns out to be : we need to understand the nature of the mind; its basic relationship to the world.\nPlato has a bold but strange model of the mind, and the relationship between ethics and mathematics. We end on a practical note: Meno is sure 1) that he knows it all; 2) that nothing can really be known. This makes him hard to teach. It's good to notice this about people.\n<br><br><strong>WEEK 5 - Plato's <\/strong><i><strong>Republic<\/strong><\/i><strong>, Book I: Again, With Fathers and Sons<\/strong><br><br>What is justice? Socrates faces a series of three debating partners. Two are easy: the father-son tag-team, Cephalus and Polemarchus.\nBut the Boss Fight - against Thrasymachus - is hard. But Cephalus - nice old retired businessman - and his honor-loving, earnest son are interesting. They aren't clever at debate (how many people are?) but they're real. That makes\nthem important. Also, Book I is Plato's gateway into <i>Republic<\/i>. (Who knew the guys at the gates of Utopia would be such regular guys?) So I should say something about all that.<br><br><strong>WEEK 6 - Plato's <\/strong><i><strong>Republic<\/strong><\/i><strong>, Book I: Thrasymachus. <\/strong><br><br>Is it in my self-interest to be just? Isn't justice just a second-best option for those who don't have what it takes to be tyrants? Worse: isn't justice just whatever those who rule say it is. So: justice is the advantage of the stronger. Thrasymachus is a cynic, but it's hard to deny he's got half a point. He's a better debater, too. Thoughts about egoism and altruism. <br><br><strong>WEEK 7 - Moral Psychology <\/strong><br><br>I am going to discuss a popular 'positive psychology' book, by Jonathan Haidt, <i>The Happiness Hypothesis<\/i>. It's a good book, and a useful snapshot of\nPlato's legacy. Haidt is, in some ways, very Platonic; in other ways, very anti-Platonic. Haidt is interested in providing a basically rational account of how the moral mind works - pretty irrationally, it turns out. He wants to improve our knowledge and have it make a real ethical difference. What a rational way to live if you are going to live irrationally?<br><br><strong>WEEK 8 – Ethics and Ethnos<\/strong><br><br>We end, where we began, thinking\nabout the ways in-group\/out-group relations structure our ethical thinking. We turn from Jonathan Haidt to Joshua Greene's book, <em>Moral Tribes<\/em>. Greene, like Haidt, studies moral psychology. He's more on Plato's side than Haidt - without actually being a Platonist. I'll try to bring out how, even if Plato is a bit out of date, empirically (no denying it!) studying Plato still provides us with useful categories for carving up the intellectual landscape. He can help you find your way around, even if you don't decide to follow him very far.<br>",
    "estimatedClassWorkload": "3-4 hours\/week",
    "recommendedBackground": "Here is our <a href=\"https:\/\/d396qusza40orc.cloudfront.net\/reasonandpersuasion%2Flecture_slides%2Freasonandpersuasionbook.pdf\">textbook<\/a>.\n<br><br>UPDATE: As you may have noted, Amazon does not have the book in stock. Here's the situation. There WILL be a new (4th) edition by the time the course starts. It probably won't be available in print from Amazon before the course starts (but I'm trying!) but it will be available in shiny, cutting-edge PDF. And this PDF will not be print-locked like the old one. So paper will be available to all, even if you have to spend your own toner on it. It will also be available on Kindle but, since I have to arrange all that myself, it may take time. (Turning a book with so many illustrations into an EPUB is fiddly.)<br>",
    "links": {

    }
}