{"id":1361,"shortName":"olympicgames","name":"The Olympic Games and the Media","language":"en","shortDescription":"This course analyses the intersection between the Olympic Games and the media and how television and other media contribute to fund, shape and disseminate the major sporting spectacle in the world: the Olympic Games.","aboutTheCourse":"This course allows students to <b>explore the universe of media and their role in the construction of the Olympic Games<\/b>, the greatest sporting event worldwide. After providing a general context regarding what the modern Olympic Games represent for\nour culture and what are the main constituents of the so called Olympic Movement, the course focuses on media as funders of the Olympics, disseminators of their values system and creators of the global image of the Games. More specifically, we will deepen\ninto:\n\n<br>\n<ul>\n    <li>The history of media and the Olympic Games<\/li>\n    <li>The television rights and sponsorship programs<\/li>\n    <li>How the media operate during the Olympics<\/li>\n    <li>The television production of the Olympic Games and their worldwide audiences<\/li>\n    <li>The opening and closing ceremonies and the symbols and rituals of the Games<\/li>\n    <li>The management of new media and social networking websites such as Facebook and Twitter by the Olympic Family.<\/li>\n<\/ul>\n<br><b>Objectives:<\/b>\n<br>\n<ul>\n    <li>You will learn the mechanisms and expressive languages used by television in the production and broadcasting of the Olympics.<\/li>\n    <li>Students will gain knowledge about the structure and funding methods and sponsorship programs of the Olympics.<\/li>\n    <li>You will know the nature and management of communication on new media and social networking.<\/li>\n    <li>Students will learn which is the cultural context of the Olympic Games and their symbols and rituals<\/li>\n<\/ul>\n<br>The course will be delivered in <b>English<\/b><i> <\/i>with <strong>subtitles in English and Spanish<\/strong>. <i><br><br><\/i><i>The Olympic Games and the Media<\/i> is a teaching project promoted by the <a href=\"http:\/\/ceo.uab.es\/\" target=\"_blank\">Olympic Studies Centre at the Universitat Autònoma de Barcelona<\/a>,\na university centre aimed at research, educate and disseminate knowledge on the Olympic and sporting phenomenon. The course team includes:\n<br>\n<br>\n<ul>\n    <li>Emilio Fernandez Peña. <i>Instructor<\/i>.<\/li>\n    <li>José Manuel Pardo Gila. <i>Teacher assistant.<\/i>\n        <br>\n    <\/li>\n    <li>Xavier Ramón. <i>Teacher assistant<\/i>.<\/li>\n    <li>Berta Cerezuela<i>. Manager<\/i>.<\/li><li>Mauricio Javier Cordova. <i>Marketing <br><\/i><\/li><li><i>Tassos Katsiadramis. Marketing<br><\/i><\/li>\n    <li>Miguel Ángel Martín. <i>Video script<\/i>.<\/li>\n    <li>Raul Gutiérrez García. <i>Camcorder operator and edition<\/i>.<\/li>\n    <li>Joel Santaeulària Boquet. <i>Camcorder Operator<\/i>.<br><\/li>\n    <\/ul>\n\n<br><br>\n\n<div>\n<i>\n<strong>SOBRE EL CURSO (versión en español)<\/strong>\n<br>\nEste curso permite a los estudiantes explorar el universo de los medios de comunicación y su papel en la construcción de los Juegos Olímpicos, el mayor evento deportivo del mundo. Después de proporcionar un contexto general sobre lo que representa los Juegos Olímpicos modernos para nuestra cultura y cuáles son los principales constituyentes del llamado Movimiento Olímpico, el curso se centra en los medios de comunicación como financiadores de los Juegos Olímpicos, difusores de su sistema de valores y creadores de la imagen global de los Juegos. Más concretamente, el curso profundizará en:\n <br><br>\n<ul>\n  <li>La historia de los medios de comunicación y de los Juegos Olímpicos<\/li>\n  <li>Los derechos de televisión y programas de patrocinio<\/li>\n  <li>¿Cómo operan los medios durante los Juegos Olímpicos?<\/li>\n  <li>La producción de la televisión de los Juegos Olímpicos y sus audiencias en todo el mundo<\/li>\n  <li>Las ceremonias de apertura y clausura, los símbolos y rituales de los Juegos<\/li>\n  <li>La gestión de los nuevos medios de comunicación y de redes sociales como Facebook y Twitter por parte de la Familia Olímpica.<\/li>\n<\/ul>\n\n<br>\n<strong>OBJETIVOS:\n<\/strong>\n<br>\n<ul> \n  <li>Aprenderás los mecanismos de realización y el lenguaje audiovisual utilizado por la televisión en la producción y transmisión de los Juegos Olímpicos.<\/li>\n  <li>Adquirirás conocimientos sobre los modos de estructura, financiación y los programas de patrocinio de los Juegos Olímpicos.<\/li>\n  <li>Conocerás las características especiales y las formas de gestión de la comunicación en los nuevos medios y las redes sociales.<\/li>\n  <li>Aprenderás cuál es el contexto cultural de los Juegos Olímpicos, sus símbolos y rituales.<\/li>\n<\/ul>\n\n<br>\nEl curso será impartido en <strong>inglés <\/strong>con <strong>subtítulos en inglés y en castellano<\/strong>.\n<br><br>\nLos Juegos Olímpicos y los medios de comunicación es un proyecto educativo promovido por el Centre d’Estudis Olímpics i de l’Esport de la Universitat Autònoma de Barcelona, un centro universitario que fomenta la investigación, la educación y la difusión del conocimiento sobre el fenómeno Olímpico y deportivo. El equipo del curso lo conforman:\n<br><br>\n\n<ul>\n  <li>Emilio Fernandez Peña. Profesor.<\/li>\n  <li>José Manuel Pardo Gila. Profesor ayudante.<\/li>\n  <li>Xavier Ramón. Profesor ayudante.<\/li>\n  <li>Berta Cerezuela. Manager.<\/li>\n  <li>Mauricio Javier Cordova. Marketing.<\/li><li><i>Tassos Katsiadramis. Marketing<\/i><\/li>\n  <li>Miguel Ángel Martín. Guión de vídeo.<\/li>\n  <li>Raúl Gutiérrez García. Operador de cámara de vídeo y edición.<\/li>\n  <li>Joel Santaeulària Boquet. Operador de cámara de vídeo.<\/li>\n\n<\/ul>\n<\/i>\n<\/div><br><br>","targetAudience":0,"courseSyllabus":"<strong>WEEK 1. INTRODUCTION TO MEDIA AND THE CULTURE OF THE OLYMPICS <\/strong>\n<br> \n<ul>\n<li>1.1 Welcome<\/li>\n<li>1.2 Introduction <\/li>\n<li>1.3 What are the Olympic Games<\/li>\n<li>1.4 Constituents and Governance<\/li>\n<li>1.5 Olympic Charter<\/li>\n<li>1.6 Pierre de Coubertin<\/li>\n<li>1.7 On the Precedents of the Modern Olympic Games <\/li>\n<li>1.8 The First Olympic Congress <\/li>\n<li>1.9 The Zeitgeist of the Modern Olympic Games <\/li>\n<li>1.10 The Olympic, Sport and the Transformation of Society <\/li>\n<li>1.11 The Ancient Olympic Games<\/li>\n<li>1.12 Next week<\/li>\n<\/ul>\n<br>\n\n<strong>WEEK 2. THE OLYMPIC GAMES AND MEDIA <\/strong>\n<br>\n<ul>\n<li>2.1 Introduction<\/li>\n<li>2.2 The Olympic Games System<\/li>\n<li>2.3 Audiovisual and Postmodernity<\/li>\n<li>2.4 Communication and the Games: a Chronology &lt;<\/li>\n<li>2.5 The Media’s in the Boost of the Modern Olympism (1894-1932) <\/li>\n<li>2.6 Television and Media Internationalisation of the Olympics (1936-1960) <\/li>\n<li>2.7 The Global Olympic Games (1964-1992) <br><\/li>\n<li>2.8 Internet, the Social Web and the Commercialisation of the Olympic Games (1996-2012) <\/li>\n<li>2.9 Introduction to the Language of Television <\/li>\n<li>2.10 Next week <\/li>\n<\/ul> \n<br>\n<strong>WEEK 3. THE MEDIA DURING THE GAMES <\/strong>\n<br>\n<ul>\n<li>3.1 Introduction <\/li>\n<li>3.2 The Television Production of the Olympic Games\n\n <ul>\n <li>3.2.1 The Working of a Television Production System <\/li>\n <li>3.2.2 Planning the Production<\/li>\n <\/ul>\n<\/li>\n<li>3.3 Programming the Olympics <\/li> \n<li>3.4 The Olympics Becoming into a Storytelling or the Construction of the Olympic Hero <\/li>\n<li>3.5 The Media during the Olympics and OBS <\/li>\n<li>3.6 Ritual and simbols of the Olympic Games<\/li>\n<li>3.7 The Olympic Ceremonies, Structure, Protocol and Symbols<\/li>\n<li>3.8 The Olympic Ceremonies and the Television <\/li>\n<li>3.9 Next week <\/li>\n <\/ul>\n<br>\n\n<strong>WEEK 4. OLYMPIC NEW MEDIA: ACTORS, MANAGEMENT AND CONTENTS <\/strong>\n<br>\n<ul>\n<li>4.1 Introduction <\/li>\n<li>4.2 The DNA of the Internet and the Web <\/li>\n<li>4.3 The Nature of the Communication on Social Networking Websites <\/li>\n<li>4.4 Great Processes behind the Communication on Social Networks <\/li>\n<li>4.5 The Social Media and the Olympic Games <\/li>\n<li>4.6 Engagement, Cross-pollination and the Communication Logics on Social Networking Websites <\/li>\n<li>4.7 IOC Social Media Rules <\/li>\n<li>4.8 The Olympic Family and the Social Media during the Olympic Games <\/li>\n<li>4.9 Facebook Participation and Contents during the Olympics<\/li>\n<li>4.10 Towards a New communication and Management Model on Social Networks <\/li>\n<li>4.11 Next week <\/li>\n<\/ul> \n<br>\n<strong>WEEK 5. SPONSORSHIP AND TV RIGHTS MANAGEMENT OF THE OLYMPICS  <\/strong>\n<br>\n<ul>\n<li>5.1 Introduction <\/li>\n<li>5.2 The Olympic Games TV Rights: an Introductory Historical approach <\/li>\n<li>5.3 The Olympic Brand <\/li>\n<li>5.4 The TOP Sponsorship Programs of the Olympics <\/li>\n<li>5.5 Gratitude <\/li>\n<\/ul>\n\n<br>\n<br>\n<b><i>TEMARIO (Versión en español)<\/i><\/b>\n<br>\n<strong><i>SEMANA 1. INTRODUCCIÓN A LOS MEDIOS DE COMUNICACIÓN Y LA CULTURA DE LOS JUEGOS OLÍMPICOS<\/i><\/strong>\n<br> \n<ul>\n<li><i>1.1 Presentación<\/i><\/li>\n<li><i>1.2 Introducción<\/i><\/li>\n<li><i>1.3 ¿Qué son los Juegos Olímpicos?<\/i><\/li>\n<li><i>1.4 Constituyentes y Gobierno<\/i><\/li>\n<li><i>1.5 La Carta Olímpica<\/i><\/li>\n<li><i>1.6 Pierre de Coubertin<\/i><\/li>\n<li><i>1.7 Sobre los precedentes de los Juegos Olímpicos modernos<\/i><\/li>\n<li><i>1.8 El Primer Congreso Olímpico<\/i><\/li>\n<li><i>1.9 El ‘Zeitgeist’ de los Juegos Olímpicos modernos<\/i><\/li>\n<li><i>1.10 Olimpismo, deporte y la transformación de la sociedad<\/i><\/li>\n<li><i>1.11 <i>Los Juegos Olímpicos Antiguos<\/i><\/i><\/li><i>\n<li><i>1.12 Próxima semana<\/i><\/li>\n<\/i><\/ul><i>\n<br>\n\n<strong><i>SEMANA 2. LOS JUEGOS OLÍMPICOS Y LOS MEDIOS DE COMUNICACIÓN<\/i>    <\/strong>\n<br>\n<ul>\n<li><i>2.1 Introducción<\/i><\/li>\n<li><i>2.2 Los Juegos Olímpicos como sistema<\/i><\/li>\n<li><i>2.3 Audiovisual y posmodernidad<\/i><\/li>\n<li><i>2.4 La comunicación y los Juegos: una cronología<\/i><\/li>\n<li><i>2.5 El impulso de los medios de comunicación en el Olimpismo moderno (1894-1932)<\/i><\/li>\n<li><i>2.6 La televisión y la Internacionalización de los Juegos Olímpicos (1936-1960)<\/i><\/li>\n<li><i>2.7 Los Juegos Olímpicos globales (1964-1992)<\/i><\/li>\n<li><i>2.8 Internet, la web social y la comercialización de los Juegos Olímpicos (1996-2012)<\/i><\/li>\n<li><i>2.9 Introducción al lenguaje de la televisión<\/i><\/li>\n<li><i>2.10 Próxima semana<\/i><\/li>\n<\/ul> \n<br>\n<strong><i>SEMANA 3. LOS MEDIOS DURANTE LOS JUEGOS<\/i>     <\/strong>\n<br>\n<ul>\n<li><i>3.1 Introducción<\/i><\/li>\n<li><i>3.2 La producción de televisión en los Juegos Olímpicos<\/i>\n <ul>\n <li><i>3.2.1 El funcionamiento de un sistema de producción de televisión<\/i><\/li>\n <li><i>3.2.2 Planificación de la producción<\/i><\/li>\n <\/ul>\n<\/li>\n<li><i>3.3 La Programación de los Juegos Olímpicos<\/i><\/li> \n<li><i>3.4 La creación de una narración o la construcción del héroe Olímpico<\/i><\/li>\n<li><i>3.5 Los medios de comunicación durante los Juegos Olímpicos y OBS (Olympic Broadcasting Services) <\/i><\/li>\n<li><i>3.6 Rituales y símbolos de los Juegos Olímpicos<\/i><\/li>\n<li><i>3.7 Las ceremonias olímpicas: estructura, protocolo y símbolos<\/i><\/li>\n<li><i>3.8 Las ceremonias olímpicas y la televisión<\/i><\/li>\n<li><i>3.9 Próxima semana<\/i><\/li>\n <\/ul>\n<br>\n\n<strong><i>SEMANA 4. NUEVOS MEDIOS OLÍMPICOS: ACTORES Y GESTIÓN DE CONTENIDOS<\/i> <\/strong>\n<br>\n<ul>\n<li><i>4.1 Introducción<\/i><\/li>\n<li><i>4.2 El ADN de Internet y de la Web<\/i><\/li>\n<li><i>4.3 La naturaleza de la comunicación en las redes sociales<\/i><\/li>\n<li><i>4.4 Grandes procesos tras la comunicación en las redes sociales<\/i><\/li>\n<li><i>4.5 Los medios sociales y los Juegos Olímpicos<\/i><\/li>\n<li><i>4.6 Engagement, cross-pollination y las lógicas de comunicación en las redes sociales<\/i><\/li>\n<li><i>4.7 Normas para la publicación en redes sociales por parte del COI<\/i><\/li>\n<li><i>4.8 La Familia Olímpica y las redes sociales durante los Juegos Olímpicos<\/i><\/li>\n<li><i>4.9 Participación y contenidos durante los Juegos Olímpicos en Facebook<\/i><\/li>\n<li><i>4.10 Hacia un nuevo modelo comunicación y gestión en las redes sociales<\/i><\/li>\n<li><i>4.11 Próxima semana<\/i><\/li>\n<\/ul> \n<br>\n<strong><i>SEMANA 5. PATROCINIO Y GESTIÓN DE LOS DERECHOS TELEVISIVOS DE LOS JUEGOS OLÍMPICOS<\/i>  <\/strong>\n<br>\n<ul>\n<li><i>5.1 Introducción<\/i><\/li>\n<li><i>5.2 Los derechos televisivos de los Juegos Olímpicos: un acercamiento histórico<\/i><\/li>\n<li><i>5.3 TLa marca olímpica<\/i><\/li>\n<li><i>5.4 Los programas de patrocinio de los Juegos Olímpicos<\/i><\/li>\n<li><i>Agradecimientos<\/i><\/li>\n<\/ul><\/i>","courseFormat":"The course lasts for <b>5 weeks<\/b>. \n<br><br>\nEvery week several short videos with the lectures will be available to the students. At the same time, the students will be assessed weekly of the contents offered throughout a test.\n <br><br>\n100% of the final mark will come from the weekly tests (5 in total).\n\n<br><br>\n<b><i>FORMATO DEL CURSO<\/i><\/b>\n<br>\n<i>El curso tiene una duración de <b>5 semanas<\/b>.\n<br><br>\nCada semana proporcionaremos diversos vídeos cortos con los contenidos de las lecciones y que contarán con subtítulos en español e inglés. Al mismo tiempo, semanalmente también se realizará un examen tipo test para evaluar los conocimientos de cada módulo.\n <br><br>\nEl 100% de la nota se obtendrá de los test semanales (5 en total).\n<\/i>","suggestedReadings":"SUGGESTED READINGS (LECTURAS RECOMENDADAS)\n<ul>\n    <li>Fernández Peña, Emilio; Berta Cerezuela; Miquel Gómez Benosa; Chris Kennett; Miquel de Moragas Spà (2011): <i>An Olympic Mosaic: Multidisciplinary Research and Dissemination of Olympic Studies. CEO-UAB: 20 Years<\/i>. Barcelona : Centre d’Estudis Olímpics,\n        Universitat Autònoma de Barcelona; Ajuntament de Barcelona. [<a href=\"http:\/\/ceo.uab.es\/2010\/docs\/C40912_3.pdf\" target=\"_blank\">online<\/a>].<\/li>\n    <li>\n\n        <p>Fernández Peña, E. (2011): “New Media and the Olympic Games: The Olympic Movement and the Social Web in the dissemination of messages”.&nbsp; In E. Fernández Peña, B. Cerezuela, Gómez, M., Kennett, C. and de Moragas Spà, M. (ed.), <i>An Olympic Mosaic: Multidisciplinary Research and Dissemination of Olympic Studies<\/i>,\n            CEO-UAB: 20 Years (1st ed.). Barcelona: CEO-UAB and Ajuntament de Barcelona, pp. 143–52. [<a href=\"http:\/\/ceo.uab.cat\/download\/FernandezPena_NewMediaOlympic.pdf\" target=\"_blank\">online<\/a>].\n            <br>\n        <\/p>\n    <\/li>\n<\/ul>\n<ul>\n    <li>Fernández Peña, E. and Lallana del Rio, I. (2011): “Television and the Olympic Games: Symbiosis, globality and the construction of meaning”.&nbsp; In Fernández Peña, E., Cerezuela, B., Gómez, M., Kennett, C. and de Moragas Spà, M. (ed.), <i>An Olympic Mosaic: Multidisciplinary Research and Dissemination of Olympic Studies,CEO-UAB: 20Years <\/i>\n        (1st ed.). Barcelona: CEO-UAB and Ajuntament de Barcelona, pp. 133–42. [<a href=\"http:\/\/ceo.uab.cat\/download\/FernandezPena-Lallana_TelevisionOlympics.pdf\" target=\"_blank\">online<\/a>].\n    <\/li>\n<\/ul>\n<ul>\n    <li>Fernández Peña, E. (2009). \"Olympic Summer Games and Broadcast Rights. Evolution and Challenges in the New Media Environment\". In <i>Revista Latina de Comunicación Social<\/i>, 64, pp. 1000-1010. La Laguna (Tenerife): Universidad de La Laguna, [<a href=\"http:\/\/www.revistalatinacs.org\/09\/art\/876_Barcelona\/77_144_FernandezEng.html\" target=\"_blank\">online<\/a>]. <br><br><\/li><li>Moragas i Spà, Miquel de; Nancy K. Rivenburgh; James F. Larson (1995): <i>Television in the Olympics<\/i>. London: John Libbey. [<a href=\"http:\/\/books.google.es\/books?hl=es&amp;lr=&amp;id=U_u73VtZcJIC&amp;oi=fnd&amp;pg=PR13&amp;dq=Television+in+the+Olympics&amp;ots=9qYfmetbZy&amp;sig=SuFZ9a2Yr3I7QiXVr8EzKL55QEc#v=twopage&amp;q&amp;f=false\" target=\"_blank\">online<\/a>]<br><\/li><\/ul>","estimatedClassWorkload":"1-3 hours\/week","recommendedBackground":"No background knowledge or skills are required, though we recommend an interest in media and the Olympics as a contemporary phenomenon.\n<br>\n<br>\n\n<i>\n<b>CONOCIMIENTOS PREVIOS<\/b><br>\nNo se requiere ningún conocimiento o habilidades, aunque se recomienda un interés en los medios de comunicación y los Juegos Olímpicos como fenómeno contemporáneo.<\/i>","links":{}}