{
    "id": 2293,
    "shortName": "healthcarejobs",
    "name": "Career 911: Your Future Job in Medicine and Healthcare",
    "language": "en",
    "shortDescription": "This course aims to help high school students, recent graduates, and those considering career transitions explore health care career options and learn strategies for entry into the health care workforce and health related fields.",
    "aboutTheCourse": "<p>There are lots of amazing job opportunities in&nbsp;medicine and healthcare! Join\nus, as we share the strategies and secrets for getting those jobs. This course will introduce you to healthcare professions, help you map a path\ntowards a health career, and&nbsp;impart skills relevant for any career,\nincluding: articulating your personal story, resume and cover letter writing,\njob search, interviewing, professional networking, and professional\ncommunications. In this course, you will hear the&nbsp;personal stories, experiences,&nbsp;and journeys of dozens of people who work in health related careers. You will also have the opportunity to connect with a supportive community of students, mentors, and health care professionals to explore your interests, find resources, and discover exciting new opportunities.<\/p><p>The course features more than 50 different guests and lecturers, including Northwestern University faculty from Feinberg School of Medicine; the Kellogg School of Management; the Medill School of Journalism, Media, Integrated Marketing Communications; the School of Professional Studies; Weinberg College of Arts and Sciences; and the School of Communication. <\/p><p>The course is also a resource and tool through which educators, parents, career counselors and others can support students’ career readiness and professional advancement.<br><\/p>",
    "targetAudience": 3,
    "courseSyllabus": "<p>\nModule 1: Why Health?<\/p><p>\n\n<\/p><ul>\n <li>Explore what\n     health means and what it may look like around the world<\/li>\n <li>Become familiar\n     with a wide range of health careers<\/li>\n <li>Align your\n     personal&nbsp;values with your career<\/li>\n<\/ul><p>\n\n<\/p><p>Module 2: Start Your Health Career Journey<\/p><p>\n\n<\/p><ul>\n <li>Assess&nbsp;how\n     your&nbsp;individual strengths&nbsp;can be&nbsp;valuable in health careers<\/li>\n <li>Explore career\n     paths with your job\/internship search<\/li>\n<\/ul><p>\n\n<\/p><p>Module 3: Leverage Your Personal Story and Networks<\/p><p>\n\n<\/p><ul>\n <li>Create your\n     elevator pitch (speech)<\/li>\n <li>Use your social\n     network to build your professional network<\/li>\n<\/ul><p>\n\n<\/p><p>Module 4: Resumes, Cover Letters, and Written Communications<\/p><p>\n\n<\/p><ul><li>Develop a resume and cover letter<\/li><li>Establish a professional online presence<\/li><\/ul><p>\n\n\n\n<\/p><p>Module 5: In-person Communications - Leverage Your Voice and\nPresence<\/p><p>\n\n<\/p><ul><li>Grow your sphere of influence<\/li><li>Prepare to stand out in an interview<\/li><li>Build focus using mindfulness breathing awareness exercises <\/li><\/ul><p>\n\n\n\n\n\n<\/p><p>Module 6: Next Steps and Transitions<\/p><p>\n\n<\/p><ul><li>Consider the educational credentials that employers look for<\/li><li>Finance your education<\/li><li>Thrive in diverse environments<\/li><li>Final words of wisdom for your career journey<\/li><\/ul><p>",
    "estimatedClassWorkload": "3-5 hours\/week",
    "recommendedBackground": "<p>No background is required. While this course can be useful for all people interested in health care careers, this course may be most valuable for high school students, recent graduates, and those&nbsp;considering career transitions. <\/p><p>The course is also a resource and tool through which educators, parents, career counselors and others can support&nbsp;the&nbsp;career development of students.<br><br><\/p>",
    "links": {

    }
}