{
    "id": 494,
    "shortName": "musichistoryperforms",
    "name": "From the Repertoire: Western Music History through Performance",
    "language": "en",
    "shortDescription": "Explore eight important works from different eras and genres of Western classical-music repertoire, through performances recorded at Curtis and discussion of each work’s historical context, composer, musical significance, and compositional design.",
    "aboutTheCourse": "<p>A survey of music history begins\nwith those works that convey the artistic trends, innovations, and\ncompositional techniques representative of their time. This course\nwill look at key works by Bach, Haydn, Mozart, Beethoven, Brahms, Schoenberg, and Crumb, brought to life by audio or video recordings by Curtis students, alumni, and faculty. Accompanying lectures explore the historical context, composer, musical significance, and compositional design of each work. Guest interviews offer special insight into performance, improvisation, and contemporary composition. In-person and online sessions with the faculty members are being planned.<\/p><p>Life-enrichment learners and amateur musicians will be encouraged to engage in global online discussions about the music, as they sharpen their listening and descriptive skills. Multiple-choice quizzes will reinforce lecture material. Optional peer-graded assignments guide learners through the process of listening, researching, and writing to create their own program notes.<\/p><p>By the end of the course, learners should be able:<br><\/p>\n\n<ul><li>to understand a general survey of the\ndevelopment of Western classical music through the ages<\/li><li>to further develop the skills to explore the background of composers and their compositions<\/li><li>to better enjoy concerts and performances with enhanced listening skills<\/li><\/ul>",
    "targetAudience": 3,
    "courseSyllabus": "<p>The first week offers an historical overview as a starting\npoint. The remaining six weeks examine specific repertoire, with recordings of\nperformances by Curtis students and alumni provided online. Lecture videos\nexplore the era, the composer, and the piece, from both music history and compositional design perspectives.<\/p>\n\n\n\n<p>Week 1: A Brief History of Notation<\/p>\n\n<p>Week 2: J. S. BACH, Chaconne<\/p>\n\n<p>Week 3: HAYDN, String Quartet in C major, Hob. III:32, and\nMOZART, String Quartet in B-flat major, K. 589<\/p>\n\n<p>Week 4: BEETHOVEN, Grosse Fuge in B-flat major, Op. 133<\/p>\n\n<p>Week 5: BRAHMS, Two Songs, Op. 91, and Trio in E-flat major,\nOp. 40<\/p>\n\n<p>Week 6: SCHOENBERG, <i>Pierrot lunaire<\/i><\/p>\n\n<p>Week 7: GEORGE CRUMB, <i>Voice\nof the Whale<\/i><\/p>",
    "estimatedClassWorkload": "2-4 hours\/week",
    "recommendedBackground": "<p>Musicians and non-musicians alike are welcome to participate\n    in the class. Each person's contributions to the conversation help us all to learn.<\/p>",
    "links": {

    }
}