{
    "id": 229,
    "shortName": "innovation",
    "name": "Leading Strategic Innovation in Organizations",
    "language": "en",
    "shortDescription": "Improve your ability to manage creativity and to lead an innovation strategy in businesses, schools, hospitals, governments, and other complex organizations and institutions, by diagnosing likely innovation failures before they occur.",
    "aboutTheCourse": "<span>This\ncourse is intended to help you improve your ability to manage creativity,\ninnovation and change in business, education, healthcare, government, and in\nany other complex organization or institution by diagnosing potential\ninnovation failures before they can occur. Using an “<span>innovation constraints<i>”<\/i><\/span> framework that draws on modern social\nscience research and on insights from business practice, participants will\nlearn how to best manage people (be they co-workers, bosses, customers,\nclients, friends or any other stakeholders) when innovation is the goal.&nbsp;\nWhile we see several examples of technological innovation, we are not focused\non the management of technology.&nbsp;\nInstead, we focus on something much more powerful:&nbsp; understanding and managing the people engaged\nin creation, innovation and positive change, regardless of the context. <\/span>\n\n<p>The course is\ndesigned to help you answer the following types of questions:<\/p>\n\n<ul><li>What are the conditions for successful\n     innovation?<\/li><li>What causes innovation to fail?<\/li><li>What makes creative people creative?<\/li><li>How should I manage an innovative team?<\/li><li>How do I lead an effective brainstorm process?<\/li><li>What is an innovation portfolio and how can\n     I manage one?<\/li><li>Why do so many great ideas get killed?<\/li><\/ul>\n\n<p><span>The approach in this\nclass will be to treat innovation as the process of <i>generating<\/i>, <i>assessing<\/i>,\nand then <i>implementing<\/i> useful and valuable ideas.&nbsp; As we will\ndiscuss, generating ideas is relatively easy; what can be hard is getting those\nideas listened to, accepted, and implemented in organizations.&nbsp; In\naddition to learning how to lead creative people and creative teams, participants\nwill also learn techniques for improving their own creativity.&nbsp; During the\ncourse you will engage numerous activities and exercises intended to bring\ncurrent habits of thought and behavior to the surface for examination and\nchange.<br><\/span><\/p>",
    "targetAudience": 2,
    "courseSyllabus": "<b>Week 1:&nbsp; Introduction:&nbsp; Why Everyone Wants Innovation but No One Wants to Change<\/b><br>We introduce the approach of the class:&nbsp; instead of trying to be innovative, just stop stopping it.&nbsp; We discuss a framework for analyzing the six most common barriers (constraints) that stop innovation.<br><br><b>Week 2:&nbsp; Individual Constraints:&nbsp; Why Most of Us Are More Creative Than We Think<\/b><br>Psychologists treat innovation as a problem of having creative ideas; we sometimes stop innovation by not \"thinking different\".&nbsp; This week explores the constraints of perception, intellection, and expression and offers strategies for overcoming them.<br><br><b>Week 3:&nbsp; Group Constraints:&nbsp; Why a Brainstorm Meeting Can Be Worse Than No Meeting at All<\/b><br>Social psychologists treat innovation as a group problem:&nbsp; we often don't get early support for our ideas because of adverse group dynamics.&nbsp; This week looks at the constraints of emotion, culture, and process in groups as well as the environment within which groups work, and looks at ways to overcome them.<br><br><b>Week 4:&nbsp; Organizational Constraints:&nbsp; Why You’ll Never Be a Prophet in Your Own Hometown<\/b><br>The field of management sees the problem of innovation as one of the organization; organization is the opposite of innovation, after all.&nbsp; This week explores the constraints of strategy, structure, and resources and we explore ways of framing them that will help us to overcome them.&nbsp;&nbsp; <br><br>&nbsp;<b>Week 5:&nbsp; Industry Constraints: If It’s Such a Great Idea, Why Isn’t Our Competitor Doing It?<\/b><br>An economist view of failed innovation sees it as a problem of adoption; when there's no market to adopt it, it's not an innovation, it's just a creative idea.&nbsp; We look at the constraints of competition, suppliers, and markets and discuss strategies you can use to relax them.<br><br><b>Week 6:&nbsp; Societal Constraints:&nbsp; Why My Innovation Means You Have to Change<\/b><br>The sociological and anthropological perspective suggests that societies control or obstruct innovations that are deemed as dangerous or contrary to societal values.&nbsp; This week explores the constraints of identity, social control, and history and we will seek an understanding of how we might avoid them. <br><br><b>Week 7:&nbsp; Technological Constraints:&nbsp; How to Take a Really Hard Problem and Make It Completely Impossible<\/b><br>Engineers and scientists see failed innovation as a failure of technology; if it doesn't work, it's not an innovation.&nbsp; Here we explore the constraints of knowledge, time, and the natural environment.&nbsp; Rather than trying to overcome them, we develop strategies for working within these constraints.<br><br><b>Week 8:&nbsp; When Failure Is Not an Option: Leading an Innovation Strategy<\/b><br>The final week has us putting the entire model together into the leadership context.&nbsp; We will learn about innovation portfolios and discuss a tested process for moving innovations from ideas to realities.&nbsp; <br><br>This <a href=\"http:\/\/creativepeoplemustbestopped.com\/video\/\">animated video<\/a> describes the basic issues addressed by the course. <br><br>",
    "estimatedClassWorkload": "6-12 hours\/week",
    "recommendedBackground": "Ideally, participants will have had experience working in an organization. &nbsp;Management experience is a plus, but is not required. &nbsp;<br>",
    "links": {}
}