{"id":3067,"shortName":"accountingmore","name":"More Introduction to Financial Accounting","language":"en","shortDescription":"The course builds on my Introduction to Financial Accounting course, which you should complete first. In this course, you will learn how to read, understand, and analyze most of the information provided by companies in their financial statements.  These skills will help you make more informed decisions using financial information.","aboutTheCourse":"<p>Accounting is the language of business. Companies communicate their performance to outsiders and evaluate the performance of their employees using information generated by the accounting system.&nbsp; Learning the language of accounting is essential for anyone that must make decisions based on financial information.&nbsp;<br><\/p><p>The course is designed to provide an understanding of financial accounting fundamentals for prospective users of corporate financial information, such as investors, creditors, employees, and other stakeholders (e.g., suppliers, customers).&nbsp;&nbsp; The course focuses on understanding how economic events such as operating activities, corporate investments, and financing transactions are recorded in the three main financial statements (i.e., the income statement, balance sheet, and statement of cash flows). Students will develop the technical skills needed to analyze financial statements and disclosures for use in financial analysis.&nbsp; Students will also learn how accounting standards and managerial incentives affect the financial reporting process. &nbsp;<\/p>","targetAudience":1,"courseSyllabus":"The course is broken up into six weekly modules:<ul><li>Accounts Receivable and inventory<\/li><li>Long-lived assets and marketable securities<\/li><li>Liabilities and long-term debt<\/li><li>Deferred taxes<\/li><li>Stockholders’ equity<\/li><li>How to read an Annual Report<\/li><\/ul>","courseFormat":"The course will combine video of the instructor with Powerpoint slides to the deliver the material.&nbsp; The lectures will be “interactive” in that the instructor will periodically ask students to pause the presentation and guess an answer before proceeding.&nbsp; The videos will also cover “case studies” of real companies to illustrate the course concepts.&nbsp; The course will provide eight short homework assignments and two exams. &nbsp;","suggestedReadings":"The course&nbsp;is designed to be self-contained.&nbsp; Students wanting to expand their knowledge beyond what we can cover in this course or who want more practice problems or more in-depth explanations can consult any Introduction to Financial Accounting textbook that is geared toward MBA students.&nbsp; Because the material in the course has been fairly unchanged for the past few years, any used prior editions of textbooks should be acceptable. &nbsp;&nbsp;","estimatedClassWorkload":"6-8 hours\/week","recommendedBackground":"The course is intended as a follow-up to <a href=\"https:\/\/www.coursera.org\/course\/whartonaccounting\" target=\"_blank\" title=\"Link: https:\/\/www.coursera.org\/course\/whartonaccounting\">Introduction to Financial Accounting<\/a>. &nbsp;Students should complete that course before beginning this one.&nbsp;<br><br>","links":{}}