{"id":34,"shortName":"vaccines","name":"Vaccines","language":"en","previewLink":"https:\/\/class.coursera.org\/vaccines-003\/lecture\/preview","shortDescription":"This course will discuss issues regarding vaccines and vaccine safety: the history, science, benefits, and risks of vaccines, together with the controversies and common questions surrounding vaccines, and an update on newly created vaccines and recent outbreaks of previously controlled diseases.","aboutTheCourse":"<p>In light of recent outbreaks of infectious diseases and new developments in immunizations, everyone from parents to policy-makers have questions about vaccines. What's actually in a vaccine? Are vaccines effective? Are they safe? &nbsp;Should a society require that all citizens get certain vaccines?<\/p><p>In this course, Dr. Paul Offit will tackle these questions and more. We will explore the history, science, and debate behind vaccines. &nbsp;We'll trace the development of vaccines over the past two and a half centuries, and describe methods for the attenuation of various viruses and bacteria. We'll discuss the benefits of vaccines in the United States and around the world, and we'll also explore the risks, both real and perceived, associated with vaccines. We'll look at how the media shapes the conversation about vaccines and some controversies that surround them, specifically that vaccines cause autism, multiple sclerosis, neurodevelopmental delays, diabetes or other chronic problems. The focus throughout the course will be on research and real-world examples and the discussion will conclude with an update on newly created vaccines and recent outbreaks of previously controlled diseases.<\/p><p>Dr. Offit is an attending physician in the Division of Infectious Diseases and the Director of the Vaccine Education Center at The Children’s Hospital of Philadelphia and the Maurice R. Hilleman Professor of Vaccinology and a Professor of Pediatrics at the University of Pennsylvania School of Medicine.<br><\/p><p>For additional information about vaccines, the Vaccine Education Center, or its program for parents, called Parents PACK, please visit:<\/p><p><a href=\"http:\/\/vaccine.chop.edu\" title=\"Link: http:\/\/vaccine.chop.edu\">http:\/\/vaccine.chop.edu<\/a><br><a href=\"http:\/\/vaccine.chop.edu\/parents\">http:\/\/vaccine.chop.edu\/parents<\/a><br><a href=\"http:\/\/www.prevent-hpv.com\">http:\/\/www.prevent-hpv.com<\/a><\/p>","targetAudience":0,"courseSyllabus":"<div><strong>WEEK ONE: History of Vaccines&nbsp;<\/strong><\/div><div>An overview of the history of vaccines is covered in week one starting with the first vaccine, the vaccine for smallpox, and concluding with discussion of Recombinant DNA and Reassortant Viruses.<\/div><div><br><\/div><div><strong>WEEK TWO: Schedules and Common Questions&nbsp;<\/strong><\/div><div>Current and alternate vaccine schedules are discussed as well as possible benefits and drawbacks of choosing an alternative schedule. The subject of vaccines raises many questions in various levels. \"What are vaccines? Are they safe? Do they cause chronic illness?\" These and other questions are also addressed in week two.<\/div><div><br><\/div><div><strong>WEEK THREE: Vaccines and the Media<\/strong><\/div><div>Such topics as the media's role in medical education of the population, the power of popular anecdote over fact, and the purported link between MMR and Autism will be discussed all in relation to the role of vaccines in society.&nbsp;<\/div><div><br><\/div><div><strong>WEEK FOUR: Case Study - The Rotavirus Vaccine&nbsp;<\/strong><\/div><div>The rotavirus structure is discussed along with functional properties of rotavirus proteins. The risks and benefits of Rotasheild in the U.S. and in the developing world, and processes and results of Rotateq trials are also examined.<\/div><div><br><\/div><div><strong>WEEK FIVE: Exemptions&nbsp;<\/strong><\/div><div>Various aspects and causes of vaccine exemptions are explored, including safety issues, tragedies, religious exemptions, and specific lawsuits. The consequences of exemptions, including breakdowns in herd immunity, are also discussed.<\/div><div><br><\/div><div><strong>WEEK SIX: Recent Vaccines and Outbreaks<\/strong>&nbsp;<\/div><div>The course concludes with an overview of newly created vaccines and recent outbreaks of previously controlled diseases.<\/div>","courseFormat":"<p>Each week two to four lecture videos between\n15 and 20 minutes in length will be presented by Dr. Offit. Integrated assessment questions are included in\neach lecture which are not scored. There will also be one to four standalone quizzes each week.<\/p><p>Students who complete course requirements will earn a Statement of Accomplishment. This course is also eligible for a&nbsp;<a href=\"https:\/\/www.coursera.org\/signature\/course\/edref\/971807\" target=\"_blank\">Verified Certificate<\/a>.&nbsp;You can start verifying your work for free and pay any time before the final week of the course.&nbsp;<a href=\"https:\/\/www.coursera.org\/signature\/guidebook\/aid\">Coursera Financial Aid<\/a>&nbsp;is also available for learners with limited economic means.<br><\/p>","suggestedReadings":"","instructor":"Paul Offit, MD","estimatedClassWorkload":"2-3 hours\/week","recommendedBackground":"All learners are welcome, particularly those with an interest in vaccines, their history, development and application.&nbsp;","links":{}}