{"id":405,"shortName":"renminbi","name":"The Role of the Renminbi in the International Monetary System ","language":"en","shortDescription":"This course will discuss various aspects of the Renminbi internationalization, including the reform of the international monetary system, the opportunities and challenges to internationalize the Renminbi, the evolution of China's monetary and exchange rate policies, and the implications of the Renminbi internationalization for Hong Kong.","aboutTheCourse":"<p>The current international\nmonetary system has critical defects. An effective reform of the system calls\nfor a new international currency, for which the Renminbi may be a promising\ncandidate. Despite the rapid growth of the Chinese economy, certain prerequisites\nhave to be satisfied before the Renminbi can be internationalized. China needs\nto ensure full convertibility of the Renminbi and further develop its financial\nmarkets to facilitate the process of internationalization.<\/p>\n\n<p>This course will discuss various\naspects of the Renminbi internationalization. Specifically, innovative\nsuggestions will be provided on topics including the reform of the\ninternational monetary system, the opportunities and challenges of the Renminbi\ninternationalization, and the evolution of China’s monetary and exchange rate\npolicies. Since the internationalization of Renminbi is important to the future\nof Hong Kong as an international financial center, the lectures will also\ndiscuss the possible implications of this process for Hong Kong.<\/p>","targetAudience":1,"courseSyllabus":"<p><b>Week 1: The Role of the Renminbi in the\nInternational Monetary System<\/b><\/p>\n\n<p>The lecture will commence with a\nreview on the roles of money in the domestic and international monetary\nsystems. Upon analyzing the critical defects of the international monetary\nsystem and the necessity of reform, we will discuss the global governance and\ninstitutional reform of the international monetary system. An assessment on the\ncosts and benefits associated with the internationalization of the Renminbi for\nthe system will conclude the lecture.<\/p>\n\n<p><b>Week 2: Internationalization of the Renminbi and\nRenminbi Offshore Markets<\/b><\/p>\n\n<p>This lecture will address the\nfollowing questions: What are the aims of internationalizing the Renminbi? What\nanalytical framework can we adopt to draft proposals on the possible process of\nRenminbi internationalization? For China, what are the costs and benefits of\nestablishing Renminbi offshore markets? How can the risks to monetary and\nfinancial stability be managed prudently? What are the implications for other\nareas, particularly Hong Kong?<\/p>\n\n<p><b>Week 3: The Monetary and Exchange Rate Policy of\nChina<\/b><\/p>\n\n<p>The lecture will begin with an\nanalysis on the approaches, instruments, and intermediate targets of China’s\nmonetary policy. The legal framework of monetary regulation, the role of the\ncentral bank, and the objective of monetary policies will then be elaborated,\nfollowed by a brief discussion on the interest rate and exchange rate\nliberalization. The lecture will then proceed to review the monetary policy stance\nof the People’s Bank of China over the years and discuss the recent experience\nof monetary policymaking in China.<\/p>\n\n<p><b>Week 4: The Future of Hong Kong’s Monetary System<\/b><\/p>\n\n<p>This lecture will focus on the\nmonetary system of Hong Kong. We will review the history of Hong Kong’s\nmonetary policy and monetary control, thus revealing how the monetary system of\nHong Kong has been designed to serve the public interest most effectively and\nmaintain Hong Kong as an international financial center. The lecture will\nconclude with a discussion on the future of the Linked Exchange Rate System,\nwhich has served Hong Kong well for almost 30 years.<\/p>","courseFormat":"<p>There will be 2-3 lectures per\nweek, each lasting 10-20 minutes in the form of a video clip.&nbsp; Open-ended questions will be assigned after\neach lecture for discussion in the forum. Students are required to complete a\ntest of 40 multiple-choice questions at the end of the course.<\/p>","suggestedReadings":"","instructor":"Joseph Yam and Terence Tai-Leung Chong","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"This course is suitable for students who are interested in the development of China's monetary system. No mathematical models will be taught in the class.","links":{}}