{"id":171,"shortName":"machlearning","name":"Machine Learning","language":"en","previewLink":"https:\/\/class.coursera.org\/machlearning-001\/lecture\/preview","shortDescription":"Why write programs when the computer can instead learn them from data? In this class you will learn how to make this happen, from the simplest machine learning algorithms to quite sophisticated ones. Enjoy!","aboutTheCourse":"<div>Machine learning algorithms can figure out how to perform important tasks by generalizing from examples. This is often feasible and cost-effective when manual programming is not. Machine learning (also known as data mining, pattern recognition and predictive analytics) is used widely in business, industry, science and government, and &nbsp;there is a great shortage of experts in it. If you pick up a machine learning textbook you may find it forbiddingly mathematical, but in this class you will learn that the key ideas and algorithms are in fact quite intuitive. And powerful!<\/div><div><br><\/div><div>Most of the class will be devoted to supervised learning (in other words, learning in which a teacher provides the learner with the correct answers at training time). This is the most mature and widely used type of machine learning. We will cover the main supervised learning techniques, including decision trees, rules, instances, Bayesian techniques, neural networks, model ensembles, and support vector machines. We will also touch on learning theory with an emphasis on its practical uses. Finally, we will cover the two main classes of unsupervised learning methods: clustering and dimensionality reduction. Throughout the class there will be an emphasis not just on individual algorithms but on ideas that cut across them and tips for making them work.<\/div><div><br><\/div><div>In the class projects you will build your own implementations of machine learning algorithms and apply them to problems like spam filtering, clickstream mining, recommender systems, and computational biology. This will get you as close to becoming a machine learning expert as you can in ten weeks!<\/div><div><br><\/div>","targetAudience":1,"courseSyllabus":"<div>Week One: Basic concepts in machine learning.<\/div><div>Week Two: Decision tree induction.<\/div><div>Week Three: Learning sets of rules and logic programs.<\/div><div>Week Four: Instance-based learning.<\/div><div>Week Five: Statistical learning.<\/div><div>Week Six: Neural networks.<\/div><div>Week Seven: Model ensembles.<\/div><div>Week Eight: Learning theory.<\/div><div>Week Nine: Support vector machines.<\/div><div>Week Ten: Clustering and dimensionality reduction.<\/div>","courseFormat":"The class will consist of a series of lecture videos, typically 5 to 15 minutes in length. Each video contains a few integrated quiz questions. There will also be standalone homeworks that are not part of video lectures, programming assignments, and a final exam.","suggestedReadings":"The class is self-contained, but a good complement to it is the book <a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=machlearning&isbn_ean=9780070428072\"><i>Machine Learning<\/i><\/a>, by Tom Mitchell, published by McGraw-Hill. This covers most but not all of the topics in the class. The remaining topics can be found in <a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=machlearning&isbn_ean=9780471056690\"><i>Pattern Classification<\/i><\/a>&nbsp;(second edition), by Duda, Hart and Stork (Wiley), and other textbooks.","instructor":"Pedro Domingos","estimatedClassWorkload":"5-7 hours\/week","recommendedBackground":"<div>The main prerequisite for this class is basic knowledge of programming. Some previous exposure to probability, statistics, linear algebra, calculus and\/or logic is useful but not essential.<\/div><div><br><\/div>","links":{}}