{"id":425,"shortName":"humanevolution","name":"Human Evolution: Past and Future","language":"en","shortDescription":"Introduction to the science of human origins, the fossil and archaeological record, and genetic ancestry of living and ancient human populations. The course emphasizes the ways our evolution touches our lives, including health and diet, and explores how deep history may shape the future of our species.","aboutTheCourse":"<div>This course covers our evolutionary history across more than seven million years, from our origins among the apes up to the biological changes that are still unfolding today. If you enroll, you'll encounter the evidence for the earliest members of our lineage, as they begin the long pathway to humanity. You'll see how scientists are learning about the diets of ancient people, using microscopic evidence and chemical signatures in ancient teeth. We will explore together the exciting fossil discoveries of the last ten years, which have shaken up our notions of the origin of human culture and our own genus. <br><br>Genomics has fundamentally transformed the way we understand our evolution, in many ways opening the direct evidence of our history to anyone. The course will teach you how to look inside the genomes of humans, Neandertals and other ancient people.  If you have used personal genomics to get your own genotypes, the course will guide you in connecting genetics to your ancestry among ancient humans.<br><br>The course brings a special focus on the rapid evolutionary changes of the last 10,000 years. You'll learn about the consequences of our shift to agriculture, and the ways that people of industrialized nations are still changing today. At the end, we trek forward to anticipate what evolutionary changes may be in store for humanity in the future, using our knowledge of history and scientific understanding to inform our speculations.<\/div>","targetAudience":0,"courseSyllabus":"","courseFormat":"The materials are designed to guide students on their own distinctive paths of discovery. Short documentary videos highlight the most up-to-date science and bring students virtually into some of the most famous archaeological sites. With a series of interviews, students will hear about new ideas from many of the world's leading experts. A series of activities give students an opportunity to see their measurements next to those provided by the worldwide group of students. Students can dig deeper by investigating ways that humanity may evolve into the future.&nbsp;","suggestedReadings":"","instructor":"John Hawks","estimatedClassWorkload":"4-5 hours\/week","recommendedBackground":"All are welcome to participate and view materials, which assume no special background. To complete some exercises, a basic knowledge of high school-level biology and algebra will be necessary.","links":{}}