{"id":1044,"shortName":"genomicmedicine","name":"Genomic and Precision Medicine","language":"en","shortDescription":"A critical, unbiased introduction to using new genomic tools for diagnosing and managing disease.","aboutTheCourse":"<p>Precision medicine has the potential to change fundamentally how health care is practiced, but requires a health care workforce that understands the complexities of this field. One important component of Precision Medicine is the use of an individual’s genomic information to offer targeted treatment, tailored to the individual. Our course aims to provide participants with some baseline knowledge of genomics, an overview of the clinical applications of genomic medicine, the skills to evaluate the clinical validity and utility of new tests, and an appreciation of the associated ethical and social issues inherent in this field.&nbsp; <\/p>\n\nThe course is geared toward practicing health care providers, although it should be accessible to anyone with a background in the biological sciences and a basic understanding of genetics.&nbsp; It is designed to be succinct and clinically-focused, offering both conceptual and practical information about real-world applications of genomics. Lessons 1 and 4 offer a basic primer on molecular genomics relevant to the individual patient as well as to patient populations. The remaining five lessons focus on five applications of genomics and present the material as case studies, highlighting the strengths, limitations, and issues that arise in the use of each test.<br>","targetAudience":2,"courseSyllabus":"<p><b>Week 1: <\/b>New insights into the structure of the human genome and different types of genetic and non-genetic variation that occur<\/p>\n<p><b>Week 2:<\/b> Genetic screening and diagnosis: prenatal carrier testing and newborn screening for Mendelian diseases <br><\/p>\n<p><b>Week 3:<\/b> The use of next-generation sequencing for solving diagnostic dilemmas<\/p>\n<p><b>Week 4:<\/b> Methods used in patient populations to uncover associations between genome variation and common diseases <br><\/p>\n<p><b>Week 5:<\/b> Predictive tests for common, complex diseases<\/p>\n<p><b>Week 6:<\/b> Pharmacogenomic testing for drug selection, dosing and predicting adverse effects of commonly prescribed drugs<\/p>\n<p><b>Week 7: <\/b>Tumor profiling for targeting cancer treatment and the use of blood-based gene expression profiles in cancer prognosis<br><\/p>","courseFormat":"<p>Each\nweek will consist of approximately two hours of work for students to complete:\n60 minutes of video lectures and 30-60 minutes to complete homework\/assessments.<\/p>","suggestedReadings":"If you are a bit rusty in genetics, we recommend that you check out The New Genetics.&nbsp; The New Genetics \"is a science education booklet [that] explains the role of genes in health and \ndisease, the basics of DNA and its molecular cousin RNA, and new \ndirections in genetic research.\"&nbsp; The publication can be accessed at the following link:<a href=\"http:\/\/publications.nigms.nih.gov\/thenewgenetics\/index.html\"> http:\/\/publications.nigms.nih.gov\/thenewgenetics\/index.html<\/a>\n\n<br><br>National Institute of General Medical Sciences.&nbsp; (2010).&nbsp;  The New Genetics.&nbsp; Bethesda, MD: U.S. Department of Health and Human Services.<br>","estimatedClassWorkload":"1-3 hours\/week","recommendedBackground":"<p>Students should have some background\nin biology\/medicine, and have a basic understanding of genetics.<br><\/p>","links":{}}