{
    "id": 1156,
    "shortName": "bioinfo",
    "name": "Введение в биоинформатику (Introduction to Bioinformatics)",
    "language": "ru",
    "shortDescription": "Курс «Введение в биоинформатику» адресован тем, кто хочет получить расширенное представление о том, что такое биоинформатика и как она помогает биологам и медикам в их работе.\n\n\nThe course is aimed at those who would like to have a better idea of what bioinformatics is and how it helps biologists and medical scientists in research and clinical work. ",
    "aboutTheCourse": "<p dir=\"ltr\">Существует много определений биоинформатики. Все они говорят о дисциплине, объединяющей биологию, математику и информатику с целью решения задач молекулярной биологии, генетики, здравоохранения, фармакологии, биохимии, клеточной биологии и т.д. Мы посмотрим на биоинформатику как на науку о биологии и биологических данных, и начнем с геномной биоинформатики.<\/p><p dir=\"ltr\">В рамках курса будет рассказано о сиквенсных технологиях, разнообразии получаемых данных и форматов, в которых они бывают доступны ученым. О том как подготовить даннные для успешного анализа и каких проблем можно избежать, внимательно отнесясь к их качеству на начальных стадиях работы с данными. Курс познакомит с некоторыми алгоритмическими подходами, используемыми при сборке геномов, их аннотации и анализе мутаций.<\/p><p dir=\"ltr\">Совместный курс Санкт-Петербургского Государственного Университета и Института Биоинформатики СПб нацелен на практические аспекты геномных проектов. Курс читается на русском языке &nbsp;с использованием наглядного материала на английском.&nbsp;Такое двуязычное изложение поможет слушателям ориентироваться в терминологии и облегчит чтение статей по геномике и биоинформатике, которые преимущественно публикуются на английском языке.<\/p><p dir=\"ltr\">There <gs id=\"5a85093b-488f-45d6-980e-67d43070ba5d\" ginger_software_uiphraseguid=\"742570ca-bea2-450a-b996-f455eb374fc7\" class=\"GINGER_SOFTWARE_mark\">is<\/gs> a wide variety of definitions attempting to explain what <gs id=\"f29993af-4aa6-4bba-8ce5-99f306e9c580\" ginger_software_uiphraseguid=\"742570ca-bea2-450a-b996-f455eb374fc7\" class=\"GINGER_SOFTWARE_mark\">bioinformatics<\/gs> really is, but despite their differences, they all seem to agree that it is a science that combines biology, <gs id=\"68016d77-2f06-4ed1-8746-de2365fdcb85\" ginger_software_uiphraseguid=\"742570ca-bea2-450a-b996-f455eb374fc7\" class=\"GINGER_SOFTWARE_mark\">mathematics and<\/gs> IT for the purpose of finding solutions in the fields of biology, genetics, healthcare, pharmacology, biochemistry, cell biology etc. We will focus on <gs id=\"e4915351-b497-41f5-b98d-504d9c592109\" ginger_software_uiphraseguid=\"4bb60107-16b9-477b-b842-832940982bd5\" class=\"GINGER_SOFTWARE_mark\">bioinformatics<\/gs> as it relates to biology and biological data, starting with genome biology.<\/p><p dir=\"ltr\">The course materials will cover sequencing technologies and the diversity of data types and data formats available to the scientific community. We will learn how to successfully prepare data for analysis and how to avoid potential issues by paying special attention to the quality of data from the very start of the project. The course will also introduce a number of algorithmic approaches used to assemble and annotate genomes, as well as to analyze mutations.<\/p><p>This course, created as a result of joint efforts between St<gs id=\"7637c289-fd04-4e72-8569-b10fcdd6cf5e\" ginger_software_uiphraseguid=\"32e1bb69-e88e-4c94-b195-9dccbd14bb07\" class=\"GINGER_SOFTWARE_mark\">.<\/gs>Petersburg State University and Bioinformatics Institute SPb, aims to familiarize the students with the practical side of genome projects. All lectures will be presented in Russian, while the visual materials will be in English.&nbsp;Such bilingual presentation will help you to understand specific terminology and read articles on genomics and <gs id=\"3a60fa7b-cda0-4261-84f9-79bebb9d7e03\" ginger_software_uiphraseguid=\"a5264fa8-fbf7-4027-8fa6-2d5380b6eac2\" class=\"GINGER_SOFTWARE_mark\">bioinformatics<\/gs>, which are mainly published in English.<\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<p>Неделя 1: Введение<\/p><p>Знакомство с лабораторией&nbsp;<br><\/p><p>Неделя 2: Технологии секвенирования<\/p><p>Неделя 3: Контроль качества<\/p><p>Неделя 4: Сборка ДНК de novo<br><\/p><p>Неделя 5: Выравнивание коротких фрагментов сиквенса (ридов)<\/p><p>Неделя 6: Аннотация генов и интерпретация результатов<\/p><p><br><\/p><p>Week One: Introduction<\/p><p>Introduction to Wet Lab<br><\/p><p>Week Two: Sequencing Technologies<\/p><p>Week Three: Quality Control<\/p><p>Week Four: De novo&nbsp;DNA Assembly<\/p><p>Week Five: Short Read Alignment<\/p><p>Week Six: Gene Annotation and Interpretation of Results<br><\/p>",
    "estimatedClassWorkload": "2-4 hours\/week",
    "recommendedBackground": "Если вы знаете, чем ДНК отличается от РНК и можете за 5 минут найти в интернете статью Уотсона и Крика 1953 года, то этот курс для Вас!<span><br><br>If you have an interest for bioinformatics, can tell the difference between DNA and RNA and need no more than 5 minutes to find a Watson and Circk article (1953) on the web, this course is for you!<\/span><br>",
    "links": {

    }
}