{
    "id": 917,
    "shortName": "religionandtolerance",
    "name": "Practicing Tolerance in a Religious Society: The Church and the Jews in Italy",
    "language": "en",
    "shortDescription": "What social and ideological mechanisms allowed Jews to survive and even flourish in Catholic Italy? And under what circumstances did the practice of tolerance break down? This course takes a different approach to the idea of tolerance, as well as to the long, complicated history of the Catholic Church and the Jews.",
    "aboutTheCourse": "Discussions of the centuries-long relationship between Christianity and the Jews are almost always framed in terms of persecution and discrimination with only occasional examples of toleration and kindness. To explain or to excuse the ongoing hatred towards Jews, historians mix together terminologies and concepts drawn from religious theology, psychology, social theory and politics. The catch-all term \"anti-Semitism\" lumps together outbreaks of prejudice and victimization in different times and places.<br><br>In this course, we shall ask a different question. Our focus is not on why a majority society saw Jews as different or reacted with violence to Jews' \"otherness.\" Rather, we ask how in a society dedicated to religious uniformity one group of people was tolerated even though it refused to join the dominant faith. Many modern writers assume that Christianity, and perhaps religion itself, is inherently intolerant of non-believers. But we will see that neither religious nor secular world views necessarily lead to toleration or discrimination. The patterns of Christian-Jewish relations are both complex and intriguing.<br><br>Our question then is how did a religious society manage to practice tolerance, and under what circumstances did that practice break down? We will focus on the history of Jews in Italy and especially Rome, the city that housed the the longest continuous Jewish settlement in world history and that was also, for most of the past two millennia, the home of the Catholic Church.<br>",
    "targetAudience": 0,
    "courseSyllabus": "Week 1: Judaism and Christianity in a Classical Context. Defining our Terms.<br>Week 2: The Birth of a Christian Empire<br>Week 3: Urban Culture & Crusading Armies. Merchants, Moneylenders & Monsters.<br>Week 4: Expulsions, Conversions & Ghettos <br>Week 5: Modernization. Liberal Nationalism & Church Reaction<br>Week 6: From Fascism to the Holocaust<br>",
    "estimatedClassWorkload": "5-7 hours\/week",
    "recommendedBackground": "This course has no prerequisites. <br><br>",
    "links": {

    }
}