{
    "id": 1405,
    "shortName": "deutsch",
    "name": "Auf Deutsch: Communicating in German Across Cultures ",
    "language": "en",
    "shortDescription": "By the end of this course you will have developed a spoken and written profile in German that reflects your backgrounds, customs and the cities you live in.  Through the medium of a foreign language, we will learn about each other and exchange our reactions to contemporary German life and lifestyles.\n\n",
    "aboutTheCourse": "In this experimental language course we will use the German language to learn about each other and develop an understanding of different cultural values in both modern Germany and around the world.  In the process of acquiring basic language skills in German, you will be using them to construct personal or virtual profiles within the context of your own culture and society. At the same time, you will compare your cultural attitudes and Weltanschauung with those represented through the lives of contemporary German personalities, actors, artists and politicians.  \n\n<br><br>Designed for a multicultural and multilingual audience, this course takes a ground zero approach to your knowledge of German language, culture and society. However, this course will also offer opportunities for advanced students and native speakers to interact with each other and with course participants on topics related to e.g. hobbies, nutrition, professions and vacation. We will also be polling your attitudes towards issues in Germany related to the family, the environment and immigration. \n\n<br><br>Expressing ourselves in German within the context of our cultural differences is an important focus of this course. To accomplish, this we will provide you with numerous models of spoken and written language usage accompanied by exercises that will prepare you for creating your own personal texts.  Throughout the course, you will receive both automated feedback during the online exercises and comments from the teaching team on the most frequent and reoccurring errors found in your essays and VoiceThreads. Moreover, we will give you links to online resources for extra grammar explanations and for practicing German pronunciation.<br><br>We hope this course will pique your\ninterest in German language and culture and that you will continue to learn and\nuse the language as a means to communicate with each other worldwide after the\ncourse ends.\n\n\n\n\n\n<br><br>",
    "targetAudience": 3,
    "courseSyllabus": "The weekly schedule for this six week course comprises daily\nassignments that guide you towards an understanding of German language and\nculture and to expressing yourself within the context of topics such as: <br><p><br>\n<\/p><ul><li>Familien und Beziehungen (Families and Relationships) <\/li><\/ul><ul><li>\nHobbys und Interessen (Hobbies and Interests) <\/li><\/ul><ul><li>\nErnährung und Wellness (Nutrition and Wellness) <\/li><\/ul><ul><li>\nReisen und Urlaub (Travel and Vacation)<\/li><\/ul>\n\n\n\n\n\n<br>",
    "estimatedClassWorkload": "5-10 hours\/week",
    "recommendedBackground": "You do not need to know German to join the course. This course is designed in mind for the student without any previous knowledge of German. &nbsp;All you need is desire to learn or to improve your German language skills.&nbsp;<br>",
    "links": {

    }
}