{"id":432,"shortName":"mathphil","name":"Introduction to Mathematical Philosophy","language":"en","shortDescription":"Learn how to apply mathematical methods to philosophical problems and questions.","aboutTheCourse":"<p>Since antiquity, philosophers have questioned the foundations--the foundations of the physical world, of our everyday experience, of our scientific knowledge, and of culture and society. In recent\nyears, more and more young philosophers have become convinced\nthat, in order to understand these foundations, and thus to make progress in\nphilosophy, the use of mathematical methods is of crucial importance.\nThis is what our course will be concerned with:\nmathematical philosophy, that is, philosophy done with the help of mathematical\nmethods.<\/p><p><\/p><p>As we will try to show, one can analyze philosophical concepts much more clearly in mathematical terms, one can derive philosophical conclusions from philosophical assumptions by mathematical proof, and one can build mathematical models in which we can study philosophical problems.<\/p><p><\/p><p>So, as Leibniz would have said: even in philosophy, <i>calculemus<\/i>. Let's calculate.<\/p><p><\/p><p><\/p>","targetAudience":0,"courseSyllabus":"Week One: Infinity (Zeno's Paradox, Galileo's Paradox, very basic set theory, infinite sets).<br><br>Week Two: Truth (Tarski's theory of truth, recursive definitions, complete induction over sentences, Liar Paradox).<br><br>Week Three: Rational Belief (propositions as sets of possible worlds, rational all-or-nothing belief, rational degrees of belief, bets, Lottery Paradox).<br><br>Week Four: If-then (indicative vs subjunctive conditionals, conditionals in mathematics, conditional rational degrees of belief, beliefs in conditionals vs conditional beliefs).<br><br>Week Five: Confirmation (the underdetermination thesis, the Monty Hall Problem, Bayesian confirmation theory).<br><br>Week Six: Decision (decision making under risk, maximizing xpected utility, von Neumann Morgenstern axioms and representation theorem, Allais Paradox, Ellsberg Paradox).<br><br>Week Seven: Voting (Condorcet Paradox, Arrows Theorem, Condorcet Jury Theorem, Judgment Aggregation).<br><br>Week Eight: Quantum Logic and Probability (statistical correlations, the CHSH inequality, Boolean and non-Boolean algebras, violation of distributivity)","courseFormat":"The class will consist of lecture videos, which are between 8 and 15 minutes in length. These contain 1-2 integrated quiz questions per video.","suggestedReadings":"We will give you lists of additional references later in the course.","instructor":"Hannes Leitgeb and Stephan Hartmann","estimatedClassWorkload":"2-3 hours\/week","recommendedBackground":"We will not presuppose more than bits of high school mathematics.","links":{}}