{
    "id": 417,
    "shortName": "art",
    "name": "Introduction to Art: Concepts & Techniques",
    "language": "en",
    "shortDescription": "Learn to identify and define various art movements, artists, and their artworks. Convey a personal appreciation for art concepts, techniques, and approaches through the creation and sharing of your own original artwork.",
    "aboutTheCourse": "Introduction to Art: Concepts &amp; Techniques is an art appreciation course created for individuals without any artistic background. This course introduces you to various art movements, cultural influences, artistic genres, artists, and their artwork. The main emphasis of the course is to teach you hands-on studio arts techniques as you conduct personal research and explore your own creativity. While utilizing historical and contemporary art concepts, the course guides you through different time periods. Examining and discussing artwork is a crucial part of this course, encouraging you to express your opinions about art in an intelligent and articulate manner. By the conclusion of the course, you will compile a portfolio of artworks reflective of your research, understanding, creativity, and personal growth.<br>&nbsp;<br>Subjects discussed: Fantastic Art, Mail Art, Black and White Portraiture Photography, Installation Art, and 3-D Art.<br>&nbsp;<br>Art Concepts explored: Line, Shape, Value, Texture, and Color.<br>&nbsp;<br>Art Mediums used: Graphite Pencils, Charcoal, Pastels, Ink, Watercolor, Acrylic Paint, Collage.",
    "targetAudience": 3,
    "courseSyllabus": "Week 1: Art Elements &amp; Techniques<br>Week 2: Fantasy &amp; You<br>Week 3: Correspondence with Memory<br>Week 4: Stories Through the Lens<br>Week 5: Inside the Space<br>Week 6: Personal Collections<br>Week 7: The Artist Critique",
    "estimatedClassWorkload": "5-7 hours\/week",
    "recommendedBackground": "An interest in art is recommended, but no formal art training is required for this course.",
    "links": {

    }
}