{"id":1590,"shortName":"reasoningcapstone","name":"Reasoning, Data Analysis, & Writing Final Project","language":"en","shortDescription":"In this final project course, students will take a position on a controversial topic, research the topic, and present arguments based on data analysis in the form of a 1,500-2,000 word essay. ","aboutTheCourse":"This course invites students to synthesize their learning from the three courses in the Specialization into one final project on a topic of their own choice.&nbsp;Each student will choose a controversial topic and write an&nbsp;essay (1,500 - 2,000 words) in which they use their analysis of&nbsp;data to argue for their own position about that topic. This written argument will analyze data and draw statistical inferences, as well as engage with other evidence in the form of visual and\/or written texts. Students will be asked to develop their project in stages, working from concept to data analysis to argument draft to final project, and will give and receive multiple rounds of peer review to hone their product.&nbsp;<br><br>The Final Project Course will run three times throughout the year.<br>","targetAudience":0,"courseSyllabus":"<div><span><p dir=\"ltr\">Prior to course start date: complete a short pre-writing assignment, which will be emailed to registrants.<\/p><p dir=\"ltr\">Week 1: Draft 2-3 potential topics, responding to 4 questions per topic.<\/p><p dir=\"ltr\">Week 2: Give and receive feedback on topic proposals; finalize topic selection.<\/p><p dir=\"ltr\">Week 3: Data analysis<br><\/p><p dir=\"ltr\">Week 4: Feedback on data analysis and data visualization <br><\/p><p dir=\"ltr\">Week 5: Draft the premises (flesh out your arguments)<\/p><p dir=\"ltr\">Week 6: Give and receive feedback, crafting a rough draft<br><\/p><p dir=\"ltr\">Week 7: Draft the final paper, including the visualization and your conclusion. <br><\/p><p dir=\"ltr\">Week 8: Provide feedback on others’ work, receive feedback on your work.&nbsp;Also, complete a reflection explaining how you adjusted your work throughout this process, based on feedback you received.<\/p><div><br><\/div><\/span><br><br><\/div><div><br><\/div><br>","courseFormat":"This course will have few videos, and those that are presented will focus on describing and clarifying the final project assignment. Students will be asked to read, write, locate and analyze data, create a visualization and give and receive peer feedback. There will be assignments for each week in the course, and active involvement is expected of each student.&nbsp;","suggestedReadings":"","estimatedClassWorkload":"3-4 hours\/week","recommendedBackground":"","links":{}}