{"id":1966,"shortName":"latinopop","name":"Latino Popular Culture for the Clueless","language":"en","shortDescription":"All your questions answered in seven exciting episodes!","aboutTheCourse":"<div>Latino Popular Culture for the Clueless is a seven-session class about the everyday lives, unique traditions, and media depictions of various Latino ethnic groups residing in the United States. We hope that you sharpen your critical thinking about the challenges and the prospects reflected by Latino popular culture. We believe that the skills this class hones will ultimately help you to become a more accountable actor, rather than merely a spectator, in the hemispheric American condition.<\/div><div><br>We hope you notice from the title of the course that we have a playful approach to teaching and learning, because we really don't think that you're clueless at all. <br><br>We are not just here to examine how Latino groups express their values and hopes, we are also here to learn how <strong>YOU<\/strong> express your values and hopes. So get ready to do exercises and assignments that play with your own ideas about your community and your identity. <br><br>You will be our most important \"textbook\" in this class.<\/div>","targetAudience":0,"courseSyllabus":"<strong>Episode One :&nbsp;Latinos and the Space Time Continuum<\/strong><ul><li>History, Geography, and Latinos as \"Aliens\" in popular culture<\/li><\/ul><strong>Episode Two :&nbsp;Zoot Suits &amp; Lowriders<\/strong><ul><li>How style in clothing and cars express a counterculture<br><\/li><\/ul><strong>Episode Three :&nbsp;Fiesta Time<\/strong><ul><li>How music, dance, traditions like Dia de los Muertos express a Latino identity<br><\/li><\/ul><strong>Episode Four :&nbsp;Mucha Lucha<\/strong><ul><li>The history of Latinos in sports such as Wrestling and the NFL<br><\/li><\/ul><strong>Episode Five :&nbsp;So You Want to Be a Latino\/a?<\/strong><ul><li>Issues of gender and power within and outside of the Latino community<br><\/li><\/ul><strong>Episode Six :&nbsp;Portrayals and Betrayals<\/strong><ul><li>Latino stereotypes in mainstream media<br><\/li><\/ul><strong>Episode Seven :&nbsp;Locura lo cura<\/strong><ul><li>The importance of medicine and laughter in Latino culture<\/li><\/ul><strong><\/strong>","courseFormat":"<p>The class will consist of:<\/p>\n<ol><li>General introductions to each topic<\/li><li>Lectures on each topic between 15-20 minutes per week<\/li><li>Readings, in addition to viewings, to be done by participants<\/li><li>A multiple choice quiz or two<\/li><li>Cyber Border\/Discussions - creative assignments and conversations for students prompted by questions from Dr. Martínez-Cruz and Dr. Aldama<\/li><\/ol><br><br><br>The following graphics and music found on this page are used with permission:<br><ul><li><strong>Radio Meurto<\/strong>&nbsp;animation &amp; graphic- ©&nbsp;<a href=\"http:\/\/film.ucsc.edu\/faculty\/john_jota_lea%C3%B1os\" target=\"_blank\">John Leaños<\/a><br><\/li><li><i><strong>Insane in the Brain<\/strong><\/i> by <a href=\"http:\/\/cypresshill.com\/\" target=\"_blank\" title=\"Link: http:\/\/cypresshill.com\/\">Cypress Hill<\/a> - © <a href=\"http:\/\/www.sonymusic.com\/\" target=\"_blank\">Sony BMG Music Entertainment<\/a><br><\/li><\/ul>","suggestedReadings":"","estimatedClassWorkload":"2-5 hours\/week","recommendedBackground":"<p>No prerequisite background or knowledge required. The only thing required is a curiosity for learning about all things Latino.<\/p>","links":{}}