{"id":1213,"shortName":"atc21s","name":"Assessment and Teaching of 21st Century Skills","language":"en","shortDescription":"Did you miss the course when it ran in 2014? Now you can join up for the next offering.\n\nLearn about ways to assess and teach new and emerging 21st century skills: we cover the nature of these skills, methods of assessment, interpretation and reporting of assessments, and their implications for teaching.\n","aboutTheCourse":"<p><span>Education and work\nare changing as a result of technology and its influence in the workplace. We\nnow have new ways of working, new tools for working, new ways of living and\neven new ways of thinking as a result of the influence of technology on life,\nwork and leisure.<br>\n<br>\nIn the workplace, more workers are needed in multi-tasking, information and\ncommunications-based employment. Entrants to workplaces need skills to function\neffectively in this environment that have not traditionally been taught in our\nschools and universities. In this course, we identify some of these complex\nskills, and select one to examine in detail - collaborative problem solving -\nthat combines both cognitive and social aspects and requires the ability to use\nand build knowledge. It is widely regarded by industry as one of the skills\nlacking in young people and graduates as they struggle to secure stable\nemployment. In some countries the unemployment rates of graduates exceeds 50%.\nThe new skills - often erroneously called soft skills - are not being developed\nin schools or universities and in many cases when they are, there is\nuncertainty regarding how to assess and teach them.<br>\n<br>\nIn times of great change, when uncertainties dominate thinking about education\nand work, the result is often a paralysis in education and a reversion to\nrudimentary approaches to assessment that fail to inform directed learning and\nteaching. In this course we will focus on the nature of 21st century skills and\ntheir assessment, with a link to teaching styles and approaches suitable for a\nclassroom in the 21st century.<\/span><\/p>\n<p><strong>Announcement for US based teachers:<\/strong><\/p>\n<p>Coursera and its partners are proud to offer eligible teachers in the United States free Verified Certificates for this course and other high-quality teacher professional development courses, through the ConnectED effort announced by President Obama.<\/p>\n<p>To participate in this opportunity, U.S. district leaders should approve Coursera MOOCs as teacher professional development by completing a brief form at: <a href=\"http:\/\/blog.coursera.org\/post\/103050170952\/president-obama-supports-free-two-year-coursera\" target=\"new\">www.coursera.org\/tpd<\/a>.<br>\n  <br>\n  U.S. teachers who are interested in this opportunity are also encouraged to follow the link to learn more and <a href=\"https:\/\/docs.google.com\/forms\/d\/1t7G3eSUuWvX3arzktgyuzHhMR188D0YnVT-T_aT2pgQ\/viewform\" target=\"new\">complete the form.<\/a><br>\n  <br>Once a district’s form has been verified, the district leader will be notified and teachers in the district will receive access to free verified certificates for Coursera professional development.<br><\/p><p>Coursera and The University of Melbourne thank educators for the hard work they do every day and hope this opportunity will assist US teachers to continue developing their craft in a meaningful and flexible way.<br><\/p>\n<p><strong>Course hours:<\/strong><\/p><p>This course requires 30 hours to complete.<\/p>","targetAudience":2,"courseSyllabus":"<p>During the course you will have opportunities to:<\/p><ul><li>Review the origins of the current  interest in 21st century skills in education, in particular the technological  and social changes which demand changes in the skills students need to prosper  in the modern world. <\/li>\n  <li>Delve into what precisely is meant by the  term ‘21st century skills’ and review some 21st century skills frameworks. <\/li>\n  <li>Examine in detail several of these ‘21 century  skills’, not as abstract concepts, but as concrete learning progressions  suitable for adaptation by teachers. <\/li>\n  <li>Investigate innovative new thinking and  practical tools for assessment and teaching that arise from using a  developmental approach to learning.&nbsp; <\/li>\n  <li>Explore, in the company of other  professionals from all over the world, the practicalities of teaching and assessing  these 21st century skills in the subjects, specialties or levels of  education of particular interest to you. <\/li>\n<\/ul><p>Here are a handful of comments from participants in\n2014 which indicate some what they got out of the course. <\/p>\n\n<p><i>Teacher, USA<\/i><span>: I\nknow the world is changing around me at a rapid pace. I strive to stay\nup-to-date so that I can help my students be prepared for the world they will\nlive and grow in, to be the best they can be. This course was perfect. <b><i>It\nhelped me see what lies ahead<\/i><\/b>.<\/span><\/p>\n\n<p><i>Deputy Principal, Australia:<\/i><span> Though I did this course in physical isolation, for future University\nof Melbourne MOOCs, I would be inviting other staff members to join together to\nwatch video lectures and discuss, utilising them <b><i>as school professional development<\/i><\/b>.\n<\/span><\/p>\n\n<p><i>Principal, Italy<\/i><span>: I\nfound this course very challenging and much more meaningful to me than I ever\ndreamt of when I enrolled. I feel much more confident now in coping with\nteaching and assessing 21st century skills and I hope <b><i>I'll be able to lead better my\nteachers towards a brand new way of teaching and managing the school system<\/i><\/b>.<\/span><\/p>\n\n<p><i>Teacher, Philippines<\/i><span>: I've\nrealized that 21st century education can also be achieved even in a far-flung\nschool… I started to apply this with my lessons. I <b><i>started to design activities\nwhere learners will be actively involved<\/i><\/b> and each of them will be\ncontributing in coming up with the solution of a certain problem. And my\nlearners found the activities fascinating, challenging and enjoyable…<\/span><\/p>\n\n<p><i>Leading teacher<\/i><span>: It\nwas great to be able to delve into this course and some of the background\nreading ...&nbsp; I feel that the course\nreally helped me <b><i>engage with current research on learning<\/i><\/b> and the future of\neducation. I felt it was a good balance of theory and practical work presented\nin an easy to learn style even if the concepts were difficult to grasp. The\nvideos of the students using the digital tools for CPS were invaluable …<\/span><\/p>\n\n<p><i>Career and Technical Education Coordinator:<\/i><span> This course has been both eye opening and life changing for me... I am taking away…a new perspective on what is happening in the world. I am\nacutely aware of the<b><i> <\/i><\/b>need to <b><i>be proactive in preparing student<\/i><\/b>s\nfor their role in the global community. <\/span><\/p>\n\n<p><i>Teacher, Australia<\/i><span>: I\nhave already <b><i>recommended it to other teachers<\/i><\/b>.<\/span><\/p>\n\n<p><i>University teacher:<\/i> I\ndidn’t expect this MOOC to help me with my teaching strategies, and it did. I\nhave used this information with my students and both assignments I’ve used in\nmy classroom. It was a great non-expected outcome. <\/p>\n\n<p><i>Teacher, United Arab Emirates<\/i><span>: I was able to develop a skill tracker using the progression\nstrands. I was able to write <b><i>diagnostic remarks <\/i><\/b>for the students\nin order to write in their reports. <\/span><\/p>\n\n<p><i>Teacher:<\/i> Professionally it\nhas allowed three of the teachers at our school to connect and <b><i>work\non the course together<\/i><\/b>.<br><\/p>","courseFormat":"<p><span>This course will\nrun for 6 weeks. Each week, participants will be able to watch short videos,\nundertake further reading, participate in discussion forums and other social\nmedia activities and work on suggested professional activities relating to\nteaching and assessing 21st century skills. There will be weekly\nreviews and assessments, including self and peer-assessed assignments.<\/span><\/p>","suggestedReadings":"<p><span><a href=\"http:\/\/www.oecd.org\/general\/thecasefor21st-centurylearning.htm\" target=\"_blank\">The case for 21st-century\nlearning<\/a>, Andreas Schleicher, OECD Education Directorate,&nbsp;<\/span><\/p>\n\n<p><br><\/p><i><\/i>","estimatedClassWorkload":"4-5 hours\/week","recommendedBackground":"<p>No background\nknowledge or skills are required, though we recommend an interest in teaching\nand learning in schools, curiosity about the future of schooling, and\nwillingness to try out new things.<\/p>","links":{}}