{"id":126,"shortName":"design","name":"Design: Creation of Artifacts in Society","language":"en","shortDescription":"Combine fundamental concepts with hands-on design challenges to become a better designer.\n","aboutTheCourse":"This is a course aimed at making you a better designer. The course marries theory and practice, as both are valuable in improving design performance. Lectures and readings will lay out the fundamental concepts that underpin design as a human activity.\nWeekly design challenges test your ability to apply those ideas to solve real problems. The course is deliberately broad - spanning all domains of design, including architecture, graphics, services, apparel, engineered goods, and products. The emphasis\nof the course is the basic design process: define, explore, select, and refine. You, the student, bring to the course your particular interests and expertise related to, for instance, engineering, furniture, fashion, architecture, or products. In prior\nsessions of the course about half of the participants were novices and about half had prior professional design expertise. Both groups seem to benefit substantially from the course. All project work is evaluated by your peers -- and indeed, you will also\nbe a peer reviewer. This format allows you to see an interesting collection of projects while getting useful feedback on your own project.\n<br>\n<br><b>Student Testimonials from Earlier Sessions of the Course:<\/b>\n<br>\n<span>\"An amazing course - a joy to take. I will really miss checking in every\n    week to see the latest. I learned a great deal, from the videos, [the course staff] and my fellow\n    students. I think getting the feedback from my peers was such a great way\n    to run the course. So many ideas, suggestions, thoughts and words of encouragement\n    that were so appreciated. I've been driving everyone I know talking about it all the time.\" &nbsp;--E. Wadsworth-Jones\n<br>\n<br>\"When I signed up for this course I didn't know what to expect; the experience\nwas so good and rewarding. I just loved it every step of the way. The course\nwas brilliant, challenging and fun! Our professor, Prof. Karl Ulrich, is\nan amazing teacher, I loved his down to Earth approach.  Participating in a tournament was also one of the course's highlights. The whole thing was a great, unforgettable experience. I wish to thank with all my heart Coursera and the University of Pennsylvania for the opportunity given\nto us.\"\n--D. Rosi<\/span>\n<br>\n<br>\n<p>See examples of student projects: <a href=\"https:\/\/spark-public.s3.amazonaws.com\/design\/PDFs\/projects2.pdf\">here<\/a><\/p>\n<div><\/div>","targetAudience":1,"courseSyllabus":"<b>WEEK ONE: The Design Process<\/b>\n<br><b>WEEK TWO: User Needs<\/b>\n<br><b>WEEK THREE: Decomposition of User Needs<\/b>\n<br><b>WEEK FOUR: Concept Selection<\/b>\n<br><b>WEEK FIVE: Concept Testing<\/b>\n<br><b>WEEK SIX: Aesthetics in Design<\/b>\n<br><b>WEEK SEVEN: Brands&nbsp;<\/b>\n<br><b>WEEK EIGHT: Introduction to Supply Chain and Costing<\/b>","courseFormat":"<div>The content is delivered via several 3-12 minutes videos created specifically for this course. The videos are typically explanations of concepts, and make liberal use of illustrative artifacts from many different domains (e.g., software, food, technology-based\n    products, services, buildings). The videos are supplemented by readings from the free digital textbook&nbsp;\n    <a href=\"http:\/\/ulrichbook.org\/\" target=\"_blank\"><\/a><a href=\"http:\/\/ulrichbook.org\/\" target=\"_blank\">Design: Creation of Artifacts in Society.<\/a>\n\n    <br>\n    <br>\n<\/div>\n<div><\/div>\n<div>Essentially all&nbsp;of the work for this course is DOING design. Each week will include a design challenge focused on a design problem of your own choosing. By the time you have completed the course, you will have stepped through a sequence of challenges\n    that will result in the creation of&nbsp;a new artifact.\n    <br>\n<\/div>","suggestedReadings":"<div>To get a feel for the style of the instructor and the material in the course, this book is a good place to start: Ulrich, K.T. 2010. Design: Creation of Artifacts in Society. University of Pennsylvania.<\/div>\n<div>\n    <br>The free digital book is available at\n    <a href=\"http:\/\/ulrichbook.org\/\" target=\"_blank\"><\/a><a href=\"http:\/\/ulrichbook.org\/\" target=\"_blank\">Design: Creation of Artifacts in Society.<\/a><br><p>Other highly recommended reading is the textbook:&nbsp;<\/p><p><i>Product Design and Development<\/i>&nbsp;by Karl T. Ulrich and Steven D. Eppinger<\/p><p><span>The textbook publisher McGraw-Hill has made available to you a version of the textbook&nbsp;<i>Product Design and Development<\/i>&nbsp;by Karl T. Ulrich and Steven D. Eppinger. The McGraw-Hill text (5th&nbsp;Edition) sells for $173 on Amazon, but the Coursera edition is $30 in eBook format. The eBook includes the chapters referenced in the course (e.g., Identifying Customer Needs, Generating Product Concepts, Selecting Product Concepts, Testing Product Concepts, and Prototyping). You do not need to purchase this text to complete this course. However, the text contains some more detailed instructions on tools and methods which you may find helpful both for this course and in your professional work.<u><\/u><u><\/u><\/span><\/p><p>The PDF, found&nbsp;<a href=\"https:\/\/www.dropbox.com\/s\/8os9ay7lxvub55u\/eBook_Ulrich_Coursera.pdf?n=178932514\" target=\"_blank\">here<\/a>, contains detailed instructions on how to purchase the text. &nbsp;However, in&nbsp;sum,&nbsp;<a href=\"https:\/\/create.mcgraw-hill.com\/shop\/#\/catalog\/details\/?isbn=9781308099064\" target=\"_blank\">you find it here and purchase in the normal ways<\/a>. After purchase&nbsp;you may download the ebook to your own computer or read it on-line. (Reading a downloaded copy requires the VitalSource ebook reader. Instructions for that reader are also in the PDF.)<\/p><p><br><\/p>\n<\/div>","instructor":"Karl  T. Ulrich","estimatedClassWorkload":"5-10 hours\/week","recommendedBackground":"No specific background is required. Those with strong skills in visual expression (sketching, 3D modeling, model making) will find the design challenges easier than those who struggle a bit more with the mechanics of expressing an idea or building a prototype.\nStill, anyone with an interest in learning to be a designer (or to be a better designer) will be able to take this course. Indeed, the goal of the course is to reach both professionals as well as those who are just really interested in design. This is\ndefinitely not an engineering course. Although engineers who wish to become engineering designers will benefit from the course, this course will not include any specific domain knowledge in engineering (e.g., circuit design, design of structures, and\nso forth).","links":{}}