{
    "id": 202,
    "shortName": "aids",
    "name": "AIDS",
    "language": "en",
    "shortDescription": "This course will discuss HIV\/AIDS in the US and around the world including its history, science, and culture as well as developments in behavioral and biomedical prevention, experimental AIDS vaccines, and clinical care issues. The course will also include a discussion of the populations that are particularly vulnerable to HIV\/AIDS and a look at future challenges facing people infected and affected by the AIDS pandemic.",
    "aboutTheCourse": "<p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p><p>Did you grow up in a world without red ribbons, AZT, the\nAIDS Memorial Quilt, or Project Red? If you did, chances are good that you came\nof age before 1981 and are a member of the last generation of humans on this\nplanet to be able to say that you remember those ‘carefree days when all you\nhad to worry about was getting pregnant, herpes, and a bad reputation’ (<a href=\"http:\/\/ihm.nlm.nih.gov\/luna\/servlet\/detail\/NLMNLM~1~1~101438751~152104:Return-to-those-carefree-days-when-\">AID\nAtlanta<\/a>).<\/p>\n\n<p>On June 5, 1981 the CDC released a <i>Morbidity and Mortality Weekly Report<\/i> describing the <a href=\"http:\/\/www.cdc.gov\/mmwr\/preview\/mmwrhtml\/june_5.htm\">first five cases<\/a>\nof what later became known as the Acquired Immune Deficiency Syndrome, or AIDS.\nOn that day human history broke into two generations: Those who can remember a time before&nbsp;the AIDS pandemic and those who can't.<\/p>\n\n<p>No matter what generation you grew up in, what we all have\nin common is a curiosity about AIDS.&nbsp; Where\ndid it come from? Why is it so widespread?&nbsp;&nbsp;Are we making progress towards\na vaccine? What is it like to be part of a vaccine trial? Has anyone ever been cured of HIV infection?&nbsp;Are some people just\nnaturally more or less&nbsp;susceptible to HIV than other people\nare?<\/p>\n\n<p>All of this and more will be covered in <i>AIDS. <\/i>Over the course of nine weeks we will discuss a wide range of\nissues, innovations, and controversies regarding HIV\/AIDS in the US and around\nthe world including everything from what circumcision and Truvada have in\ncommon; how school children in Africa are changing the way AIDS education is\ndone; where you can go online to learn how many cases of AIDS there are in your\narea; and how one man’s insistence that AIDS doesn't exist&nbsp;left hundreds of thousands of people&nbsp;without access to life saving drugs.<\/p>\n\n<p><\/p>\n\n<p><\/p>\n\n<p><\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<p><\/p>\n<p><b>Week 1:&nbsp;<\/b>HISTORY: Focusing on the origin of HIV, its initial discovery in\nhumans, the early response to HIV (good, bad, and ugly), and its global spread\nsince then.<\/p>\n<p><\/p><blockquote>Lectures:<br>\n<blockquote><b>Dr. Hagen<\/b>: The Origin of HIV<br>\nGuest Lecture:<br> \n<blockquote><b>Dr. James W. Curran<\/b>: The History of AIDS\n<\/blockquote><\/blockquote><\/blockquote><p><\/p>\n\n<p><b>Week 2:<\/b> SCIENCE: Focusing on how the immune system\nworks, what HIV does to disable the body’s ability to protect itself against\neveryday germs, and important scientific questions about HIV that are as yet\nunanswered.<\/p>\n<p><\/p><blockquote>Lectures:<br>\n<blockquote><b>Dr. Hagen<\/b>: The Normal Immune System<br>\nGuest Lecture:<br> \n<blockquote><b>Dr. Eric Hunter<\/b>: HIV's Effect on the Immune System\n<\/blockquote><\/blockquote><\/blockquote><p><\/p>\n\n\n<p><b>Week 3:<\/b> BEHAVIORAL PREVENTION: Focusing on behavior change, culturally embedded HIV prevention and awareness messages, an exceptionally cost-effective way to reduce HIV transmission rates, and\nwhere to find information about prevention interventions of proven efficacy.<br><\/p>\n<p><\/p><blockquote>Lectures:<br>\n<blockquote><b>Dr. Hagen<\/b>: Introduction; Theories of Behavior Change; The DEBI Project<br>\nGuest Lectures:<br> \n<blockquote><b>Dr. Kate Winskell<\/b>: Scenarios from Africa \/ Global Dialogues<br>\n<b>Dr. Susan Allen<\/b>: Couples Voluntary Counseling and Testing\n<\/blockquote><\/blockquote><\/blockquote><p><\/p>\n\n<p><b>Week 4: <\/b>BIOMEDICAL PREVENTION: Focusing on current research in biological ways to reduce transmission between mother and child, in the workplace, and among sero-discordant couples.<\/p>\n<p><\/p><blockquote>Lectures:<br>\n<blockquote><b>Dr. Hagen<\/b>: Preventing MTCT; PEP; PrEP<br>\nGuest Lecture:<br>\n<b>Dr. Carlos del Rio<\/b>: TasP; Male Circumcision\n<\/blockquote><\/blockquote><p><\/p>\n\n<p><b>Week 5:<\/b>&nbsp;VULNERABLE POPULATIONS: Focusing on how HIV affects and is affected by political, cultural, sexual, biological, and gender-based factors.<\/p><p><\/p><blockquote>Lectures:<br><blockquote><b>Dr. Hagen<\/b>: Social Determinants of&nbsp;<br>Guest Lectures:<br><blockquote><b>Dr. Claire Sterk<\/b>: Women<br><b>Dr. Patrick Sullivan<\/b>: Men who have Sex with Men<br><b>Dr. Rana Chakraborty<\/b>: Children and Adolescents&nbsp;<br>Dr. Anne Spaulding: Prisoners<\/blockquote><\/blockquote><\/blockquote><p><\/p><p><b>Week 6:<\/b>&nbsp;CLINICAL CARE ISSUES: Focusing on developments in HIV testing, the illnesses that people with HIV\/AIDS are at risk from, and crucial issues that can affect the success of HIV treatment.<\/p><p><\/p><blockquote>Lectures:<br><blockquote><b>Dr. Hagen<\/b>: HIV Testing; AIDS-defining and Opportunistic Infections<br>Guest Lecture:<br><b>Dr. Marcia Holstad<\/b>: Health Literacy; Obstacles to Medication Adherence<\/blockquote><\/blockquote><p><\/p><p><\/p><p><b>Week 7:<\/b> AIDS VACCINES: Focusing on an explanation of what vaccines are, the requirements\nfor a successful HIV\/AIDS vaccine, what is involved in being a volunteer in a\nclinical trial of an experimental AIDS vaccine, and a discussion of vaccine\ntrial results to date.<\/p>\n<p><\/p><blockquote>Lectures:<br>\n<blockquote><b>Dr. Hagen<\/b>: Vaccine History and Development<br>\nGuest Lecture:<br> \n<b>Dr. Paula Frew<\/b>: Participating in an Experimental AIDS Vaccine Trial\n<\/blockquote><\/blockquote><p><\/p>\n\n\n<p><b>Week 8:<\/b>&nbsp;FUTURE CHALLENGES: Focusing on key areas in the battle to successfully mitigate global suffering related to AIDS.<\/p><p><\/p><blockquote>Lectures:<br><blockquote><b>Dr. Hagen<\/b>: The Economics of AIDS<br>Guest Lecture:<br><b>Dr. Vincent Marconi<\/b>: Curing HIV<br>Dr. James Curran: The Next&nbsp;30 Years<\/blockquote><\/blockquote><p><b>Week 9:<\/b>&nbsp;RESPONDING TO HIV\/AIDS: Focusing on how individuals, organizations, and societies have and are&nbsp;responding to the pandemic.<br><\/p><p><\/p><blockquote>Lectures:<br><blockquote><b>Dr. Hagen<\/b>: On Being a Volunteer<br>Guest Lecture:<br><b>Dr. John Blevins<\/b>: The History of AIDS Activism; Religion as a Social Force in HIV<\/blockquote><\/blockquote><p><\/p><p><br><\/p><p><\/p>",
    "estimatedClassWorkload": "3-4 hours\/week",
    "recommendedBackground": "<p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p><p>This course does not assume any prior knowledge of, or\ncoursework in, HIV\/AIDS.&nbsp;<\/p>\n\n<p><\/p>",
    "links": {

    }
}