{"id":3557,"shortName":"whartoncapstonees","name":"Proyecto de Fundamentos Empresariales de Wharton","language":"es","shortDescription":"El Proyecto Final de Conocimiento Aplicado de Wharton te permite aplicar tus habilidades analíticas a retos de negocios reales, incluyendo el tuyo. Usarás esas habilidades empresariales recientemente adquiridas, para evaluar de manera reflexiva una oportunidad o situación real de compañías dirigidas por Wharton como Televisa.","aboutTheCourse":"El Proyecto Final de Conocimiento Aplicado de Wharton te permite aplicar tus habilidades analíticas a retos de negocios reales, incluyendo el tuyo. Usarás esas habilidades empresariales recientemente adquiridas, para evaluar de manera reflexiva una oportunidad o situación real de compañías dirigidas por Wharton como Televisa.También podrás preparar un análisis estratégico y plantear una solución a un reto al que se enfrente tu propia compañía u organización. Personal cualificado de Wharton evaluará los mejores trabajos, y equipos de dirección de Televisa revisarán los proyectos que obtengan mejor puntuación.","targetAudience":3,"courseSyllabus":"<p>El alumno podrá elegir un reto de negocios real de Televisa o usar un ejemplo de su propio trabajo para evaluarlo cuidadosamente, y después comunicar su análisis de manera clara a sus compañeros, al personal cualificado de Wharton y a directores de industrias colaboradoras relevantes.<\/p>\n<p>Objetivos de Aprendizaje:<\/p>\n<p>●\tIdentificar los beneficios y los puntos de riesgo de una oportunidad de negocio real.<\/p>\n<p>●\tDesarrollar una estrategia para sacar provecho a una oportunidad empresarial.<\/p>\n<p>●\tComunicar tus análisis y planes claramente y con precisión.Los estudiantes crearán un informe estratégico, una presentación de diapositivas o un vídeo, donde recomendarán una estrategia de mercado para sus retos de negocios.<\/p>\n<p><br><\/p><p>Los estudiantes definirán la oportunidad, identificarán los principales riesgos y beneficios y presentarán un plan de mercado, que incluirá los siguientes elementos clave:<\/p>\n<p>●\tMarketing: Desarrollar un plan de comunicación\/marketing centrado en el consumidor para los nuevos productos.<\/p>\n<p>●\tFinanzas\/Contabilidad: Desarrollar un modelo financiero (p.e. modelo de flujo de efectivo descontado) del proyecto potencial. velop a financial model (e.g., discounted cash flow model) of the potential project. Incluirá costes y previsiones de ingresos.<\/p>\n<p>●\tGestión de Operaciones: Esbozar un plan de producción y\/o de servicio para el nuevo proyecto.<\/p>","courseFormat":"Los vídeos y los proyectos de muestra guiarán a los estudiantes en la creación de sus proyectos.","suggestedReadings":"","estimatedClassWorkload":"3-5 hours\/week","recommendedBackground":"<span><p dir=\"ltr\">Tienes que completar los cuatro cursos de la Especialización de Fundamentos Empresariales antes de comenzar el proyecto final.<\/p><div><br><\/div><\/span>","links":{}}