{
    "id": 2294,
    "shortName": "fog",
    "name": "Fog Networks and the Internet of Things",
    "language": "en",
    "shortDescription": "This course teaches the fundamentals of Fog Networking, the network architecture that uses one or a collaborative multitude of end-user clients or near-user edge devices to carry out storage, communication, computation, and control in a network. It also teaches the key results in the design of the Internet of Things, including consumer and industrial applications. ",
    "aboutTheCourse": "<p>Pushing computation, control and storage into the “cloud” has been a key trend in\nnetworking in the past decade. The cloud is now “descending” to the network\nedge and often diffused among the client devices in both mobile and wireline\nnetworks. The cloud is becoming the “fog.” Empowered by the latest chips,\nradios, and sensors, each client device today is powerful in computation, in\nstorage, in sensing and in communication. Yet client devices are still limited\nin battery power, global view of the network, and mobility support. Most\ninterestingly, the collection of many clients in a crowd presents a highly\ndistributed, under-organized, and possibly dense network. <\/p>\n\n<p>Fog Networking is an architecture that will also support the Internet of Things, IoT, such as the “connected wearables.” Bold, new user interfaces are getting close to affordable price points for the mass, begging questions on the “architectural choices for the glasses and watches,” from naming to billing, and from session management to resource optimization. Fog Networking leverages past experience in sensor networks, P2P and MANET research, and incorporates the latest advances in devices, network systems, and data science to reshape the “balance of power” in the ecosystem of computing and networking.&nbsp;<\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<ol><li>Overview: From Cloud to Fog<\/li><li>Overview: From IT to loT<\/li><li>Principles of Edge\/P2P networking<\/li><li>Smart data pricing for new network services<\/li><li>Client side control and configuration<\/li><li>Client-side measurement &amp; Control Signaling<\/li><li>Edge resource pooling and caching<\/li><li>Security and privacy in Fog<\/li><li>Consumer and wearable IoT<\/li><li>Connected cars IoT<\/li><li>Smart grids IoT<\/li><li>Healthcare IoT&nbsp;<\/li><\/ol>",
    "estimatedClassWorkload": "6-10 hours\/week",
    "recommendedBackground": "Basic knowledge of communication networks.",
    "links": {}
}