{"id":173,"shortName":"epigenetics","name":"Epigenetic Control of Gene Expression","language":"en","shortDescription":"Each mammalian cell has the same genes, yet performs distinct functions. This is achieved by epigenetic control of gene expression; the switching on and switching off of genes. This course will cover the principles of epigenetic control of gene expression, how epigenetic control contributes to cellular differentiation and development, and how it goes wrong in disease.","aboutTheCourse":"<p><b><\/b>While the human genome sequence has\ntransformed our understanding of human biology, it isn’t just the sequence of\nyour DNA that matters, but also how you use it! How are some genes activated\nand others are silenced? How is this controlled? The answer is epigenetics.  <\/p>\n\n<p>Epigenetics has been a hot topic for research\nover the past decade as it has become clear that aberrant epigenetic control\ncontributes to disease (particularly to cancer). Epigenetic alterations are heritable\nthrough cell division, and in some instances are able to behave similarly to\nmutations in terms of their stability. Importantly, unlike genetic mutations,\nepigenetic modifications are reversible and therefore have the potential to be\nmanipulated therapeutically. It has also become clear in recent years that\nepigenetic modifications are sensitive to the environment (for example diet),\nwhich has sparked a large amount of public debate and research.<\/p>\n\n<p>This course will give an introduction to the\nfundamentals of epigenetic control. We will examine epigenetic phenomena that\nare manifestations of epigenetic control in several organisms, with a focus on\nmammals. We will examine the interplay between epigenetic control and the\nenvironment and finally the role of aberrant epigenetic control in disease.<\/p>","targetAudience":1,"courseSyllabus":"<p>Introduction to epigenetics<\/p><p>Epigenetic modifications and their function\nin regulating gene expression and chromosome structure<\/p><blockquote><p>DNA methylation, covalent histone modifications, histone variants, chromatin structure, noncoding RNAs and 3D organisation of the nucleus<br><\/p><\/blockquote><p>Epigenetic phenomena in lower organisms<\/p><blockquote><p>Position effect variegation, dosage compensation, paramutation<br><\/p><\/blockquote><p>Mammalian epigenetics<\/p><blockquote><p>Epigenetic reprogramming, genomic imprinting, X inactivation<br><\/p><\/blockquote>\n\n<p>Epigenetic deregulation in disease<\/p><blockquote><p>Rett syndrome, ICF syndrome, Imprinting disorders, cancer<br><\/p><\/blockquote><p>Epigenetics and the environment (diet,\nmaternal environment, maternal care)<\/p><blockquote><p>The Agouti viable yellow allele in mice, maternal care in rats, Dutch famine in humans<br><\/p><\/blockquote>","courseFormat":"This course will run for 8 weeks, comprising\n7 weeks of short video lectures, weekly quizzes for weeks 1 to 6, one peer-assessed written assignment and discussion\ngroups. Please note that the written assignment is in short answer format, and an easy to follow marking scheme will be provided.<br><br>","suggestedReadings":"<p>All necessary information will be covered in the lectures, and recommended and required readings will be provided. There are no additional required texts for this course.<\/p><p>For those interested, additional\ninformation can be obtained in the following textbook.<\/p><p><span>\n<i><a title=\"Link: http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=epigenetics&isbn_ean=9780879698751\" href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=epigenetics&isbn_ean=9780879698751\">Epigenetics<\/a>.<\/i> Allis, Jenuwein, Reinberg and Caparros. Cold Spring Harbour\nLaboratory Press. ISBN-13: 978-0879697242 | Edition: 1<\/span><\/p>","instructor":"Dr Marnie Blewitt","estimatedClassWorkload":"6-8 hours\/week","recommendedBackground":"Some background in biology, and more specifically genetics is recommended. If you don't have a genetics background, or want to brush up on genetics before you start, you might like to consider taking one of these MOOCs before our course starts:<br><br><b>Introduction to Genetics and Evolution<\/b><br><a href=\"https:\/\/www.coursera.org\/course\/geneticsevolution\">https:\/\/www.coursera.org\/course\/geneticsevolution<\/a><br><b><br>Genes and The Human Condition (From Behaviour to Biotechnology)<\/b>:&nbsp;<br><a href=\"https:\/\/coursera.org\/course\/genes\" target=\"_blank\" title=\"Link: https:\/\/coursera.org\/course\/genes\">https:\/\/coursera.org\/course\/genes<\/a> <br><br><b>Useful Genetics<\/b>:&nbsp;<br><a href=\"https:\/\/www.coursera.org\/course\/usefulgenetics\" target=\"_blank\" title=\"Link: https:\/\/www.coursera.org\/course\/usefulgenetics\">https:\/\/www.coursera.org\/course\/usefulgenetics<\/a> <br><br><strong>Genomic Medicine gets Personal:<\/strong><br><a href=\"https:\/\/www.edx.org\/course\/georgetown-university\/medx202-01\/genomic-medicine-gets-personal\/837\" target=\"_blank\">https:\/\/www.edx.org\/course\/georgetown-university\/medx202-01\/genomic-medicine-gets-personal\/837<\/a> <br><br>","links":{}}