{"id":394,"shortName":"networksonline","name":"Social and Economic Networks:  Models and Analysis","language":"en","shortDescription":"Learn how to model social and economic networks and their impact on human behavior.  How do networks form, why do they exhibit certain patterns, and how does their structure impact diffusion, learning, and other behaviors?   We will bring together models and techniques from economics, sociology, math, physics, statistics and computer science to answer these questions.  ","aboutTheCourse":"<div>Social networks pervade our social and economic lives.   They play a central role in the transmission of information about job opportunities and are critical to the trade of many goods and services. They are important in determining which products we buy, which languages we speak, how we vote, as well as whether or not we decide to become criminals, how much education we obtain, and our likelihood of succeeding professionally.   The countless ways in which network structures affect our well-being make it critical to understand how social network structures impact behavior, which network structures are likely to emerge in a society, and why we organize ourselves as we do.  This course provides an overview and synthesis of research on social and economic networks, drawing on studies by sociologists, economists, computer scientists, physicists, and mathematicians.<\/div><div><br><\/div><div>The course begins with some empirical background on social and economic networks, and an overview of concepts used to describe and measure networks.   Next, we will cover a set of models of how networks form, including random network models as well as strategic formation models, and some hybrids.   We will then discuss a series of models of how networks impact behavior, including contagion, diffusion, learning, and peer influences.<\/div><div><br><\/div>","targetAudience":2,"courseSyllabus":"<ul><li>Week 1: Introduction, Empirical Background and Definitions<br><\/li><\/ul>Examples of Social Networks and their Impact, Definitions, Measures and Properties: Degrees, Diameters, Small Worlds, Weak and Strong Ties, Degree Distributions<br><br><ul><li>Week 2: Background, Definitions, and Measures Continued<\/li><\/ul>Homophily, Dynamics,  Centrality Measures: Degree, Betweenness, Closeness, Eigenvector, and Katz-Bonacich. Erdos and Renyi Random Networks: Thresholds and Phase Transitions,<br><br><ul><li>Week 3: Random Networks <br><\/li><\/ul>Poisson Random Networks, Exponential Random Graph Models, \u000f Growing Random Networks, Preferential Attachment and Power Laws, Hybrid models of Network Formation<br><br><ul><li>Week 4:  \u000f Strategic Network Formation <\/li><\/ul><div>Game Theoretic Modeling of Network Formation, The Connections Model, The Conflict between Incentives and E\u000efficiency, Dynamics, Directed Networks, Hybrid Models of Choice and Chance<br><br><\/div><ul><li>Week 5:  Di\u000bffusion on Networks. <\/li><\/ul>Empirical Background, The Bass Model, Random Network Models of Contagion, The SIS model, Fitting a Simulated Model to Data<br><br><ul><li>Week 6:  Learning on Networks. <\/li><\/ul>Bayesian Learning on Networks, The DeGroot Model of Learning on a Network, Convergence of Beliefs, The Wisdom of Crowds, How Influence depends on Network Position.<br><br><ul><li>Week 7: Games on Networks. <\/li><\/ul><div>Network Games, Peer Influences:  Strategic Complements and Substitutes, the Relation between Network Structure and Behavior, A Linear Quadratic Game, Repeated Interactions and Network Structures.<\/div><div><br><\/div>","courseFormat":"<p>The course will run for seven weeks, plus two for the final exam.&nbsp; Each week there will be\nvideo lectures available, as well as a standalone problem set and some occasional data\nexercises, and there will be a final exam at the end of the course for those who wish to earn a course certificate. &nbsp;<\/p>","suggestedReadings":"The course is self-contained, so that all the definitions and concepts you need to solve the problem sets and final are contained in the video lectures. &nbsp;Much of the material for the course is covered in a text: Matthew O. Jackson &nbsp;Social and Economic Networks, Princeton University Press (Here are  <a href=\"http:\/\/press.princeton.edu\/titles\/8767.html\">Princeton University Press<\/a> and\n<a href=\"http:\/\/www.amazon.com\/Social-Economic-Networks-Matthew-Jackson\/dp\/0691148201\/ref=tmm_pap_title_0\">Amazon<\/a>&nbsp; pages for the book). &nbsp;The text is&nbsp;<i>optional<\/i> and not required for the course. &nbsp;Additional background readings, including research articles and several surveys on some of the topics covered in the course can be found on <a href=\"http:\/\/www.stanford.edu\/~jacksonm\/papersarticles.html\">my web page<\/a>.","instructor":"Matthew O. Jackson","estimatedClassWorkload":"3-6 hours\/week","recommendedBackground":"The course has some basic prerequisites in mathematics and statistics.  For example, it will be assumed that students are comfortable with basic concepts from linear algebra (e.g., matrix multiplication), probability theory (e.g., probability distributions, expected values, Bayes' rule), and statistics (e.g., hypothesis testing), and some light calculus (e.g., differentiation and integration).  Beyond those concepts, the course will be self-contained.","links":{}}