{"id":1426,"shortName":"pealgoritmico","name":"Pensamiento algorítmico","language":"es","shortDescription":"¿Qué es un algoritmo? ¿Cómo se hace un diagrama de flujo? ¿Qué es un pseudocódigo? ¿Cómo me pueden ayudar a resolver problemas cotidianos?\n\nEste curso básico de computación te ayudará a desarrollar el pensamiento algorítmico necesario para solucionar problemas en forma estructurada.","aboutTheCourse":"<span><p>¿Has tenido que resolver un mismo problema varias veces?, por ejemplo, al salir de viaje o preparar una reunión con amigos. Y cada vez, ¿tuviste que volver a pensar en todo lo que hay que hacer, cuáles pasos y en qué orden? <\/p><p>Precisamente lo que busca este curso es proporcionarte las herramientas necesarias con las que identificarás, analizarás y plantearás soluciones efectivas para estas situaciones. Así, al encontrarte con el mismo problema, ya sabrás una manera de resolverlo.<\/p><p>En este curso introductorio a la computación, desarrollarás el razonamiento estructurado necesario para analizar problemas básicos y resolverlos utilizando la reflexión lógica y el pensamiento algorítmico. De igual manera, reconocerás los elementos que están a tu alcance y cómo los puedes utilizar efectivamente para lograr tus objetivos.<\/p>Al finalizar el curso, aprenderás a plasmar soluciones en términos computacionales a través de diagramas de flujo o pseudocódigo. Además, podrás trasladar estas soluciones a herramientas como hojas de cálculo que te serán útiles en tus actividades diarias, personales y profesionales.<\/span>","targetAudience":0,"courseSyllabus":"<ul><li><p><strong>Semana 1 - Razonamiento algorítmico y metodología para la solución de problemas<\/strong><\/p><\/li><ul><li><p>Análisis y solución de problemas empleando algoritmos y diagramas de flujo<\/p><\/li><li><p>Entrada y salida de datos <\/p><\/li><li><p>Expresiones aritméticas y operador de asignación<\/p><\/li><li><p>Solución de problemas con expresiones aritméticas<\/p><\/li><\/ul><li><p><strong>Semana 2 - Estructuras de control selectivas<\/strong><\/p><\/li><ul><li><p>Problemas que involucran toma de decisiones<\/p><\/li><li><p>Especificación y funcionamiento de la estructura de control selectiva <\/p><\/li><ul><li><p>Operadores relacionales (lógicos)<\/p><\/li><\/ul><\/ul><li><p><strong>Semana 3 - Estructuras de control repetitivas<\/strong><\/p><\/li><ul><li><p>Problemas que involucran situaciones repetitivas<\/p><\/li><li><p>Especificación de un estatuto de repetición para formar ciclos<\/p><\/li><ul><li><p>Contador y acumulador<\/p><\/li><\/ul><\/ul><li><p><strong>Semana 4 - Aplicación de estructuras cíclicas<\/strong> <\/p><\/li><ul><li><p>Solución de problemas utilizando estatutos de repetición simple<\/p><\/li><\/ul><li><p><strong>Semana 5 - Introducción al ambiente de hoja de cálculo<\/strong><\/p><\/li><ul><li><p>Elementos básicos de una hoja de cálculo<\/p><\/li><li><p>Referencias absolutas y referencias relativas<\/p><\/li><li><p>Creación de fórmula<\/p><\/li><li><p>Jerarquía de evaluación de los operadores aritméticos<\/p><\/li><li><p>Uso de rangos<\/p><\/li><\/ul><li><p><strong>Semana 6 - Solución de problemas con hoja de cálculo<\/strong><\/p><\/li><ul><li><p>Funciones matemáticas<\/p><\/li><li>Funciones selectivas<\/li><\/ul><\/ul>","courseFormat":"El curso está compuesto por &nbsp;dos módulos: razonamiento para el diseño de diagramas de flujo y algoritmos y el uso básico de hoja de cálculo. Los recursos didácticos con los que se podrá contar son videos, actividades y apoyos visuales.","suggestedReadings":"Aunque los materiales de clase se proporcionarán, los participantes que quieran ampliar sus conocimientos en temas particulares tendrán la oportunidad de consultar recursos adicionales que se pondrán a disposición dentro del curso.","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"Se requiere tener conocimientos elementales de las ciencias básicas de nivel medio-superior.","links":{}}