{"id":3495,"shortName":"artofthemooc","name":"ART of the MOOC: Merging Public Art and Experimental Education","language":"en","shortDescription":"Join thousands around the world in this free, six-week online course that is also a work of public art. Designed by artist and Duke University professor Pedro Lasch, and co-taught by Creative Time chief curator Nato Thompson, the course includes creative exercises and dozens of presentations by key figures in the field of art and social politics. ","aboutTheCourse":"<div>Can a MOOC be a work of art? New York’s public art organization, Creative Time, and Duke University believe it can. &nbsp;Designed by artist and Duke professor, Pedro Lasch, and co-taught with Creative Time chief curator, Nato Thompson, ART of the MOOC functions simultaneously as a socially-engaged public art form and a survey course on that very subject. &nbsp;Taking full advantage of the global scale yet intimate environment that only a MOOC can offer, this course merges traditional classroom practices with new technology and aesthetic experimentation. &nbsp;Video lectures, complementary materials, and presentations by cross-national artists, curators, critics, and activists provide a formal and theoretical overview of the fundamental themes within socially-engaged public art. &nbsp;Interspersed with these lessons, students will contribute to the field by completing creative assignments and participating in collective art projects. &nbsp;Online forums and opportunities to assemble outside of class will allow students to share their activities while developing critical thinking and discussion skills. &nbsp;Through this hands-on, participatory approach, ART of the MOOC welcomes students as collaborators in an unprecedented expression of public art and education.&nbsp;<\/div><div><br><\/div><div>In addition to Lasch and Thompson, students will be learning from the following list of guest presenters:<\/div><div><br><\/div><div>•\t<strong>Tania Bruguera<\/strong> is an installation and performance artist who frequently addresses the political climate in Cuba and the world, and also the founder of the Hannah Arendt International Institute for Artivism.<\/div><div>•\t<strong>Sean Dockray<\/strong> is an artist, researcher, founding director of the Los Angeles non-profit Telic Arts Exchange, and initiator of knowledge-sharing platforms, The Public School and Aaaaarg.<\/div><div>•\t<strong>Claire Doherty<\/strong> is a curator, writer, and educator interested in temporary, place-based art and unconventional curatorial practices. She is the founding director of Situations in the U.K., and author of Public Art (Now).&nbsp;<\/div><div>•&nbsp;<b>Not An Alternative (represented by Beka Economopoulos)<\/b>&nbsp;Beka Economopoulos&nbsp;is a grassroots field and online organizer, and director of the art, activism, technology, and theory non-profit Not An Alternative. She is also co-founder and director of The Natural History Museum.<\/div><div>•\t<strong>Tom Finkelpearl<\/strong> is the Commissioner of the New York City Department of Cultural Affairs, and author of What We Made: Conversations on Art and Social Cooperation<\/div><div>•\t<strong>Future Farmers<\/strong> is a group of artists, researchers, designers, farmers, scientists, engineers, and illustrators, all working together to challenge current social, political, and economic systems.<\/div><div>•\t<strong>Mariam Ghani<\/strong> is artist, writer, filmmaker, and educator, whose work focuses on memory, history, language, loss, and reconstruction, particularly through her US, Afghani, and Lebanese background, and her engagement with choreography.<\/div><div>•\t<strong>Rebecca Gomperts<\/strong> is a doctor and environmental activist dedicated to providing women access to contraception and safe, legal abortion services. Her Women on Waves iniative has garnered worldwide attention and was the topic of the film The Vessel.<\/div><div>•\t<strong>Chido Govera<\/strong> is a farmer, campaigner, and educator based in Zimbabwe. The founder of The Future of Hope Foundation, she has promoted mushroom cultivation as a sustainable source of food and income in impoverished regions of the world for many years.<\/div><div>•\t<strong>Gulf Labor<\/strong> is an international art and research group that pressures institutions to adopt fair labor standards in the Middle East, particularly towards migrant workers during the construction of museums on Saadiyat Island in Abu Dhabi.<\/div><div>•\t<strong>Hans Haacke<\/strong> is an artist whose concept-based work critiques political and social systems. His public commissions include a piece for the Fourth Plinth in London, and the German Parliament.<\/div><div>•\t<strong>Sharon Hayes<\/strong> is a multimedia artist whose methodological approaches borrow from theater, film, anthropology, linguistics, and journalism. Her works focus on collectivity and dissent and the intersections between history, politics and speech.<\/div><div>•\t<strong>Fran Ilich<\/strong> is a Tijuana-raised author of novels and producer of new media works, including technological platforms dedicated to alternative economies. He has worked with the Zapatistas in Chiapas, Diego de la Vega, and Spacebank.<\/div><div>•\t<strong>Shannon Jackson<\/strong> is the author of several books, including Social Works: Performing Art, Supporting Publics. She is the Cyrus and Michelle Hadidi Chair of Rhetoric and performance Studies and Associate Vice Chancellor of Arts and Design at the University of California, Berkeley.<\/div><div>•\t<strong>Suzanne Lacy<\/strong> is an artist and educator whose installation, video, performance, public art, photography, and art books focus on social themes and urban issues. She is the author of Mapping the Terrain, Leaving Art, and founder of the Public Practice M.F.A. at Otis College.<\/div><div>•\t<strong>Rick Lowe<\/strong> is an artist whose unconventional approach to community revitalization has transformed a long-neglected neighborhood in Houston into a visionary public art project.<\/div><div>•&nbsp;<b>Leonidas Martin Saura<\/b> is an artist, activist, expert joke teller, and member of Enmedio and other collectives like Las Agencias, Yomango, Prêt à Revolter, New Kids on the Black Block. His is also a professor of new media and political art at Barcelona University.&nbsp;<\/div><div>•\t<strong>Naeem Mohaiemen<\/strong>&nbsp;uses essays, films, and mixed media to explore borders, wars, and belonging after postcolonial ruptures. The afterlives of the idea of Bangladesh center his research on \"global history.\"<\/div><div>•\t<strong>Mujeres Creando<\/strong> (represented by María Galindo) is a Bolivian anarcha-feminist collective that participates in anti-poverty movements through propaganda, street theater, and direct action.<\/div><div>•\t<strong>Wanda Nanibush<\/strong> is an Anishinabe-kwe curator, writer, consultant, and artist from Beausoleil First Nation concentrated on re-contextualizing Indigenous time-based media and performance art.<\/div><div>•\t<strong>Enrique Peñalosa<\/strong> is the former mayor of Bogotá, Colombia and an urban activist. His radical approaches to expand walking, cycling, and more democratic designs to urban transport and land policy have brought him international attention<\/div><div>•\t<strong>Cesare Pietroiusti<\/strong> is an artist and educator who focuses on problematic and paradoxical situations that are hidden in ordinary acts or social relationships. He is also the founder of Evolution de l’Art, a gallery dedicated exclusively to immaterial art.<\/div><div>•\t<strong>Jolene Rickard<\/strong> is a Tuscarora artist, curator and visual historian at Cornell University, specializing in issues of indigeneity in a global context. Rickard co-curated two of the four permanent exhibitions for the Smithsonian's National Museum of the American Indian.<\/div><div>•\t<strong>Chemi Rosado-Seijo<\/strong> is a Puerto Rico-based artist whose interdisciplinary projects and public interventions concern urban landscape, social action, and art history, including longterm community engagements like El Cerro at Naranjito.<\/div><div>•\t<strong>Abigail Satinsky<\/strong> is a writer, grassroots organizer, and curator of socially-engaged art. She was a co-founder of InCUBATE, and author of the book Support Networks.<\/div><div>•\t<strong>Gregory Sholette<\/strong> is an artist, writer, and activist concerned with issues pertaining to culture and the political economy. He is the author of Dark Matter: Art and Politics in the Age of Enterprise Culture.<\/div><div>•\t<strong>ruangrupa<\/strong> (represented by farid rakun) is an artist initiated nonprofit organization based in Indonesia that strives to support artistic ideas within the urban context. Their work has included repurposing homes in Jakarta, and transforming them into cultural spaces.<\/div><div>•\t<strong>Joshua Wong<\/strong> is a student activist at the Open University of Hong Kong, leader of the Scholarism group and the Umbrella Revolution. At age 18 he was nominated as ‘Person of the Year’ by Time Magazine, also appearing on its cover.<\/div><div>•\t<strong>Caroline Woolard<\/strong> is an artist and organizer who operates at the intersection of art, urbanism, architecture, and political economy. She has co-founded various resource sharing networks, also focusing on the impact of debt systems in education and real estate.<\/div>","targetAudience":3,"courseSyllabus":"<div><strong>Week 1: Public Art and Spatial Politics (Lasch &amp; Thompson)<\/strong><\/div><div>This lesson will lay out some basic definitions and examples of public practice and socially engaged art, especially as they relate to spatial politics. We will examine the critical role that such practices have had in relation to various forms of urbanism and social planning and consider the physical and symbolic mechanisms that separate the global and the local, the urban and the rural, the visible and the invisible, citizens and immigrants, settlers and refugees. The lecture and guest presentations will provide foundation and inspiration for students’ own experiments with spatial politics.&nbsp;<\/div><div>Guest presenters: <strong>Claire Doherty, Tom Finkelpearl, Rick Lowe, Enrique Peñalosa<\/strong><\/div><div><br><\/div><div><strong>Week 2: Experimental Pedagogy (Lasch)<\/strong><\/div><div>Many socially engaged artists are invested in the communication of ideas through education or educational projects. From Freire and Boal to Judy Chicago and Miriam Shapiro’s Womanhouse and the CalArts Feminist Art Program a brief review of experimental or radical pedagogy and its influence on art is hence the focus of this lesson. Using various technologies and social forms, some of these works set out to transform education from within. Others intentionally position themselves as self-organized platforms outside of institutions. Our focus will be on how the production of alternative communities of learning can challenge the hierarchies, professionalization, homogenization, and economy of current education systems. This week’s practical components will invite students to rethink their relationship to education as they chose between small-scale socialization and massive collaboration.<\/div><div>Guest presenters: <strong>Tania Bruguera, Sean Dockray, Suzanne Lacy,&nbsp;<\/strong><b>Cesare Pietroiusti<\/b><\/div><div><br><\/div><div><strong>Week 3: Fictions, Alternative Structures, and Mock-Institutions (Lasch &amp; Thompson)<\/strong><\/div><div>By definition, social art is a collective endeavor. It might seek to transform larger social structures and economies. Perhaps more modestly, it might offer some alternatives or simply confront immediate challenges. The production of an unusual, creative, or engaged collective body can be its final goal. In this lesson we will learn how socially engaged artists have used the guise or actual form of organizations and institutions such as churches, corporations, banks, government offices, and other social units as the very media of their work. This lesson’s practical components will ask students to invent their own alternative social structures or fictional interventions.<\/div><div>Guest presenters: <strong>Fran Ilich,&nbsp;<\/strong><b>Cesare Pietroiusti,&nbsp;<\/b><strong>Ruangrupa,&nbsp;<\/strong><b>Greg Sholette,&nbsp;<\/b><strong>Caroline Woolard<\/strong><\/div><div><br><\/div><div><strong>Week 4: Aesthetics, Art History, and Cultural Institutions (Lasch &amp; Thompson)<\/strong><\/div><div>Starting with an exploration of the ways in which socially engaged public art has been included and excluded from particular narratives, theories, institutions, and events, we will use this lesson to follow social practices as they question conventional art and art history. As we do so, students will be invited to create projects that directly engage with Cultivating, Farming, Cooking, or Eating—activities that are fundamentally social but traditionally seen to contradict serious artistic production.<\/div><div>Guest presenters: <strong>Chido Govera, Hans Haacke, Future Farmers,&nbsp;<\/strong><b>Shannon Jackson,&nbsp;<\/b><strong>Jolene Rickard, Abigail Satinsky<\/strong><\/div><div><br><\/div><div><strong>Week 5: Embodied Knowledges (Lasch)<\/strong><\/div><div>This lesson will use the notion of ‘embodied knowledges’ to link socially engaged art to performance art, gesture, and ‘writing without words.’ Recognizing that knowledge is inseparable from ones lived, physical, and social experience, ‘embodied knowledges” challenge the Western paradigms that separate information from matter, reason from affect, mind from the body, the worker from her labor, the individual from the collective. This lesson’s practical components will ask students to actively think ‘from’ their particular site of enunciation and ‘through’ their particular embodied knowledge.&nbsp;<\/div><div>Guest presenters: <strong>Mujeres Creando, Regina José Galindo, Mariam Ghani, Sharon Hayes, Wanda Nanibush, Chemi Rosado-Seijo&nbsp;<\/strong><\/div><div><br><\/div><div><strong>Week 6: Activism and Social Movements (Lasch &amp; Thompson)<\/strong><\/div><div>The final lesson is dedicated to the prolific and exciting overlap between socially engaged art and cultural practices generated by recent social movements around the world. Environmentalism, AIDS activism, Queer movements, Zapatismo, immigrant rallies, alter-globalization, the World Social Forum, Occupy, the Hong Kong Umbrella Movement, museum boycotts, and democratic uprisings in the Middle East will be seen in dialogue with cultural producers who participate in these movements or are inspired by them. Rather than assess the political efficacy of such cultural activities, we will examine their place within contemporary art practices. Based on Listening, Organizing, Dancing, or Partying, each student’s contribution will respond to &nbsp;a particular social movement of their choosing.<\/div><div>Guest presenters: <strong>Beka Economopoulos, Gulf Labor, Rebecca Gomperts, Leonidas Martin, Naeem Mohaiemen, Joshua Wong<\/strong><\/div>","courseFormat":"<div><div>This course consists of short video lectures by Lasch and Thompson, complemented by video presentations and interviews with important figures related to each module. To best ensure learning comprehension, students will complete short multiple choice quizzes before moving on to produce their own projects inspired by the weekly topics. As the primary focus of the ART of the MOOC, the projects are based on simple prompts presented in weekly instructional videos. In the prompts, Lasch also discusses related processes. Students chose which of two options best matches their interests. No previous art or social practice experience is required. This approach to learning through practice is the ART of the MOOC's primary artistic and experimental component. Working alone and collectively on projects transforms students into active participants of an unprecedented experiment in art and education. All works will be graded through a peer evaluations process. Some will be highlighted in forums with the instructors and guest presenters. Others may be presented in professional settings like the Creative Time Summit in New York on November 14-15, 2015. The four best out of the six weekly projects will be counted towards a student’s certificate of completion.<\/div><div><br><\/div><div>All required study materials will be posted on Coursera, including a ‘Glossary of Terms, Artists, and Projects’ that will serve as aid to study for the weekly quizzes. Additional resources like full interviews with guests, short readings, full bibliographies, links, databases, and more, will be made available through an external Wiki produced as part of the The Art of the MOOC. Students may in fact contribute to this Wiki as they complete their course.<\/div><\/div>","suggestedReadings":"","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"The course is open to those without previous experience, as well as more advanced students and practicing professionals.&nbsp;","links":{}}