{
    "id": 1292,
    "shortName": "adolescenthealth",
    "name": "Global Adolescent Health",
    "language": "en",
    "shortDescription": "This course will explore the dynamic factors affecting the health and wellbeing of young people around the world, and how important it is for individuals, communities and nations that we improve the health and life chances of this important population group.",
    "aboutTheCourse": "<p>With over 25% of the world’s population aged between 10 and 24 years, today’s generation of young people is the largest in human history. As the future leaders and drivers of growth, productivity and innovation, young people are our greatest assets, and investment in their health and wellbeing has social, economic and other benefits that continue across the lifespan and into the next generation.<\/p><p>In this course we will adopt a life-course framework to take a holistic view of youth health and wellbeing. We will explore changing patterns of adolescent health and development, including why adolescence is starting earlier and ending later; how puberty and adolescent brain development may shape future health; and how what happens in adolescence can affect the start to life for the next generation. We’ll also look at the major health and social issues affecting young people and ways of addressing these through policy, practice and programming.&nbsp;<\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<p>This course will cover the following topics:<\/p>\n<p>• Conceptualizations of adolescence and how these have changed over time<\/p>\n<p>• Adolescent development within a life course perspective on health<\/p>\n<p>• Major health issues affecting young people, such as mental health, sexual and reproductive health, injury and accidents, non-communicable diseases and health risk behaviours<\/p>\n<p>• Social determinants of health in adolescence<\/p>\n<p>• Adolescent health policy and programming, including intervention and prevention frameworks, legal and human rights issues, measurement and indicators.<\/p>",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": "This course will be relevant for anyone with an interest in the health and wellbeing of young people. You don't need to be of any particular personal or professional background to benefit from this course, but having some basic undergraduate study experience will be helpful to your learning (particularly if in a health related field).",
    "links": {

    }
}