{"id":2326,"shortName":"chemistry1","name":"Chemistry","language":"en","shortDescription":"This course is designed to cover subjects in advanced high school chemistry courses, correlating to the standard topics as established by the American Chemical Society. This course is a precursor to the Advanced Chemistry Coursera course. Areas that are covered include atomic structure, periodic trends, compounds, reactions and stoichiometry, bonding, and thermochemistry.","aboutTheCourse":"Many students leave high school without being prepared for the rigors of college chemistry. This course is designed to give students the opportunity to review topics at a pace conducive to their level, whether they are encountering the material for the first time or are using the course as a refresher.<br><br>Allison Soult and Kim Woodrum bring their experience to the course covering atomic structure, periodic trends, compounds, reactions, stoichiometry, and thermochemistry. Instruction consists of concepts, calculations, and video demonstrations of the principles being discussed. Practice problems and end of unit assessments will help students gauge their understanding of the material.<br>","targetAudience":3,"courseSyllabus":"This ten-week course covers 7 main topics. <br><br><strong>Atoms and Electronic Structure<\/strong><br>This unit examines the structure of atoms and their electronic structure as it pertains to the properties of the element. <br>&nbsp;<br><strong>Periodic Trends<\/strong><br>This unit explores periodic trends of atomic size, ionization energy, electron affinity and metallic character and discusses how these characteristics affect the reactivity of the element.<br>&nbsp;<br><strong>Compounds<\/strong><br>This unit covers the formation of compounds, including ionic and molecular, as well as nomenclature of compounds.<br>&nbsp;<br><strong>Reactions<\/strong><br>Writing and balancing equations will be covered in this unit including precipitation, oxidation-reduction, titration, and combustion reactions.<br>&nbsp;<br><strong>Stoichiometry<\/strong><br>The concept of stoichiometry, mathematical relationships resulting from the balanced equation, will be introduced and applied in this unit to understand the concepts of actual, theoretical, and percent yields along with the idea of limiting and excess reactants.<br>&nbsp;<br><strong>Bonding<\/strong><br>This unit will explore the bonding in molecular compounds to understand how electrons are shared and how these connections determine the three-dimensional geometry of molecules.<br>&nbsp;<br><strong>Thermochemistry<\/strong><br>This unit will examine the energies associated with physical processes and chemical reactions, including how to relate a specific amount of reagent to the energy evolved or consumed in a reaction.<br>","courseFormat":"The class consists of lecture videos, which are approximately 10 to 15 minutes in length. Practice problems, accompanying videos, and answer sets are included that correspond with each lecture video. Tests are administered at the end of the seven main course topics.<br>","suggestedReadings":"Any college level general chemistry textbook.<br>","estimatedClassWorkload":"10-12 hours\/week","recommendedBackground":"Students should have a background in basic chemistry including properties and phases of matter, familiarity with units, scientific notation, and the ability to solve basic problems with dimensional analysis. <br><br>","links":{}}