{
    "id": 1767,
    "shortName": "globalsrhr",
    "name": "Global Perspectives on Sexual and Reproductive Health and Rights (SRHR)",
    "language": "en",
    "shortDescription": "Questions related to sexuality and reproduction are intimately linked to health, well-being and human rights. In this course, you will gain a unique opportunity to explore the field of SRHR together with participants from around the world, and to reflect upon themes and issues that are of global relevance.",
    "aboutTheCourse": "Sexual and Reproductive Health and Rights (SRHR) are issues of global concern. Sexuality and reproduction are core aspects of human existence, and shape the lives of people in all parts of the world. As conditions change, for example through globalization and socio-economic development, new challenges and opportunities emerge.<br><br>In this course, we will introduce you to some of the main themes in SRHR today – Global Policies in Sexual and Reproductive Health and Rights, Youth Sexual Health, Maternal and Reproductive Health, Contraception and Fertility, Sexually Transmitted Infections (STIs) and HIV\/AIDS, Violence and Coercion in Sexual and Reproductive Contexts, Human Rights and Sexual Identity. We will examine both underlying issues and questions that are relevant throughout the world, as well as challenges that occur in specific settings.<br>You will meet our international team of faculty members and experts, who will highlight the dynamics and challenges inherent in these themes by examining them within the context of current global policy issues, such as sustainability, gender equality, social justice, democracy\/participation, and the human rights perspective. You will also get a unique opportunity to explore and discuss the course themes with fellow participants from around the world.<br><br>Selected lectures and seminars will be given by our international team of faculty members, who have worked with and lectured on SRHR issues within a broad range of contexts. The course is led by Associate Professors Anette Agardh and Jerker Liljestrand from the Faculty of Medicine at Lund University, Sweden. <br><br>",
    "targetAudience": 0,
    "courseSyllabus": "<p>\n\n\n\n\n\n\n\n\n\n\n\n\nThe course will start with an introductory session that presents an overview of the main themes and provides some definitions concerning&nbsp; the terminology used in the course. The subsequent weekly topics will cover Global Policies in the field of Sexual and Reproductive Health and Rights,Youth Sexuality and Health, Sexual Identity, Violence, Coercion and Human Rights in the context of Sexual and Reproductive Health, Maternal Health, Contraception, and Sexually Transmitted Infections (STIs) and HIV\/AIDS. <br><\/p><br>",
    "estimatedClassWorkload": "3-5 hours\/week",
    "recommendedBackground": "<p>No specific\nbackground is required. We welcome anyone with an interest in SRHR, including\nhealth care professionals, students in related academic fields, policy makers\nand other stakeholders working with SRHR issues. The course does not address or concern the medical aspects of diseases or conditions, and no knowledge of medical\nterminology is needed.<\/p>\n\n<p>The course is an introduction to SRHR and the main lectures and reading will reflect this. If you already have experience of\nthe field and want to learn more, there will be extra reading and assignments\n(and discussion topics) to keep you challenged.<\/p>",
    "links": {

    }
}