{
    "id": 1432,
    "shortName": "audio",
    "name": "Audio Signal Processing for Music Applications",
    "language": "en",
    "shortDescription": "In this course you will learn about audio signal processing methodologies that are specific for music and of use in real applications. You will learn to analyse, synthesize and transform sounds using the Python programming language.",
    "aboutTheCourse": "Audio signal processing is an engineering field that focuses on the computational methods for intentionally altering sounds, methods that are used in many musical applications.<div>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p><p>We have put together a course that can be of\ninterest and accessible to people coming from diverse backgrounds while going\ndeep into several signal processing topics. We focus on a number of spectral processing\ntechniques of relevance for the description and transformation of sounds, developing the basic theoretical and practical knowledge with which to analyze,\nsynthesize, transform and describe audio signals in the context of music\napplications. <\/p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p><p>The course is based on open software and content. The\ndemonstrations and programming exercises are done using Python under Ubuntu,\nand the references and materials for the course come from open online\nrepositories. We are also distributing with open licenses&nbsp;the software and\nmaterials developed for the course.<\/p>\n\n<\/div>",
    "targetAudience": 1,
    "courseSyllabus": "<span>Week 1: Introduction; basic mathematics&nbsp;<br>Week 2: Discrete Fourier transform<br><\/span>Week 3:&nbsp;<span>Fourier transform properties<br><\/span>Week 4:&nbsp;<span>Short-time Fourier transform<br><\/span>Week 5:&nbsp;<span>Sinusoidal model<br><\/span>Week 6:&nbsp;<span>Harmonic model<br><\/span>Week 7:&nbsp;<span>Sinusoidal plus residual modeling<br><\/span>Week 8:&nbsp;<span>Sound transformations<br><\/span>Week 9:&nbsp;<span>Sound\/music description<br><\/span>Week 10:&nbsp;<span>Concluding topics; beyond audio signal processing<br><\/span>",
    "estimatedClassWorkload": "8-10 hours\/week",
    "recommendedBackground": "The course assumes some basic background in mathematics and signal processing. Also, since the assignments are done with the programming language Python, some software programming skills in any language are most helpful.&nbsp;",
    "links": {

    }
}