{
    "id": 210,
    "shortName": "precalculus",
    "name": "Pre-Calculus",
    "language": "en",
    "shortDescription": "This course covers mathematical topics in algebra and trigonometry and is designed to  prepare students to enroll for a first semester course in single variable calculus.",
    "aboutTheCourse": "Through this course, students will acquire a solid foundation \nin algebra and trigonometry. The course concentrates on the various \nfunctions that are important to the study of the calculus. Emphasis is \nplaced on understanding the properties of linear, polynomial, piecewise, \nexponential, logarithmic and trigonometric functions. Students will \nlearn to work with various types of functions in symbolic, graphical, \nnumerical and verbal form.<br><br><br>THE SIGNATURE TRACK OPTION\n<p>Signature Track is an optional path you may choose for this course. \nBy signing up and paying a nominal fee (financial aid can be provided), \nyou can add a higher level of identity verification to your Coursera \ncoursework. If you achieve the threshold score,\n    you have the opportunity to earn a Verified Certificate. For each assignment, your identity is \nconfirmed through your photo and unique typing pattern. If you earn a \nVerified Certificate, you will also be given a\n    personal URL through which your course records can be shared with \nemployers and educational institutions.<\/p><p>Click <a href=\"https:\/\/www.coursera.org\/signature\/guidebook\" target=\"_blank\">here<\/a> for more information on the Signature Track option.<br><\/p><p>LICENSE<\/p><p>The course videos are licensed Creative Commons Attribution-Sharealike-NonCommercial 3.0. The&nbsp;<a href=\"http:\/\/ocw.uci.edu\/courses\/math_1a1b_precalculus.html\" target=\"_blank\">course videos<\/a>&nbsp;can be found at UC Irvine's&nbsp;<a href=\"http:\/\/ocw.uci.edu\/\" target=\"_blank\">OpenCourseWare&nbsp;<\/a>site.<br><\/p>",
    "targetAudience": 0,
    "courseSyllabus": "This course will be taught over ten weeks, with materials released on a weekly basis. Below you will find the weekly topic schedule.&nbsp;<br><br><i>Week One<\/i>: Algebra Review. Linear Equations. Linear Inequalities. Absolute Value in Equations and Inequalities.<br><i>Week Two<\/i>: Quadratic Equations. Absolute Values. Rational and Radical Equations.<br><i>Week Three<\/i>: Functions. Transformations of Graphs. <br><i>Week Four<\/i>: Inverse Functions. Polynomials.<br><i>Week Five<\/i>: Exponential and Logarithmic Equations. <br><i>Week Six<\/i>: Angles and their Measure. Trigonometric Functions. Unit Circle. Solving Right Triangles.<br><i>Week Seven<\/i>: Properties of Trigonometric Functions. Inverse Trigonometric Functions. <br><i>Week Eight<\/i>: Trigonometric Identities: Sum, Difference, Double-Angle and Half-Angle Identities.<br><i>Week Nine<\/i>: Trigonometric Equations. Law of Sines. Law of Cosines<br><i>Week Ten<\/i>:&nbsp; Review and Final Exam.<br>",
    "estimatedClassWorkload": "10-12 hours\/week",
    "recommendedBackground": "High school algebra I &amp; II&nbsp;and basic geometry are prerequisites for this course.<br>",
    "links": {

    }
}