{
    "id": 1315,
    "shortName": "behavioralgenetics",
    "name": "Introduction to Human Behavioral Genetics",
    "language": "en",
    "shortDescription": "Behavioral genetic methodologies from twin and adoption studies through DNA analysis will be described and applied to address longstanding questions about the origins of individual differences in behavioral traits.",
    "aboutTheCourse": "<p>One of psychology’s defining issues\nconcerns the origins of individual differences in behavior: Why are some people\noutgoing and cheerful while others are withdrawn and forlorn? Why do some struggle\nacademically while others excel at school despite minimal study? Why do some\nsuffer the ravages of a psychotic illness like schizophrenia while others enjoy\na life free of mental illness? At the core to answering these questions is the\nages-old \"nature-nurture\" debate: Are the behavioral differences\namong us due predominantly to inborn natural differences or the cumulative\nimpact of our experiences? The nature-nurture debate generated much controversy\nand acrimony within psychology, although today most are willing to retire the\ndebate and declare both sides victorious.<\/p>\n\n<p>This course provides an introduction\nto behavioral genetics, the field within psychology that demonstrated that\nNature and Nurture both play a fundamental role in the development of\npsychological traits. We will explore how early behavioral genetic research\nradically changed how psychologists conceptualized human behavior and how the\nmapping of the human genome is fundamentally altering current research\napproaches to a wide range of behavioral characteristics. The course will cover\nthe traditional behavioral genetic methodologies of twin and adoption studies\nas well as modern approaches based on molecular genetic techniques.<\/p>\n\n<p>Upon completion of the course,\nstudents should have a basic understanding of<\/p>\n\n<ul><li>how behavioral genetic research has changed\n     psychology’s view of human behavior; <\/li><li>the strengths and limitations of traditional behavioral\n     genetic methodologies such as twin and adoption studies; <\/li><li>the behavioral genetic approach to psychiatric\n     phenotypes (to be illustrated by schizophrenia) and psychological\n     phenotypes (to be illustrated by intelligence); and <\/li><li>the structure and function of the human genome and the\n     prospects for identifying the specific genetic variants underlying\n     individual differences in behavior. <\/li><\/ul>\n\n<p><b>What\nis New in Session 2?<\/b><\/p>\n\n<p>This course was first offered in 2014. The major\nchanges in this second offering of the course include<\/p>\n\n<ul><li>Students\nhave the option of obtaining a Statement of Accomplishment with Distinction<\/li><li>Eight of\nthe lecture modules have been re-recorded. Usually this was to allow us to\nincorporate recent research findings into the lecture; in a few cases the\nlectures were somewhat restructured. The re-recorded lectures are identified in\nthe weekly welcome message.<\/li><li>There are\neight new supplementary lectures, one for each weekly unit. These supplementary\nlectures allow us to cover more advanced topics (e.g., epigenetic inheritance,\nrace, ancestry and genetics, genetic prediction.) The supplementary lectures\nare not covered in the weekly quizzes and so are not required for students\nseeking the typical Statement of Accomplishment. The supplementary lectures are,\nhowever, required for those seeking to obtain a Statement of Accomplishment\nwith Distinction.<br><\/li><\/ul>",
    "targetAudience": 1,
    "courseSyllabus": "<p><b>Unit #1: Introduction and Overview<\/b> <\/p>\n\n<p><i>Topics covered:<\/i><\/p>\n\n<p><span>The nature-nurture debate and the\nfounding of behavioral genetics; the eugenics movement; what is behavioral\ngenetics?; the \"John\/Joan\" case: when the blank slate model failed;\nPhenylketonuria: every geneticist’s favorite disorder. &nbsp;<i>Supplemental<\/i>: Huntington disease.&nbsp; <br><\/span><\/p>\n\n<p><b>Unit #2: How Twins Saved Psychology<\/b> <\/p>\n\n<p><i>Topics covered:<\/i><\/p>\n\n<p><span>Twins: a natural experiment;\nassessing twin similarity; what twin studies have revealed about the origins of\nbehavior; are twin studies of behavior really valid?; adoption studies: not by\ntwins alone; Minnesota Study of Twins Reared Apart (MISTRA). <i>Supplemental<\/i>: Interview with Thomas J.\nBouchard, Jr.<\/span><\/p>\n\n<p><b>Unit #3: Heritability, a Much\nMaligned and Misunderstood Concept<\/b> <\/p>\n\n<p><i>Topics covered:<\/i><\/p>\n\n<p><span>Mendelian inheritance (and\nterminology); Galtonian inheritance (aka quantitative genetics); how\nheritability is estimated; what heritability is and what it is not;\ngene-environment interaction. <i>Supplemental<\/i>:\nMultivariate biometric approaches.<\/span><\/p>\n\n<p><b>Unit #4: What Everyone Should Know\nAbout the Human Genome<\/b> <\/p>\n\n<p><i>Topics covered:<\/i><\/p>\n\n<p><span>DNA; what is a gene?; three\nsurprising findings from the human genome project; the nature of genetic\nvariation; Williams syndrome; the X chromosome; Prader-Willi &amp; Angelman\nsyndromes; genetic regulation and epigenetics. <i>Supplemental<\/i>: Epigenetic inheritance.<\/span><\/p>\n\n<p><b>Unit #5: Schizophrenia: &nbsp;The\nGenetic Approach to a Psychiatric Phenotype<\/b>\n<\/p>\n\n<p><i>Topics covered:<\/i><\/p>\n\n<p><span>What is schizophrenia?; the\nepidemiology of schizophrenia; twin and adoption studies – establishing a heritable\nbasis; what we have learned about environmental risk from twin and adoption\nstudies; identifying schizophrenia risk alleles - limits of the positional\ncloning strategy, what we have learned through GWAS, and the role of rare\nvariants. <i>Supplemental<\/i>: Genetics,\nrace &amp; ancestry<\/span><\/p>\n\n<p><b>Unit #6: Behavioral Genetic\nApproaches to the Study of Intelligence\/General Cognitive Ability<\/b> <\/p>\n\n<p><i>Topics covered:<\/i><\/p>\n\n<p><span>What is intelligence?; twin and\nadoption studies – establishing a genetic basis; heritability and the\nmalleability of general cognitive ability; gene-environment interplay in\nstudies of general cognitive ability; why is general cognitive ability\nheritable?; genetics of intellectual disability. <i>Supplemental<\/i>: The replication crisis.<\/span><\/p>\n\n<p><b>Unit #7: Genes, Environment, and\nDevelopment<\/b> <\/p>\n\n<p><i>Topics covered:<\/i><\/p>\n\n<p><span>Shared versus non-shared environment\ndistinction; the moderating effect of development; gene-environment\ncorrelation; family socialization: a behavioral genetic perspective;\ngene-environment interaction I; gene-environment interaction II; genetics and\naging.&nbsp;<i>Supplemental<\/i>: Epigenetics\nand twins.<\/span><\/p>\n\n<p><b>Unit #8: Pulling It All Together:\nSummary, Public Policy, and Prospects<\/b> <\/p>\n\n<p><i>Topics covered:<\/i><\/p>\n\n<p><span>The four laws of behavioral\ngenetics; behavior and genomic medicine; behavioral genetics, the law and\npersonal responsibility part I; behavioral genetics, the law and personal\nresponsibility part II; interview with Irv Gottesman. <i>Supplemental<\/i>: Genetic prediction.<\/span><\/p>",
    "estimatedClassWorkload": "3-5 hours\/week",
    "recommendedBackground": "<p>The course is intended to provide an\nintroduction to the field of behavioral genetics, so minimal background will be\nassumed.&nbsp; While students are expected to have an interest in psychology,\nno prior study of psychology is needed. In terms of background in genetics,\nhigh school genetics as well as a basic understanding of some standard genetic\nterminology (e.g., phenotype, Mendelian inheritance, chromosomes) is expected.\nAn introductory understanding of statistical concepts including correlation,\nregression, analysis of variance, and statistical significance will be assumed,\nalthough the instructor will briefly review most statistical topics the first\ntime they are used in the course.<\/p>\n\n<p>The course is designed for students\nwho are open-minded, analytical, and willing to confront some of the great\ncontroversies that have helped shape psychology. Target audiences include\neducational professionals interested in incorporating an up-to-date segment on\nbehavioral genetic models and findings into their courses on human behavior;\nstudents from the social and biological sciences interested in genetic\ncontributions to behavior but who do not otherwise have access to a behavioral\ngenetics course at their home institutions; and individuals just interested in\nexploring questions that have perplexed scholars for millennia.<\/p>",
    "links": {

    }
}