{"id":465,"shortName":"volcano","name":"Volcanic Eruptions: a material science.","language":"en","shortDescription":"Volcanic eruptions are a powerful demonstration of the energy of the Earth´s interior. A materials-based understanding of the evolution of erupting systems provides a quantitative physico-chemical description of the nature of lava and magma and the role of experiments in quantifying the eruptive process. ","aboutTheCourse":"<p>Geoscientists define\na “living planet” as one with active volcanism. By this definition our Earth is\nvery much alive, with many eruptions each year and with a far greater number of\n“active volcanoes” that can potentially erupt in any given year.&nbsp;<\/p><p>In detail, each eruption is\ndifferent. Every volcano is its own physical and chemical system, occurs in its\nown geological location, is subjected to its local stress field, and is at its\nown stage in evolution in geological time.&nbsp;\nExternal triggers of volcanic eruptions are also believed to play an\nimportant role.<\/p><p>Yet powerful generalisations\nand models of volcanic eruptions are indeed possible and in fact very useful in\ndealing with the consequences of volcanic eruptions.<\/p>\n\n<p>How are such models\nconstructed? They must rest on a basis of a mechanistic understanding of what\nvolcanoes are, and what they are doing – not just during eruptions but also in\nthe events leading up to eruptions, and not just at the Earth´s surface but\nalso at depth, where the magma is being prepared for the next eruption.<\/p><p>In addition to\nfield observations of past eruptions, monitoring of signals from magmatic\nsystems, and computer-based simulation of volcanic eruptions, increasingly,\nhigh pressure and high temperature experiments are employed in order to answer\nthe question of how volcanic systems work.<\/p>\n\n<p>These controlled laboratory conditions\nfor experimental volcanology are transforming the study of volcanoes from a\nchiefly observational discipline where eruptive mechanisms were developed via\ntheoretical analysis of such observations, into a fully modern scientific\ndiscipline where such theoretical approaches are either verified or rejected,\nby the experimental picture of what is possible and what is not.<\/p><p>This course shows you how such experimental insight is&nbsp;obtained and what it tells us about erupting volcanoes.<br><\/p>","targetAudience":1,"courseSyllabus":"<div><strong>Week 1:<\/strong> The Earth as a living planet: The five big extinctions during Phanerozoic times; Volcanic fatalities; Volcanism in the Solar system; Volcanism on Earth; The essence of volcanism;<br><br><\/div><div><strong>Week 2:<\/strong> The Earth as a living planet: Volcanoes on Earth: magnitudes and landforms; Explosive and effusive volcanism; Videos of Merapi and Etna volcanoes; Volcanic materials; mineralogy and fragment classification; Chemical and mineralogical classification;&nbsp;<br><br><\/div><div><strong>Week 3:<\/strong> Structure of molten silicates: Chemical composition; Stability and geological properties (an overview on viscosity\/viscoelasticity; density, expansivity\/compressibility; Volatiles solubilities, diffusivities, heat capacity, redox equilibria);&nbsp;<br><br><\/div><div><strong>Week 4:<\/strong> Dynamics of molten silicates: Glass and molten silicates; Molar heat, Enthalpy: Strain vs. time; Cooling vs. heating paths; Maxwell relations for viscoelasticity; Resistivity and viscosity; Relaxation times and implications for experiments;<br>&nbsp;<\/div><div><strong>Week 5:<\/strong> Relaxation in silicate melts: Longitudinal vs. shear viscosity; Glass transition; Quench rate, relaxation time and viscosity; The role of water content, water speciation, pressure and temperature; Details of water speciation from experimental data;<br><br><\/div><div><strong>Week 6:<\/strong> Diffusion in silicate melts: water content and water speciation &nbsp;(cont.); Diffusion in contrasting silicate melts; The role of temperature; Comparing diffusion of different elements; The role of pressure; Simplified Stokes-Einstein and Eyring equations; Relaxation times &nbsp;(comparison between different compositions at different temperatures);<br><br><\/div><div><strong>Week 7:<\/strong> Expansivity and compressibility in silicate melts: Partial molar volumes; Density: equation of state for liquid silicates; Density determinations and calculations above and below glass transition; Density models for anhydrous granitic system;<br><br><\/div><div><strong>Week 8:<\/strong> Viscosity of silicate melts: Calibration of reaction kinetics for speciation (e.g. H2O); Prediction of glass transition: temperature, thermodynamic and kinetic; Methods of viscosity measurements; Arrhenian and non-Arrhenian plots; Viscosity-temperature relationships; Peraluminous and metaluminous (calcalkaline) melts; Adam Gibbs model: entropy of mixing; Multicomponent models with water and fluorine;<br><br><\/div><div><strong>Week 9:<\/strong> Fragmentation of magmas: The role of crystals and bubbles; Bubble growth; Structural relaxation; Non-Newtonian effects; Viscous heating; Flow or blow: the volcanic dilemma; Fragmentation velocities; Experimental Volcanology at the LMU; Videos from the labs and scientific staff;<br><br><\/div><div><strong>Week 10:<\/strong> Volcanic hazards: how to get information from volcanological maps; Impact and relevance; Volcanoes and Mankind; Hazards mitigation; Examples from the Vesuvius case; Video from Vesuvius with animations;<\/div>","courseFormat":"","suggestedReadings":"Although the lectures are designed to be self-contained, we recommend (but do not require) that students refer to the suggested reading at the end of the chapters.<br><br>","instructor":"Donald Bruce Dingwell","estimatedClassWorkload":"1-2 hours\/week","recommendedBackground":"Basic mathematics, physics and chemistry.&nbsp;","links":{}}