{"id":167,"shortName":"womencivilrights","name":"Women and the Civil Rights Movement","language":"en","shortDescription":"Learn about women’s roles in the U.S. civil rights struggles of the 1890s to the 1990s. ","aboutTheCourse":"This\ncourse examines the U.S. civil rights movement from the vantage point of women,\nconsidering both women’s involvement in the legal campaigns and political\nprotests and the impact of civil rights struggles on women’s status and\nidentity.&nbsp; Taking a “long civil rights\nmovement” perspective, we begin in the late nineteenth century and consider\nevents, organizations, and personalities through the twentieth century. <br><br>Throughout\nwe will consider issues which have preoccupied historians, social movement\ntheorists, and historians alike:&nbsp;\ndeveloping and sustaining political commitment, assessing the strengths\nand weaknesses of various forms of political organization, maximizing influence\nand securing long-range objectives.&nbsp; We\nwill also examine competing definitions of leadership; class, race, and gender\ndynamics within the movement; and the cultural dynamics of political organizing\nand social change.&nbsp; <br><br>In the process, we\nconsider not only how the movement altered the status of African Americans in\nthe U.S. but the legacy of these struggles as they changed understandings of\ncitizenship and rights more broadly. &nbsp;&nbsp;Our concern throughout the course will be to\nnot only understand the historical narrative but also to see how historians\nwork to make sense of the past.<br>","targetAudience":1,"courseSyllabus":"","courseFormat":"Each\nweek I will offer a series of video discussions, including an analytical\noverview of the week’s topics and themes and shorter case studies of specific\nactivists, organizations, events.&nbsp; I will\nalso offer video discussions of the major readings.&nbsp; There will be weekly quizzes and throughout\nthe course students will be asked to write short essays offering insights into\nthe reading.&nbsp; After a student has\nsubmitted an essay, the student will be given access to the essays written by\nseveral fellow students and be asked to read and comment on those.&nbsp; The course will include an optional online\nforum where students may raise questions about the historical material and\nengage the contemporary implications of our discussions of citizenship, rights,\nand political organizing.&nbsp; The forum will\nbe monitored and in some cases I will reply in the forum or post a\nsupplementary video clip for the class based on issues raised in the forum.<br>","suggestedReadings":"The\ncourse includes significant reading of primary historical documents of the\ncivil rights movement and historians’ analyses.<br>","instructor":"Dr. Elsa Barkley Brown ","estimatedClassWorkload":"8-10 hours\/week","recommendedBackground":"There\nis no prerequisite but the course will be conducted at the level expected of\nadvanced undergraduates.&nbsp; <br>","links":{}}