{"id":244,"shortName":"lyingcamera","name":"The Camera Never Lies","language":"en","shortDescription":"Film, images & historical interpretation in the 20th century for those who have a general interest in history that draws on photojournalism as primary evidence, and films based on historical events.","aboutTheCourse":"<p>This short history course is an introduction to use of\nimages and other media as historical evidence in the twentieth century, issues\nof authenticity and manipulation, and the place of film and historical\nadoptions as public history.<\/p>\n\n<br><br><br><br>","targetAudience":0,"courseSyllabus":"Week 1: The Camera Never Lies - Introduction\n<br>Week 2: Images and History in the Twentieth Century\n<br>Week 3: The Air-Brushing of History: Stalin and Falsification\n<br>Week 4: Photojournalism, Authenticity and Matters of Public Acceptability\n- The Battle of Mogadishu\n<br>Week 5: The Power of the Image - Mount Suribachi, 1945\n<br>Week 6: From Page to Screen - Film as Public History\n<br>\n<br>","courseFormat":"<p>The course will cover the following subjects: <\/p>\n\n<p>Images and History in the Twentieth Century<br>Jacobson, C. (ed.) <em>Underexposed: Pictures of the 20th Century They\nDidn't Want You to See<\/em>. 2002\n\n<\/p><p>The Air-Brushing of History: Stalin and Falsification\u2028<br>King, D. <em>The Commissar Vanishes: The Falsification of Photographs and\nArt in Stalin’s Russia<\/em>. 1997.\n\n<\/p><p>Photojournalism, Authenticity and Matters of Public Acceptability: The\nBattle of Mogadishu<br>Bowden, M. <em>Black Hawk Down<\/em>. 1999.<br>Scott, R. (dir). <em>Black Hawk Down<\/em>. 2001.<\/p>\n\n<p>The Power of the Image: Mount Suribachi, 1945<br>Bradley, James and Ron Powers. <em>Flags Of Our Fathers<\/em> . 2006.<br>Kakehashi, Kumiko. <em>Letters From Iwo Jima<\/em>. 2007.<\/p>\n\n<p>From Page to Screen: Film as Public History\u2028<br>Eastwood, C. (dir). <em>Flags Of Our Fathers<\/em>. 2006; and <em>Letters From Iwo Jima<\/em>.\n2006.<span><br><br>\nUnfortunately, the Jacobson and King have been out of print for a little while\nnow; but we will try to introduce you to as much of the material as we can\nduring the course.<\/span><span><br>\n<\/span><\/p>\n\n<p>Course materials will be written up in the form of an introductory talk,\nfollowed by reflective tasks, video clips, and internet links to augment the\nseminar materials.<\/p>\n\n<p><\/p>\n<p><\/p><br>","suggestedReadings":"To give a background perspective to the course, participants may wish to\nconsult:<br>Marien, M. W. Photography: A Cultural History, 4th Edn.&nbsp; 2014.<span><br>(The earlier editions – from 2002, 2006 and 20010 – can also be used.)<\/span><br>","instructor":"Emmett Sullivan of Royal Holloway, University of London","estimatedClassWorkload":"5-10 hours\/week","recommendedBackground":"No prior knowledge or study of history is required.  Royal Holloway has a speciality in public history, including a dedicated MA in the\nsubject.  Students are encouraged to explore the relationship between\nscholarly history and representations of historical events in the media,\nand this course follow this ethos.","links":{}}