{
    "id": 2429,
    "shortName": "compol",
    "name": "Сравнительная политика (Comparative Politics)",
    "language": "ru",
    "shortDescription": "Курс дает студентам двойную выгоду. Они учатся ЧТО и КАК сравнивать. Они изучают важнейшие институты, режимы и практики. Они осваивают целый ряд способов анализа от всеохватных до казусно ориентированных сравнений.\n\n\n",
    "aboutTheCourse": "<p>Студенты осваивают надежные методы и\nдостоверные научные технологии сравнения на основе тренировочных сравнений\nразнообразных государств и демократий мира. Они учатся сравнивать различные\nвиды власти и способы ее распределения в современных политиях или фактическое\nразделение властей.<br><\/p>\n\nСтуденты сравнивают\nразличные способы представительства людей или корпуса граждан – осуществляется\nли оно главами государств или законодателями. Студенты изучают, как выборы и\nпартии могут помочь или помешать демократическому представительству в различных\nслучаях. Наконец они учатся сравнивать «ускользающие» предметы изучения,\nнапример, преобразования, кризисы и конфликты различных видов.<br><br>Students master sound methods and reliable scientific techniques of comparison by actually doing trial comparisons of varieties of states and democracies of the world. They learn to compare different kinds of power and ways of its distributions in modern polities or actual separation of powers. &nbsp;Students compare different ways to represent people or rather citizen corps – be it done by heads of states or legislators. They also learn how elections and parties may help or hinder democratic representation in different case. Finally, they learn to compare “elusive” objects like reforms, crises, or conflicts of various types.<br>",
    "targetAudience": 0,
    "courseSyllabus": "<p><strong>Неделя 1.<\/strong><\/p><p><\/p><ul><li>Как возможно\nсравнение? Что такое сравнительная политика?<br><\/li><li>Государства:\nодно, многие, какие?<\/li><\/ul><p><\/p>\n\n<p><strong>Неделя 2.<\/strong><\/p>\n\n<p><\/p><ul><li>Как поделить и\nобъединить власть? Современные способы распределения власти (разделения\nвласти).<br><\/li><\/ul><p><\/p>\n\n<p><strong>&nbsp;Неделя 3.<\/strong><\/p><p><\/p><ul><li>Демократия: одна,\nмногие, какие?<\/li><\/ul>\n\n<p><strong>Неделя 4.<\/strong><\/p><p><\/p><ul><li>Институты, режимы\nи практики.<br><\/li><li>Представительство\nи легислатуры.<\/li><\/ul>\n\n<p><strong>Неделя 5.<\/strong><\/p><p><\/p><ul><li>Представительство:\nглавы государств.<br><\/li><li>Выборы: кого,\nзачем и как выбирают.<\/li><\/ul>\n\n<p><strong>Неделя 6.<\/strong><\/p><p><\/p><ul><li>Кризисы и\nизменения, революции и реформы.<\/li><\/ul>\n\n<p><strong>Неделя 7.<\/strong><br><\/p><p><\/p><ul><li>&nbsp;Между войной и\nмиром: конфликты между гражданами.&nbsp;<\/li><\/ul>\n\n<p><strong>Неделя 8.<\/strong><\/p><p><\/p><ul><li>Между войной и\nмиром: конфликты между государствами.<\/li><\/ul>\n\n<p><strong>Неделя 9.<\/strong><\/p><p><ul><li>Мировая политическая\nдинамика.<br><\/li><\/ul><\/p>",
    "estimatedClassWorkload": "5-7 hours\/week",
    "recommendedBackground": "Курс\nрассчитан на слушателей, имеющих базовые представления о сфере политики и\nзнакомых с набором основных понятий и концепций политической науки.",
    "links": {

    }
}