{
    "id": 1524,
    "shortName": "cataractsurgery",
    "name": "Introduction to Cataract Surgery",
    "language": "en",
    "shortDescription": "This comprehensive course will give you the fundamental knowledge needed to begin performing cataract surgery by phacoemulsification and extracapsular removal.  Each step from preoperative evaluation to postoperative care will be covered to help prepare you for the operating room.  ",
    "aboutTheCourse": "Cataracts remain the leading cause of visual impairment and blindness worldwide. &nbsp;The development of this course was an effort to make learning to perform cataract surgery more accessible to trainees in the US and worldwide. &nbsp;The course teaches the fundamentals required to perform successful phacoemulsification and extracapsular cataract surgery. Expert cataract surgeons will lecture on each step of cataract surgery from preoperative assessment to postoperative care. Lectures will explain the “how-to,” pitfalls, and successful execution of each part of cataract surgery. &nbsp;Surgical video is included to demonstrate optimal performance of various steps. &nbsp;More advanced topics such as small pupil, astigmatism, and capsular complications are also reviewed. &nbsp;Since most cataract surgeries are done with the patient awake, it is imperative that the surgeon gains as much knowledge as possible prior to entering the operating room.<br><br>Course Objectives:&nbsp;<p><span>\n1.\nDescribe proper technique for performing cataract surgery, from wound\nconstruction to wound closure<br>\n2.\nEvaluate a patient with cataracts in preparation for surgery and determine the\nappropriate anesthetic to use<br>\n3.\nKnow how to identify potentially difficult cataracts and list appropriate\nstrategies for complicated cataract surgery<br>\n4.\nUnderstand intraocular lens calculations, forumlas, and selection<\/span><\/p><br>",
    "targetAudience": 3,
    "courseSyllabus": "<span><p dir=\"ltr\">The course syllabus is available <a href=\"https:\/\/docs.google.com\/document\/d\/1cIqmu0Zs7m_ER4vFLeEKm6XBgrk58pyYepAGCXMAfSs\/pub\" target=\"_blank\">here<\/a>.<\/p><p dir=\"ltr\"><strong>Course Outline:<\/strong><\/p><p dir=\"ltr\">Week 1: Prior to the Operating Room<br><\/p><p dir=\"ltr\">Week 2: In the Operating Room and Getting to the Cataract<\/p><p dir=\"ltr\">Week 3: Removing the Cataract and Lens Replacement<\/p><p dir=\"ltr\">Week 4: Cataract Complications and Extras<\/p><p dir=\"ltr\"><br><\/p><\/span>",
    "estimatedClassWorkload": "1-3 hours\/week",
    "recommendedBackground": "<span><p dir=\"ltr\"><\/p><ul><li>Enrollment in or completion of an Ophthalmology training program<br><\/li><li>Understanding of the anatomy of the eye and orbit<br><\/li><li>Interest in learning about cataract surgery<\/li><\/ul><p><\/p><\/span>",
    "links": {

    }
}