{"id":2295,"shortName":"cloudnetworking","name":"Cloud Networking","language":"en","shortDescription":"The network is what makes the cloud. The cloud’s key capabilities—the ability to share infrastructure, the ability to move and scale applications across servers, massive parallelism, virtualization, and worldwide connectivity—are all rooted in the network. Learn how it all works!","aboutTheCourse":"<p>In the cloud networking course, we will see what the network needs to do to enable cloud computing. We will explore current practice by <strong>talking to leading industry experts<\/strong>, as well as looking into <strong>interesting new research<\/strong> that might shape the cloud network’s future.<\/p>\n\n<p>This course will allow us to explore <strong>in-depth the challenges for cloud networking<\/strong>—how do we build a network infrastructure that provides the agility to deploy virtual networks on a shared infrastructure, that enables both efficient transfer of big data and low latency communication, and that enables applications to be federated across countries and continents? Examining how these objectives are met will set the stage for the rest of the course. <\/p>\n\n<p>This course places an emphasis on both <strong>operations and design rationale<\/strong>—i.e., how things work and why they were designed this way. We're excited to start the course with you and take a look inside what has become the <strong>critical communications infrastructure<\/strong> for many applications today.<\/p>","targetAudience":1,"courseSyllabus":"<p>This course will be covering the following topics:<\/p>\n<ul> \n<li>Physical data center network topology and fault-tolerance<\/li>\n<li>Network virtualization<\/li>\n<li>Software defined networking<\/li>\n<li>Congestion control and traffic engineering&nbsp;<\/li><li>Inter-data center networks<\/li>\n<\/ul>","courseFormat":"The course will have video lectures, accompanied by handouts and short exercises.","suggestedReadings":"","estimatedClassWorkload":"6-8 hours\/week","recommendedBackground":"<p>Undergraduate-level networking know-how (for instance, how shortest path routing works, how TCP works, etc.) is recommended.<br><\/p>","links":{}}