{
    "id": 1409,
    "shortName": "dentmedpenn",
    "name": "Introduction to Dental Medicine",
    "language": "en",
    "shortDescription": "The mouth is the window into human health.  This course provides an overview of dental medicine to engage, educate, excite and assist you in improving the oral health of your patients and members of your community.",
    "aboutTheCourse": "In this course, you will learn basic dental anatomy, how to evaluate a patient and the causes and impact of oral diseases. &nbsp;We will use case examples and live demonstrations with patients.<br><br>The course will focus on four areas:<br><ol><li>Review of modern aspects of dental medicine<\/li><li>Introduction of basic oral and dental anatomy and techniques of clinical examination of the oral and per-oral structures<\/li><li>Discussion of common disease processes affecting the oral cavity and peri-oral structures including a) dental and periodontal diseases, b) oral mucosal diseases, c) orofacial pain conditions<\/li><li>Demonstration of clinical cases,&nbsp;ranging from basic to complex, reflective of the common\ndisease processes affecting the oral cavity and perioral structures<p><\/p><\/li><\/ol>",
    "targetAudience": 3,
    "courseSyllabus": "<strong>WEEK ONE:<\/strong> Introduction to dental medicine including oral health related to general health, sources of infection, modern technology in dentistry and public health impact.<br><br><strong>WEEK TWO: <\/strong>Basic dental anatomy including embryology of the oral cavity, oral functions, basic tooth structure and clinical implications of disease.<br><br><strong>WEEK THREE:<\/strong> Comprehensive evaluation of the patient including medical history, with live demonstrations with patients.<br><br><strong>WEEK FOUR:<\/strong> &nbsp;Dental and periodontal disease - their causes and contributing factors.<br><br><strong>WEEK FIVE:<\/strong> &nbsp;Oral and mucosal disease focusing on anomalies, ulcers, cancer and other diseases.<br><br><strong>WEEK SIX:<\/strong> &nbsp;Oral and facial pain from common conditions to rare ones including an exploration of psychological aspects of oral and facial pain.<br><br><strong>WEEK SEVEN: <\/strong>&nbsp;Selected cases in dental medicine ranging from oral surgery to prosthetic reconstruction.",
    "estimatedClassWorkload": "1-2 hours\/week",
    "recommendedBackground": "",
    "links": {

    }
}