{
    "id": 1147,
    "shortName": "microeconomic",
    "name": "Основы микроэкономики (Microeconomics Principles)",
    "language": "ru",
    "shortDescription": "Самое сложное экономическое событие сводится, в конечном счёте, к действиям отдельных людей и фирм. Микроэкономика показывает, как можно эти действия анализировать – как люди выбирают, что потреблять, а фирмы – что производить.\nMicroeconomic theory tells how people decide what to consume, and firms – what to produce and how to win over their competitors in the market.\n",
    "aboutTheCourse": "<p>В базовом\nкурсе микроэкономики рассказывается об основных инструментах экономического\nанализа, которые позволяют изучать наиболее важные закономерности в поведении\nлюдей и фирм. У людей есть предпочтения относительно товаров и бюджетные\nограничения, у фирм – производственные возможности и спрос на их продукцию со\nстороны людей. В результате взаимодействия людей и фирм складываются рынки,\nна которых определяется цена – важнейший канал передачи информации.<\/p><p>Чтобы информации было больше, существуют рынки, на\nкоторых продаются и покупаются товары и услуги. Потребитель никогда не купит\nнужный ему товар, если не узнает, где и как его можно купить. Производитель не\nстанет его изготавливать, если не будет уверен, что найдется покупатель,\nкоторый его приобретет. Каждый человек и каждая фирма обладает какими-то\nсведениями – прежде всего о себе самом, о своих вкусах, интересах, потребностях\nи возможностях. Однако информации у всех становится во много раз больше, когда\nсубъекты начинают взаимодействовать – производят и потребляют, продают, покупают\nи меняются. Поведение людей и фирм на рынках – основной предмет изучения в\nкурсе микроэкономики.<\/p><p>The introductory course in Microeconomics describes the basic instruments of economic analysis, which allow us to study the most important patterns in the behavior of people and firms. As a result of their interactions markets occur and prices are determined. Microeconomics studies the behavior of people and firms in the markets.<\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<p><b>1.  <\/b><b>Что такое микроэкономика<br><\/b>Введение, предварительные\nзамечания. Цели и задачи курса, смысл изучения экономики вообще и\nмикроэкономики в частности. Основные предпосылки классической\nмикроэкономической теории. Понятие рынка, конкурентного рынка.<\/p>\n\n<p><b>2.  <\/b><b>Cпрос и предложение<br><\/b>Кривые спроса и предложения.\nПонятие эластичности, эластичность спроса и предложения в краткосрочной и\nдолгосрочной перспективе. Примеры последствий правительственного вмешательства:\nминимальная зарплата, контроль над ценами.<\/p>\n\n<p><b>3.  <\/b><b>Поведение потребителя<br><\/b>Предпочтения потребителя,\nбюджетные ограничения, влияние изменения доходов и цен. Кривые безразличия,\nпредельная норма замещения, эффект дохода и эффект замещения. Рыночный спрос и\nпотребительский излишек<\/p>\n\n<p><b>4. <\/b><b>Экономика фирмы\/<br><\/b>Производственные технологии,\nпроизводственная функция. Краткосрочный и долгосрочный периоды. Производство с\nодним переменным фактором, средний и предельный продукты. Закон убывающей\nпроизводительности. Производство с двумя переменными факторами. Замещение\nфакторов производства. Кривая предложения. Излишек производителя.<\/p>\n\n<p><b>5.  <\/b><b>Анализ конкурентного рынка<br><\/b>Оценка выигрыша и потерь от\nгосударственного регулирования. Эффективность конкурентного рынка. Пример:\nпоследствия торговых барьеров для благосостояния.<\/p>\n\n<p><b>6.<\/b><b> Рыночная власть<br><\/b>Рыночная власть: монополия и\nмонопсония. Источники монопольной власти, издержки монопольного\nценообразования.<\/p>\n\n<p><b>7.  <\/b><b>Стратегическая конкуренция<br><\/b>Олигополистический рынок. Понятие\nо стратегическом взаимодействии. Равновесие по Нэшу.<\/p>\n\n<p><b>8. <\/b><b>Общественные блага<br><\/b>Экстерналии. Проблема недофинансирования общественных благ и другие\nпримеры «провалов рынка». Теорема Коуза<\/p>\n\n<p><b>9. <\/b><b>Риск и финансовые рынки<br><\/b>Выбор в условиях\nнеопределенности. Описание риска в терминах теории вероятности. Математическое\nожидание и дисперсия. Отношение потребителя к риску, спрос на рисковые активы,\nоптимальный баланс риска и дохода.<\/p>\n\n<p><b>10.   <\/b><b>Аукционы <br><\/b>Стратегическое взаимодействие в условиях неопределенности. Виды\nаукционов. Приложения<\/p>",
    "estimatedClassWorkload": "4-5 hours\/week",
    "recommendedBackground": "Это базовый курс, и для его освоения не требуется специального образования, он ориентирован на широкий круг слушателей.",
    "links": {

    }
}