{
    "id": 1195,
    "shortName": "brainspace",
    "name": "The Brain and Space",
    "language": "en",
    "shortDescription": "This course is about how the brain creates our sense of spatial location from a variety of sensory and motor sources, and how this spatial sense in turn shapes our cognitive abilities.",
    "aboutTheCourse": "<p>Knowing where things are is effortless. &nbsp;But “under the hood,” your brain must figure out even the simplest of details about the world around you and your position in it. &nbsp;Recognizing your mother, finding your phone, going to the grocery store, playing the banjo – these require careful sleuthing and coordination across different sensory and motor domains. &nbsp;This course traces the brain’s detective work to create this sense of space and argues that the brain’s spatial focus permeates our cognitive abilities, affecting the way we think and remember.<\/p>\n<p>The material in this course is based on a book I've written for a general audience. &nbsp;The book is called \"Making Space: How the Brain Knows Where Things Are\", and is available from&nbsp;<a href=\"http:\/\/www.amazon.com\/Making-Space-Brain-Knows-Things\/dp\/0674863216\/ref=sr_1_1?ie=UTF8&amp;qid=1399059520&amp;sr=8-1&amp;keywords=Making+space+Groh\" target=\"_blank\" title=\"Link: http:\/\/www.amazon.com\/Making-Space-Brain-Knows-Things\/dp\/0674863216\/ref=sr_1_1?ie=UTF8&amp;qid=1399059520&amp;sr=8-1&amp;keywords=Making+space+Groh\">Amazon<\/a>,&nbsp;<a href=\"http:\/\/www.barnesandnoble.com\/w\/making-space-jennifer-m-groh\/1119132779?ean=9780674863217\" target=\"_blank\">Barnes and Noble<\/a>,&nbsp;or directly from <a href=\"http:\/\/www.hup.harvard.edu\/catalog.php?isbn=9780674863217\" target=\"_blank\" title=\"Link: http:\/\/www.hup.harvard.edu\/catalog.php?isbn=9780674863217\">Harvard University Press<\/a>.&nbsp;<\/p><p>The course material overlaps with classes on perception or systems neuroscience, and can be taken either before or after such classes.<br><\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<p>There are 9 units spread over 6 weeks (with a 1 week grace period). &nbsp;Each unit corresponds to a chapter or two of the book <a href=\"http:\/\/www.amazon.com\/Making-Space-Brain-Knows-Things\/dp\/0674863216\" target=\"_blank\" title=\"Link: http:\/\/www.amazon.com\/Making-Space-Brain-Knows-Things\/dp\/0674863216\">Making Space: How the Brain Knows Where Things Are<\/a>. &nbsp;<\/p><p><b>1.&nbsp;Vision (Week 1-2) &nbsp;<\/b><i>The Ways of Light<\/i><\/p><p>Vision is one of the most spatial of our senses.This unit explains what light is,\nand how it is detected by photoreceptors in the eye.&nbsp; It includes a history of vision research\ndating back to ancient Greece, and describes the role of the astronomer Kepler\nin deducing how the image of the visual scene is formed on the eye. &nbsp;How the two-dimensional projection of the\nvisual scene onto the surface of the retina is interpreted by the brain as a\nthree-dimensional world is explored through examples from various artists such\nas Magritte and Escher. &nbsp;(\"Making Space\" Chapters 1-2).<\/p>\n\n<b>2.&nbsp;Somatosensory (Week 2) &nbsp;<\/b><i>Sensing Our Own Shape<\/i><br><br>This unit covers how we know about\nthe positions of the parts of our bodies.&nbsp;\nSome intriguing illusions of body position sense are covered.&nbsp; The combination of body position sense and\nour sense of touch yields a sense of the three-dimensional location and shape\nof solid objects.&nbsp;(\"Making Space\" Chapter 3).<br><br><b>3.&nbsp;Brain maps (Week 3) &nbsp;<\/b><i>Brain Maps and Polka Dots<\/i><br><p>This unit introduces the brain\nmechanisms responsible for sensory processing of vision and touch, with an\nemphasis on the formation of sensory maps in the visual and somatosensory\npathways of the brain.&nbsp; The implications\nof these maps and other neural response properties for perception of spatial\nlocation are explored, with an emphasis on object motion and contours.&nbsp; Experiments using electrical stimulation in\nsensory maps to probe their connection to perception are discussed. (\"Making Space\" Chapter 4).<\/p>\n\n<p><b>4.&nbsp;Auditory (Week 4)&nbsp;<\/b><i>Sherlock\n     Ears: How Your Brain Finds Sounds<\/i><\/p><p>This unit turns to a sensory\nsystem for which spatial location must be inferred from indirect\nmeasurements.&nbsp; For vision and touch, the\nsensory receptors are able to measure spatial location in kind:&nbsp; objects at different locations activated\ndifferent sensory receptors.&nbsp; For hearing,\nthe brain must compare and contrast the sounds arriving at each ear to make\ninferences about the location of origin.&nbsp;\nThis unit discusses the how this works, from the nature of sound itself\nto the interpretation of location-dependent sound attributes by the brain. (\"Making Space\" Chapter 5).<\/p>\n\n<p><b>5.&nbsp;Brain meters for space (Week 4) &nbsp;<\/b><i>Moving\n     with Maps and Meters<\/i><\/p><p>This unit focuses on the concept of representation. &nbsp;We review maps as a form of representation, and introduce another kind of spatial representation, the “meter”.&nbsp;\nMore commonly but somewhat obscurely referred to as rate coding, this\nkind of representation involves neural response rates that scale in proportion\nto spatial location – a meter whose level indicates position. This kind of code\nis used in movements, the sense of body position, and in the early stages of\nthe auditory pathway. &nbsp;&nbsp;(\"Making Space\" Chapter 6).<\/p><p><b>6. Reference Frames (Week 5) &nbsp;<\/b><i>Your Sunglasses Are In the Milky Way<\/i><\/p><p>Spatial locations are measured\nwith respect to reference positions, but these reference positions differ\ndepending on the type of sensory input.&nbsp;\nThe eyes measure locations with respect to the eyes, and the ears\nmeasure locations with respect to the ears.&nbsp;\nThis unit discusses some illusions related to this issue and describes\nbrain mechanisms for translating between different reference frames.&nbsp; Synthesizing a sense of space across time as\nthe body and its sense organs move through the environment requires integrating\nmemories of the sensory input at different times and positions. &nbsp;(\"Making Space\" Chapter 7).<\/p>\n\n<p><b>7.&nbsp;Navigation (Week 5) &nbsp;<\/b><i>Going Places<\/i><\/p><p>This unit shifts focus in two\nways:&nbsp; (a) it involves space on a larger\nscale such as traveling from one place to another, and (b) it involves a sense\nof one’s own position in the environment as opposed to the position of objects\nor events in that scene.&nbsp; The role of the\nsense of balance and one’s own movements are incorporated.&nbsp; Animal species that navigate long distances\nand how they do this are described. &nbsp;(\"Making Space\" Chapter 8).<\/p><p><b>8.&nbsp;Remembering (Week 6) &nbsp;<\/b><i>Space and Memory<\/i><\/p><i><br><\/i>This unit builds the first of\nseveral important links between the sense of space and other kinds of\ncognition.&nbsp; Memory is closely linked to\nspatial processing at several levels.&nbsp;\nThis unit discusses the role of the hippocampus in both navigation and\nmemory, and tells the story of patient HM, whose hippocampus was surgically\ndestroyed in the 1950’s, resulting in lifelong amnesia.&nbsp;&nbsp;(\"Making Space\" Chapter 9).<br><br><b>\n\n9.&nbsp;Cognition (Week 6) &nbsp;<\/b><i>Thinking about Thinking &nbsp;<br><br><\/i>This unit argues that the brain's spatial systems provide a framework for thinking. The&nbsp;space-sensitive regions of the brain may do more than evaluate location, but may also be recruited for\ncognitive processes such as paying attention, making decisions, and planning\nfuture actions.&nbsp; The kinds of computations\nthat the brain performs on spatial inputs may resemble the kinds of\ncomputations that the brain performs on abstract concepts and ideas.&nbsp; Thinking about space and more general kinds\nof thinking may involve similar brain mechanisms.&nbsp;&nbsp;(\"Making Space\" Chapter 10).",
    "estimatedClassWorkload": "4-5 hours\/week",
    "recommendedBackground": "No background is required; all are welcome!&nbsp;&nbsp;",
    "links": {

    }
}