{
    "id": 559,
    "shortName": "ucimacroeconomics",
    "name": "The Power of Macroeconomics: Economic Principles in the Real World",
    "language": "en",
    "shortDescription": "In this course, you will learn all of the major principles of macroeconomics normally taught in a quarter or semester course to college undergraduates or MBA students.   ",
    "aboutTheCourse": "<p>In this course, you will learn all of the major principles of macroeconomics\n    normally taught in a quarter or semester course to college undergraduates\n    or MBA students.&nbsp;&nbsp;&nbsp;<\/p>\n<p>Perhaps more importantly, you will also learn how to apply these principles\n    to a wide variety of situations in both your personal and professional\n    lives. In this way, the Power of Macroeconomics will help you prosper\n    in an increasingly competitive and globalized environment.<\/p>\n<p><\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<p>Week One: An Overview of Modern Macroeconomics<br><\/p>\n<p>Week Two: The Aggregate Supply-Aggregate Demand Model and the Classical-Keynesian\n    Debate<\/p>\n<p>Week Three:&nbsp;&nbsp;The Keynesian Model and Fiscal Policy<\/p>\n<p>Week Four: The Federal Reserve and Monetary Policy<\/p>\n<p>Week Five: Unemployment, Inflation, and Stagflation<\/p>\n<p>Week Six: The Warring Schools of Macroeconomics<\/p>\n<p>Week Seven: Economic Growth and Productivity<\/p>\n<p>Week Eight: Budget Deficits and the Public Debt<\/p>\n<p>Week Nine: International Trade and Protectionism<\/p>\n<p>Week Ten: Exchange Rates, The Balance of Payments, and Trade Deficits<\/p>\n<p>Week Eleven: The Economics of Developing Countries<\/p>",
    "estimatedClassWorkload": "2-4 hours\/week",
    "recommendedBackground": "<p>This course is suitable for everyone from advanced secondary or high school students to billion\n    dollar hedge fund managers.&nbsp; It requires no complicated mathematical\n    training.&nbsp; While a previous study of microeconomics might be useful\n    in more quickly assimilating some of the graphical material, it is certainly\n    not a pre-requisite.<\/p>",
    "links": {}
}