{
    "id": 172,
    "shortName": "animalbehav",
    "name": "Animal Behaviour",
    "language": "en",
    "shortDescription": "This course will help you understand the remarkable behaviors of wild animals from an evolutionary perspective. \n\n[Image: Peacock spider. Photo by Jürgen Otto, Manakin bird footage (Ex-Riddle of the Sexes) reproduced with permission, courtesy of BBC Worldwide Ltd]",
    "aboutTheCourse": "<p>Many of us derive inspiration from watching natural history\ndocumentaries and their astounding catalogue of wild animal&nbsp;behaviours.&nbsp; In this course, we will explore how\nscientists study animal behaviour, and in particular how behaviour is shaped by&nbsp;the evolutionary forces of natural and sexual\nselection.&nbsp;Topics include&nbsp;resource acquisition; avoiding enemies; mate choice and sexual conflict; cues, signals and communication; parental care and social behaviour; and\nthe role of genes, environments and learning in regulating behavioural diversity.&nbsp;&nbsp;We\ndraw on examples from across the animal kingdom to illustrate&nbsp;the complex\nmechanisms underlying adaptations,&nbsp;and complement these with natural\nhistory videos that highlight key concepts. We evaluate the scientific rigour\nof studies used to test theory, and highlight the often ingenious methods\nadopted by researchers to understand animal behaviour.<\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<div><b>We will cover the&nbsp;following topics:<\/b><\/div><ul><li>Behaviour, Ecology and Natural Selection<\/li><li>Genes, Environment and Learning<\/li><li>Finding food and avoiding predators<\/li><li>Communication<\/li><li>Sexual selection and sperm competition<\/li><li>Mating systems and sex allocation<br><\/li><li>Parental care and conflict<\/li><li>Social behaviour<\/li><\/ul>",
    "estimatedClassWorkload": "6-8 hours\/week",
    "recommendedBackground": "Apart from enthusiasm for animal behaviour, there is no background required for this course.",
    "links": {

    }
}