{
    "id": 2187,
    "shortName": "ageing",
    "name": "Rethinking Ageing:  Are we prepared to live longer?",
    "language": "en",
    "shortDescription": "Population ageing is occurring in nearly every country around the word. This MOOC takes a multidisciplinary approach to explore the impact of living longer and takes into account the technological advancements, the built environment, economics and ethics to rethink what it means to 'age well' now and in the future.",
    "aboutTheCourse": "<p>Where do see yourself 25 years from now? In the year 2040...<\/p>\n<p>The course explores the demographic shift that is occurring around the world as people continue to live longer and have fewer children. This course dives into the challenges and opportunities that are likely to occur over the next 25 years in a multidisciplinary approach that includes <strong>15 academics from over 10 disciplines <\/strong>ranging from demography, to gerontology, architecture and design, health informatics, social work and economics in order to bring a broader perspective to '<strong>rethink ageing<\/strong>' and help lead all of us to ideas and resolutions that are more holistic in their approach.<\/p>\n<p>Another key theme throughout this course is <strong>self-reflection.<\/strong> Here is an opportunity to learn innovative approaches to individual and population ageing and be introspective. There will be ample opportunity to share your thoughts on the concepts covered in the discussion board forums, social media sites and in your assessments. <\/p>\n<p>We hope this integrated course will lead to promoting a sustainable good life in old age - no matter where you are in the world - or where you will be in 2040!<\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<p>During the course you will have the opportunity to explore the following topics:<\/p>\n  <p><strong>Module one - Worldwide population ageing<\/strong><\/p>\n  <p>The course begins with module one, which looks at population ageing over the 21st century to better understand how to <strong>measure population ageing<\/strong>, the trends and data sources that are available in order to make evidence-based predictions.  You will explore available, reliable and free data sources on population ageing and use demographer tools to interpret data.<\/p>\n<p><strong>Module two - Lifelong participation<\/strong><\/p>\n  <p>We move from the population perspective covered in module one and consider your <strong>individual health status and the factors that influence how you age, <\/strong>such as type of work you do, your environment, current health conditions and daily activities.This module dives into the physical and psychological changes that are more common in later life and how the gains in technology advancements enable people to be active, independent and socially connected to support lifelong participation.<\/p>\n  <p><strong>Module three - Planning and design for an ageing population<\/strong><\/p>\n<p>By the middle of the course, we have moved beyond our individual selves to explore infrastructure and the spatial implications of ageing. This module highlights the planning and design principles for an <strong>age-friendly environment <\/strong>for transportation, housing, retirement communities and health care settings.<\/p>\n<p>This module also showcases information technology software, such as mapping, data visualization and geospatial data to identify population trends and make data supported projections to optimally plan for ageing populations.<\/p>\n<p><strong>Module Four - Economics of ageing<\/strong><\/p>\n<p>The economic issues related to how to <strong>financially support living longer<\/strong> is challenging for government, communities, families and individuals. The module provides a framework to consider these challenges and potential strategies to address them.<\/p>\n<p><strong>Module Five - Ageing well<\/strong><\/p>\n<p>Lastly, we question whether the perceptions of ageing are changing – <strong>is 60 the new 40?<\/strong> What does this mean for intergenerational relationships, the value of older people, how we treat each other and how we can all age well in a sustainable way? Broad societal issues and ethical questions are raised in this module to consider<strong> what it means to 'age well.'<\/strong><\/p>\n<p><strong>Modules six and seven <\/strong>are 100% dedicated to your final assessment and you will have plenty of opportunities to explore what your final product could look like throughout the course.<\/p>",
    "estimatedClassWorkload": "3-4 hours\/week",
    "recommendedBackground": "<p>No background knowledge or skills are required, though we recommend an interest in ageing and willingness to think about the ageing process from different perspectives.<\/p>",
    "links": {

    }
}