{
    "id": 2253,
    "shortName": "gt",
    "name": "Теория игр (Game Theory)",
    "language": "ru",
    "shortDescription": "Теория игр изучает принципы принятия решений в условиях стратегического взаимодействия нескольких агентов — людей, компаний или правительств. Курс будет интересен желающим разобраться в том, как конкурируют друг с другом несколько компаний и можно ли гарантированно выиграть в шашки, есть ли смысл угрожать на переговорах и с кем стоит объединяться в коалиции в парламенте.",
    "aboutTheCourse": "<script type=\"text\/javascript\"> \nfunction look(type){ \nparam=document.getElementById(type); \nif(param.style.display == \"none\") param.style.display = \"block\"; \nelse param.style.display = \"none\" \n} \n<\/script> \n \n<p>В течение жизни мы&nbsp;постоянно взаимодействуем с&nbsp;другими людьми. Маленькие дети, пытаясь добиться того, чтобы родители купили понравившуюся конфетку, часто шантажируют родителей своими слезами. Принимая решение заплакать, ребенок рискует&nbsp;— он&nbsp;не&nbsp;знает, как поведут себя папа с&nbsp;мамой. В&nbsp;чуть&nbsp;более взрослом возрасте абитуриенты, выбирающие вуз, принимают сложное решение о&nbsp;том, в&nbsp;какие университеты подать документы. Ошибка может стоить дорого: при&nbsp;неправильной стратегии можно оказаться в&nbsp;слабом университете или&nbsp;вообще остаться без&nbsp;заветного студенческого билета. Окончив вуз, юноши и&nbsp;девушки начинают искать работу. Перед интервью с&nbsp;работодателем они&nbsp;штудируют статьи в&nbsp;интернете о&nbsp;том, что можно и&nbsp;чего нельзя говорить на&nbsp;интервью, —&nbsp;они пытаются найти наилучшую стратегию своего поведения, исходя из&nbsp;ожиданий компании, в&nbsp;которую они устраиваются. Все эти&nbsp;ситуации объединяет то, что решения, которые принимают одни люди, оказывают влияние на&nbsp;других людей. Такие взаимодействия называются стратегическими. Именно их изучает теория игр.<\/p>\n\n<p>Чтобы проанализировать ту&nbsp;или&nbsp;иную реальную жизненную ситуацию стратегического взаимодействия и&nbsp;найти оптимальный вариант поведения в&nbsp;ней, необходимо сделать две&nbsp;вещи. Во-первых, необходимо формально записать ситуацию на&nbsp;языке теории игр, то&nbsp;есть создать модель (игру). Во-вторых, после&nbsp;того&nbsp;как модель (игра) составлена, ее&nbsp;необходимо решить. Этому&nbsp;мы&nbsp;будем учиться в&nbsp;течение курса. Мы&nbsp;разберем основные виды игр (одновременные и&nbsp;последовательные, с&nbsp;совершенной и&nbsp;несовершенной информацией, коалиционные и&nbsp;некоалиционные), приведем способы их решения&nbsp;и&nbsp;обсудим&nbsp;их на&nbsp;многочисленных примерах.<\/p>\n\n<a href=\"javascript:look('div1');\" title=\"See Course description in English below\">See Course description in English below<\/a> \n<div id=\"div1\" style=\"display: none;\">\n<br>\n<p>During our lifetime, we constantly interact with other people. Small children tend to&nbsp;shed tears in the hope that their parents will buy them a sweet they’d like to try. Making a decision on whether to cry, a child takes the risk — he can’t know for sure what his mum and dad will do next. At a more mature age, students make a hard decision as to which university to apply to. A mistake can be costly: a student who happened to choose the wrong strategy may find himself studying at a second-rate university or not even enter university at all. After graduating from university, young men and women start looking for a job. Before a job interview, they look through different articles on the Internet on what they should and shouldn’t say during the&nbsp;interview. They try to find the best strategy of how to behave based on the expectations of the company they strive to get a job in. All of these situations have something in common: decisions made by some people influence what other people do. We call these situations strategic interactions, and we will use the term ‘game’ to&nbsp;refer to any of them. Such games are exactly what game theory studies (although games, as ordinarily understood, usually turn out to be strategic interactions as well).<\/p>\n\n<p>In order to analyse a real-life situation of strategic interaction and find an optimal way of behaviour, we should do two things. First, we need to formalise this situation using the language of game theory, i.e. to create a model (game). Second, when the model (game) is created, we need to solve it. During our course we will learn how to do both of these things. We will consider the main types of games (simultaneous and&nbsp;sequential, those with perfect and those with imperfect information, coalitional and&nbsp;non-coalitional), study the ways to solve them and discuss plenty of examples.<\/p> <\/div>",
    "targetAudience": 0,
    "courseSyllabus": "<p><b>Неделя&nbsp;1. Стратегические взаимодействия<\/b>\n<\/p>\n\n<ul>\n    <li>Примеры стратегических взаимодействий.<\/li>\n    <li>Формализация одновременных стратегических взаимодействий в&nbsp;виде игр в&nbsp;нормальной форме. Матричная запись игр двух лиц.<\/li>\n    <li>Формализация последовательных стратегических взаимодействий в&nbsp;виде игр в&nbsp;развернутой форме: введение. <\/li>\n<\/ul>\n\n<p><i>К&nbsp;концу первой недели мы&nbsp;разберемся с&nbsp;алфавитом теории игр и&nbsp;научимся переводить реальные жизненные ситуации на&nbsp;этот язык.<\/i><\/p>\n\n<p><b>Неделя&nbsp;2. Доминирующие и&nbsp;доминируемые стратегии<\/b><\/p>\n\n<ul>\n    <li>Концепции решения игр: равновесие в строго (слабо) доминирующих стратегиях.<\/li>\n    <li>Концепции решения игр: равновесие, получаемое исключением строго (слабо) доминируемых стратегий.<\/li>\n<\/ul>\n\n<p><i>На&nbsp;второй неделе мы&nbsp;договоримся, что означает «решить игру», и&nbsp;познакомимся с&nbsp;первыми концепциями решений.<\/i>\n<\/p>\n\n<p><b>Неделя&nbsp;3. Равновесие Нэша<\/b><\/p>\n\n<ul>\n    <li>Концепции решения игр: равновесие Нэша. Алгоритмы поиска равновесий&nbsp;Нэша.<\/li>\n    <li>Связь между равновесием Нэша, доминирующими и&nbsp;доминируемыми стратегиями.<\/li>\n<\/ul>\n\n<p><i>Третья неделя курса&nbsp;— одна из&nbsp;ключевых: если хорошо понять, что такое равновесие Нэша, то&nbsp;со&nbsp;всем остальным материалом будет разобраться совсем несложно.<\/i>\n<\/p>\n\n<p><b>Неделя&nbsp;4. Модель Хотеллинга&nbsp;— Даунса и&nbsp;модель Курно<\/b><\/p>\n\n<ul>\n    <li>Анализ предвыборной конкуренции: модель Хотеллинга&nbsp;— Даунса.<\/li>\n    <li>Анализ олигополистической конкуренции: модель Курно.<\/li>\n<\/ul>\n\n<p><i>Модели, которые мы&nbsp;обсудим на&nbsp;четвертой неделе, давно стали классическими. Они являются простым, но&nbsp;очень мощным способом анализа политической конкуренции и&nbsp;конкуренции между фирмами на&nbsp;рынке олигополии соответственно.<\/i>\n<\/p>\n\n<p><b>Неделя&nbsp;5. Игры в&nbsp;развернутой форме<\/b><\/p>\n\n<ul>\n    <li>Последовательные стратегические взаимодействия и&nbsp;их&nbsp;формализация в&nbsp;виде игр в&nbsp;развернутой форме. <\/li>\n    <li>Подыгры. Алгоритм обратной индукции.<\/li>\n<\/ul>\n\n<p><i>До&nbsp;пятой недели мы&nbsp;обсуждали в основном одновременные\nстратегические взаимодействия. После изучения последовательных взаимодействий\nмы научимся представлять в&nbsp;виде игры и&nbsp;затем подробно анализировать почти любую\nпростейшую игровую ситуацию. <\/i>\n<\/p>\n\n<p><b>Неделя&nbsp;6. Равновесие Нэша, совершенное на&nbsp;подыграх<\/b>\n<\/p>\n\n<ul>\n    <li>Связь между играми в&nbsp;нормальной форме и&nbsp;играми в&nbsp;развернутой форме.<\/li>\n    <li>Концепции решения игр в&nbsp;развернутой форме: равновесие Нэша, совершенное на&nbsp;подыграх. Идея рафинирования равновесий.<\/li>\n<\/ul>\n\n<p><i>После первых шести недель курса будут получены необходимые\nбазовые теоретические знания по&nbsp;теории игр. Дальше мы&nbsp;будем опираться на&nbsp;них для&nbsp;построения более сложных моделей.<\/i>\n<\/p>\n\n<p><b>Неделя&nbsp;7. Игры с&nbsp;несовершенной информацией<\/b>\n<\/p>\n\n<ul>\n    <li>Игры с&nbsp;несовершенной информацией. Обсуждение роли информации для&nbsp;принятия решений.<\/li>\n    <li>Модификация определения подыгры. Равновесие Нэша, совершенное на&nbsp;подыграх.<\/li>\n<\/ul>\n\n<p><i>При&nbsp;последовательных взаимодействиях часто бывает так, что\nодин из&nbsp;игроков не&nbsp;знает, какие решения приняли другие игроки. Тем&nbsp;не&nbsp;менее такие игры тоже можно анализировать. Мы&nbsp;научимся этому на&nbsp;седьмой неделе.<\/i>\n<\/p>\n\n<p><b>Неделя&nbsp;8. Смешанные стратегии<\/b>\n<\/p>\n\n<ul>\n    <li>Понятие смешанной стратегии. Концепции решения игр: равновесие Нэша в&nbsp;смешанных стратегиях.<\/li>\n<\/ul>\n\n<p><i>Ни&nbsp;один теннисист никогда не&nbsp;подает подачу в&nbsp;один и&nbsp;тот&nbsp;же\nугол. А&nbsp;как подает? Поговорим, в&nbsp;частности, и&nbsp;об&nbsp;этом на&nbsp;восьмой неделе.<\/i>\n<\/p>\n\n<p><b>Неделя&nbsp;9. Задача о&nbsp;стабильных мэтчингах<\/b>\n<\/p>\n\n<ul>\n    <li>Задача о&nbsp;стабильных мэтчингах: теория и приложения.<\/li>\n<\/ul>\n\n<p><i>На&nbsp;этой неделе мы&nbsp;разберемся, почему нужно не&nbsp;бояться знакомиться с&nbsp;противоположным полом первым и&nbsp;почему может иметь смысл скрывать свои&nbsp;настоящие предпочтения.<\/i>\n<\/p>\n\n<p><b>Неделя&nbsp;10. Коалиционные игры<\/b>\n<\/p>\n\n<ul>\n    <li>Концепции решения коалиционных игр: ядро.<\/li>\n    <li>Концепции решения коалиционных игр: вектор Шепли.<\/li>\n    <li>Простые игры. Индекс Шепли&nbsp;—&nbsp;Шубика. Сколько стоит право вето, и&nbsp;с&nbsp;кем формировать коалицию в&nbsp;парламенте?<\/li>\n<\/ul>\n\n<p><i>До&nbsp;сих пор каждый из&nbsp;игроков принимал решения независимо\nот&nbsp;остальных игроков. Но&nbsp;ведь они&nbsp;могут объединяться для&nbsp;того, чтобы\nпостараться увеличить свой&nbsp;платеж. Мы&nbsp;рассмотрим такие игры на&nbsp;десятой неделе.<\/i>\n<\/p>\n\n<p><b>Неделя&nbsp;11. Краткая история теории игр<\/b>\n<\/p>\n\n<ul>\n    <li>История теории игр от&nbsp;древних карточных игр до&nbsp;Нобелевских премий.<\/li>\n<\/ul>\n\n<p><i>Теперь, когда мы&nbsp;уже знаем не&nbsp;так мало, интересно вспомнить, как развивалась теория игр. Благодаря этому мы&nbsp;сможем лучше понять эту&nbsp;науку.<\/i>\n<\/p>",
    "estimatedClassWorkload": "3-4 hours\/week",
    "recommendedBackground": "Курс является базовым, поэтому он не требует специальной подготовки. Для его успешного освоения достаточно уверенных знаний курса математики в объеме школьной программы. В одном-двух примерах могут пригодиться знания начал математического анализа (дифференцирование функций одной переменной, необходимое условие экстремума) и знания начал теории вероятностей\n(понятие математического ожидания случайной величины).",
    "links": {

    }
}