{"id":3555,"shortName":"whartonoperationses","name":"Introducción a la Gestión de Operaciones","language":"es","shortDescription":"Aprende a analizar y a mejorar los procesos empresariales en servicios o en la industria. Aprende cómo incrementar la productividad y a ofrecer niveles de calidad mayores. Después de que finalices con éxito este curso, podrás aplicar estas habilidades en un reto empresarial del mundo real como parte de la Programa Especializado de Fundamentos Empresariales de Wharton.\n","aboutTheCourse":"<p><b>PARTE DE LA PROGRAMA ESPECIALIZADO DE FUNDAMENTOS EMPRESARIALES DE WHARTON&nbsp;<\/b><\/p><p><a href=\"http:\/\/youtu.be\/Y1UlXveNj_g\">Aquí<\/a> puedes ver como Geoffrey Garrett, Decano de Wharton School, habla sobre la Programa Especializado.<\/p><p>La última vez que fuiste a un restaurante ¿qué querías? Querías encontrar algo en el menú que te gustara, querías que la comida se preparara siguiendo estándares de alta calidad, querías que te sirvieran rápido y no querías pagar mucho por ello. Ahora, piensa en la última vez que fuiste a la consulta del médico o a un hospital. ¿Qué querías que hicieran los médicos y el personal sanitario? Querías que te ofrecieran los cuidados adecuados, que los cuidados fueran de gran calidad, querías que te atendiera rápido y que tú (o tu seguro) no tuvieras que pagar demasiado por esos servicios.&nbsp;<\/p><p>\nLas habilidades de gestión necesarias para dirigir el funcionamiento de un restaurante son las mismas que se necesitan para dirigir un hospital. Aprenderás esas habilidades en este curso. Específicamente aprenderás cómo mejorar la productividad,aumentar la capacidad de &nbsp;respuesta, proporcionar más opciones al consumidor y ofrecer estándares de mayor calidad. En resumen, aprenderás cómo analizar los procesos empresariales y cómo mejorarlos.&nbsp;<\/p><p>Completa este curso como parte de la Programa Especializado de Fundamentos Empresariales de Wharton, y tendrás la oportunidad de realizar el Proyecto Final y de preparar un análisis estratégico y proponer soluciones a un reto empresarial real de compañías dirigidas por Wharton como Televisa o a un reto al que se enfrente tu propia compañía u organización. Un equipo cualificado de Wharton evaluará los mejores trabajos, y los equipos directivos de Televisa revisarán los proyectos con mayor puntuación elaborados para sus compañías.&nbsp;<\/p><p>Mira este vídeo para aprender más sobre la Serie sobre Fundamentos de Wharton en Coursera:&nbsp;<\/p><p><a href=\"http:\/\/www.youtube.com\/watch?v=SgS3AJCe6i8\">http:\/\/www.youtube.com\/watch?v=SgS3AJCe6i8<\/a><\/p>\nPara obtener más información sobre los cursos online que ofrece Wharton, por favor visita&nbsp;<p>\n<\/p><a href=\"http:\/\/online.wharton.upenn.edu\/\">online.wharton.upenn.edu<\/a>","targetAudience":1,"courseSyllabus":"<p dir=\"ltr\">Entre los temas clave encontramos:<\/p><ul><li><p dir=\"ltr\">Análisis de procesos<\/p><\/li><li><p dir=\"ltr\">Productividad<\/p><\/li><li>Calidad<\/li><\/ul>","courseFormat":"<span><p dir=\"ltr\">Este curso consta de una combinación de vídeo lecciones, cuestionarios y debates.<\/p><div><br><\/div><\/span>","suggestedReadings":"<p dir=\"ltr\">No se requieren lecturas para este curso. Los estudiantes que quieran ampliar sus conocimientos, que quieran más problemas prácticos, explicaciones más en profundidad, o más matemáticas, pueden consultar el siguiente libro:<\/p><p><\/p><p dir=\"ltr\">Cachon, Gerard, Christian Terwiesch, <a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&amp;AFID=301076&amp;ADID=1088031&amp;SID=operations&amp;isbn_ean=9780073525204\">Matching Supply with Demand: An Introduction to Operations Management<\/a> <img width=\"1\" src=\"https:\/\/lh5.googleusercontent.com\/aSfDXILOvNnRQrN_MLZIyqbLVdR6u5H_rssUn2jVje89J_lZlChL8AaFzEZKGTIiIqDCfH9zqGL8Y3beczNKEaI2m20wm7ogXLsbeRrISauaoLEQ0skgO6eCCRI3KoYB8IU=s1600\" height=\"1\" style=\"border: none; transform: rotate(0.00rad); -webkit-transform: rotate(0.00rad);\">, 3ª edición, Irwin - McGraw Hill, 2012 (ISBN 978-0073525204, 507 páginas)<\/p>","estimatedClassWorkload":"5-7 hours\/week","recommendedBackground":"No se requieren conocimientos previos, aunque será útil poseer un nivel de matemáticas equivalente a secundaria.<br>","links":{}}