{
    "id": 225,
    "shortName": "nlangp",
    "name": "Natural Language Processing",
    "language": "en",
    "shortDescription": "Have you ever wondered how to build a system that automatically translates between languages? Or a system that can understand natural language instructions from a human?  This class will cover the fundamentals of mathematical and computational models of language, and the application of these models to key problems in natural language processing.",
    "aboutTheCourse": "<p>Natural language processing (NLP) deals with the application of computational models to text or speech data. Application areas within NLP include automatic (machine) translation between languages; dialogue systems, which allow a human to interact with a machine using natural language; and information extraction, where the goal is to transform unstructured text into structured (database) representations that can be searched and browsed in flexible ways. NLP technologies are having a dramatic impact on the way people interact with computers, on the way people interact with each other through the use of language, and on the way people access the vast amount of linguistic data now in electronic form. From a scientific viewpoint, NLP involves fundamental questions of how to structure formal models (for example statistical models) of natural language phenomena, and of how to design algorithms that implement these models.<\/p>\n\n<p>In this course you will study mathematical and computational models of language, and the application of these models to key problems in natural language processing. The course has a focus on machine learning methods, which are widely used in modern NLP systems: we will cover formalisms such as hidden Markov models, probabilistic context-free grammars, log-linear models, and statistical models for machine translation. The curriculum closely follows a course currently taught by Professor Collins at Columbia University, and previously taught at MIT.<\/p>",
    "targetAudience": 1,
    "courseSyllabus": "Topics covered include:\n\n<p>\n1. Language modeling.<br>\n2. Hidden Markov models, and tagging problems.<br>\n3. Probabilistic context-free grammars, and the parsing problem.<br>\n4. Statistical approaches to machine translation.<br>\n5. Log-linear models, and their application to NLP problems.<br>\n6. Unsupervised and semi-supervised learning in NLP.<\/p>",
    "estimatedClassWorkload": "8-10 hours\/week",
    "recommendedBackground": "A basic knowledge of probability (e.g., you should be familiar with random variables, independence assumptions, etc.), a basic knowledge of algorithms, and a basic knowledge of calculus (e.g., how to differentiate simple functions).&nbsp;",
    "links": {

    }
}