{
    "id": 1351,
    "shortName": "resilienceinchildren",
    "name": "Resilience in Children Exposed to Trauma, Disaster and War: Global Perspectives",
    "language": "en",
    "shortDescription": "How do children overcome hazardous experiences to succeed in life? What can be done to protect young people at risk from trauma, war, disasters, and other adversities? Learn about the importance of fostering resilience in children at risk.",
    "aboutTheCourse": "<p>Children around the world experience severe adversity in different forms, including maltreatment, disaster, war, and terrorism. Some children manage to adapt and recover, showing resilience, while others do not. What do we know about resilience and how\n    to protect child development in the face of potentially life-altering adversities? This course will examine the global literature on resilience in children and youth, with a focus on core concepts, methods scholars use to study resilience, highlights\n    of lessons learned from half a century of research, and applications to promote resilience in children whose lives are threatened by extreme adversity.<\/p>\n<p>Course materials will examine multimedia biographies as well as research studies on the effects of common and rare traumatic experiences on child development. Both classic and contemporary studies of risk and resilience in children facing the following\n    kinds of adversities will be included<\/p>\n<ul>\n    <li>natural disasters (eg, tsunami, hurricane, earthquake)\n        <br>\n    <\/li>\n    <li>political violence and war (eg, child soldiers, refugees)\n        <br>\n    <\/li>\n    <li>terror attacks (eg, 9\/11, Beslan school)\n        <br>\n    <\/li>\n    <li>compound mass-trauma events (eg, 2011 earthquake - tsunami - nuclear plant meltdown)\n        <br>\n    <\/li>\n    <li>child maltreatment\n        <br>\n    <\/li>\n    <li>severe poverty or privation\n        <br>\n    <\/li>\n<\/ul><span><p>The course also will highlight new frontiers of research on the neurobiology of resilience, cultural protective processes, and preventive interventions to promote the capacity for resilience in young people.<\/p><p>The course has been designed for relevance to students and professionals from multiple disciplines, diverse backgrounds, and different regions of the globe. Participants completing the course will gain a basic understanding of concepts and methods of research on resilience in children and youth, major findings from the first half-century of science on this topic, and a broad framework for applications of this growing knowledge to improve the lives of children threatened by hazardous circumstances.&nbsp;<\/p><\/span>\n<p><\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<p><\/p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Course content will address these topics among others<\/p>\n<p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p>\n<ul>\n    <li>the origins and meaning of resilience in research on human development\n        <br>\n    <\/li>\n    <li>methods and models of research on resilience, including case studies\n        <br>\n    <\/li>\n    <li>effects on children of natural and technological disasters\n        <br>\n    <\/li>\n    <li>resilience in children exposed to war and political violence\n        <br>\n    <\/li>\n    <li>roles of families, schools, culture, and community in promoting resilience of children\n        <br>\n    <\/li>\n    <li>enduring controversies and new horizons in the study of resilience\n        <br>\n    <\/li>\n<\/ul>\n<p><\/p>\n\n\n\n\n\n\n\n\n\n\n\n<p><\/p>",
    "estimatedClassWorkload": "3-5 hours\/week",
    "recommendedBackground": "<p><\/p>\n<p>The course has been designed for relevance to students and professionals from multiple disciplines, diverse backgrounds, and different regions of the globe. It will appeal to individuals interested in both basic science and the translation of science\n    to practice related to understanding and promoting positive development and well-being in people at risk due to adverse childhood experiences. The University of Minnesota also offers additional <a href=\"http:\/\/digitalcampus.umn.edu\/programs\" target=\"_blank\" title=\"Link: http:\/\/digitalcampus.umn.edu\/programs\">online program and certificate opportunities<\/a> for students who would like to continue their studies.<\/p>",
    "links": {}
}