{"id":188,"shortName":"pdstatistics","name":"Passion Driven Statistics","language":"en","shortDescription":"With existing data, you will develop skills in data analysis and basic statistics by exploring your own research question.","aboutTheCourse":"In this project-based course, you will have the opportunity to answer a question that you feel passionately about through independent research based on existing data. Students will have the opportunity to develop skills in generating testable hypotheses, preparing data for analysis, conducting descriptive and inferential statistical analyses, and presenting research findings.<br>","targetAudience":0,"courseSyllabus":"<ol><li>Statistical Software set up; Data, data sets and data documentation<\/li>\n<li> Data management<\/li>\n<li> Descriptive statistics and data visualization<\/li>\n<li>Comparing means (ANOVA), tests of categorical independence (Chi Square) and Correlation (r)<\/li>\n<li> Moderation<\/li>\n<li> Presenting statistical results\n<\/li><\/ol><blockquote><b>Activities include:<br><\/b>\nExploring data documentation<br>\nRunning a basic program<br>\nData management<br>\nGraphing<br>\nTesting and interpreting bivariate associations and post hoc paired comparisons<br>\nTesting and interpreting bivariate associations for population subgroups <br>\nWriting about results<br><\/blockquote><br>","courseFormat":"We will provide students with a selection of data sets with which to work (from studies focused on the characteristics of Mars craters, adolescent health, adult psychiatric and substance use disorders and the social, economic and health indicators of countries worldwide). Based on the student’s choice of data, each generates testable hypotheses, prepares data for analysis (i.e. data management), selects and conducts descriptive and inferential statistical analyses; and evaluates, interprets and presents research findings. Evaluations will include quizzes, applied data assignments and a final presentation of results through individual student project blogs . Supporting materials will be presented as text, and as video lectures and demonstrations.<br><br><b>SOFTWARE\n\n<\/b><p>In supporting you in answering questions with data, we are going to be using SAS Enterprise Guide through the OnDemand educational platform. SAS OnDemand for Academics provides a no-cost on-line delivery model to students for learning data management and statistics.<\/p><p>Technical support for SAS OnDemand \nfor Academics is available through the course Discussion Forums. <u>Support is NOT available \nthrough SAS Technical Support.<\/u><\/p>\n\n\n<b>SYSTEM REQUIREMENTS<\/b>\n\n<p>Check the following guidelines to ensure you can access the software. Your system must meet these requirements for SAS OnDemand for Academics to be fully supported.<\/p>\n\n<b>Operating systems:<\/b>\n<ul>\n<li>Microsoft Windows 7 Home Premium and above (32-bit or 64 bit).<\/li>\n<li>Microsoft Windows Vista Home Premium (32-bit or 64 bit).<\/li>\n<li>Microsoft Windows XP Professional.<\/li>\n<\/ul>\n<p>(Other versions of Microsoft Windows Vista might work, but have not been fully tested and are not supported by SAS.)<\/p>\n\n<p><i>MACINTOSH OPERATING SYSTEMS ARE NOT SUPPORTED<\/i>.<\/p>\n\n<p>***If missing, then Microsoft .NET Framework version 3.5 Service Pack 1 will be installed for users of Microsoft Windows XP Professional. Depending on the files required, installation could take from 5 to 90 minutes.<\/p>\n\n<b>Internet browser:<\/b>\n<p>Microsoft Internet Explorer 8 or later. Other Internet browsers might work but have not been fully tested and are not supported by SAS.<\/p>\n\n<b>Hard disk space:<\/b>\n<p>Approximately 80 MB of free hard disk space. You will be prompted to install Microsoft .NET if it is not on your machine. This requires additional disk space.<\/p>\n\n<b>Location:<\/b>\n<p>Unfortunately, access to SAS OnDemand is not available in the following countries:<\/p>\n<ul>\n<li>Burma (Myanmar)<\/li>\n<li>Cuba<\/li>\n<li>Iran<\/li>\n<li>North Korea<\/li>\n<li>Sudan<\/li>\n<li>Syria<\/li>\n<li>China<\/li>\n<\/ul><br>","suggestedReadings":"","instructor":"Lisa Dierker","estimatedClassWorkload":"3-4 hours\/week","recommendedBackground":"No background required. All are welcome.&nbsp;","links":{}}