{"id":1624,"shortName":"lidergestionedu","name":"Liderazgo en gestión educativa estratégica a través del uso de la tecnología","language":"es","shortDescription":"Curso de actualización docente que tiene como objetivo fortalecer el liderazgo en gestión educativa estratégica a través del uso de la tecnología en los procesos de planeación estratégica, liderazgo compartido, trabajo colaborativo, participación social responsable y evaluación para la mejora continua.","aboutTheCourse":"<p>Hoy en día, el uso de la\ntecnología en los centros escolares brinda importantes áreas de oportunidad, que\npermiten fortalecer la gestión educativa estratégica y mejorar la calidad de la\neducación básica.<\/p><p>Ser\nlíderes en gestión educativa estratégica a través del uso de la tecnología, es\nun objetivo de desarrollo profesional posible de alcanzar por todos los\nmiembros de una comunidad educativa, mediante el uso de&nbsp;herramientas sencillas y\namigables en su Plan Estratégico de Transformación\nEscolar.<\/p><p>Este\ncurso invita a los participantes a actualizar sus conocimientos sobre las ideas\nteóricas que fundamentan el Modelo de Gestión Educativa Estratégica y sus\nprincipales componentes. A través de actividades didácticas, los participantes\ndesarrollarán<i>&nbsp;<\/i>habilidades en el uso\nde las herramientas tecnológicas para fortalecer los procesos de planeación\nestratégica, liderazgo compartido, trabajo colaborativo, participación social\nresponsable y evaluación para la mejora continua.<\/p>","targetAudience":2,"courseSyllabus":"<b>1. Fortalezcamos la\ngestión educativa de nuestros centros escolares<\/b><br>&nbsp; &nbsp; 1.1.&nbsp; Modelo de Gestión Educativa Estratégica (MGEE)<br>&nbsp; &nbsp; 1.2.&nbsp; Tecnología Educativa pare fortalecer los componentes MGEE<br><b>2.&nbsp;<\/b><b>Construyamos una\nvisión compartida de transformación escolar<\/b><br>&nbsp; &nbsp; 2.1.&nbsp; Planeación estratégica<br>&nbsp; &nbsp; 2.2.&nbsp; Liderazgo compartido<br> <b>3.&nbsp;<\/b><b>Aprendamos a\ntrabajar de manera colaborativa y corresponsable<\/b><br>&nbsp; &nbsp; 3.1.&nbsp; Trabajo colaborativo<br>&nbsp; &nbsp; 3.2.&nbsp; Participación social responsable<br><b>4.&nbsp;<\/b><b>Evaluemos para\nmejorar la calidad de la educación<\/b><br>&nbsp; &nbsp; 4.1.&nbsp; Evaluación para la mejora continúa<br>&nbsp; &nbsp; 4.2.&nbsp; Estándares de Gestión para la Educación Básica&nbsp;<br>","courseFormat":"<p>Durante la primera semana\ndel curso, los participantes revisarán los objetivos de aprendizaje, la agenda\nde las unidades, la metodología de trabajo, los criterios de evaluación y los\nrecursos que ofrece la plataforma para facilitar su integración en la comunidad\nde aprendizaje “Líderes en gestión educativa estratégica”.<\/p><p>Este\ncurso está integrado por 4 unidades que se podrán realizar en un periodo de 4\nsemanas, las cuales presentan ideas teóricas sobre el Modelo de Gestión\nEducativa Estratégica y sus principales componentes. En cada unidad, los\nparticipantes realizarán 2 actividades didácticas que ofrecen 4 ejercicios para\nconocer y aplicar herramientas tecnológicas en los procesos de gestión\neducativa. Al término de cada unidad, los participantes realizarán una\nactividad de cierre con ejercicios que les permitirán valorar sus aprendizajes.<\/p><p>\n\n\n\n<\/p><p>En\nla última semana del curso, los participantes compartirán experiencias en el\nuso de las herramientas tecnológicas que fortalecen el liderazgo en gestión\neducativa y realizarán la evaluación del curso. Todos\nlos&nbsp;participantes que realicen las&nbsp;actividades didácticas&nbsp;y\nejercicios que ofrecen las 4 unidades, podrán solicitar una&nbsp;constancia de 30 horas&nbsp;que será expedida por el Centro de Investigación en Educación\ndel&nbsp;Tecnológico de Monterrey&nbsp;en\ncolaboración con el&nbsp;Consejo Nacional de Ciencia y\nTecnología&nbsp;(CONACyT) y el Instituto Nacional para la Evaluación de la Educación (INEE).<b><\/b><\/p>","suggestedReadings":"<p>En las actividades del\ncurso se ofrecen todos los materiales que se necesitan para poder realizar los\nejercicios didácticos; los participantes que deseen ampliar sus conocimientos\npodrán consultar los siguientes recursos adicionales que se pondrán a\ndisposición:<\/p><p><\/p><ul><li>Gómez-Zermeño, M. G. y Alemán, L. Y. (2014). PROYECTO\nPETC: <i>Estudio de casos de éxito sobre la\ngestión y el liderazgo escolar en las escuelas de tiempo completo.<\/i>\nMonterrey, Nuevo León, México: Tecnológico de Monterrey.<br><\/li><li>Gómez-Zermeño, M. G., &amp; Alemán, L. Y. (2012). <i>Administración de proyectos de capacitación\nbasados en tecnología<\/i>. Monterrey, Nuevo León, México: Tecnológico de\nMonterrey.<br><\/li><li>Gómez-Zermeño,\nM. G. (2012). Bibliotecas Digitales: Recursos bibliográficos electrónicos en\neducación básica. <i>Comunicar<\/i>. ISSN:\n1134-3478. Madrid: España.<br><\/li><li>Schmelkes, S. (1994). <i>Hacia\nuna mejor calidad de nuestras escuelas<\/i> [Versión electrónica]. México:\nInteramer.<br><\/li><li>Secretaría de Educación Pública [SEP] (2011). <i>Guía práctica para la elaboración del PETE y\nPAT<\/i>. México: SEP<br><\/li><li>Secretaría de Educación Pública [SEP] (2010a). <i>Programa Escuelas de Calidad, Módulo II,\nPETE Simplificado, Recomendaciones para elaborar el Plan Estratégico de\nTransformación Escolar<\/i>. México: SEP<br><\/li><li>Secretaría de Educación Pública [SEP] (2009). <i>Programa Escuelas de Calidad, Módulo 1,\nModelo de Gestión Educativa Estratégica<\/i>. México: SEP<br><\/li><\/ul><p><\/p>","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"<p>Este\ncurso fue diseñado para todos los docentes y&nbsp;miembros de una comunidad educativa en general, que deseen actualizar sus <strong>conocimientos <\/strong>en gestión educativa\nestratégica, desarrollar <strong>habilidades<\/strong> en\nuso de la tecnología y fortalecer las <strong>actitudes<\/strong><i><strong>\n<\/strong><\/i>que permiten implementar un liderazgo compartido en los centros escolares.<\/p>","links":{}}