{
    "id": 418,
    "shortName": "maps",
    "name": "Maps and the Geospatial Revolution",
    "language": "en",
    "shortDescription": "Learn how advances in geospatial technology and analytical methods have changed how we do everything, and discover how to make maps and analyze geographic patterns using the latest tools.",
    "aboutTheCourse": "The past decade has seen an explosion of new mechanisms for understanding and using location information in widely-accessible technologies. This Geospatial Revolution has resulted in the development of consumer GPS tools, interactive web maps, and location-aware mobile devices. These radical advances are making it possible for people from all walks of life to use, collect, and understand spatial information like never before.<br>&nbsp;<br>This course brings together core concepts in cartography, geographic information systems, and spatial thinking with real-world examples to provide the fundamentals necessary to engage with Geography beyond the surface-level. We will explore what makes spatial information special, how spatial data is created, how spatial analysis is conducted, and how to design maps so that they’re effective at telling the stories we wish to share. To gain experience using this knowledge, we will work with the latest mapping and analysis software to explore geographic problems.&nbsp;",
    "targetAudience": 0,
    "courseSyllabus": "<b><i><a target=\"_blank\" href=\"http:\/\/www.personal.psu.edu\/acr181\/GR_MOOC_Course_Outline_121313.pdf\">Detailed Course Outline<\/a>.<\/i><\/b><b><i><br><br>Week One:<\/i><\/b> The Geospatial Revolution; highlighting the massive changes in geospatial and mapping technology in recent years and their impact on people from all walks of life.<br> <br><span><i><b>Week Two:<\/b><\/i> <\/span>Spatial is special; an exploration of spatial thinking and geographic thought to provide the context necessary to understand the underpinnings of the Geospatial Revolution.<br> <br><span><b><i>Week Three:<\/i><\/b> <\/span>Spatial data; how spatial data is created, what makes it different from other types of information, and how it is managed using new technologies.<br> <br><span><i><b>Week Four:<\/b><\/i> <\/span>Spatial analysis; basic techniques for solving geographic problems that take spatial relationships into account.<br> <br><span><b><i>Week Five:<\/i><\/b> <\/span>Cartographic design; fundamentals necessary to design great maps to tell compelling stories about geographic patterns.",
    "estimatedClassWorkload": "6-9 hours\/week",
    "recommendedBackground": "No background is required; all are welcome. If you're already a Geospatial Guru, then you might find this class a bit basic, in which case I hope you'll consider taking the <a title=\"Link: http:\/\/www.worldcampus.psu.edu\/gep?cm_mmc=GEOSPATIAL+ED+13-14-_-MOOC_2-_-Online%3ABanner%3AOther-_-GEP+Tracking+URL+(ONLNBO16463)\" href=\"http:\/\/www.worldcampus.psu.edu\/gep?cm_mmc=GEOSPATIAL+ED+13-14-_-MOOC_2-_-Online%3ABanner%3AOther-_-GEP+Tracking+URL+(ONLNBO16463)\">online courses<\/a> that we offer at Penn State.<br><span id=\"_wysihtml5-undo\" class=\"_wysihtml5-temp\"><\/span>",
    "links": {}
}