{"id":1162,"shortName":"spobuildaerodynamics","name":"Sports and Building Aerodynamics","language":"en","shortDescription":"Have we reached the boundaries of what can be achieved in sports and building design? The answer is definitely “NO”. This course explains basic aspects of bluff body aerodynamics, wind tunnel testing and Computational Fluid Dynamics (CFD) simulations with application to sports and building aerodynamics. It is intended for anyone with a strong interest in these topics. Key fields addressed are urban physics, wind engineering and sports engineering. ","aboutTheCourse":"Can\nthe present outstanding records in cycling team time trials be\nfurther improved? Can the present world and Olympic records in\nathletics disciplines such as the 100 m sprint be advanced? This\ncourse provides the answer to these questions. It shows that\naerodynamic processes in sports and around buildings are very complex\nand that many misconceptions exist. These misconceptions are caused\nby the often counter-intuitive flow physics. Interestingly, the same\ncounter-intuitive flow physics govern the misconceptions in both\nsports and building aerodynamics. The insights from this course will\nhelp you to understand and improve the performance of top athletes\nand of modern building design. <br><br>In\n2013, team Orica-Green Edge set the fastest-ever average speed for a\nTour de France team time trial, with 57.8 km\/h over a distance of 25\nkm, beating team Omega-Pharma Quick-Step by a mere 0.75 s. At the\nsubsequent 2013 UCI Road World Championships, the latter team beat\nthe former by only 0.88 s. Clearly, even minor aerodynamic\nimprovements can be decisive in these prestigious races. And,\nsurprisingly, up to now, the optimum aerodynamic setting for a team\ntime trial has not yet been explored.<br><br><p>\nRecords\nin athletics races such as the 100 m sprint, the 110 m hurdles and\nthe long jump are only validated by the IAAF (International\nAssociation of Athletics Federations) when the tail wind does not exceed\n2 m\/s. Most world and Olympic records have been established at tail\nwinds close to 2 m\/s. Clearly, local aerodynamic effects can be\ndecisive in establishing new records. Also here, the optimum\naerodynamic setting has not yet been explored.<\/p>\n<p>\nNew\nand prestigious building projects are realized in different parts of\nthe world. Some of them feature the integration of wind energy\nsystems in the building design. Also here, aerodynamic misconceptions\ncan lead to suboptimal performance. \n<\/p>\n<p>\nThe\ncourse starts with a brief recapitulation of the basic aspects of\nfluid flow: statics, kinematics, dynamics, flow regimes and boundary\nlayers, including the atmospheric boundary layer in which sports and\nbuilding aerodynamics take place. Next, the main aspects of the\naerodynamic analysis techniques of wind tunnel testing and\nComputational Fluid Dynamics (CFD) simulations are outlined. Tips and\ntricks for wind tunnel testing and CFD simulations are given. This\nknowledge provides the basis for the course parts on building\naerodynamics, 100 m sprint aerodynamics and cycling aerodynamics,\nwhere some surprising and sometimes spectacular results will be\nshown.<\/p>","targetAudience":3,"courseSyllabus":"<p>\nThis\nis a six-week course with the following contents: \n<\/p>\n<p><b>Week\n1:<\/b>&nbsp;<b>Basic\naspects of fluid flow <\/b>\n<\/p>\n<ol><li>Fluid properties - part 1 (velocity, pressure, temperature)<\/li><li>Fluid properties - part 2 (density)<\/li><li>Fluid properties - part 3 (viscosity)<\/li><li>Flow properties - part 1<br><\/li><li>Flow properties - part 2<br><\/li><li>Fluid statics, kinematics, dynamics<br><\/li><li>Boundary layers - part 1<br><\/li><li>Boundary layers - part 2<\/li><li>Boundary layers - part 3<br><\/li><li>The atmospheric boundary layer<\/li><\/ol><p>\n\n<b>Week\n2: &nbsp;Wind-tunnel testing<\/b><\/p>\n<ol><li>Why wind-tunnel testing?<br><\/li><li>Wind-tunnel types and applications<br><\/li><li>The atmospheric boundary layer wind tunnel<br><\/li><li>Wind-tunnel components<br><\/li><li>Measurements and flow visualization<br><\/li><li>Similarity and flow quality<\/li><li>Best practice guidelines\t<\/li><\/ol><p>\n<b>Week\n3: Computational Fluid Dynamics<\/b><\/p>\n\n\n<ol><li>Computational\nFluid Dynamics: what, why and how? \n\n\n\n<\/li><li>Approximate\nforms of the Navier-Stokes\nequations\n\n\n\n<\/li><li>Turbulence\nmodeling\n\n\n\n<\/li><li>Some\naspects of discretization\n\n\n\n<\/li><li>Near-wall\nmodeling\n\n\n\n<\/li><li><span>Errors\nand uncertainty, verification and validation<br>\n<\/span>\n\n<\/li><li>Best\npractice guidelines\n\n\n\n<\/li><li>Computational\nWind\nEngineering – Part 1\n\n\n\n<\/li><li>Computational\nWind Engineering – Part 2<\/li><\/ol>\n\n<p>\n<b>Week\n4: &nbsp;Building aerodynamics<\/b><\/p>\n\n\n<ol><li>Wind\nflow around buildings – part 1\n\n\n\n<\/li><li>Wind\nflow around buildings – part 2\n\n\n\n<\/li><li>Pedestrian-level\nwind conditions around buildings – part 1\n\n\n\n<\/li><li>Pedestrian-level\nwind conditions around buildings – part 2\n\n\n\n<\/li><li>Pedestrian-level\nwind conditions around buildings – part 3\n\n\n\n<\/li><li>Natural\nventilation of buildings\n\n\n\n<\/li><li><span>Wind-driven\nrain on building facades – part 1<br>\n<\/span>\n\n<\/li><li>Wind-driven\nrain on building facades – part 2\n\n\n\n<\/li><li><span>Wind\nenergy in the built environment – part 1<br>\n<\/span>\n\n<\/li><li>Wind\nenergy in the built environment – part 2<\/li><\/ol>\n\n<p>\n\n<b>Week\n5: 100 m sprint aerodynamics<\/b><\/p>\n<ol><li>Why study sprint aerodynamics?<br><\/li><li>Mathematical-physical model of running<br><\/li><li>Wind effects<br><\/li><li>Altitude effects<br><\/li><li>Stadium aerodynamics and sprint records<br><\/li><li>Interview with a professional athletics coach<br><\/li><\/ol><p>\n\n<b>Week\n6:&nbsp; Cycling aerodynamics<\/b><\/p>\n\n\n<ol><li>Why\nstudy cycling aerodynamics?\n\n\n\n<\/li><li><span>Wind-tunnel\ntesting for a single cyclist – Part 1<br>\n<\/span>\n\n<\/li><li>Wind-tunnel\ntesting for a single cyclist – Part 2\n\n\n\n<\/li><li><span>CFD\nsimulations for a single cyclist<br>\n<\/span>\n\n<\/li><li>Aerodynamics\nof two drafting cyclists\n\n\n\n<\/li><li>Aerodynamics\nof drafting cyclist groups\n\n\n\n<\/li><li>Aerodynamics of car-cyclist combinations<br><\/li><li>Interview&nbsp; with professional cycling coaches from teams Belkin and RaboLiv<br><\/li><\/ol><br>","courseFormat":"<ul><li>\n\tThe course consists of 6 weeks. Every week consists of a series of short lecture videos (called modules) of about 8-15 minutes each. Every modules will start with a short question that will be answered later in the module based on the newly acquired knowledge. <\/li><li>Reading assignments are provided for every week.<\/li><li>Forum discussions.<\/li><li>Main assignment which is an evaluation of a published scientific paper on wind-tunnel testing and\/or CFD for Sports and\/or Building Aerodynamics.<\/li><li>Final exam (multiple choice, online).<\/li><\/ul>","suggestedReadings":"<p>\nWe have developed\nthe course to be to a very large degree self-contained. <\/p>","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"<p>\nThe\nfirst three parts of this course assume an overall high-school level\nknowledge of mathematics and physics (fluid mechanics), although a\nmore advanced level of mathematics is recommended for the parts on\nthe approximate forms of the governing equations of fluid flow.\nHowever, this should not deter other participants from following the\ncourse. \n<\/p>\n<p>\nThe\nlast three parts of the course assume a lower degree of scientific\nknowledge and are geared toward a more general audience. These parts\nare explicitly intended at the widest possible audience. Again, the\nfull benefit from the course will be obtained by participants with a\nbackground in mathematics and physics (fluid mechanics). \n<\/p>","links":{}}