{"id":48,"shortName":"friendsmoneybytes","name":"Networks: Friends, Money, and Bytes","language":"en","shortDescription":"A course driven by 20 practical questions about wireless, web, and the Internet, about how products from companies like Apple, Google, Facebook, Netflix, Amazon, Ericsson, HP, Skype and AT&T work.\n\nIn this offering, we will cover 7 of the 20 questions, and you will have the opportunity to personalize your own learning experience by choosing which of the versions suits you best.","aboutTheCourse":"You pick up your iPhone while waiting in line at a coffee shop. You google a not-so-famous actor, get linked to a Wikipedia entry listing his recent movies and popular YouTube clips of several of them. You check out user reviews on Amazon and pick one,\ndownload that movie on BitTorrent or stream that in Netflix. But suddenly the WiFi logo on your phone is gone and you're on 3G. Video quality starts to degrade, but you don't know if it's the server getting crowded or the Internet is congested somewhere.\nIn any case, it costs you $10 per Gigabyte, and you decide to stop watching the movie, and instead multitask between sending tweets and calling your friend on Skype, while songs stream from iCloud to your phone. You're happy with the call quality, but\nget a little irritated when you see there're no new followers on Twitter. You may wonder how they all kind of work, and why sometimes they don't. Take a look at the list of 20 questions below. Each question is selected not just for its relevance to our\ndaily lives, but also for the core concepts in the field of networking illustrated by its answers. This course is about formulating and answering some of these 20 questions.\n<br>","targetAudience":0,"courseSyllabus":"<ol>\n    <li>What makes CDMA work for my smartphone?<\/li>\n    <li>How does Google rank webpages?<\/li>\n    <li>How does Netflix recommend movies?<\/li>\n    <li>Why do AT&amp;T and Verizon Wireless charge me $10 a GB?<\/li>\n    <li>How does traffic get through the Internet?<\/li>\n    <li>Why doesn't the Internet collapse under congestion?<\/li>\n    <li>Why is WiFi faster at home than at a hotspot?<\/li>\n<\/ol>","courseFormat":"2 lectures per week, each lecture about 75 minutes, formulating and answering one of the 20 questions. Weekly assignment, midterm, final, blogging and wiki-creation on <a href=\"http:\/\/www.network20q.com\">www.network20q.com<\/a>","suggestedReadings":"M. Chiang, <a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&amp;AFID=301076&amp;ADID=1088031&amp;SID=friendsmoneybytes&amp;isbn_ean=9781107024946\">Networked Life: 20 Questions and Answers<\/a>\n<img width=\"1\" src=\"http:\/\/www.assoc-amazon.com\/e\/ir?t=coursera-20&amp;l=as2&amp;o=1&amp;a=1107024943\" height=\"1\" style=\"border: none !important; margin: 0px !important;\">, Cambridge University Press, August 2012.&nbsp;\n<br>\n<br>C. Brinton and M. Chiang, <a href=\"http:\/\/www.amazon.com\/Networks-Illustrated-Principles-Without-Calculus\/dp\/0989543005\/ref=tmm_pap_title_0?ie=UTF8&amp;qid=1392402415&amp;sr=8-1\">Networks Illustrated: 8 Principles Without Calculus<\/a>\n<img width=\"1\" src=\"http:\/\/www.assoc-amazon.com\/e\/ir?t=coursera-20&amp;l=as2&amp;o=1&amp;a=1107024943\" height=\"1\" style=\"border: none !important; margin: 0px !important;\">, EdWiser Scholastic Press, June 2013.&nbsp;","instructor":"Mung Chiang","estimatedClassWorkload":"3-5 hours\/week","recommendedBackground":"No prerequisites.\n<br>","links":{}}