{"id":879,"shortName":"ntusym","name":"An Exploration of Symmetry (Eligible for NTU Credit)","language":"en","previewLink":"https:\/\/class.coursera.org\/ntusym-004\/lecture\/preview","shortDescription":"[IF YOU ARE LOOKING FOR THE NO-CREDIT ON-DEMAND VERSION OF THIS COURSE PLEASE GO TO https:\/\/www.coursera.org\/learn\/symmetry].\n\nLearn how to identify symmetrical forms and appreciate their importance in nature, art, architecture, crystallography and technology.  Understand symmetry quantitatively, recognize its role in beauty and design, and appreciate its function in our everyday life. The level of difficulty is intermediate-to-hard with a workload is 7-10 hrs\/week.  This MOOC is for credit and students who obtain a Verified Certificate with an overall mark of more than 60% earn 3 Academic Units (AU) that can be directed towards either an Unrestricted Elective (UE) or General Elective (GE-STS) subject at NTU.  The usual NTU examination procedure requires student identification through webcam plus keystroke patterning for each assignment submission with a no-tolerance policy towards cheating (https:\/\/www.coursera.org\/about\/terms\/honorcode and http:\/\/www.ntu.edu.sg\/SAO\/Pages\/HonourCode.aspx).  Students who are found to cheat, tamper with or falsify grades, or collude on assignments will be denied credits. It is not necessary to be enrolled at NTU to be awarded 3 AU and once received the AU remain valid 3 years. Because this is a for-credit course students must join the Signature Track stream within the first 2 week add-drop period (up to 21 August 2015, 2359 hrs) in accordance with NTU rules.","aboutTheCourse":"&nbsp;<br>Nanyang Technological University\nand Coursera are proud to offer Beauty, Form &amp; Function: An Exploration of\nSymmetry that caters to both non-specialists via a <strong>non-academic credit on-demand version<\/strong> (<a target=\"_blank\" href=\"https:\/\/webmail.ntu.edu.sg\/owa\/redir.aspx?C=qXFzMQlNjk2rDeiYsyjF3DSxSJUOk9IIIoPcPB3lFIXM756UNx5Lrvit9qv3-I2hyn9nyqeU3kI.&amp;URL=https%3a%2f%2fwww.coursera.org%2flearn%2fsymmetry%2f\">https:\/\/www.coursera.org\/learn\/symmetry<\/a>) and specialists through this <strong>academic credit fixed-session version<\/strong>.&nbsp; Below can be found the:<br><strong><br>Syllabus • Grading Scheme • Recommended Readings • <br><\/strong><p><strong>Required Background <\/strong><strong><strong> • <\/strong>Essential Resources<\/strong><strong><strong> • <\/strong> Student Responsibility • FAQs<\/strong><br><\/p><p>Symmetry is everywhere. In the\ngrand scheme of things it is the blueprint by which the universe operates. We\nsee symmetry in nature, art, architecture, science and engineering. This course\nexplores the Beauty, Form and Function of Symmetry in common objects, then\nprogresses to investigate tiling and tessellation, gems and crystals, and\nfinally its indispensable role in technology.&nbsp;\nSymmetry and asymmetry are also key factors that ensure the successful\nreproduction of plants and animals. For example, the bilateral symmetry of\norchids is widely admired and this geometry is essential for insects to pollinate\nthese flowers.<\/p><p>Duration: 8 weeks<\/p><p>Time Commitment: 7-10 hours per\nweek<\/p><p>Target Group: Scientists and\nEngineers (current and prospective NTU students)<\/p><p>Recognition: Verified Certificate through Signature Track enrollment<\/p><p>NTU Academic Units: Verified\nCertificate Students earn 3 Academic Units<\/p><p>NTU Course Type:&nbsp; Unrestricted Elective or General Elective<\/p><p>This course gives you the means to address several fundamental questions.<\/p><p><\/p><ul><li>What tags do we recognize in decorative arrangements?<br><\/li><li>What guidelines shape the patterns in the world around us?<br><\/li><li>What functions do these symmetrical patterns serve?<\/li><li>How are drug and materials design engineered through\natomic scale symmetry?<br><\/li><li>How is the internal\narrangement of atoms reflected by crystal faceting?<\/li><li>How does symmetry manipulation create polytypes, polymorphs and polysomes?<\/li><\/ul><p><\/p><p><\/p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p><p>To amplify these ideas, you will\nundertake field-exercises and be introduced to specialists - botanists,\nartists, geomancers, historians, scientists and engineers - that work with\nsymmetry, and who will provide their personal insights into its ‘magic’ and\nimpact on their disciplines.<\/p><p>\n\n\n\n<\/p><p>The option of earning AUs is open\nto all students. It is not necessary to be already enrolled at NTU.&nbsp; Once earned, the AUs remain valid for 3\nyears.<\/p><p><b>Course Difficulty<\/b><\/p>\n\n<p>This is a challenging course with 65% of students rating the material\n as Difficult to Very Difficult, but many find the subject matter \nstimulating.<\/p><p><img src=\"https:\/\/d396qusza40orc.cloudfront.net\/ntusym\/Announcements\/CourseDifficultyGraph_v1.png\" height=\"198\" width=\"512\">\n<\/p>","targetAudience":1,"courseSyllabus":"<p>The course content is\nreleased in two week blocks and consists of approximately 1 hr of\nlectures and tutorials per week. There are specific windows for uploading\nhomework and undertaking peer-to-peer marking. These are detailed in the downloadable course timetable.<br><\/p><p><strong>Part I: Basic Concepts of Symmetry<\/strong><\/p><p><\/p><ul><li><strong>Week 1: <\/strong>‘A World of Symmetry’ will refresh your intuitive\nappreciation of symmetry in furniture, botany and common objects and introduce\nthe mathematics of point symmetry.<br><br><\/li><li><strong>Week 2:<\/strong> ‘Tiling and the Asymmetric Unit’ begins by examining tessellations\nin architecture that will illustrate key concepts in plane symmetry including\nthe asymmetric unit.&nbsp; ‘Chirality’ discusses this key concept in symmetry and its impact on drug design\nand delivery.<\/li><\/ul><p><\/p><p><strong>Part II: Plane (2D) and Space (3D)\nSymmetry<\/strong><\/p><p><\/p><ul><li><strong>Week 3: <\/strong>‘Escher and Graphic Design’ introduces symmetry operations in 2 dimensions\nand the difference between ‘primitive’ and ‘centered’ unit cells are illustrated\nusing the art of Escher. ‘Nets’ examines the role of symmetry in Islamic\narchitecture and history in the context of regular networks.<br><br><\/li><li><strong>Week\n4: <\/strong>‘Space Symmetry’ expands the symmetry operations to include 3 dimensional\nmotion.&nbsp; The methodology for reading and\nusing the symmetry diagrams of the 17 plane groups and 230 space groups is\nintroduced.<\/li><\/ul><p><\/p><p><strong>Part III: Symmetry in Crystals<\/strong><\/p><p><\/p><ul><li><strong>Week 5: <\/strong>‘Crystal Forms and the Beauty of Minerals’ looks the external shape of\nmineral crystals and we learn about crystal power by visiting a geomancer. The manner in which crystal faceting\nreflects the internal atomic arrangements is described. <strong><\/strong>‘Planes, Directions and Unit Cell’ introduces the mathematics\nfor describing perfect crystal structures. <br><br><\/li><li><strong>Week 6: <\/strong>‘Platonic Solids and Atomic Bonding’\nshows that regular geometrical shapes can be derived from folding plane \nnets into polyhedra that often describe atomic clustering and also the appearance of defects or\nasymmetry that are important aesthetically and technologically.&nbsp; A laboratory tour will show the experiments\nused to extract crystallographic information.<\/li><\/ul><p><\/p><p><strong>Part IV: Symmetry and Technology<\/strong><\/p><p><\/p><ul><li><strong>Week 7: <\/strong>‘Tailoring Crystals for Technology’ brings together chemistry and\ncrystallography, shows how they are inter-related, and how they are adapted to\nengineer designer technological materials.&nbsp;\nA clean room fabrication facility provides real world context for\nexploiting chemically- and physically-driven symmetry.<br><br><\/li><li><strong>Week 8:&nbsp;<\/strong> ‘Looking for Broken Symmetry - Atomic Scale Imaging’ looks beyond 3 dimensional symmetry to higher dimensional\nrepetitions found in incommensurate crystal structures. ‘Deceptive Perception - Symmetry &amp; Furniture Design’ returns to the everyday appearance of symmetry that can now be\nexplored analytically.<\/li><\/ul><p><\/p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAt the conclusion of this study, you will\npossess the tools and the motivation to look at symmetry with even greater\ndelight, wonder and appreciation!<br><\/p>","courseFormat":"<p>The class is divided into 4 major Parts and will consist of:<\/p><ul><li>Lecture\nvideos about 9 - 15 minutes in length. Most lectures contain 1-2 in video quiz\nquestions for self-assessment. These are not graded.<br><\/li><li>Multiple Choice Question (MCQ) Quizzes at the\nend of each&nbsp;Part which will be graded.&nbsp; Model MCQ and detailed answers are available for revision.<br><\/li><li>3 open - ended assignments with peer-to-peer assessment.&nbsp; To guide you in this homework, student focus-group recordings show how undergraduates tackled these assignments.<br><\/li><li>2 learning logs.&nbsp; These logs are designed to help you reflect on what you have learned and share with fellow students.<br><\/li><\/ul><div><div><b>Assessment:<\/b><\/div><ul><li>4 MCQ quizzes&nbsp; (30% of total grade)<\/li><li>3 peer-graded assignments (62%)<\/li><li>2 learning logs (8%)<\/li><\/ul><div>The pass mark is &gt;= 60% of the maximum possible score averaged&nbsp;across all graded assignments.<br><br><strong>Student Responsibility<\/strong><br><br>\n\n<p>It is the\nresponsibility of students to ensure assignments are submitted on time. Note\nthat times are for Singapore and we are unable to entertain late submission.<\/p>\n\n<ul><li>Use the international clock\n     provided near the top of the navigation menu to check the time difference\n     with your locality.<\/li><li>Download the course\n     timetable and print it out to ensure you do not miss homework deadlines.<\/li><li>Do not leave your homework\n     until the last minute.<\/li><li>For the graded multiple\n     choice question (MCQ) sets either 1 or 2&nbsp;attempts are allowed. When 2 attempts are made the highest mark is\n     taken towards grading.<\/li><li>For peer-to-peer assignments\n     submit 1-2 days early in case of internet failures.<\/li><li>While homework submission is\n     not compulsory it is very difficult to pass this course without attempting\n     every assignment.<\/li><li><span>For <b>SIGNATURE TRACK\n     STUDENTS<\/b> at least 8 out of the 9 assignments must be submitted and authenticated to gain\n     3 Academic Units (AU).<\/span><\/li><li><span>For <b>SIGNATURE TRACK\n     STUDENTS<\/b> authentication through a webcam plus keystroke recognition is\n     always required for the assignment to be recognized.&nbsp; ALWAYS&nbsp;\n     USE A COMPUTER WITH WEBCAM.<\/span><\/li><li><span>For <b>SIGNATURE TRACK\n     STUDENTS<\/b> a live portrait captured by webcam is compulsory for all submitted&nbsp;assignments.&nbsp;\n     Capturing student ID cards, passport photos, drivers licences etc is not\n     acceptable.<\/span><\/li><li><span>All <b>NTU MATRICULATED\n     SIGNATURE TRACK STUDENTS<\/b> must enrol using their NTU email to avoid\n     paying the course fee and allow transfer of academic credits.&nbsp;<\/span>NTU students that enrol with Coursera using a non-NTU email must change it to their university email account.&nbsp;Please follow the steps at&nbsp;<a href=\"https:\/\/courserahelp.zendesk.com\/hc\/en-us\/articles\/201208129-Account-Settings\">https:\/\/courserahelp.zendesk.com\/hc\/en-us\/articles\/201208129-Account-Settings<\/a>&nbsp;to change the email address.<\/li><li><b>SIGNATURE TRACK\n     AUTHENTICATION IS&nbsp; NOT SUPPORTED ON MOBILE DEVICES<\/b> such as iPhone and iPads.\n     Always submit your homework from a desktop or laptop computer to avoid any\n     problems with authentication. <\/li><li><b>CHEATING AND UNETHICAL BEHAVIOUR ARE UNACCEPTABLE<\/b><span> and students must comply with the Coursera Honour\nCode (<a title=\"Link: https:\/\/www.coursera.org\/about\/terms\/honorcode\" href=\"https:\/\/www.coursera.org\/about\/terms\/honorcode\">https:\/\/www.coursera.org\/about\/terms\/honorcode<\/a>)\nand NTU Examination Policy (<a title=\"Link: http:\/\/www.ntu.edu.sg\/Students\/Undergraduate\/AcademicServices\/Examination\/pages\/instructionstoexamcand.aspx\" href=\"http:\/\/www.ntu.edu.sg\/Students\/Undergraduate\/AcademicServices\/Examination\/pages\/instructionstoexamcand.aspx\">http:\/\/www.ntu.edu.sg\/Students\/Undergraduate\/AcademicServices\/Examination\/pages\/instructionstoexamcand.aspx<\/a>).&nbsp; Failure to abide by these requirements will, at\nminimum, lead to loss of Academic Units and exclusion from all NTU MOOC, with egregious\ncases resulting in suspension or expulsion from <\/span>NTU.<\/li><li><span>For peer-to-peer evaluated\n     assignments<b> PLAGIARISM WILL NOT BE TOLERATED<\/b> and whether detected\n     by students or the course manager will automatically lead to a score of\n     zero for that assignment.<\/span><\/li><li>If you are sharing a\n     computer with other students, make sure you log out to avoid your homework\n     and grades being over-written on the Coursera server by another student's\n     uploads and answers.&nbsp; Once lost, your work cannot be restored.<\/li><li><span>Matriculated NTU students\n     must enrol using the secure website&nbsp;<u><a href=\"http:\/\/teamsites.ntu.edu.sg\/CITS\/LearningSolutions\/Symmetry\/default.aspx\">http:\/\/teamsites.ntu.edu.sg\/CITS\/LearningSolutions\/Symmetry\/default.aspx<\/a><\/u>&nbsp;and their NTU email account to ensure seamless transfer of Academic Units\n     to their degree transcript.<\/span><\/li><li>Peer-to-peer marked\n     assignments will gain a score that is the average taken from either 2 or 5 student\n     assessors.&nbsp; It is essential that students mark carefully against the\n     simple rubrics provided.<\/li><\/ul>\n\n<\/div><\/div>","suggestedReadings":"<p><span>In a topic\nas broad as <i>Symmetry<\/i> no single text can\ndo justice to the field.&nbsp; Therefore, the\nnotes and supplementary materials provided in this course strive to be\nself-contained.&nbsp; There are also many web\nresources to access.<\/span><\/p>\n\n<p>Video book reviews are provided to get a sense of the breadth of\npublications available.\n\n<\/p><p><span>Quite academic treatments can be found in the research papers of the Open Access\njournal Symmetry. <a title=\"Link: http:\/\/www.mdpi.com\/journal\/symmetry\" href=\"http:\/\/www.mdpi.com\/journal\/symmetry\">http:\/\/www.mdpi.com\/journal\/symmetry<\/a>\n<\/span>\n\n<\/p><p>\n\n<\/p><p>For those\nwho wish to study conventionally the following texts, that are widely available in\npublic libraries, are recommended.<br><\/p>\n\n<em>Visual Symmetry<\/em> by Magdolna Hargittai and István\nHargittai <br>ISBN 978-981-283-531-4\n\n<p>Symmetry is as simple or as\ncomplicated as we are ready to absorb it in everything around us. From flowers\nto bridges, buildings, coke machines, and snowflakes; from molecules to\nwalnuts, fences, pine cones, and sunflowers; from music to children's drawings;\nfrom hubcaps to bank logos, propellers, wallpaper decorations, and pavements,\nwe recognize it if we walk around with open eyes and an open mind. This book\nprovides aesthetic pleasure and covert education, immersing the reader in both\nthe familiar and the unknown and leading always to unexpected discoveries.&nbsp; The authors, world-renowned\nscientists, have already produced a dozen books on symmetry for professionals\nas well as lay persons, for grownups as well as children, in English, Russian,\nGerman, Hungarian, and Swedish languages. They provide this attractive account\nof symmetry in few words and many, as many as 650, images in full colour from\nthe most diverse corners of our globe. An encounter with this book will open up\na whole new experience for the reader, who will never look at the world with\nthe same eyes as before.<\/p>\n\n<em>Crystals\nand Crystal Structures<\/em> by<b> <\/b>Richard J. D. Tilley<br>ISBN: 978-0-470-01820-0\n\n<p>&nbsp;Crystals and Crystal Structures is an\nintroductory text for students and others who need to understand the subject\nwithout necessarily becoming crystallographers. Using the book will enable\nstudents to read scientific papers and articles describing a crystal structure\nor use crystallographic databases with confidence and understanding.&nbsp; Reflecting the interdisciplinary nature of\nthe subject the book includes a variety of applications as diverse as the\nrelationship between physical properties and symmetry, and molecular and\nprotein crystallography. As well as covering the basics the book contains an\nintroduction to areas of crystallography, such as modulated structures and\nquasicrystals, and protein crystallography, which are the subject of important\nand active research.<br><\/p>","estimatedClassWorkload":"4-10 hours\/week","recommendedBackground":"<p><\/p>Mathematics at GCE\nAdvanced Level or International Baccalaureate Diploma or equivalent to junior\nhigh school.&nbsp;In addition, high school or undergraduate (freshman) chemistry is very helpful.<br><p><b>.<br><\/b><\/p><p><b>Essential Resources Required<\/b><\/p>\n\n<p>This is an undiluted university\ncourse and resources equivalent to an undergraduate student at NTU are\nessential to complete these studies.&nbsp;\nThese include:<\/p>\n\n<p><\/p><ul><li><strong>Access to a Windows or Apple\npersonal computer:<\/strong>&nbsp; While lectures can be\nviewed on tablets and smartphones it is not possible to run the specialized\nprograms on these architectures.&nbsp; There can\nbe no troubleshooting of compatibility problems.<br><br><\/li><li><strong>Access to a smartphone with\ncamera or a digital camera:<\/strong>&nbsp; The\nfield-work exercises involve photographing objects in your environment and\nanalysing their symmetry.&nbsp; Submission of these\ngraded exercises is essential to obtain course recognition.<br><br><\/li><li><strong>Access to Microsoft Office or\nOpen Office:<\/strong> Homework must be prepared in PowerPoint or Word using the pptx and docx templates provided, converted to a\npdf and uploaded. If you have have an older version of Powerpoint and Word you can convert the pptx and docx files to doc and ppt files at <a href=\"http:\/\/www.convertfiles.com\/convert\/document\/DOCX-to-DOC.html\" target=\"_blank\">http:\/\/www.convertfiles.com\/convert\/document\/DOCX-to-DOC.html<\/a> and <a href=\"http:\/\/www.convertfiles.com\/convert\/document\/PPTX-to-PPT.html\" target=\"_blank\">http:\/\/www.convertfiles.com\/convert\/document\/PPTX-to-PPT.html<\/a>.\n<br><\/li><\/ul><p><\/p><p><\/p><p>\n\n<\/p>","links":{}}