{
    "id": 2822,
    "shortName": "matlab",
    "name": "Introduction to Programming with MATLAB",
    "language": "en",
    "shortDescription": "This course teaches computer programming to those with little to no previous experience. It uses the programming system and language called MATLAB to do so because it is easy to learn, versatile and very useful for engineers and other professionals.",
    "aboutTheCourse": "<div><div>MATLAB is a special-purpose language that is an excellent choice for writing moderate-size programs that solve problems involving the manipulation of numbers. The design of the language makes it possible to write a powerful program in a few lines. The problems may be relatively complex, while the MATLAB programs that solve them are relatively simple: relative, that is, to the equivalent program written in a general-purpose language, such as C++ or Java. As a result, MATLAB is being used in a wide variety of domains from the natural sciences through all disciplines of engineering to finance and beyond, and it is heavily used in industry. Hence, a solid background in MATLAB is an indispensable skill in today’s job market.<\/div><div><br><\/div><div>Nevertheless, this course is not a MATLAB tutorial. It is an introductory programming course that happens to use MATLAB to illustrate general concepts in computer science and programming.&nbsp;<\/div><div><br><\/div><div>Students who successfully complete this course will:<\/div><div><ul><li>become familiar with general concepts in computer science<br><\/li><li>gain an understanding of the general concepts of programming<br><\/li><li>obtain a solid foundation in the use of MATLAB<br><\/li><\/ul><\/div><div>\t<\/div><div>This is an introductory college-level course in computer science for engineering and science students. However, it is also suitable for high school students who are interested in programming. The material assumes no background in mathematics beyond the standard high school curriculum. Students taking the course will get a MATLAB license free of charge for a three-month period.&nbsp;<br><\/div><\/div>",
    "targetAudience": 0,
    "courseSyllabus": "<p>The course is divided into the following 8 weekly modules:<\/p>\n\n<p>Week 1: Introduction to MATLAB<\/p>\n\n<p>Week 2: Matrices and Operators<\/p>\n\n<p>Week 3: Functions<\/p>\n\n<p>Week 4: Programmer’s Toolbox<\/p>\n\n<p>Week 5: Selection<\/p>\n\n<p>Week 6: Loops<\/p>\n\n<p>Week 7: Data Types<\/p>\n\n<p>Week 8: File Input\/Output<\/p>",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": "Facility with basic high school math or equivalent is recommended.",
    "links": {

    }
}