{
    "id": 2590,
    "shortName": "postharvestloss",
    "name": "Global Postharvest Loss Prevention: Fundamentals, Technologies, and Actors",
    "language": "en",
    "shortDescription": "This course provides an overview of the issue of postharvest loss of grains by exploring essential physical, technical, and social dimensions of postharvest supply chains and loss prevention methods globally.",
    "aboutTheCourse": "<img alt=\"\" style=\"float:right; margin:0 0 0 5px; width:270px;\" src=\"https:\/\/d396qusza40orc.cloudfront.net\/postharvestloss\/images\/pharvest1.jpg\">\n<p>Each year, estimates suggest that <strong>1\/3 of all food produced is lost or wasted<\/strong>, making postharvest loss a critical global <strong>food security and sustainability issue<\/strong> of today. Key knowledge areas are presented including:<\/p>\n<ul>\n<li>An overview of postharvest loss<\/li>\n<li>Supply chain activities such as harvesting, drying, and storage<\/li>\n<li>Economics and markets<\/li>\n<li>An introduction to the network of actors working in this field<\/li>\n<\/ul>\n\n<p>We face the immense challenge of feeding over 9 billion people by the year 2050. To meet these demands, <strong>yields will have to more than double<\/strong> using the same amount of natural resources. In recent years, postharvest loss has been recognized by major institutions including the US government, the United Nations, the CGIAR Research Consortium, and several others as a <strong>significant opportunity to impact food security and improve livelihoods<\/strong>. Despite this increased attention, a lack of knowledge, technical capacity, and resources remain obstacles for stakeholders worldwide to act on these issues. This course will, for the first time, provide you as professionals, practitioners, and students, with a <strong>comprehensive introduction to postharvest loss processes<\/strong> and begin building capacity for loss prevention worldwide.<\/p>",
    "targetAudience": 3,
    "courseSyllabus": "<p>This course will be broken up into 4 modules covering the following topics:<\/p>\n\n<p><strong>Week 1: Problem–Global Postharvest Loss<\/strong><\/p>\n<p>This module will provide an overview of the issue of postharvest loss (PHL) and how this impacts global food security and sustainability. It will also define the postharvest supply chain. <\/p>\n\n<p><img src=\"https:\/\/d396qusza40orc.cloudfront.net\/postharvestloss\/images\/pharvest2.jpg\" style=\"float:left; margin:0 8px 0 0; width:270px;\" alt=\"\"><\/p>\n\n<p><strong>Week 2: Causes–Major Causes &amp; Encounters for PHL<\/strong><\/p>\n<p>This module will introduce technical, social, and economic factors and situations that lead to postharvest losses. Harvesting, drying, and storage phases will be specifically covered as stages that are both vital in the grain supply chain and in which a great deal of postharvest losses are experienced.<\/p>\n\n<p><strong>Week 3: Solutions–A Prevention Framework for PHL<\/strong><\/p>\n<p>This module will introduce a conceptual framework for how losses can be prevented. Theories, methods, and case examples on prevention will be covered.<\/p>\n\n<p><strong>Week 4: Actors–A Network of Global Stakeholders<\/strong><\/p>\n<p>This module will explore how the international community is responding to the issue of postharvest loss. It will cover the current state of the postharvest loss prevention field, as well as provide background as to how it developed. Some key projects, initiatives, and approaches will be highlighted. <\/p>",
    "estimatedClassWorkload": "3-5 hours\/week",
    "recommendedBackground": "<p>No specific background is required. An interest in food security issues, sustainability, global agriculture, and international development is helpful.<\/p>",
    "links": {

    }
}