{
    "id": 80,
    "shortName": "mentalhealth",
    "name": "The Social Context of Mental Health and Illness",
    "language": "en",
    "shortDescription": "Learn how social factors promote mental health, influence the onset and course of mental illness, and affect how mental illnesses are diagnosed and treated.",
    "aboutTheCourse": "Mental health and mental illness used to be something that people didn’t\ntalk about, but now it seems every time we open a newspaper we are hearing\nabout the importance of mental health, or the consequences of mental illness.\nAt this point in our history we understand mental illness and mental health\nto be largely influenced by biological factors, specifically, workings\nof the brain. At the same time, we have always known that social factors\nplay a very strong role in promoting mental health and can make big differences\nin who gets mentally ill, who gets treated for mental illness, and how\npeople can achieve good quality of life after a mental health diagnosis.\n<br>\n<br>This course is an opportunity to explore how social practices and ideas\ncontribute to the ways in which society, families and individuals are affected\nby mental health and mental illness. We will look at issues like why some\npeople think mental illness is a myth, how people think about mental health\nand illness in different cultures, who gets mentally ill and why, how families\nare affected by mental illness and what interventions are available to\ntreat mental illness and promote mental health.",
    "targetAudience": 1,
    "courseSyllabus": "<div><strong>Week One:<\/strong> A brief history of madness&nbsp;<\/div>\n<div><strong>Week Two:<\/strong> What is mental health and what causes mental\n    illness?<\/div>\n<div><strong>Week Three:<\/strong> The social context of diagnosis and treatment\n    of mental illnesses<\/div>\n<div><strong>Week Four:<\/strong> Culture, mental health and mental illness<\/div>\n<div><strong>Week Five:<\/strong> Families, caregiving and mental illness<\/div>\n<div><strong>Week Six:<\/strong> Society, communities and mental health<\/div>",
    "estimatedClassWorkload": "5-7 hours\/week",
    "recommendedBackground": "A basic background in introductory psychology is recommended.",
    "links": {

    }
}