{
    "id": 3556,
    "shortName": "whartonfinancees",
    "name": "Introducción a las Finanzas Corporativas",
    "language": "es",
    "shortDescription": "Este curso proporciona una breve introducción a los fundamentos de las finanzas. Puedes aplicar estas habilidades en un reto empresarial real como parte de la Programa Especializado de Fundamentos Empresariales de Wharton.",
    "aboutTheCourse": "<p><b>PARTE DE LA PROGRAMA ESPECIALIZADO DE FUNDAMENTOS EMPRESARIALES DE WHARTON<\/b><\/p><p><a href=\"http:\/\/youtu.be\/Y1UlXveNj_g\">Aquí<\/a> puedes ver como Geoffrey Garrett, Decano de Wharton School, habla sobre la Programa Especializado.<\/p><p>Este curso proporciona el entorno, los conceptos y las herramientas para analizar decisiones financieras basadas en los principios fundamentales la teoría moderna financiera. Aprenderás el lenguaje y los conceptos clave de la financiación y la inversión empresarial incluyendo el cálculo de los valores actuales, la valoración de bonos y acciones, la regla del VAN, medición del riesgo, presupuesto del capital y el modelo de valoración de activos financieros. Al final de este curso, serás capaz de leer, entender y explicar la gestión financiera empresarial y las decisiones de inversión.&nbsp;<\/p><p>Completa este curso como parte de la Programa Especializado de Fundamentos Empresariales de Wharton, y tendrás la oportunidad de realizar el Proyecto Final y de preparar un análisis estratégico y proponer soluciones a un reto empresarial real de compañías dirigidas por Wharton como Televisa o a un reto al que se enfrente tu propia compañía u organización. Un equipo capacitado de Wharton evaluará los mejores trabajos, y los equipos de liderazgo de Televisa revisarán los proyectos con mayor puntuación elaborados para sus compañías.&nbsp;<\/p><p>Mira este vídeo para aprender más sobre la Serie sobre Fundamentos de Wharton en Coursera:&nbsp;<\/p><p><a href=\"http:\/\/www.youtube.com\/watch?v=SgS3AJCe6i8\">http:\/\/www.youtube.com\/watch?v=SgS3AJCe6i8<\/a><\/p><p>Para obtener más información sobre los cursos online que ofrece Wharton, por favor visita<\/p><p><a href=\"http:\/\/online.wharton.upenn.edu\/\">online.wharton.upenn.edu<\/a><\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<p dir=\"ltr\"><strong>Tema 1: Valor Tiempo del Dinero<\/strong><\/p><ul><li><p dir=\"ltr\">Intuición, herramientas y descuento<\/p><\/li><li><p dir=\"ltr\">Composición<\/p><\/li><li><p dir=\"ltr\">Atajos útiles<\/p><\/li><li><p dir=\"ltr\">Impuestos<\/p><\/li><li><p dir=\"ltr\">Inflación<\/p><\/li><\/ul><p dir=\"ltr\"><strong>Tema 2: Tipos de Interés<\/strong><\/p><ul><li><p dir=\"ltr\">APR y TAE<\/p><\/li><li><p dir=\"ltr\">Estructura de Plazos<\/p><\/li><\/ul><p dir=\"ltr\"><strong>Tema 3: Análisis de Descuento de Flujos de Caja (DCF)<\/strong><\/p><ul><li><p dir=\"ltr\">Toma de Decisiones<\/p><\/li><li><p dir=\"ltr\">Flujo de Caja Libre<\/p><\/li><li><p dir=\"ltr\">Previsión de Variables<\/p><\/li><li><p dir=\"ltr\">Previsión de Flujos de Caja Libres<\/p><\/li><li><p dir=\"ltr\">Análisis de Sensibilidad<\/p><\/li><\/ul><p dir=\"ltr\"><strong>Tema 4: Rentabilidad de las Inversiones<\/strong><\/p><ul><li><p dir=\"ltr\">Rentabilidad de las Inversiones<\/p><\/li><\/ul>",
    "estimatedClassWorkload": "6-8 hours\/week",
    "recommendedBackground": "Se aconseja que los alumnos tengan un conocimiento profundo de conceptos matemáticos.\n",
    "links": {

    }
}