{"id":1986,"shortName":"sportsagents","name":"Representing the Professional Athlete","language":"en","shortDescription":"An immersive experience in the world of sports that will take students through the four stages of the professional athlete's career. Utilizing lectures, guest speakers and hypothetical walkthroughs, students will learn how the best sports agents manage each of these four stages.","aboutTheCourse":"This course will provide each student with the skills necessary to guide an athlete through the difficult decisions that can make or lose the athlete millions of dollars, and affect their public image and career. Walking through the four stages of an athlete's career, we will provide a broad scope of the landscape of amateur and professional sports so that you can avoid the pitfalls and traps that so many have fallen into in the past; not to mention, bringing you updates throughout the course regarding the rapidly changing sports world that we live in today.\nAnalyzing the best practices in the management of the superstar athletes with whom Professor Carfagna and his expert guests have worked, we will show you how to manage the career of any professional athlete who might seek your guidance at any stage of his or her professional career.","targetAudience":1,"courseSyllabus":"<b>Week One: Introduction to Agents and The Three U.S. Major Leagues CBAs <\/b><br>An introduction to the duties of an agent; the \"Rep K\" that controls the player-agent relationship; and a comprehensive analysis of the collective bargaining agreements that govern the three major leagues -- including how a professional athlete achieves free agency in each major league. Also, an analysis of how the NFL CBA affected Adrian Peterson and Ray Rice, and what the new policy may hold for the players and owners.<br><br>\n<b>Week Two: Early Stages of Professionalism and Selecting an Agency<\/b><br>How the best high school baseball player in the U.S. in 2013, Clint Frazier, went about selecting his management team; the way Major League Baseball teams handle their minor leaguers; and what it takes for any of them to reach the Majors. In this Lesson, we will also study how an agent can build an agency from the ground up, and represent professional athletes through their progression to their peak earning years. Finally, a look into the beginning of LeBron James’ career with his personal attorney, up to “The Decision.”<br><br>\n<b>Week Three: Representing the Peak Professional Athlete Part I<\/b><br>Protecting the publicity rights of athletes while monetizing and maximizing their brands through product endorsement and license agreements. We will analyze the history of publicity rights and how to market your clients image effectively.<br><br>\n<b>Week Four: Income Representing the Peak Professional Athlete Part II<\/b><br>Rebuilding the reputation of athletes who have damaged their brands. How a financial advisor can help a player manage income streams to maintain their lifestyle post-retirement. Also, we will discuss whether LeBron James made the right long-term branding decision by returning to Cleveland, and where his brand will go from here.<br><br>\n<b>Week Five: Income Protection and Life After Retirement<\/b><br>Protecting an athlete's income through insurance policies; an analysis of the on-going concussion epidemic in contact sports; and how an athlete can best prepare for life after retirement.<br><br><strong><\/strong><strong>Week Six: Life Cycle of Individual Sports, the Longest Career Trajectory Part I<br><\/strong>An introduction to the world of golf and tennis athletes who have enjoyed the longest careers in sports. Insider experts' look into how an athlete can diversify his or her brand. Also, the Commissioner of the LPGA will discuss the ins and outs of the ladies’ tour. <strong><br><br>Week Seven:&nbsp;<\/strong><strong>Life Cycle of Individual Sports, the Longest Career Trajectory Part II<\/strong><strong><br><\/strong>An introduction to the world of golf and tennis athletes who have enjoyed longest careers in sports. Insider experts' look into how an athlete can diversify his or her brand. How an agent can best protect his or her athlete in endorsement agreements through appropriately drafted suitability and morals clauses. <strong><br><br>Week Eight: Representing the Professional Footballer Part I<br><\/strong>An in-depth look into the life of a footballer, from the youth squad to the first team and after retirement. How to handle a player deciding whether or not to continue their career following a series of injuries. How to handle the career of the next young David Beckham, from loans to transfers to bumper contracts and more -- how to monetize the brand of your footballer, while ensuring their focus with success on the pitch.<strong><br><br>Week Nine: Representing the Professional Footballer Part II<br><\/strong>An in-depth look into the operations of football club AFC Bournemouth with chairman Jeff Mostyn -- Jeff will also describe his roles with the FA Council. An analysis of the contract clauses in football, in particular release clauses, buyout clauses and sell-on clauses, and a brief glimpse into third-party ownership and how a transfer works. Finally, a look at the most influential agents in Europe and how they have come to be successful. <strong><br><\/strong>","courseFormat":"The course will last nine weeks with each lesson lasting approximately 60 to 75 minutes. The weekly lessons will be divided into manageable videos that contain lecturing, guest interviews and play acting of hypothetical situations that summarize the materials. Each week, students will be asked to complete a multiple choice quiz and participate in the course forum by answering the \"question of the week.\"","suggestedReadings":"For a deeper understanding of the course materials, we recommend purchasing <i>Representing the Professional Athlete<\/i>, 2d (American Casebook) by Professor Carfagna. If you are in the United States, the book is available <a href=\"http:\/\/store.westacademic.com\/s.nl\/it.A\/id.2810\/.f\">here<\/a> for purchase. If you are outside the United States, <a href=\"http:\/\/home.westacademic.com\/intl\">click here<\/a> for information on ordering it from one of our international resellers.","estimatedClassWorkload":"1-2 hours\/week","recommendedBackground":"No particular background is required, but because the course is an introduction to the world of a sports agent,&nbsp;students may find it helpful to possess an interest in&nbsp;sports, marketing or representing professional talent.&nbsp;","links":{}}