{"id":677,"shortName":"ni","name":"Networks Illustrated: Principles without Calculus","language":"en","shortDescription":"This course serves as an introduction to the basic principles that govern all aspects of our networked lives. We will learn about companies like Google and technologies like the Internet in a way that requires no mathematics beyond basic algebra.","aboutTheCourse":"<p>Networks are\neverywhere. From the social connections we make on platforms like Facebook, to\nthe technology behind the Internet upon which these sites run, they have become\nan integral part of our daily lives.<\/p>\n\n<p>In this course,\nwe will study these networks. Specifically, we will focus on understanding the\nfundamental principles that guide their designs and sustainability. We will see\nhow the simplest phrases like “sharing is hard” and “crowds are wise” can\nsummarize a vast amount of network theory, that goes into answering questions\nlike “how does 3G work on your smartphone?” and “when can you trust an average\nrating on Amazon?”. &nbsp;And rather than using heavy math, this course will only\nrequire basic arithmetic such as addition and multiplication. We rely on\nanimations, analogies, and anecdotes as our pedagogical tools, in lieu of\ndetailed equations.<\/p>","targetAudience":0,"courseSyllabus":"The following 11 topics (one per lecture) will be covered during this course:<br><br><ol><li>How\ndoes your cell phone decide what power to transmit?<\/li><li>Why\nis WiFi slower at a hotspot?<br><\/li><li>How\ndoes Google rank webpages?<br><\/li><li>When can you trust an average rating on Amazon?<br><\/li><li>How\ndoes Netflix recommend movies?<br><\/li><li>Why do certain videos go viral on YouTube?<br><\/li><li>How are people influenced on Facebook and Twitter?<br><\/li><li>Why do Verizon and AT&amp;T charge you $10 for every GB of data you use?<\/li><li>How\ndoes traffic get through the Internet?<br><\/li><li>Why doesn't congestion cause the Internet to collapse?<\/li><li>Can you really reach anyone in six steps?<\/li><\/ol>","courseFormat":"<p>\n\n\n\n\n\n\n\n<\/p><p>We will present two lectures per week, about 60 minutes each. Each lecture is edited into short segments with embedded quizzes that will allow you to check your understanding of the material. &nbsp;There will also be weekly homework assignments, a midterm, and a final.<\/p><p><\/p>","suggestedReadings":"<span>C. Brinton and M. Chiang, <i>Networks Illustrated: 8 Principles without Calculus<\/i>. Available on Amazon <a href=\"http:\/\/www.amazon.com\/gp\/product\/B00DIIKDJO\/ref=s9_simh_gw_p351_d6_i1?pf_rd_m=ATVPDKIKX0DER&amp;pf_rd_s=center-2&amp;pf_rd_r=1S8TCZ4PMPH7XQ44YS89&amp;pf_rd_t=101&amp;pf_rd_p=1688200382&amp;pf_rd_i=507846\" title=\"Link: http:\/\/www.amazon.com\/gp\/product\/B00DIIKDJO\/ref=s9_simh_gw_p351_d6_i1?pf_rd_m=ATVPDKIKX0DER&amp;pf_rd_s=center-2&amp;pf_rd_r=1S8TCZ4PMPH7XQ44YS89&amp;pf_rd_t=101&amp;pf_rd_p=1688200382&amp;pf_rd_i=507846\">here<\/a><\/span>.","estimatedClassWorkload":"6-8 hours\/week","recommendedBackground":"No prerequisites.","links":{}}