{"id":508,"shortName":"compvision","name":"Einführung in Computer Vision","language":"de","shortDescription":"Dieser Kurs vermittelt einen Überblick über die Grundlagen des Maschinellen Sehens an Hand der Extraktion von 3D-Information aus dem Stereokamerabild einer Szene.","aboutTheCourse":"<div>\n    <p><span>Räumliches Sehen stellt für die meisten Menschen eine Selbstverständlichkeit dar. Maschinen mit einem gleichwertigen Sehvermögen auszustatten, ist hingegen eine sehr komplizierte Angelegenheit. Seit den 1960-er Jahren hat sich dieser als <i>Computer Vision<\/i> bezeichnete Forschungsbereich kontinuierlich entwickelt und zahlreiche Forschungsergebnisse hervorgebracht. Viele Fragen haben jedoch noch nicht hinreichend beantwortet werden können und sind bis heute aktuell.<\/span>\n\n    <\/p>\n<\/div>\n<p>Dieser Kurs befasst sich mit einigen grundlegenden Algorithmen der Computer\n    Vision, führt das hierzu benötigte Fachvokabular ein und frischt die benötigten\n    mathematischen Grundlagen auf, wann immer sie benötigt werden. Beginnend\n    mit grundlegenden Methoden der Bildverarbeitung wie z.B. der Kantendetektion,\n    werden diese im Lauf des Kurses für umfassendere Aufgaben wie Merkmalsextraktion\n    und Korrespondenzschätzung angewendet.<\/p>\n<p>Diese Korrespondenzen können mit Wissen über die Darstellung von Bildern\n    am Computer und der Beschreibung von Objektbewegungen im Raum dann verwendet\n    werden, um die Epipolargeometrie eines Stereokamerasystems und somit die\n    2D-3D-Beziehung zwischen Bildern und der Szene zu beschreiben. Hierbei\n    wird der Unterschied zwischen unkalibriertem und kalibriertem Kamerasystem\n    erläutert, sowie auf das Konzept der Homographie eingegangen. Schließlich\n    ermöglicht das Zusammenspiel all dieser Aspekte die 3D-Rekonstruktion einer\n    Szene aus einem Stereokamerabildpaar.<\/p>","targetAudience":1,"courseSyllabus":"Erstes Kapitel: Wissenswertes über Bilder (Darstellung von Bildern, Bildgradient, Merkmalspunkte, Korrespondenzschätzung)<br>Zweites Kapitel: Bildentstehung (Lochkameramodell, Homogene Koordinaten, Euklidische Bewegungen, Perspektivische Projektion mit kalibrierter Kamera, Bild, Ur-Bild und Co-Bild)<br>Drittes Kapitel: Epipolargeometrie (Epipolargleichung, Epipole und Epipolarlinien, 8-Punkt-Algorithmus, 3D-Rekonstruktion, Die Fundamentalmatrix)<br>Viertes Kapitel: Planare Szenen (Planare Epipolargleichung, 4-Punkt-Algorithmus, Kamerakalibrierung)","courseFormat":"Der Kurs besteht aus 17 Videovorlesungen, die im Mittel etwa 20 Minuten \ndauern. Somit steht jede Woche etwa eine Stunde Videomaterial zur Verfügung. Innerhalb der Vorlesungen gibt es einige Quizfragen. Überdies erhalten Sie Hilfestellung beim eigenständigen Implementieren der vorgestellten Algorithmen. Zum Abschluss des Kurses findet eine Online-Klausur statt, aus der sich die Abschlussnote für diesen Kurs ergibt. Zum Bestehen sind mindestens 50% der Punkte erforderlich.<br>","suggestedReadings":"Die Inhalte der Vorlesung finden Sie in Englischer Sprache im Buch <i>An Invitation to 3D Computer Vision<\/i> (Ma, Y., Soatto, S., Kosetska, J., & Sastry, S., 2004)<br>Hilfreiche Informationen hierzu erhalten Sie außerdem auf der <a title=\"Link: http:\/\/vision.ucla.edu\/MASKS\" target=\"_blank\" href=\"http:\/\/vision.ucla.edu\/MASKS\">Homepage<\/a> der Autoren<br><br><br>","instructor":"Martin Kleinsteuber","estimatedClassWorkload":"2-8 hours\/week","recommendedBackground":"Für diesen Kurs benötigen Sie grundlegende mathematische Kenntnisse, vor allem im Bereich der Linearen Algebra. Für die Implementierung der vorgestellten Algorithmen sind Programmierkenntnisse hilfreich.<br>","links":{}}