{"id":3218,"shortName":"chinesepolitics2","name":"Chinese Politics Part 2 – China and the World","language":"en","shortDescription":"This course introduces China’s relationship to the outside world after it began to open up in the mid- late-1970s. It seeks to explain the impact of the world on China and China’s impact on the world.","aboutTheCourse":"One of the most significant changes in the world in the past 30 years is the opening of China to the outside world and its engagement with that world. In the initial years of the opening, external forces influenced China’s economy, regional balances, bureaucracy, as well as the political authority of local leaders in the coastal areas. More recently, the world is feeling the effects of a rising China which seeks resources and talent from all around the globe and uses its financial wealth to strengthen its position in the world. This course tracks the opening of China up from 1978 until it joins the WTO, focusing on how the world affected China’s internal development. We then look at various aspects of China’s “going out strategy”—its search for energy, talent, as well as its relations with the United States and the states within the Asia-Pacific region. The instructor has been deeply engaged in research on all these topics, having lived in China during various stages of China’s opening to the outside world.","targetAudience":0,"courseSyllabus":"<p>Part 2 covers the following topics:<\/p>\n<ol><li>China’s Opening to the Outside World, 1978-2000<\/li>\n<li>China’s Changing Relations with the World, 2000-2015<\/li>\n<li>China’s Global Search for Energy and Resources<\/li>\n<li>China’s Global Search for Talent and Technology<\/li><\/ol>","courseFormat":"Each subject involves a 60 minute lecture, which incorporates recent, often on-going, research by the professor on these issues, and suggests 50 pages of relevant reading followed by peer mentored online discussions of the lecture and assigned reading. The first two topics will be assessed through multiple choice quizzes while the latter two topics are assessed through a 500 word essay, graded by peer evaluation. There will also be a multiple choice exam at the end of the course.","suggestedReadings":"David Zweig, Internationalizing China: Domestic Interests and Global Linkages (Cornell University Press, 2002), David Zweig and Hao Yufan, eds., US-China Energy Triangles: Resource Diplomacy under Hegemony (Routledge, 2015), and Lowell Dittmer and George Yu, eds., China, the Developing World, and the New Global Dynamic (Lynne Reinner, 2010)","estimatedClassWorkload":"3-4 hours\/week","recommendedBackground":"Students are recommended to have taken <a target=\"_blank\" href=\"https:\/\/www.coursera.org\/course\/chinesepolitics1\">Chinese Politics Part 1 – China and Political Science<\/a>, otherwise should watch topics 1-4 lecture videos from that course.","links":{}}