{"id":208,"shortName":"algebra","name":"Intermediate Algebra","language":"en","shortDescription":"This course is taught so that students will acquire a solid foundation in algebra. The course concentrates on the various functions that are important to the study of calculus.","aboutTheCourse":"This course is taught so that students will acquire a solid foundation \nin algebra. Emphasis is placed on understanding \nthe properties of linear, polynomial rational and radical functions, including \ninequalities and complex numbers. Students will learn to work with \nvarious types of functions in symbolic, graphical, numerical and verbal \nform.<br><br>The course videos are licensed Creative Commons Attribution-Sharealike-NonCommercial 3.0. The <a href=\"http:\/\/ocw.uci.edu\/courses\/math_1a1b_precalculus.html\" target=\"_blank\">course videos<\/a> can be found at UC Irvine's <a href=\"http:\/\/ocw.uci.edu\" target=\"_blank\">OpenCourseWare <\/a>site.","targetAudience":0,"courseSyllabus":"This course will be taught over ten weeks, with materials released on a weekly basis. Below you will find the weekly topic schedule.&nbsp;<br><br><i>Week One.<\/i> Introduction, Algebra and Real Numbers. Exponents and Radicals.&nbsp;<br><i>Week Two<\/i>. Polynomials: Basic Operations and Factoring. Rational Expressions: Basic Operations.<br><i>Week Three<\/i>. Linear Equations. Linear Inequalities.&nbsp;<br><i>Week Four<\/i>. Absolute Value in Equations and Inequalities. Complex Numbers. Quadratic Equations. Additional Equation Solving Techniques.<br><i>Week Five<\/i>. Cartesian Coordinate System. Distance in the Plane.<br><i>Week Six<\/i>. Equations of a Line.&nbsp; Linear Equations and Models.&nbsp;Functions.<br><i>Week Seven<\/i>. Graphing Functions. Transforming Functions.<br><i>Week Eight<\/i>. Quadratic Functions. Operations on Functions, Composition. Inverse Functions. Polynomial Functions and Models<br><i>Week Nine<\/i>. Real Zeros and Polynomial Inequalities. Complex Zeros and Rational Zeros of Polynomials. Rational Functions and Inequalities.<br><i>Week Ten<\/i>. Review and Final.<br><br><br><br><br>","courseFormat":"This course is divided into topical sections, released on a weekly basis.&nbsp;Each week will consist of a series of lecture videos, short quizzes, and suggested readings and homework assignments.<br>","suggestedReadings":"We highly recommend ALEKS software be used in conjunction with the course.&nbsp; Though not required, this software will allow students more algebra practice opportunities and a more individualized course experience in which you focus just on those topics you have yet to master. <br><br><b>A<\/b><span>ssessment\nand <b>LE<\/b>arning in <b>K<\/b>nowledge <b>S<\/b>paces is a Web-based,\nartificially intelligent assessment and learning system. ALEKS uses adaptive\nquestioning to quickly and accurately determine exactly what a student knows\nand doesn't know in a course. ALEKS then instructs the student on the topics she\nis most ready to learn. As a student works through a course, ALEKS periodically\nreassesses the student to ensure that topics learned are also retained. <br><\/span><span><br>\n<\/span><i><span><br>\n<\/span><\/i>The ALEKS subscription will\nalso enable you limited access to content from the textbook\n\"Precalculus\" by Barnett, Ziegler, Byleen and Sobecki; this access is\nin the form of PDF files linked from the Explanation pages of particular topics\nin ALEKS. Some students may prefer a physical version of this textbook. You can\npurchase that from any online textbook retailer. (Any edition of this text is\nfine!)<i><br><\/i><br>","instructor":"Sarah Eichhorn and Rachel Cohen Lehman","estimatedClassWorkload":"8-10 hours\/week","recommendedBackground":"High school algebra and geometry are recommended. <br>","links":{}}