{
    "id": 1562,
    "shortName": "geodesign",
    "name": "Geodesign: Change Your World",
    "language": "en",
    "shortDescription": "What happens when creativity and science come together?  The power to design our world is unleashed, providing tools to inform choices about how we live!  Geodesign is the glue—it’s a process that deploys creativity to connect information to people, using collaboration to better inform how we design our world.",
    "aboutTheCourse": "Our world is awash in facts and information,\nwhich are now easily accessible.&nbsp; So why\nare so many bad decisions being made?&nbsp;\nWhat is needed is creativity and design that brings those facts to life\n– to create a vision and choices as well as an understanding about the\npotential impacts of those choices.&nbsp; The\ngeodesign process has evolved over nearly 40 years and now combines the core\nconcepts of design thinking with the latest in geo-spatial technologies.<br><br>Geodesign is a proven form of design that\nuses techniques and practices from a multitude of professions to determine\noptimal ways to design for complex land use challenges. It is a collaborative\nprocess that capitalizes on the strengths of people with a variety of expertise\nto create and implement unique models to aid in the design decision-making\nprocess.<br><br>Our MOOC will introduce the average person to\nthe core concepts of geodesign through real-world examples which showcase how\ngeodesign has worked across the globe. &nbsp;People\nfrom all walks of life with interests in science, design, sustainability and\nenvironmental stewardship will want to learn about geodesign. &nbsp;Together we will explore how anyone can use\nthe geodesign process to work with others to effect change in their world.",
    "targetAudience": 3,
    "courseSyllabus": "<strong>Week One: &nbsp;Shared Languages<br><\/strong>The key underpinnings of geodesign include aspects we all share: spatial thinking, creative change, and being rooted in real places.<br><br><strong>Week Two: The Three D's of Geodesign<\/strong><br>Decision is the driver but one must also consider Data and Design. &nbsp;<br><br><strong>Week Three: The Three C's of Geodesign<\/strong><br>Dealing with tough challenges is the main issue.&nbsp; Imbedded in those are Complexity, Computation, and Collaboration. &nbsp;<br><br><strong>Week Four: The Influence of Context<\/strong><br><strong><\/strong>Place matters and is shaped by culture.&nbsp; Who are the people of the place and what scale is best?<br><br><strong>Week Five: Process and Framework <\/strong>&nbsp;<br>The value of a proven process.&nbsp; How to set up a project, outline an approach, understand the options, and get feedback about the impacts.<br>",
    "estimatedClassWorkload": "3-5 hours\/week",
    "recommendedBackground": "<div>\n\t\t\t<div>\n\t\t\t\t<div>\n\t\t\t\t\t<p>No background is required; all are welcome.&nbsp; We only ask that students have an interest in how to change our world for the better. &nbsp;If\nyou are looking for more in-depth geodesign programs, please consider the&nbsp;<a target=\"_blank\" href=\"http:\/\/www.worldcampus.psu.edu\/degrees-and-certificates\/geodesign-certificate\/overview?utm_source=geodesign&utm_medium=cmpreferrer&utm_campaign=SAVE+14-15&utm_content=coursera-courses&cid=CMPRFO20079\">online courses<\/a>&nbsp;that\nwe offer at Penn State.<br><\/p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><\/p>\n\n\n\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t<\/div><br>",
    "links": {}
}