{"id":2875,"shortName":"americanhealthsystem","name":"American Health Policy: The Structure of the American Health Care System (Part I of II)","language":"en","shortDescription":"This course will explain the structure of the American health care system and explore the many problems of this complicated system. Part I of II.","aboutTheCourse":"<p>The American health care system has many problems. 50 million people are uninsured. Quality is extremely uneven, with peaks of greatness at leading academic centers but overall poor quality in both process measures and outcomes such as asthma deaths. Finally, the U.S. health care system spends over $8000 per patient per year, nearly double the next highest country. In March 2010, the Affordable Care Act was enacted. Over the next decade or more, the Act will dramatically re-structure the American health care system.<\/p><p>Part I of this course will explore the history and structure of the current American health care system, including the history of and problems with employment-based health insurance, the challenges surrounding access, cost and quality, and the medical malpractice conundrum. It will conclude with the history of health care reform, leading up to the Affordable Care Act. Throughout lessons regarding health economics, health policy, and medical practice will be elucidated.<\/p><p><a href=\"https:\/\/class.coursera.org\/ushealthcarereform-001\" target=\"_blank\">Part II<\/a> of this course will then explore the challenges that were overcome to achieve health reform in America. We will delineate the specific ways that the Affordable Care Act improves access and quality and will control costs. Part II will conclude with predictions about further reforms and about the future of health care in America.&nbsp;<\/p><p>This class is open to anyone that is interested in gaining a better understanding of the US health care system and the challenges of health care reform. There are no prerequisites or required knowledge of the health system. Students who feel as though they have a strong grasp of the structure of the current US health system and the history of health care reform in the US may start with <a href=\"https:\/\/class.coursera.org\/ushealthcarereform-001\" target=\"_blank\">Part II<\/a> of the course instead.&nbsp;<\/p>","targetAudience":0,"courseSyllabus":"<p><i>Week 1: Introduction\nand History<\/i><\/p>\n\n<p><i>Week 2: Structure<\/i><\/p>\n\n<p><i>Week 3: Problems<\/i><\/p>\n\n<p><i>Week 4: Reforming\nAmerican Health Care<\/i><\/p>","courseFormat":"This class will consist of lecture videos, which are between 5-10 minutes in length. There are 3-7 lecture videos each week.&nbsp;<br><p>This class is four weeks long. Each week, students will watch approximately 20 - 40 minutes of lectures delivered by Dr. Emanuel. Students should expect to spend 2 - 5 hours per week reading related materials from the reading list, all of which are freely accessible online. In addition to the assigned readings, we recommend you purchase a copy of \"<a href=\"http:\/\/www.amazon.com\/Reinventing-American-Health-Care-Outrageously\/dp\/1610393457\/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1424466282&amp;sr=1-1&amp;keywords=reinventing+american+health+care\" target=\"_blank\">Reinventing American Health Care<\/a>\" by Dr. Emanuel to aid your learning in this course.&nbsp;<\/p><p>Students taking the course for a grade will complete one short essay question (approximately 1 page) per week, which will be peer-graded based on a detailed answer key provided after the due date. Of the 4 scores earned for assignments, the lowest score will be dropped in calculating the final grade. The remaining 3 scores will be weighted equally. As a result, students who miss a homework assignment can still earn full credit in the course. There are no exams or final projects in this course. Students not taking the course for a grade may choose not to complete the assignments.<\/p><p>The details of these logistics are subject to change; if changes are made, students will be notified via an announcement and this page will be updated.<\/p>","suggestedReadings":"In addition to assigned PDFs and other online documents, we recommend you purchase a copy of \"<a href=\"http:\/\/www.amazon.com\/Reinventing-American-Health-Care-Outrageously\/dp\/1610393457\/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1424466282&amp;sr=1-1&amp;keywords=reinventing+american+health+care\" target=\"_blank\">Reinventing American Health Care<\/a>\" by Dr. Emanuel to aid your learning in this course.&nbsp;","estimatedClassWorkload":"3-6 hours\/week","recommendedBackground":"No background is required; all are welcome.","links":{}}