{
    "id": 3552,
    "shortName": "whartonmarketinges",
    "name": "Introducción al Marketing ",
    "language": "es",
    "shortDescription": "Aprende las bases de Marketing llegando al fondo de toma de decisiones del cliente. Después de completar con éxito este curso, puedes aplicar estas habilidades en un reto empresarial de la vida real como parte de la Programa Especializadode Fundamentos de Negocios de Wharton.",
    "aboutTheCourse": "<p><b>PARTE DE LA PROGRAMA ESPECIALIZADO EN FUNDAMENTOS DE NEGOCIOS DE WHARTON<\/b><\/p><p>Ve a Geoffrey Garrett, Decano de la Escuela Wharton, hablando sobre la Programa Especializado aquí.<\/p><p>Impartido por tres de los mejores expertos de Wharton en el departamento de Marketing, clasificado como el departamento de Marketing #1 del mundo, este curso cubre tres temas centrales en la lealtad del cliente: marcas (branding), orientación al cliente y estrategias prácticas para insertarse en el mercado.<\/p><p>Aprenderás principios clave sobre<\/p><ul>\n<li><b>Branding: <\/b>el valor de marca es uno de los elementos clave para mantener a los clientes en una dinámica mundial donde las nuevas empresas surgen constantemente.&nbsp;<\/li>\n<li><b>Orientación al cliente:<\/b> no es sinónimo de servicio al cliente, pues la orientación comienza al enfocarse en el cliente y sus necesidades.&nbsp;<\/li>\n<li><b>Estrategias de inserción al mercado:<\/b> comprende los motivos que influencian a los clientes y ve cómo se implementan antes de hacer una inversión.<\/li>\n<\/ul><p>Completa este curso como parte de la Programa Especializado en Fundamentos de Negocios de Wharton y tendrás la oportunidad de tomar tu Proyecto Final y preparar un análisis estratégico y una propuesta de solución para un reto empresarial verdadero en compañías regidas por Wharton, como Shazam y SnapDeal, o para un reto enfrentado por tu propia compañía u organización. El personal capacitado por Wharton evaluará las mejores presentaciones y los equipos directivos de Shazam y SnapDeal revisarán los proyectos con mayor puntaje preparados para sus compañías.<\/p><p>Mira este video para aprender más sobre la Serie de Negocios de Wharton en Coursera:<\/p><p><a>http:\/\/www.youtube.com\/watch?v=SgS3AJCe6i8<\/a><\/p>\n<p>Para mayor información sobre los cursos en línea ofrecidos por Wharton, por favor visita <a href=\"http:\/\/online.wharton.upenn.edu\/\">http:\/\/online.wharton.upenn.edu<\/a><\/p>",
    "targetAudience": 3,
    "courseSyllabus": "<p><b>MÓDULO UNO: Branding<\/b><\/p>\n\n<p>Los conceptos clave incluyen comunicaciones y\nreposicionamiento, estrategia mercadológica, posicionamiento de marca y toma de\ndecisiones del cliente.<\/p>\n\n<p><b>MÓDULO DOS: Orientación al cliente<\/b><\/p>\n\n<p>Los conceptos clave incluyen establecer una ventaja\ncompetitiva a través de la orientación al cliente, el vocabulario de la\norientación al cliente y la gestión de relación con el cliente (ARC).<\/p>\n\n<p><b>MÓDULO TRES: Estrategias de inserción al mercado<\/b><\/p>\n\n<p>Los conceptos\nprincipales incluyen una estrategia omnicanal e interacción en línea y\nconvencional, metas sociales, publicidad social y persuasión.&nbsp;<\/p>",
    "estimatedClassWorkload": "5-6 hours\/week",
    "recommendedBackground": "<p>Aun cuando\nno se requieren antecedentes para este curso, sería útil tener conocimientos\nsobre conceptos de Marketing.&nbsp;<\/p>",
    "links": {

    }
}