{
    "id": 1399,
    "shortName": "personalisedmed",
    "name": "Myths and Realities of Personalised Medicine: The Genetic Revolution",
    "language": "en",
    "shortDescription": "Learn about the concept of “personalised medicine” and the impact that our enhanced understanding of genetics has had on modern medicine and society.",
    "aboutTheCourse": "<p><i>Personalised\nmedicine.&nbsp; Precision medicine.\nIndividualised medicine. Customised medicine. Targeted medicine. Even bespoke\nmedicine!<\/i>&nbsp; All\nbuzzwords of recent years that equally excite, confuse and infuriate the\npublic, researchers and healthcare professionals. What does it all mean, and\nwhy should you care?<\/p>\n\n<p>Broadly speaking, these terms all refer to the idea of tailoring\ntreatment to individual patients based on their genetic code. But is this\nactually happening, and what are the consequences of this shift in thinking?<\/p>\n\n<p>The last 10 years have yielded significant and rapid advances in our\nunderstanding of the human genome. The impact on human health and clinical practice is already being widely felt.&nbsp;<\/p><p>This course will discuss both\nthe benefits and controversies surrounding the genetic\nrevolution as it relates to modern medicine and its impact on society.\nThe promise of personalised medicine will likely yield significant benefits for\npatients, yet raises a number of serious ethical and legal issues for health\nprofessionals, patients and the community.&nbsp;<\/p>\n\n<p>You will learn how genetic testing is currently used to guide\ntreatment across diseases including cancer, neurodegenerative\ndiseases and mental health, and infectious disease. You will also explore the power of genetics to impact disease prevention and diagnosis, and\nthe social, legal, political and ethical implications of this new knowledge.<\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<p><b>Module One:<\/b> We begin by discussing what causes disease and development of personal traits – our genes or our\nenvironment? We will also explore how genes are passed from one generation to\nthe next, and basic medical genetics.<\/p>\n\n<p><b>Module Two:<\/b> We will discuss how recent technological and scientific advances have heralded\nthe advent of the genetic revolution, and the global approach and impact of\nthese advances.<\/p>\n\n<p><b>Module Three: <\/b>We will explore the concept of risk, and\nmultifactorial disease. We will describe examples of genes that pre-dispose\npatients to specific diseases, and discuss genetic testing and genetic\ncounselling.<\/p>\n\n<p><b>Module Four: <\/b>We will investigate the use of personalised medicine\ntoday, and tease out the reality from the hype.\nWe will also explore the apparent delay between research findings and\ntranslation to the clinic (“bench to bedside”), and the reasons for this.<\/p>\n\n<p><b>Module Five:<\/b>\nWe will describe the rationale of medical patents, clinical trials, drug\napproval and regulation, and how these differ in various parts of the world.<\/p>\n\n<p><b>Module Six:<\/b>&nbsp;\nWe will analyse and reflect on how research and drug developments in\npersonalised medicine are presented in the media, and the effect this may have\non patients, policy &amp; society both locally and globally.<\/p>\n\n<p><b>Module Seven:<\/b>\n&nbsp;We will explore and debate the legal,\nreligious, cultural and societal issues surrounding personalised medicine.<\/p>\n\n<p><b>Module Eight:<\/b>\nWe will integrate what we have learnt in modules 1-7 in order to understand the potential and pitfalls of\npersonalised medicine in our own specific discipline and cultural\ncircumstances.<\/p>",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": "<p>No particular background is required. All are welcome.<\/p>",
    "links": {}
}