{"id":1190,"shortName":"solarsystem","name":"The Science of the Solar System","language":"en","shortDescription":"Explore the solar system using concepts from physics, chemistry, biology, and geology. Learn the latest from Mars, explore the outer solar system, ponder planets outside our solar system, and search for habitability in the universe.","aboutTheCourse":"This course is a scientific exploration of our solar system. You will learn both what we know about the solar system around us but also how we have been using the tools of science to learn the things that we know. You will get to use some of the tools yourself.<br><br>Unlike typical solar system classes, which plod from one planet to the next, we will focus our examination of the solar system on four main topics: (1) Where is there water on Mars? (2) What is inside of a giant planet? (3) How can we use the smallest bodies in the solar system to answer the biggest questions? (4) Where might we look for life?<br><br>To answer these questions we will learn about details of atmospheric chemistry and dynamics, planetary interiors and magnetism, the geological history of planets, spacecraft exploration, telescopic observations of planets around other stars, spectroscopic determinations of composition, biochemistry of water- and non-water based life, and many more. In short, we'll learn about the whole solar system and about planets in other systems besides ours.<br>","targetAudience":1,"courseSyllabus":"The course will be divided into 4 two- or thre-week long units exploring specific concepts in depth. <br><br><strong>Weeks 1, 2, and 3<\/strong>: <strong>Where is the water on Mars?<\/strong> We'll explore geology, atmospheric science, geochemistry, and interior physics to track water through time and figure out where and when it might have been on the surface.<br><br><strong>Weeks 4 and 5<\/strong>:<strong> What is inside of a giant planet?<\/strong> We'll figure out all of the indirect methods scientists have used to learn about the interior of Jupiter and other giant planets, from understanding the formation of the solar system, experimenting with high pressure physics, calculating atmospheric structures, to exploring other giant planets here and outside the solar system.<br><br><strong>Weeks 6 and 7<\/strong>: <strong>How can we use the smallest bodies in the solar system to answer&nbsp; the biggest question?<\/strong> We'll learn about the populations of small bodies in the solar system, from the asteroids to the tiny satellites, to the distant Kuiper belt, and how we have been using these objects to determine how the solar system was formed, how it has rearranged since then, and how changes are continuing to happen.<br><br><strong>Weeks 8 and 9<\/strong>: <strong>Where might we look for life in and beyond the solar system?<\/strong> We'll explore life in extreme environments on the Earth and then consider the habitability of places like Mars, Europa, Enceladus, and Titan before broadly considering habitability in the galactic environment.<br><br><strong>Week 9: Final exam<\/strong><br>","courseFormat":"The class will consist of video lectures between 10 and 15 minutes in length. Each lecture will pause once or twice for in-video quizzes to help develop understanding. There will be four standalone homework assignments that are not part of the video lectures, and there will be a final exam. <br>","suggestedReadings":"The lectures are generally self-contained, but, for those interested in learning in more depth, we will provide links to relevant resources for students to explore. In addition, links to resources with additional background will be provided for those whose scientific background needs refreshing.<br>","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"This class will present the planets using concepts from Freshmen-level physics, chemistry,and math, however much of the content will be accessible even for those without these backgrounds, and everyone is welcome.<br>","links":{}}