{"id":736,"shortName":"eefunlab","name":"Fundamentals of Electrical Engineering Laboratory","language":"en","shortDescription":"This hands-on laboratory course complements Coursera's Fundamentals of Electrical Engineering. The course develops basic skills in constructing and measuring electrical circuits using modern laboratory instruments.","aboutTheCourse":"This course represents a&nbsp;<i>real<\/i> hands-on laboratory course in introductory electronics. In it, you will learn how to use the instruments every electrical engineer needs to know: the oscilloscope, function generator and multi-meter. You will use\nthese instruments running on your computer to measure voltages from circuits you will build from <b>actual<\/b> electrical components with measurement systems provided by National Instruments, Inc. Students will be required to purchase hardware, software\nand electrical parts.\n<br>\n<br>This laboratory uses the terminology and knowledge of electrical engineering provided in Coursera's&nbsp;<i><a href=\"https:\/\/www.coursera.org\/course\/eefun\" target=\"_blank\">Fundamentals of Electrical Engineering<\/a>.<\/i> You can take the laboratory simultaneously\nwith this course or afterwards. Once you learn the basics found in the laboratory course, you will know how to interface electrical circuits to measurement systems, be they analog or digital. You will have the knowledge to build live circuits and get\nthem to work. No simulations!!\n<br>\n<br>\n<br>This lab would not be possible without the strong involvement of our industrial partners. National Instruments makes the myDAQ interface equipment as well as the LabView and ELVISMX software system that emulates measurement instruments. DigiKey Corporation\ngathered the diverse collection of electrical and electronics parts into a course-specific parts kit. Mathworks is supplying the Matlab software environment for this course without charge for the course's duration.\n<br>\n<img width=\"500\" src=\"https:\/\/d396qusza40orc.cloudfront.net\/eefunlab%2Fimages%2FLogos%2FCombined_Logo.png\" title=\"Image: https:\/\/d396qusza40orc.cloudfront.net\/eefunlab%2Fimages%2FLogos%2FCombined_Logo.png\">\n<br><br>","targetAudience":0,"courseSyllabus":"Lab Zero: Ordering the laboratory kit, opening the box and installing the software. Most electrical engineering systems combine hardware and software systems, and this kit follows that approach. Instruments are implemented in software to run on\nyour computer while the circuits and software perform information processing. Because of delivery of the parts take time, this \"lab\" lasts for several weeks even though it is quite simple.\n<br>\n<br>Lab One: Simple DC Circuits. Using a DMM (Digital Multi-Meter) to measure voltage, current, and resistance; an oscilloscope to display time-varying voltages; a power supply to produce constant (DC) voltages; and a function generator to produce time varying\n(AC) voltages.\n<br>\n<br>Lab Two: AC Measurements. Characterization and measurement of waveforms using an oscilloscope. Grounding issues. Electro-acoustics—conversion of sound to voltage and back—and opto-electronics—conversion of light to voltage and back.\n<br>\n<br>Lab Three: Signal Processing I: Amplifiers. Using the op-amp in various modes for creating amplifiers.\n<br>\n<br>Lab Four: Signal Processing II: Filters. Building passive and active filters and measuring their transfer functions.\n<br>\n<br>Lab Five: Signals and Systems I. Time-domain and frequency-domain characterization of signals, especially speech.\n<br>\n<br>Lab Six:&nbsp;Signals and Systems II. A\/D &nbsp;and D\/A conversion.&nbsp;\n<br>\n<br>Lab Seven: Digital Signal Processing I.&nbsp;Implementing digital filters.\n<br>\n<br>Lab Eight: Digital Signal Processing II. Advanced digital filtering. Generating signals digitally. \"Fancy\" signal processing: speech scramblers, digital music.\n<br>\n<br>Lab Nine: Final Project. A combined optical communication\/pulse monitor system.","courseFormat":"This lab course focuses on building and characterizing information processing systems. Videos are provide to guide you through the laboratory experiments. Each student will be part of a lab group, enabling you to consult closely with your lab partners. Each lab report will be peer graded.","suggestedReadings":"No supplementary readings are required beyond the <a href=\"https:\/\/d396qusza40orc.cloudfront.net\/eefun%2FNotes%2Fcol10040.pdf\" target=\"_blank\">book<\/a> for <i>Fundamentals of Electrical Engineering<\/i>. This is a hands-on course, where learning arises from doing!","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"Taking <i><a href=\"https:\/\/www.coursera.org\/course\/eefun\" target=\"_blank\">Fundamentals of Electrical Engineering<\/a><\/i>, either simultaneously or previously. Each student will be required to order the lab kit.","links":{}}