{
    "id": 217,
    "shortName": "newchinahistory1",
    "name": "Understanding China, 1700-2000: A Data Analytic Approach, Part 1",
    "language": "en",
    "shortDescription": "The purpose of this course is to summarize new directions in Chinese history and social science produced by the creation and analysis of big historical datasets based on newly opened Chinese archival holdings, and to organize this knowledge in a framework that encourages learning about China in comparative perspective.",
    "aboutTheCourse": "<p>Our course demonstrates how a new scholarship of discovery is redefining what is\nsingular about modern China and modern Chinese history. Current understandings\nof human history and social theory are based largely on Western experience or\non non-Western experience seen through a Western lens. This course offers\nalternative perspectives derived from Chinese experience over the last three\ncenturies. <strong>We present specific case studies of this new scholarship of\ndiscovery divided into two stand-alone parts, which means that students can\ntake any Part without prior or subsequent attendance of the other Part.<\/strong><\/p><p><\/p><p>\n\n<\/p><p><b>Part One focuses on comparative\ninequality and opportunity and addresses two related questions ‘Who rises to\nthe top?’ and ‘Who gets what?’. <\/b><b>Please note that Part One was\npreviously named ‘A New History for a New China, 1700-2000: New Data and New\nMethods, Part 1’.<\/b><\/p>\n\n<p><\/p><p><a href=\"https:\/\/www.coursera.org\/course\/newchinahistory2\" target=\"_blank\">Part Two<\/a> turns to an arguably even more important question\n‘Who are we?’ as seen through the framework of comparative population behavior\n- mortality, marriage, and reproduction – and their interaction with economic\nconditions and human values. We do so because mortality and reproduction are\nfundamental and universal, because they differ historically just as radically\nbetween China and the West as patterns of inequality and opportunity, and\nbecause these differences demonstrate the mutability of human behavior and\nvalues.<\/p><br><br><br>",
    "targetAudience": 0,
    "courseSyllabus": "<p>Part 1 covers the following subjects:<\/p>\n<ol>\n    <li>Social Structure and Education in Late Imperial China<\/li>\n    <li>Education and Social Mobility in Contemporary China<\/li>\n    <li>Social Mobility and Wealth Distribution in China<\/li>\n    <li>Wealth Distribution and Regime Change<\/li>\n<\/ol>",
    "estimatedClassWorkload": "3-4 hours\/week",
    "recommendedBackground": "No requirements. Everyone is welcome.",
    "links": {

    }
}