{"id":907,"shortName":"geomatique","name":"Éléments de Géomatique","language":"fr","shortDescription":"Le but de ce cours de base en géomatique est de présenter un aperçu des méthodes d'acquisition, de modélisation et de représentation des données à référence spatiale. Les ingénieurs civils et en environnement devront comprendre le rôle et les enjeux de la géomatique face aux disciplines de la construction, de l'aménagement et de l'environnement.","aboutTheCourse":"<p><strong>Nouveauté 2015<\/strong><\/p><p><span><span>La nouvelle session du cours \"<a title=\"Link: https:\/\/www.coursera.org\/course\/geomatique\" target=\"_blank\" href=\"https:\/\/www.coursera.org\/course\/geomatique\">éléments de&nbsp;<\/a><\/span><a target=\"_blank\" href=\"https:\/\/www.coursera.org\/course\/geomatique\">géomatique<\/a>\"&nbsp;permet d'acquérir un certificat et 2 crédits ECTS, il fait désormais partie du&nbsp;<\/span><a href=\"https:\/\/eventing.coursera.org\/redirect\/x_k_pAHvEKgXjLlb1_Mg7w9Hh3IBVWIIw84iwwnU0gcMzyIlOjEG53KBQNDpBzub39Kz-VDdVIGNh8gG9Fealg.kRwHFUdsmr_FxD5DPZUV-Q.plSaJTgJqDLR08c_1rXGmeqv27AQ4SUr-NdIFDMQkLm3rnVMBUl_NC8qKSK65feHCLtriQy_YynuN9GFBZdM2NHRI8hG1Q8QWEvPAr_8BjkaCSyH9ZSh4ZWxsFmR3od8Olvz7h6Tw-50K7837SooQMGRBqXIf0rK2Of5UdamBobB5bHDorjp5Tk-pmnLQ4O4Ui6_ZQFpYV8bimChZ6Rz22EtcA9mRkr6GJDkZeFUIA0vITxxqI9QKdhRtz44R2WAxZkzX_H0T3YfWLcP4_pdv3kVlbciS0I_Dr8QOSGZtF7f9N6tGEVL1HCaM1BTnlW9vPq599rCTOmS-buVdEFcAWOy_Xt__eax_e89tkFJo3U_MGW3vRKN2l_ttmZhS0Dg3grKrtv2hkiSvRzcfq3FNXKMkmHEh4CDg9JvwWgY7m4\">\"Certificat d'études en gestion et planification de la ville africaine\"<\/a>.<\/p><p><span>Pour obtenir les crédits , il faut suivre le cours, obtenir l'attestation en ligne et passer un examen final dans un des 37 centres CNF de l'<a href=\"https:\/\/eventing.coursera.org\/redirect\/xFZzuc5hZ-CxeWkYcAvepAhbZtXTCNJjCokzTDcizkp9UXFZZ9kGYv8kJ3ST_MbWQUVAxwFl6iNU6LJoMHeobQ.DJIuQSvhFYtyqLkOm1TUOg.1vH-WdrjTCxe6reuBN80WWotui5vAziP3zhqgnuo6bd7JQ8BsOJnAEyMPtPIvAyl3oM9nPnTJzKehPneyD29Pk9Q0BK5CrsgXD4FlULofUWLI5_1DhpKVOkJseuA5eIYx0JtUQ1TXMuYsunqt7BTG0BB7Bjfw7wBxQH0WS1ObCB-tr4hQ5sF56Q5UeChUOxYqNdN_ya9XsDCvxG8FHdn4BSDYv_-_tiVX4lhCMqLyaNhXOH-tnZVrbx4K49Fu_sYDYhZN26UOJ5ktkuK4lhRiPjE5PWuGVaHES1DFc4ojgwc0YsJ_BA6_3XrPfMKBr4NpMdCy9weGR_hVIVu5fU2bnWNP-zStDMIk6krHAS7tQ4CPoDVBSeSrTFqESjT7A0jjAs5CouTCEUs8KfHToOXFA\">Agence Universitaire de la Francophonie<\/a>&nbsp;(AUF) à travers le monde.<\/span>Les modalités d'inscription seront données lors des premières semaines du cours.<\/p><p><strong>A propos du cours<\/strong><\/p><p>Les nouvelles technologies de\nl’information ont facilité l’accès à de nombreuses bases de données offrant au\ngrand public, mais surtout aux professionnels une multitude de services. Le\ndomaine de<b> l’information géographique<\/b> a également suivi ce mouvement en\nmodernisant l’ensemble des supports, des plans, des cartes topographiques et de\ntous les types de données à référence spatiale.<br><\/p>\n\n<p>Face au déploiement massif des\ncartes numériques, des globes virtuels et des nombreux services basés sur la\nlocalisation, il s’agit de rester critique et surtout de développer les\ncapacités nécessaires afin de choisir les outils et jeux de géodonnées adaptés\nà nos besoins professionnels.&nbsp;<\/p><p>C’est dans cette optique que ce cours propose de développer les éléments fondamentaux de la géomatique en décrivant les domaines\nclés que sont:<\/p><p><\/p><ul><li>les références géodésiques&nbsp;<br><\/li><li>les techniques d’acquisition des géodonnées&nbsp;<br><\/li><li>les instruments de topométrie terrestre<br><\/li><li>les méthodes de localisation par satellites<\/li><li>la modélisation et la représentation du terrain.<\/li><\/ul><p><\/p>\n\n\n\n<p>Cet enseignement est proposé aux futurs ingénieurs et architectes et quels que soient les métiers de ces filières, le recours aux bases de données spatiales et géodonnées est\nincontournable pour la réalisation de projets d’aménagement, de construction, de\ngestion de l’environnement, de transport et de développement territorial. Dans\nces domaines, l’accès aux données à référence spatiale ainsi qu’une\nconnaissance des sources d’information et de leur qualité sont donc primordiales pour la conduite de projets.<\/p>","targetAudience":0,"courseSyllabus":"Ce cours est composé de 8 leçons hebdomadaires qui rassemblent les sujets de base en géomatique avec un accent particulier sur l'acquisition de géodonnées.<br><ol><li>Introduction à la géomatique: principes et techniques, représentation\/acquisition\/gestion<\/li><li>Bases de géodésie: unités, références géodésiques, géoïde, systèmes de coordonnées, projections<\/li><li>Cartographie: types de cartes, sémiologie, modes de représentation<\/li><li>Nivellement géométrique: système altimétrique, contrôle du niveau et cheminement<\/li><li>Lever topométrique: théodolite, principe d'orientation, mesures d'angles, lever polaire<\/li><li>Mesures de distances: mesure électronique, réduction des distances<\/li><li>Localisation par satellites: principe du GPS, modes de localisation, sources d'erreurs<\/li><li>Modèle numérique d'altitudes: représentation de l'altimétrie, géomorphométrie, produits dérivés<\/li><\/ol>","courseFormat":"Ce cours est composé d'une série de vidéos d'une durée de 8 à 15 min qui contiennent les explications et développements des différents thèmes. Chaque vidéo est ponctuée par des quiz et de courts films tournés à l'extérieur présentant la pratique des instruments de topométrie. Le cours comprend une série d'exercices relatifs à la matière qui demandent le développement d'algorithmes et la réalisation de calculs. Des quiz additionnels sont également mis à disposition afin de vérifier les connaissances.<br>","suggestedReadings":"Eléments de géomatique, P.-Y. Gilliéron, G. Vincent, A. Ueberschlag, EPFL, 2014<br><br>","estimatedClassWorkload":"4-5 hours\/week","recommendedBackground":"Il n'y a pas de pré-requis particuliers pour ce cours. Toutefois, il est recommandé de posséder les connaissances de base en trigonométrie, géométrie et analyse. <br>","links":{}}