{
    "id": 1420,
    "shortName": "compartsaudio",
    "name": "Introduction to Computational Arts: Audio",
    "language": "en",
    "shortDescription": "In this 6-week course we’ll introduce the fundamentals of digital audio. The course will provide the essentials of recording and editing sound, and culminates with a piece using both recorded and synthesized sound. ",
    "aboutTheCourse": "<p>In this 5-week course we’ll introduce the fundamentals of digital audio. This is the final third of a class which has been taught for seventeen years at Stony Brook University, and is an accessible introduction to combining arts and computing. The other two portions have already been taught this spring, but we will offer them again in the fall: &nbsp; Introduction to Computational Arts: Image Manipulation and Introduction to Computational Arts: Processing.<\/p><p>For sound we’ll be Logic or a combination of Audacity and Soundation. Students can use other Digital Audio Workstations such as Reaper or Ableton Live. The course will provide the essentials of digital audio&nbsp;and culminates with a piece using both recorded and synthesized sound.&nbsp;<\/p><p>You will complete both technical assignments and an artistic project, and learn how to participate in an aesthetic critique. This course is more about recording and sound art than about writing traditional music - I will give examples of work which doesn't require a background in traditional music to create.&nbsp;<\/p><p>Peer review is integral to the success of this class; we will also teach you how to give constructive criticism. By the end of the 5 weeks you should have a strong foundation for how computers work and deal with audio.<\/p><p>Additionally, you’ll create an online portfolio of digital sound projects, and be able to communicate ideas about aesthetics. &nbsp;<\/p><p>Each week you’ll watch two video series - one on the theory and one on the practice. The practice videos are divided by software platforms. &nbsp;There will be technical assignments and artistic projects which will be peer reviewed. We’re looking forward to working with you.<\/p><div><br><\/div>",
    "targetAudience": 0,
    "courseSyllabus": "<p>Introduction to Computational Arts: Audio<br>March 2014<br>Consortium for Digital Arts &amp; Technology (CDACT)<br>Stony Brook University and Coursera<\/p><h2>COURSE INFORMATION<\/h2><h2>Instructors<\/h2><p>Dr. Margaret Schedel&nbsp;<\/p><p>Course Description<\/p><p>This multidisciplinary production class serves as an introduction to, and exploration of electronic media in the arts. Lectures will cover concepts and presentations of musicians working in various capacities with audio, as well as tutorials on specific software packages.<\/p><p>Prerequisite<\/p><p>No prerequisites or prior knowledge needed. Familiarity with computers is helpful but not necessary.<\/p><p>Course Requirements<\/p><ul><li><p>Internet connection<\/p><\/li><li><p>Windows or Apple computer<\/p><\/li><li><p>Ability to install software on your machine (admin account)<\/p><\/li><li><p>Logic or Audacity and Soundation<\/p><\/li><li><p>Digication e-Portfolio account (links and details will be provided) or other web-based sharing<\/p><\/li><\/ul><p>Course Learning Outcomes<\/p><p>Learners who successfully complete this course will have learned the basic skills of Processing, Students will be learn to give critical feedback to their peers about technical and artistic matters through a grounding in the history of technology and the arts. A digital portfolio will showcase your work from this course.<\/p><p>Outcomes:<\/p><p>1. Record, edit, and process digital sound using the basic functions of a Digital Audio Workstation.<\/p>2. Demonstrate creative\/conceptual awareness of sound art through peer critique<br><br>3. Produce an effective 1-3 minute sound work with a formal structure<p><br><\/p><p><b>Textbook &amp; Course Materials<br><\/b>Required Text<br>&nbsp;&nbsp;No required texts<\/p><p>Optional Texts:<\/p><p>MUSIC:<br><\/p><p><a href=\"http:\/\/www.amazon.com\/Electronic-Music-Cambridge-Introductions\/dp\/1107648173\/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1372862386&amp;sr=1-1&amp;keywords=schedel+electronic&amp;tag=coursera-course743-20\" title=\"Link: http:\/\/www.amazon.com\/Electronic-Music-Cambridge-Introductions\/dp\/1107648173\/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1372862386&amp;sr=1-1&amp;keywords=schedel+electronic&amp;tag=coursera-course743-20\">Electronic Music (Cambridge Introductions to Music) <\/a><\/p><p>by Nick Collins &nbsp;(Author) , Margaret Schedel &nbsp;(Author) , Scott Wilson &nbsp;(Author)<\/p><p>ISBN-13: 978-1107648173<\/p><p>Publisher: Cambridge University Press<br><\/p><p>WEB:<\/p><p><a href=\"http:\/\/www.amazon.com\/gp\/product\/1118008189\/ref=ox_sc_imb_mini_detail?ie=UTF8&amp;smid=ATVPDKIKX0DER&amp;tag=coursera-course743-20\">HTML and CSS: Design and Build Websites<\/a><\/p><p>by Jon Duckett<\/p><p>ISBN-13: 978-1118008188<\/p><p>Publisher: Wiley<\/p><br><br><br><h2>GRADING POLICY &amp; COURSE REQUIREMENTS<\/h2><p>Grading<\/p><p>Assignments and your final project are graded through a peer-review process; quizzes are multiple-choice and are graded by the computer. Your work on the assignments, projects will be graded by your peers using unique rubrics for each task.<\/p><br><div><p>Quizzes (5) 30%<\/p><p>Assignments (4) 40%<\/p><p>Project (1) 30 %<\/p><\/div><br><p>Quizzes<\/p><p>After watching each video lecture series, you will take a multiple choice quiz which will count towards your final grade. You can only take these quizzes ONCE. We are using this MOOC to flip the classroom and we do not give our students multiple chances.<\/p><p>There are also “in-video questions,” and you must answer these questions correctly in order to advance the video, but these questions are NOT graded, you can re-do the “in-video” quiz as many times as you need to.<\/p><p>Assignments<\/p><p>Assignments are purely technical; each module will include a detailed explanation of how to complete and grade each assignment. There will be one assignment (which may have multiple components) &nbsp;every week that there is no project due. &nbsp;Each assignment should take you no more than one hour.<\/p><br><p>Project<\/p><p>The final project is both aesthetic and technical; there will be an explanation of how to grade the project but you must remember that art is subjective. You can expect the project to take at &nbsp;least 4 hours to complete.<\/p><p>Disclaimer: “The course schedule, policies, procedures, and assignments in this course are subject to change in the event of extenuating circumstances, by mutual agreement, and\/or to ensure better student learning.”<\/p><p><\/p><p><b>COURSE SCHEDULE<\/b><\/p><p>Week 1 Introduction to Computing and Audio<br>Week 2 Qualities of Sound<br>Week 3 Form and EQ<br>Week 4 How things work - Digital, Analog, MIDI&nbsp;<br>Week 5 Synthesis and Production&nbsp;<br>Week 6 Grading Projects&nbsp;<\/p>",
    "estimatedClassWorkload": "1-4 hours\/week",
    "recommendedBackground": "<p>No background is required; all are welcome!<\/p><div><br><\/div>",
    "links": {

    }
}