{"id":2683,"shortName":"cc2lit","name":"Common Core in Action II: Exploring Literacy Design Collaborative Tools","language":"en","shortDescription":"Learn about and explore tools to incorporate Common Core literacy standards into your content area. In this course you will explore Literacy Design Collaborative resources, and develop a plan to use one of those resources within your context.","aboutTheCourse":"<p><span>The Common Core State Standards are\nnew and will challenge our students to show evidence of learning in new\nways.&nbsp; Instructional shifts are required, especially for teachers who must\nnow incorporate literacy into content areas. Integrating the literacy standards\ncan be difficult to do well. In this course you will have the support of a\ncommunity and harness the power of collaboratively exchanging ideas with\ncolleagues, as you explore a variety of Literacy Design Collaborative tools to\nalign curriculum with the Common Core.<br>\n&nbsp;<br>\nEach week you’ll explore one aspect of the Literacy Design Collaborative model,\nchoosing from a variety of resources to differentiate for your own learning. You’ll\nthen participate in a discussion forum to share you insights, questions, and\napplications with others.&nbsp;<\/span><\/p>","targetAudience":3,"courseSyllabus":"<p>This course will include\nexploration of the Template Task, LDC Core Tools, Mini-Tasks, and the Mini-Task\nLibrary. Participants will differentiate for their own learning by considering\nthe application of one of these aspects of the LDC model.<\/p>\n\n<p>Requirements\nfor course completion include:<\/p>\n\n<p><span>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n<\/span>Pre and post course surveys<\/p>\n\n<p><span>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n<\/span>12 discussion forum posts<\/p>\n\n<p><span>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n<\/span>End of the course plan for application<\/p>\n\n<p><span>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n<\/span>Assessment of 2-3 of your peer’s plans (rubrics are provided)<\/p>","courseFormat":"<p>Class will consist of short\nintroduction videos and links to resources and videos.&nbsp; Participants will\nbe expected to respond to instructor and peer discussion posts. Assignments\nwill be assessed by peers according to provided rubrics. An end-of-course\nreflection and survey are required for completion.<\/p>","suggestedReadings":"None","estimatedClassWorkload":"2-4 hours\/week","recommendedBackground":"<p><span>Classroom teachers and other\neducators in the United States interested in implementing the Common Core State\nStandards for literacy.&nbsp; Teachers of all\nsubjects and grades are welcome.<\/span><\/p>","links":{}}