{"id":410,"shortName":"childliteracy","name":"Children Acquiring Literacy Naturally","language":"en","shortDescription":"This course will survey fundamental principles of language acquisition and learning to read. We will explore the possibility of becoming literate without formal schooling and instruction. No prior background in behavioral science, neuroscience, or technology is required.","aboutTheCourse":"<p>Have recent developments in behavioral\nscience, neuroscience, and technology made it possible&nbsp;to achieve universal literacy with minimal cost? This course explores that important question.&nbsp;The lectures contemplate a revolutionary\nnew age that challenges the survival of our educational institutions and\nsociety as we know them. Learn about current research and theory in language\nacquisition, reading pedagogy, and wearable computing to assess the possibility\nof an interactive system that would enable infants, toddlers, and preschool children to\nacquire literacy naturally.<\/p>","targetAudience":0,"courseSyllabus":"<b>Lecture 1: <\/b>&nbsp;The course&nbsp;begins with the guiding proposal that universal\nliteracy can be achieved with minimal cost. It questions the commonly held belief that written language requires\nformal instruction and schooling whereas spoken language is seamlessly acquired\nfrom birth onward by natural interactions with persons who talk. This proposal\nis followed by an overview of the scientific process because the research and\ntheory discussed in the class will consist of alternative perspectives and the\nstudents will learn how different perspectives are developed and evaluated.\nThis process will enhance their critical thinking skills.<p><\/p>\n\n<p><b>Lecture 2: <\/b>There have been two primary theoretical\nframeworks to describe language and its acquisition. The nativist position\nholds that language and its acquisition are uniquely dependent on a considerable\namount of innate abilities, and unlike other perceptual and cognitive\nfunctions. The empiricist position holds that very little, if any, of language\ndepends on innate abilities and its acquisition can be accounted for by typical\nperceptual and cognitive processes. To evaluate these two theoretical\nframeworks, we will learn about language structure, how it is used, and how it\nis acquired.<\/p>\n\n<p><b>Lectures 3 and 4: <\/b>To set the stage for assessing the\npossibility of naturally acquired reading, we will explore speech perception\nand how it is acquired. Speech has also had two alternative theoretical\nframeworks, and we will consider relevant research that addresses their\ndifferences. The goal of this assessment is to better understand what is\nrequired for speech perception and its acquisition and how these requirements\ncompare to the natural acquisition of reading.<\/p>\n\n<p><b>Lectures 5 and 6: <\/b>These lectures will give an overview of\nresearch and theory on reading and literacy. Given the possibility of naturally\nacquired reading, we will review the nature of reading and how it is currently\ntaught. One of the main goals is to destroy prevalent myths about how we read.\nThis discussion will highlight the assumptions in current practice and how they\ncompare to the possibility of naturally acquired reading.<\/p>\n\n<p><b>Lecture 7: <\/b>As covered in the previous lectures, it is\ncommonly believed that spoken and signed languages are acquired from birth\nonward by natural interactions with persons who talk whereas learning to read\nrequires formal instruction and schooling. We consider the hypothesis that once\nan appropriate form of written text is made available early in a child’s life\nbefore formal schooling begins, reading will also be learned inductively,\nemerge naturally, and with no significant negative consequences. We will\nexamine the role of perception and action modalities in language acquisition\nand use and compare spoken and signed languages to written languages.<\/p>\n\n<p><b>Lecture 8: <\/b>We will describe the demographics of literacy and\nilliteracy and their social and economic implications. The cost of illiteracy\nas well as the huge cost of formal literacy instruction is one of the major\nfinancial burdens on societies.<\/p>\n\n<p><b>Lecture 9: <\/b>We will study the implications of naturally\nacquired literacy for individuals who are spoken and\/or written language\nchallenged because of deafness or other impairments.<\/p>\n\n<p><b>Lecture 10. <\/b>We will review past technological developments\nto set the stage for peering into the future. We will discuss the various technologies\navailable or soon to be available that will allow growing children to\nexperience an augmented reality that will be capable of supplementing their\nreal world experience with various forms of language generated automatically.<\/p>","courseFormat":"This course includes 10 hours of lecture material presented in a series of videos. Quizzes and assessments throughout the course will assist in learning. All\nlectures will involve some recommended readings. Discussion on the course forum\nwill be encouraged.\n\n<br>","suggestedReadings":"All of these readings are available without any purchase.<p><\/p>\n\n<p>Beddinghaus, T. (2010). <a href=\"http:\/\/vision.about.com\/od\/childrensvision\/tp\/vision_develop.htm\" target=\"_blank\">Top 5 Milestones in Vision Development<\/a>.<\/p>\n\n<p>Christakis, D. (2009). Univ. of Washington.&nbsp;<a href=\"http:\/\/www.seattlechildrens.org\/healthcare-professionals\/aar\/2009\/highlights\/healthy-media-use\/\" target=\"_blank\">Healthy Media Use<\/a>.<\/p>\n\n<p>PajamaProgram.org (2011). <a href=\"http:\/\/www.pajamaprogram.org\/literacy.html\" target=\"_blank\">Drop Out Rates<\/a>.<\/p>\n\n<p>Education-Portal.com (2010). <a href=\"http:\/\/education-portal.com\/articles\/Illiteracy:_The_Downfall_of_American_Society.html\" target=\"_blank\">Illiteracy: The Downfall of American Society<\/a>.<\/p>\n\n<p>Wikipedia.org (2011). <a href=\"http:\/\/en.wikipedia.org\/wiki\/HUD_%28video_gaming%29\" target=\"_blank\">Heads-Up Display<\/a>.<\/p><p>The Wall Street Journal (2012).&nbsp;<a href=\"http:\/\/online.wsj.com\/article\/SB10001424052702303610504577418181348485336.html\" target=\"_blank\">A New Home for Computer Screens: The Face<\/a>.<\/p>\n\n<p>American Optometric Association.&nbsp;<a href=\"http:\/\/www.aoa.org\/x9420.xml\" target=\"_blank\">Infant Vision: Birth to 24 Months of Age<\/a>.<\/p>\n\n<p>Laubach Literacy Statistics (2011). <a href=\"http:\/\/www.policyalmanac.org\/education\/archive\/literacy.shtml\" target=\"_blank\">Literacy in the United States<\/a>.<\/p>\n\n<p>Massaro, D. W. (2011). Method And System For Acquisition Of Literacy. Patent Application Number 13\/253,335, October 5, 2011.<\/p>\n\n<p>Massaro, D. W. (2012). Acquiring Literacy Naturally: Behavioral science and technology could empower preschool children to learn to read naturally without instruction, American Scientist, 100, 324-333.<\/p>\n\n<p>Massaro, D. W. (2012). Experimental Psychology: Am Information Processing Approach. Chapter 17: Speech Perception.<\/p>\n\n<p>Massaro, D. W. (2012). Experimental Psychology: Am Information Processing Approach. Chapter 20: Reading.<\/p>\n\n<p>Massaro, D. W. (2012). Experimental Psychology: An Information Processing Approach. The Scientific Process.<\/p>","instructor":"Dominic William Massaro and Dominic William Massaro","estimatedClassWorkload":"3-7 hours\/week","recommendedBackground":"You should be familiar with or interested in understanding the scientific method, the structural features of language and how it is understood, and how evidence-based inquiry guides behavioral science inquiry.<br>","links":{}}