{"id":426,"shortName":"videogameslearning","name":"Video Games and Learning","language":"en","shortDescription":"Video games aren’t just fun, they can be powerful vehicles for learning as well. In this course, we discuss research on the kinds of thinking and learning that go into video games and gaming culture, benefits and drawbacks of digital gameplay, tensions between youth culture and traditional education, and new developments intended to bridge that growing divide.","aboutTheCourse":"Video games are one of the fastest trending topics in media, education, and technology. Research across fields as disparate as science, literacy, history, visual processing, curriculum, and computer science suggests that video games aren’t just fun –\nthey can actually be good for your mind as well. In this course, we will discuss current research on the kinds of thinking and learning that go into video games and gaming culture. We’ll investigate the intellectual side of digital gameplay, covering\ntopics that range from perception and attention in Left 4 Dead 2 to the development of historical understanding in Civilization to collaborative learning in massively multiplayer online games like World of Warcraft. Throughout the course, we examine the\ninherent tensions between contemporary youth culture and traditional education and new developments in games for learning that promise to help bridge that growing divide.\n<br>\n<br>If you do have questions about the course itself, please direct your inquiries to <a href=\"mailto:vglcoursera@gmail.com\" target=\"_blank\">vglcoursera@gmail.com<\/a>.\n<br>\n<br>Data from this course is being used for quality assurance and for educational research purposes. All data from minors will be excluded from use in educational research purposes. See Coursera’s Terms of Use for a description of the data captured from course\nactivity. Please contact&nbsp;<a href=\"mailto:outreach@learninggamesnetwork.org\" target=\"_blank\">outreach@learninggamesnetwork.org<\/a>&nbsp;with any questions or concerns. If you do not wish to have your data from this course used for educational research purposes, you may dis-enroll from this course.<br>","targetAudience":0,"courseSyllabus":"Week One – <b>Introduction: Games and Learning?!<\/b><br>Week Two – <b>Game Design for Learning?<\/b><br>Week Three – <b>Game Culture & Learning<\/b><br>Week Four – <b>Games & Cognition<\/b><br>Week Five – <b>Games & Content Subject Matter<\/b><br>Week Six – <b>Games & The Institution of Education<\/b> ","courseFormat":"Each week you can expect video lectures, readings, and one or more assignments, including ample discussion of each in the forums. Though we hope you complete the entire course, you can choose to focus on what interests you.","suggestedReadings":"<span><p>Squire, K. (2011). <i>Video Games and Learning: Teaching and Participatory Culture in the Digital Age. Technology, Education--Connections (the TEC Series)<\/i>. Teachers College Press. 1234 Amsterdam Avenue, New York, NY 10027.<\/p>\n<p>Steinkuehler, C., Squire, K. & Barab, S. (2012) <i>Games, Learning and Society: Learning and Meaning in the Digital Age.<\/i> Cambridge University Press.<\/p>\n<p>Gee, J.P. (2004). <i>Situated Language & Learning: A Critique on Traditional Schooling.<\/i> Routledge.<\/p>\n<p>Gee, J.P. (2007). <i>What Video Games Have to Teach Us About Learning and Literacy. Second Edition: Revised and Updated<\/i>. New York: Palgrave Macmillan.<\/p><\/span>","instructor":"Constance Steinkuehler and Kurt Squire","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"Though the course targets an undergraduate audience, there is no prerequisite for completing the course.","links":{}}