{"id":1186,"shortName":"historyofec","name":"История экономической мысли (History of Economic Thought)","language":"ru","shortDescription":"Курс поможет осмыслить извечные проблемы жизни человека: богатство и бедность, деньги и рынки, инфляция и безработица, индивидуальные решения и государственная политика.\nThe course will help you to understand the lasting economic problems of everyday human life: wealth and poverty, money and markets, inflation and unemployment, human decisions and governmental policies. ","aboutTheCourse":"<p>Свои повседневные экономические решения –&nbsp;<i>что купить, куда пойти работать, как сберечь накопленный доход<\/i>&nbsp;– человек обычно принимает без сложных расчетов, руководствуясь здравым смыслом. Не всегда, к сожалению, здравый смысл оказывается достаточно просвещенным и тренированным.&nbsp;<\/p><p>Экономические понятия, которыми мы мыслим, складывались в разные эпохи и несут, порой, совсем не тот смысл, который мы по инерции в них вкладываем. Мы копим деньги, порой, так, как это делали наши предки столетия тому назад, хотя деньги тогда были из драгоценных металлов, а ныне они бумажные. Мы легко ссылаемся на рост ВВП, плохо осознавая, что за этим стоит. Мы верим обещаниям политиков сделать нашу жизнь богатой и счастливой, не различая, каким обещаниям можно верить, а какими нас откровенно обманывают. &nbsp;&nbsp;<\/p><p>История экономической мысли – это квинтэссенция опыта решения сложных проблем хозяйственной жизни; опыта, который складывался в борьбе идей, отражавших конфликтующие социальные интересы. В нашем курсе обобщаются уроки выдающихся экономических мыслителей: Адама Смита и Карла Маркса, Леона Вальраса и Йозефа Шумпетера, Торстейна Веблена и Николая Кондратьева, Джона М. Кейнса и др. Мы будем разбираться в том, как, отвечая на вызовы своего времени, они создавали корпус современного экономического знания с его возможностями и ограничениями. Тем самым мы рассчитываем сделать ваш экономический здравый смысл более тренированным и просвещенным.<br><\/p><p><br><\/p><p>We tend to make&nbsp;<span>everyday economic decisions – <i>what to buy, what job to choose, how to save one's income<\/i> – without complicated calculations, instead relying on common sense.\nUnfortunately, common sense does not always appear to be enlightened and\ntrained enough.<\/span><\/p>\n\n<p>Economic conceptions, with which we think, were shaped\nin different epochs and often bear not that very sense we tend to put into\nthem. We sometimes accumulate money in a way our predecessors did, although at\nthat time it was gold or silver, while now we deal with just paper. We easily\nrefer to GDP, being hardly aware of complexities behind this notion. We believe\nto politicians promising to make our life wealthy and happy, not distinguishing\nreliable promises from those just fooling us.&nbsp;<\/p>\n\n<p>History of economic thought is a distillation of experiences in solving complicated\nproblems of economic life – experiences that were shaped in struggle of ideas\nwith conflicting social interests behind them. In our course we summarize\nlessons of outstanding economic thinkers, such as Adam Smith and Karl Marx,\nLeon Walras and Joseph Schumpeter, Torstein Veblen and Nikolai Kondratieff,\nJohn M. Keynes and others. We shall analyze how responding to the challenges of\ntheir times they created the corps of our economic knowledge with its powers\nand limitations. Thus we hope to make your economic common sense more\nenlightened and better trained.<\/p>\n\n<p><\/p>","targetAudience":0,"courseSyllabus":"<p>1-я неделя:&nbsp;<i>Экономика как наука: муки рождения<\/i><\/p><p>2-я неделя:&nbsp;<i>Адам Смит и другие: экономическая классика<\/i><\/p><p>3-я неделя:&nbsp;<i>Феномен Карла Маркса<\/i><\/p><p>4-я неделя:&nbsp;<i>Вызов экономических кризисов, или предыстория макроэкономики<\/i><\/p><p>5-я неделя:&nbsp;<i>Маржинализм – наука об экономическом поведении<\/i><\/p><p>6-я неделя:&nbsp;<i>Воспоминания о будущем капитализма: о Веблене, Шумпетере и др.<\/i><\/p><p>7-я неделя:&nbsp;<i>Серебряный век российской экономической мысли<\/i><\/p><p>8-я неделя:&nbsp;<i>Джон Мейнард Кейнс: революционер-реформатор<\/i><\/p><p>9-я неделя:&nbsp;<i>Макроэкономика после Кейнса: в поисках «генеральной линии»<\/i><\/p><p>10-я неделя: Э<i>кономическая наука в современном мире: новые подходы и меняющиеся контексты<\/i><\/p>","courseFormat":"<p>Занятия\nбудут состоять из лекционных 10-12-минутных видео, перемежающихся вопросами к\nслушателям. Перед некоторыми лекциями мы будем рекомендовать для чтения\nфрагменты текстов выдающихся экономистов, которым будет посвящена часть задаваемых\nвопросов.<\/p>\n\nИз аналогичных заданий будет состоять и заключительный\nэкзамен.","suggestedReadings":"<p>Дополнительной\nлитературой будут фрагменты текстов выдающихся экономистов, которые мы\nпредложим к соответствующим лекциям.<\/p>\n\n<span>В качестве вспомогательного пособия по курсу можно\nвоспользоваться нашим учебником<b><i>: История экономических учений<\/i><\/b>. Под\nред. В.С. Автономова, О.И. Ананьина и Н.А. Макашевой. М.: Инфра-М. 2012<\/span>","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"<span>\n <span><span>\n  <span>\n  <p>Специальных знаний, выходящих за\n  пределы общеобразовательной школы, не предполагается.<\/p>\n  <\/span>\n <\/span>\n<\/span><\/span>","links":{}}