{"id":691,"shortName":"virology2","name":"How Viruses Cause Disease","language":"en","shortDescription":"Introductory virology course that covers the interplay between viruses and their host organisms, with with the goal of understanding viral diseases and their prevention.","aboutTheCourse":"This introductory virology course explores the interplay between viruses and their host organisms. The course begins with an overview of how infection is established in a host, then moves to a virologist's view of immune defenses.  Next we consider how the replication strategy and the host response determine the outcome of infection, such that some are short and others are of long duration. The mechanisms by which virus infections transform cells in culture are explored, a process that may lead to tumor formation in animals. We then move to a discussion of how viral infections are controlled by vaccines and antiviral drugs. After an introduction to viral evolution, we discuss the principles learned from zoonotic infections, emerging infections, and humankind's experiences with epidemic and pandemic viral infections. The course ends with an exploration of unusual infectious agents such as viroids, satellites, and prions, followed by a discussion of the causative agent of the most serious current worldwide epidemic, HIV-1.","targetAudience":1,"courseSyllabus":"<div><b>Week 1<\/b><br>Infection basics<br>Entry into the host<br>Viral spread<br>Tissue invasion and tropism<br>Transmission and seasonality<\/div>\n<div><b>Week 2<\/b><br>Innate immune responses<br>Interferon<br>Sentinels and complement<br>Inflammation<br>Adaptive immunity<\/div>\n<div><b>Week 3<\/b><br>Viral virulence<br>Mechanisms of cell injury I<br>Mechanisms of cell injury II<br>Host susceptibility<\/div>\n<div><b>Week 4<\/b><br>Acute infections<br>Influenza<br>Poliomyelitis<br>Measles<br>Gastroenteritis<br>West Nile fever<\/div>\n<div><b>Week 5<\/b><br>Persistent infections<br>Persistence by modulating the adaptive response<br>Two persistent infections<br>Herpes simplex virus<br>Epstein-Barr virus<\/div>\n<div><div><b>Week 6<\/b><br>Transformation<br>RNA tumor viruses<br>Transforming retroviruses<br>DNA tumor viruses<br>Epiphenomena of a unique life style<\/div><div><b>Week 7<\/b><br>Vaccines<br>How do you make a vaccine?<br>Inactivated vaccines<br>Attenuated vaccines<\/div><\/div>\n<div><b>Week 8<\/b><br>Antivirals<br>Antiviral discovery<br>Antiviral resistance<br>Other antiviral targets<br>HIV antivirals<\/div>\n<div><b>Week 9<\/b><br>Viral evolution<br>Drivers of evolution<br>Error threshold and bottlenecks<br>Selection<br>Origins of viruses<\/div>\n<div><b>Week 10<\/b><br>Emerging viruses<br>Host-virus interactions<br>Examples of emerging viruses<br>SARS and MERS<br>Canine parvovirus<\/div>\n<div><b>Week 11<\/b><br>Viroids<br>Satellites<br>Transmissible spongiform encephalopathies<br>Prions<\/div>\n<div><b>Week 12<\/b><br>HIV and AIDS<br>The origin of HIV<br>HIV pathogenesis<br>An amazing but deadly virus<\/div>","courseFormat":"This class consists of lecture videos which are between 10-15 minutes in length. There will also be standalone quizzes and a final exam.","suggestedReadings":"The recommended textbook is <i>Principles of Virology. Vol I: Molecular Biology, Vol. II: Pathogenesis and Control<\/i> (S.J. Flint et al., Third Edition, ASM Press 2009). You don't need to buy this book to do well in this course, as the lectures\nare self-contained, but if you are very interested in virology, it's a great resource.\n<div>\n    <br>\n<\/div>Students are expected to read Prof. Racaniello’s virology blog (<a href=\"http:\/\/www.virology.ws\" target=\"_blank\">virology.ws<\/a>) which will contain information relevant to the course.\n<br>\n<div>\n    <br>\n<\/div>\n<div>Students are expected to listen to the weekly podcast <i><a href=\"http:\/\/www.twiv.tv\">This Week in Virolog<\/a>y <\/i> produced by Prof. Racaniello, for additional material about viruses relevant to the course. You can subscribe to TWiV at <a href=\"http:\/\/www.twiv.tv\">www.twiv.tv<\/a> or\n    on \n    <a href=\"http:\/\/itunes.apple.com\/WebObjects\/MZStore.woa\/wa\/viewPodcast?id=300973784\">iTunes<\/a>. <\/div>","estimatedClassWorkload":"3-4 hours\/week","recommendedBackground":"Two semesters of a rigorous, molecularly-oriented introductory biology course and Virology I: How Viruses Work.","links":{}}