{"id":20,"shortName":"gametheory","name":"Game Theory","language":"en","previewLink":"https:\/\/class.coursera.org\/gametheory-003\/lecture\/preview","shortDescription":"The course covers the basics: representing games and strategies, the extensive form (which computer scientists call game trees), repeated and stochastic games, coalitional games, and Bayesian games (modeling things like auctions).","aboutTheCourse":"Popularized by movies such as \"A Beautiful Mind\", game theory is the mathematical modeling of strategic interaction among rational (and irrational) agents. Beyond what we call 'games' in common language, such as chess, poker, soccer, etc., it includes the modeling of conflict among nations, political campaigns, competition among firms, and trading behavior in markets such as the NYSE. How could you begin to model eBay, Google keyword auctions, and peer to peer file-sharing networks, without accounting for the incentives of the people using them? The course will provide the basics: representing games and strategies, the extensive form (which computer scientists call game trees), Bayesian games (modeling things like auctions), repeated and stochastic games, and more. We'll include a variety of examples including classic games and real-world applications.","targetAudience":1,"courseSyllabus":"<p><b>Week 1. Introduction:<\/b>  Introduction, overview, uses of game theory,\nsome applications and examples, and formal definitions of: the normal form,\npayoffs, strategies, pure strategy Nash equilibrium, dominated strategies.<\/p>\n\n<p><b>Week 2. Mixed-strategy\nNash equilibria:<\/b> Definitions, examples, real-world evidence.<\/p>\n\n<p><b>Week 3. Alternate\nsolution concepts: <\/b>iterative removal of strictly dominated strategies,\nminimax strategies and the minimax theorem for zero-sum game, correlated equilibria.<\/p>\n\n<p><b>Week 4.\nExtensive-form games:<\/b> Perfect information games: trees, players assigned to\nnodes, payoffs, backward Induction, subgame perfect equilibrium, introduction\nto imperfect-information games, mixed versus behavioral strategies.<\/p>\n\n<p><b>Week 5. Repeated\ngames:<\/b> Repeated prisoners dilemma, finite and infinite repeated games,\nlimited-average versus future-discounted reward, folk theorems, stochastic\ngames and learning.<\/p>\n\n<p><b>Week 6. Coalitional games:\n<\/b>Transferable utility cooperative games, Shapley value, Core, applications.<\/p>\n\n<p><b>Week 7. Bayesian\ngames: <\/b>General definitions, ex ante\/interim Bayesian Nash equilibrium.<\/p>","courseFormat":"<p>The course consists of the following materials:<\/p>\n\n<ul><li><b>\nVideos<\/b>.  The lectures are delivered via videos, which are broken into small chunks, usually between five and fifteen minutes each.\nThere will be approximately one and a half hours of video content per week.  You may watch the lecture videos at your convenience. Lower-resolution videos are also available for those with slow internet connections.<br><\/li><li><b>\nSlides. <\/b> We have made available pdf files of all the lecture slides.<br><\/li><li><b>\nQuizzes.  <\/b>There will be non-graded short \"quiz\" questions that will follow some of the videos to help you gauge your understanding.<\/li><li>\n<b>Online Lab Exercises  <\/b>After some of the videos, we will ask you\n to go online to play some games.  These are entirely optional, and are designed to illustrate some of the concepts from the course.<\/li><li><b>\nProblem Sets.  <\/b>There will also be graded weekly problem\n sets that you will also answer online, but may work through offline; \nthose must be completed within two weeks of the time that they are \nposted in order to be graded for full credit.  If you miss a problem set\n deadline, you may complete it before the end of the course for half \ncredit.  You may discuss problems from the problem sets with other \nstudents in an online forum, without providing explicit answers.<\/li><li><b>\nFinal Exam.  <\/b>There will be an online final exam that you will \nhave to complete within two weeks of its posting.  Once you begin the \nexam, you will have four hours to complete it.  <\/li><li><b>\nScreen-side Chats.  <\/b>A couple of times during the course, we will hold a brief online chat where we \nanswer  questions and discuss topics relevant to the course.<\/li><\/ul>","suggestedReadings":"The following \nbackground readings provide more detailed coverage of the course \nmaterial:<ul><li><a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=gametheory&isbn_ean=9781598295931\">Essentials of Game Theory<\/a>, by Kevin Leyton-Brown \nand Yoav Shoham; Morgan and Claypool Publishers, 2008. This book has the same structure as the course, and covers most of the same material. It is free if you access the link from a school that subscribes to the Morgan & Claypool Synthesis Lectures, and otherwise costs $5 to download. You can also get it as a printed book from (e.g.) <a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=gametheory&isbn_ean=9781598295931\">amazon.com<\/a>, or as an ebook for <a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=gametheory&isbn_ean=9781598295931\">Kindle<\/a> or <a href=\"https:\/\/play.google.com\/store\/books\/details?id=u8sDLATVJikC&rdid=book-u8sDLATVJikC&rdot=1&source=gbs_atb\">Google devices<\/a>.<br><\/li><li><a href=\"http:\/\/papers.ssrn.com\/sol3\/papers.cfm?abstract_id=1968579\">A Brief Introduction to the Basics of Game Theory<\/a>, by Matthew O. Jackson. These notes offer a quick introduction to the basics of game theory; they are available as a free PDF download.<\/li><\/ul>","instructor":"Kevin Leyton-Brown, Matthew O. Jackson and Yoav Shoham","estimatedClassWorkload":"5-7 hours\/week","recommendedBackground":"You must be comfortable with mathematical thinking and rigorous \narguments. Relatively little specific math is required; the course \ninvolves lightweight probability theory (for example, you should know \nwhat a conditional probability is) and very lightweight calculus (for \ninstance, taking a derivative).<br>","links":{}}