{"id":27,"shortName":"algs4partII","name":"Algorithms, Part II","language":"en","shortDescription":"This course covers the essential information that every serious programmer needs to know about algorithms and data structures, with emphasis on applications and scientific performance analysis of Java implementations.","aboutTheCourse":"Part II covers graph-processing algorithms, including minimum spanning tree and shortest paths algorithms, and string processing algorithms, including string sorts, tries, substring search, regular expressions, and data compression, and concludes with an overview placing the contents of the course in a larger context.","targetAudience":1,"courseSyllabus":"","courseFormat":"There will be two lectures (75 minutes each) each week. The lectures are each broken into about 4-6 segments, separated by interactive quiz questions for you to to help you process and understand the material. In addition, there will be a problem set and a programming assignment each week and there will be a final exam.","suggestedReadings":"Although the lectures are designed to be self-contained, students wanting to expand their knowledge beyond what we can cover in this 7-week class can find much more extensive coverage of these topics in our book <a href=\"http:\/\/amzn.to\/13VNJi7\">Algorithms (4th Edition)<\/a><img width=\"0\" src=\"http:\/\/www.assoc-amazon.com\/e\/ir?t=coursera-20&amp;l=as2&amp;o=1&amp;a=032157351X\" height=\"0\" style=\"border: none !important; margin: 0px !important; display: none !important; visibility: hidden !important; opacity: 0 !important; background-position: 0px 0px;\">, published by Addison-Wesley Professional.","instructor":"Kevin Wayne and Robert Sedgewick","estimatedClassWorkload":"6-12 hours\/week","recommendedBackground":"You need basic familiarity with programming in Java and the algorithms and data structures from Algorithms, Part I. This course is primarily aimed at first- and second-year undergraduates interested in engineering or science, along with high school students and professionals with an interest (and some background) in programming.","links":{}}