{
    "id": 1735,
    "shortName": "forensicaccounting",
    "name": "Forensic Accounting and Fraud Examination",
    "language": "en",
    "shortDescription": "Everyday across the world, thousands of businesses are victimized by fraud.  Who commits these bad acts?  Why? And, how? In this course we are going to help you answer the questions: who commits fraud, why and how.  We’ll also help you develop skills for catching them.",
    "aboutTheCourse": "<p>Fraud\nis prevalent around the world, having a significant impact on the global\neconomy. The Association of Certified Fraud Examiners (ACFE) 2014 Report to the\nNations projects that in 2013, worldwide fraud approached $3.7 trillion, or as\nmuch as 5% of the productive economy.<br>\n<br>\nUnderstanding and combating fraud, nefarious financial activities associated\nwith organized crime and terrorist financing is a multidimensional task. Some\nfraudsters are characterized as good persons making a bad decision that appear\nout of character for the individual. At the same time, there are fraud schemes\nand criminal organizations established solely for the purpose of defrauding\ntheir victims to accumulate massive amounts of cash and other assets through\nactivities like systematic credit card and healthcare fraud. In this course, you will develop the skills to\nidentify accidental versus predator fraudsters. <br><\/p><p><\/p>\n\n<p>Next the course introduces the topics of evidence, data\nanalysis and investigations; During this\nstage, the course discusses cutting edge data mining, big data analysis tools,\nthe examination of evidence and an overview of investigation techniques\ncentered on putting fraud examination and forensic accounting cases together.<\/p>\n\n<p>From there the course examines more sophisticated approaches\nto concealment, money laundering, in the hopes of turning ill-gotten gains into\nmoney and other assets seemingly derived from legitimate sources.&nbsp; Money laundering is featured as both a\nconcealment technique as well and a devise for clearing tainted assets.<\/p>\n\n<p>Finally, the course considers the important role of\nwhistle-blowing in the anti-fraud arsenal.&nbsp;\nThe most common way in which frauds are discovered is by “tips.” Tips are the information provided by whistle-blowers. As such, effective\nanti-fraud measures need to provide whistle-blowing options to detect frauds at\nthe earliest time in order to minimize damage.<\/p>\n\n<p>These topics are delivered over five weeks. Our primary teaching tool will be the case\nmethod. Through anecdotes sprinkled in\ncourse lectures as well as videos of actual fraudsters in action, this courses\nis hands-on, immersing participants in actual frauds perpetrated by bad guys,\nproviding relevant, real world knowledge, tools and skills to develop a deeper\nunderstanding of forensic accounting and fraud examination.<\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<strong>Week One:<\/strong> The Accidental Fraudster.<br><strong>Week Two:<\/strong> The Predator Fraudster.<br><strong>Week Three:<\/strong> Big Data, Benford's Law and Financial Analytics.<br><strong>Week Four:<\/strong> Cyber-Crime and Money Laundering: Contemporary Tools and Techniques.<br><strong>Week Five:<\/strong> Financial Statement Fraud and Whistle-Blowing.<br>",
    "estimatedClassWorkload": "3-5 hours\/week",
    "recommendedBackground": "For this course no background is required and all are welcome!",
    "links": {

    }
}