{
    "id": 1648,
    "shortName": "circaclock",
    "name": "Circadian clocks: how rhythms structure life",
    "language": "en",
    "shortDescription": "This course is geared towards starting undergraduate students. A solid background in biology will be helpful but not absolutely essential. The material will be of interest to those who are pursuing a career in any of the life sciences as well as anyone who has run up against their biological clock.",
    "aboutTheCourse": "<p>Have you ever wondered why some\npeople sleep later or earlier than others or why your sleep times are seasonal?\nDid you know that even fungi make spores earlier or later than their relatives\neach day? Daily rhythms – from gene expression to behaviour – are everywhere in\nnature and they form a web of rhythmic interactions – from bees to blossoms to\nmoles to hawks. That we are earlier or later than our neighbours or even than family\nmembers is due to a combination of our genes, our age and our environment. In\nthis Coursera offering, you will be taught about the science of chronobiology,\nwith a specific emphasis on daily or circadian clocks. We will discuss a\nvariety of biological clock systems from bacteria to humans and will explain how\ncircadian systems are organised from the molecular mechanisms that generate the\ndaily rhythms to the many ways that circadian clocks control our lives.<\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<p>&nbsp;Lecture&nbsp;One: Introduction to\n'chronobiology'. What sorts of rhythms are observed in nature? Most of the\nlecture will be spent on describing daily or circadian rhythms in organisms\nfrom bacteria to man.<\/p>\n\n<p>&nbsp;Lecture Two: Circadian rhythms synchronise to\nthe 24-hour environment. Organisms use specialised photoreceptors to do this\nand they display characteristic properties in this process. We experience this\nactive synchronisation process for example when we suffer from jet lag!<\/p>\n\n<p>&nbsp;Lecture Three: We will discuss the\nelaborate molecular mechanisms that allow circadian clocks to produce their\ndaily rhythms and to synchronise them to its environment. We will compare these\nmechanisms in a wide range of organisms.<\/p>\n\n<p>&nbsp;Lecture Four: Circadian clocks serve to\norchestrate physiology and metabolism in a coordinated way over the course of\nthe day. Therefore, practically all processes in an organism are\nregulated&nbsp;outputs of the clock. We'll discuss examples of these processes\nand ideas about how this circadian regulation works.<\/p>\n\n<p>&nbsp;Lecture Five: With the appreciation of the\nclock’s global control, we proceed to discussing how much this temporal\nprogramme controls our lives from birth to death and how much we mistreat the\ncircadian clock in modern life.<\/p>\n\n<p>&nbsp;Lecture\nSix: Finally, we will look at the clock’s relationship to pathology.&nbsp; What are the consequences of living against\nthe clock, what happens if the clock ‘breaks’, and how can we use our knowledge\nabout the circadian system in medical diagnosis and therapy.<\/p>",
    "estimatedClassWorkload": "3-6 hours\/week",
    "recommendedBackground": "All are welcome! If you wish to earn a certificate, the successful completion of introductory university-level biology will be helpful.",
    "links": {}
}