{"id":277,"shortName":"steinmicro","name":"Principles of Microeconomics","language":"en","shortDescription":"Learn how markets work, what they accomplish well and what their limitations are.","aboutTheCourse":"<p>\n\t\n\t\n\t\n\n\n<\/p><p>We make economics\ndecisions every day: what to buy, whether to work or play, what to\nstudy. We respond to markets all the time: prices influence our\ndecisions, markets signal where to put effort, they direct firms to\nproduce certain goods over others. Economics is all around us. <\/p><p>This\ncourse is a rigorous introduction to the microeconomic theory of\nmarkets: why we have them, how they work, what they accomplish. We\nwill explore what outcomes they generate when they work well\nand what happens when they do not. We will learn why governments are\nimportant and when regulation and intervention is necessary. Examples\nare taken from everyday life, from goods and services that we all\npurchase and use. We will apply the theory to current events and\npolicy debates through weekly exercises. These will empower you to be\nan educated, critical thinker who can understand, analyze and\nevaluate market outcomes. \n<\/p>\n<p><br>\n<\/p><p><\/p>","targetAudience":0,"courseSyllabus":"<p><b>Week One<\/b>: Where do\nmarkets come from? We will start with understanding the constraint of scarcity\nthat we face and the concept of opportunity cost that reflects the true cost of any decision we make.<\/p><p><b>Week Two:<\/b> We will discuss how gains from specialization according to our comparative advantage allows us to use our resources efficiently. We will apply these concepts to a simple model of trade.<br><\/p><p><b>Week Three<\/b>: We will introduce the\nbasic model of Supply & Demand. This will allow you to communicate with other economists\nand finally understand those business pages and market updates. <br><\/p>\n<p><b>Week Four<\/b>: There is a lot of terminology this week. We will introduce of the concept of elasticity to discuss effects of price\nand income changes on market outcomes.Then we will explore the\ngreat accomplishment of markets: maximizing the size of the pie or the total benefit to society.<\/p><p><b>Week Five: <\/b>What\nhappens when government intervenes in the market? We will analyze\nprice floors and ceilings, taxes and subsidies and learn how the best intentions sometimes lead to very unfortunate results.<br><\/p>\n<p><b>Week Six<\/b>:\nIntroduction to firms’ decisions: understanding firms’ cost\ncurves and the goal of profit maximization.<\/p>\n<p><b>Week Seven<\/b>: The\nPerfectly Competitive Market: what is it? does it exist? why is it a\ncrucial benchmark? \n<\/p>\n<p><b>Week Eight<\/b>:\nMonopolies of various types: one price monopoly, natural monopoly,\nprice discrimination and monopolistic competition. What market\noutcomes do we get in each case? How should government intervene in\nsuch cases?<\/p>\n<p><b>Week Nine<\/b>: Understanding the market for labor. Defining employment and unemployment. We will learn about the minimum wage and the concerns economist have with setting it too high. We will also learn of cases were minimum wage makes sense<\/p><p><b>Week Ten:<\/b> When\nmarkets fail: externalities and public good. We will cover the classical approach to these topics as well as introduce a few simple concepts from Game Theory to understand the Tragedy of the Commons.<br><\/p>\n<p><b>Week Eleven<\/b>: Poverty\nand inequality: how do we measure these? How do we balance our\nconcern about poverty and inequality while allowing markets to work\nfor the benefit of society at large?   <\/p><br>","courseFormat":"<p>The class will consist of lecture\nvideos which are between 8 and 15 minutes long. Each video will\ninclude integrated questions to help you assess your\ncomprehension. <br><\/p><p>There are <b>weekly <\/b>assignments. Each week there will be a\n10 question multiple choice assessment. We will also have six extended assignments in the course that require applying the model, our graphs and numerical examples to analyze an example based on recent news article. Three of these assignments will be auto graded and three will be peer assessments.<\/p><p>There is a final exam. You will have two weeks to complete it.<br><\/p>\n<p><br>\n<\/p>","suggestedReadings":"<p>There are many wonderful introductory texts to Microeconomics that you\n    could use to supplement the Coursera material. At the University of Pennsylvania\n    I have been using Michael Parkin’s “ <a title=\"Link: http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=steinmicro&isbn_ean=9780132830881\" href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=steinmicro&isbn_ean=9780132830881\">Principles of Microeconomics<\/a>” as I\n    find it especially rigorous and accurate. You are welcome to use any basic\n    text or none at all.<\/p>\n<p>I do recommend reading economic newspapers and popular books on the topic.\n    My favorite is The Economist, especially the Business and the Finance and\n    Economics sections. This course will help your fluency in understanding\n    such material.<\/p>\n<p>\n    <br>\n<\/p>","instructor":"Rebecca Stein","estimatedClassWorkload":"5-8 hours\/week","recommendedBackground":"<p>Economics requires thinking in three\n“languages”: words, graph and mathematical notation. All concepts\nare introduced slowly and gradually, but comfort with thinking\nanalytically will be helpful.<\/p>","links":{}}