{"id":3513,"shortName":"bigdatabrasil","name":"Big Data em Saúde no Brasil","language":"pt-br","shortDescription":"Aprenda a utilizar as novas metodologias de big data para a análise de grandes bancos de dados e para a melhoria dos processos de tomada de decisão.","aboutTheCourse":"Em 1988 foi criado o Sistema Único de Saúde (SUS), nosso sistema público e universal de saúde. Apesar da sua importância na diminuição das disparidades em saúde, o sistema de saúde tem\nconsistentemente liderado a lista de maiores problemas do país segundo as pesquisas de\nopinião. Reclamações frequentes sobre o sistema privado têm contribuído para a conclusão de que a saúde é um\nproblema generalizado no país. O uso de big data pode trazer melhorias\nsignificativas em termos de gestão, transparência e responsabilidade por parte dos\nprovedores de saúde, além de fornecer dados importantes para os pacientes.<br><br>Este curso irá abordar tanto a obtenção de dados em saúde como a sua utilização para\nmelhorar a qualidade de tomada de decisões por parte de hospitais e das diferentes esferas do governo. Mais especificamente, abordaremos as fontes de dados públicos de saúde, o uso do R e do Python para a\nanálise de dados, metodologias de big data (como machine learning, redução de\ndimensão e como evitar associações espúrias), noções de economia da saúde e o uso de metodologias causais em pesquisas científicas.&nbsp;Apesar de o foco do curso ser a área da saúde, os conhecimentos podem ser diretamente aplicados em outras áreas como a educação, biologia, economia e administração.<br><br>As aulas já começaram e você pode assistir normalmente a todo o conteúdo do curso independentemente do período de inscrição.","targetAudience":1,"courseSyllabus":"<ul><li><strong>Primeiro módulo<\/strong>: Perspectivas do uso de big data no Brasil (estudos multicêntricos, prontuários eletrônicos, medicina de precisão e internet das coisas).<br><\/li><\/ul><ul><li><strong>Segundo módulo<\/strong>: Linguagens de programação mais utilizadas em big data (R e Python).<\/li><\/ul><ul><li><strong>Terceiro módulo<\/strong>: Metodologias de big data (machine learning, redução de dimensão e controle de associações espúrias).<\/li><\/ul><ul><li><strong>Quarto módulo<\/strong>: Causalidade (propensity score, regressão descontínua, diferenças em diferenças, variáveis instrumentais e randomização mendeliana).<\/li><\/ul><ul><li><strong>Quinto módulo<\/strong>: As \"imperfeições\" da saúde pública - Introdução à Economia da Saúde (informação assimétrica, seleção adversa, risco moral e o problema do agente-principal).<\/li><\/ul><ul><li><strong>Sexto módulo<\/strong>: Limitações e conclusão (privacidade e o uso de big data para uma nova saúde pública).<\/li><\/ul>","courseFormat":"As aulas serão ministradas em vídeos gravados pelo Núcleo de Teleodontologia e Telessaúde e Centro de Produção Digital \"Prof. Edmir Matson\" da Faculdade de Odontologia da USP, sob a direção e coordenação da Profa.&nbsp;Mary Caroline (Maine) Skelton-Macedo e&nbsp;Diego Santana Zuqueto. Os monitores da disciplina&nbsp;serão&nbsp;Carla Ferreira do Nascimento, mestranda da FSP-USP, e&nbsp;Kaio Henrique Correa Massa, doutorando da FSP-USP. A avaliação dos alunos será feita por meio de quizzes ao final de cada módulo e um trabalho final com avaliação por pares. Essa avaliação é opcional e apenas necessária se você quiser receber o certificado, é possível só assistir às aulas.<br>","suggestedReadings":"Leitura sugerida: <a href=\"http:\/\/www.scielo.br\/scielo.php?script=sci_arttext&amp;pid=S2237-96222015000200325\" target=\"_blank\">Chiavegatto Filho, ADP.&nbsp;Uso de big data em saúde no Brasil: perspectivas para um futuro próximo<\/a>.","estimatedClassWorkload":"2-3 hours\/week","recommendedBackground":"Espera-se que o aluno tenha pelo menos começado uma graduação e que possua&nbsp;algum conhecimento básico de estatística. Caso não possua, recomendamos fazer a disciplina Data Analysis and Statistical Inference aqui do Coursera.","links":{}}