{
    "id": 1742,
    "shortName": "metaliteracy",
    "name": "Metaliteracy: Empowering Yourself in a Connected World",
    "language": "en",
    "shortDescription": "This course will prepare participants to be active digital citizens who locate and evaluate information in 21st century social environments, including Massive Open Online Courses (MOOCs), while making individual and collaborative contributions to these spaces as self-reflective and empowered learners.\n",
    "aboutTheCourse": "<p>This course prepares learners to empower themselves through\nmetaliteracy in a connected world. Metaliteracy promotes critical thinking and\nself-reflection to consume, create, and share information with others.&nbsp; Participants will learn how to critically navigate,\nevaluate and produce information in open, online, and social media settings through&nbsp;videos, readings, discussions, and learning activities\nthat promote metaliteracy competencies.&nbsp;&nbsp;<\/p><p>\n\n<span>Metaliteracy is an empowering idea because it\nencourages individuals to be active and self-reflective participants in today’s\nexpanding information environments.&nbsp; It\nis relevant to lifelong learners seeking new ways to gain knowledge in social\nsettings, college students interested in expanding research competencies, and\nprofessionals pursuing effective strategies for engaging with interactive\nsocial media in the workplace.&nbsp; This\napproach is relevant to anyone who wants to be an informed consumer of digital\ninformation and active contributor to social settings mediated by\ntechnology.&nbsp; It is invaluable to learners\nin a variety of fields and disciplines that involve evaluating and managing\ninformation.&nbsp; Metaliteracy is also\nrelevant to anyone in the workplace who wants to improve the ability to search,\nevaluate, produce, and distribute information.&nbsp;\nThis approach supports college students who want to expand their\ncritical thinking capabilities through research, writing, and adaptation to\nemerging technologies.&nbsp; It is also\nrelevant to anyone taking a MOOC or pursuing social learning opportunities\nbecause it empowers users to be&nbsp;<\/span>active\nand engaged digital citizens.<\/p><div><div><div>\n\n<\/div>\n\n<\/div>\n\n<\/div><p><a href=\"https:\/\/docs.google.com\/presentation\/d\/1zBpSSt8uG1N35QswST_ZTBivKI5aqH3VsOsmeN8fN_o\/htmlpresent\" target=\"_blank\">Video Image Credits<\/a><\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<span>\n <span><span>\n  <span>\n  <p>Week One: Your Role as a Metaliterate Learner&nbsp;<\/p><\/span>\n <\/span>\n <span>\n  <span>\n  <p>Week Two: Becoming a Digital Citizen: Creating and Sharing a Social Identity<\/p><\/span>\n <\/span>\n <span>\n  <span>\n  <p>Week Three: Becoming a Digital Citizen: Understanding Intellectual Property<\/p><\/span><\/span><\/span><\/span><span>\n <span>\n  <span>\n  <p>Week Four: Becoming a Digital Citizen: Remixing and Sharing<\/p><\/span>\n <\/span>\n <span>\n  <span>\n  <p>Week Five: Understanding How Information is Packaged and Shared&nbsp;<\/p><\/span>\n <\/span>\n <span>\n  <span>\n  <p>Week Six: Creating Information&nbsp;<\/p><\/span>\n <\/span>\n <span>\n  <span>\n  <p>Week Seven: Participating as a Global Contributor<\/p><\/span>\n <\/span>\n <span>\n  <span>\n  <p>Week Eight: Create and Curate<\/p><\/span>\n <\/span>\n <span>\n  <span>\n  <p>Week Nine: Metacognitive Reflection&nbsp;<\/p><\/span>\n <\/span>\n <span>\n  <span>\n  <p>Week Ten: Empowered Learning: From Learner to Teacher<\/p><\/span><\/span><\/span>",
    "estimatedClassWorkload": "2-4 hours\/week",
    "recommendedBackground": "<p>No background is required to\nparticipate in this course; all are welcome!<b><\/b><\/p>",
    "links": {

    }
}