{"id":474,"shortName":"googlemedia","name":"Understanding Media by Understanding Google","language":"en","shortDescription":"Few people who “just Google it” to find an answer to their every question understand just what the company does (and why). Through this course, you'll join the minority that really gets it.","aboutTheCourse":"<p>Google Inc. is one of the key success stories of the Internet era. The\n    company has expanded beyond its original search business through innovation\n    and acquisition to touch the lives of nearly every person who lives life\n    online. For example, Americans spend more than 3,400 hours per year using consumer media,\n    the field where Google’s impact is most profound, and citizens around the world must\n    understand what the&nbsp;company has wrought&nbsp;not only to control their offline and online environments, but also to interact and engage successfully\n    with anyone in&nbsp;our&nbsp;professional and personal lives.<\/p>\n<p>Enrollees in this course learn how to understand the tactics that modern media companies,\n    journalists, marketers, politicians, technologists, and social networks\n    are using to reach them and affect their behavior. They learn how to\n    adopt strategies that put them on an even footing with these entities in\n    achieving their own communications goals. They&nbsp;<\/p>\n<ul>\n    <li>think about, react to, and write about excerpts from half a dozen important books;&nbsp;<\/li>\n    <li>read a sampling of newspaper and magazine reportage from Google’s entire\n        history;<\/li>\n    <li>monitor news sites and specialized blogs about the company and its competitors while the course is in session;<\/li>\n    <li>take note of their own usage of Google and other online resources;\n        and<\/li>\n    <li>learn how to anticipate the future impact of the company and its competitors\n        on aspects of the media such as information consumption, creation, and distribution.&nbsp;<\/li><\/ul>","targetAudience":1,"courseSyllabus":"<b>Weekly topics<br><\/b>\n<br>Week 1: The Age of Google\n<br><ul><li>Introduction: Why study Google and the media? &nbsp;&nbsp;<br><\/li><li>Search and Research<br><\/li><\/ul>\n\nWeek 2: Google and Publishing&nbsp;\n<br>\n<ul>\n    <li>Google and News<\/li>\n    <li>Google and Books<\/li>\n<\/ul>Week 3: Google and Advertising\n<br>\n<ul>\n    <li>How and Why the Magic Works<\/li>\n    <li>Advertising Personalization and Privacy<\/li>\n<\/ul>Week 4: Google and Video\n<br>\n<ul>\n    <li>Google, YouTube, and You<\/li>\n    <li>YouTube (and Google) and the News<\/li>\n<\/ul>Week 5: Google and Mobile\n<br>\n<ul>\n    <li>Google and Smartphones<\/li>\n    <li>Google and \"Wearable\"<\/li>\n<\/ul>Week 6: Google, Social Media, and Privacy\n<br>\n<ul>\n    <li>Google's Social Circle<\/li>\n    <li>The Private, The Public, and the Politic(s)<\/li>\n<\/ul>","courseFormat":"<div>\n    <div>\n        <div>\n            <div>The class features several lecture videos per week, most of which are between 8 and 15 minutes\n                in length and&nbsp;may contain integrated quiz questions (though these questions will not be part of your grade). There will\n                also be peer-graded homework assignments; quizzes from the readings and lectures; and videos to review from\n                popular Web sites and blogs. <br><br>The quizzes and homework incorporate ideas from readings in the syllabus as well as the lectures. Several authors provide additional context through on-camera interviews with the professor.<br><br>Students also are encouraged to post in Coursera's discussion forums, which have been extremely popular during the first two sessions of this course (more than 40,000 posts, all of which were read by someone on our course staff).<\/div>\n        <\/div>\n    <\/div>\n<\/div>\n<div>\n    <div><\/div>\n<\/div>","suggestedReadings":"The key ideas in this course have been gleaned from the following books,\namong others, and you are strongly encouraged to borrow or purchase them. They are fun to read and endlessly fascinating, containing both strong reporting and strong opinions. Use any format you prefer, digital or analog. These links are to print versions, from which you can easily navigate to the e-book versions if you prefer.<br>\n<ul>\n    <li><a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&amp;AFID=301076&amp;ADID=1088031&amp;SID=googlemedia&amp;isbn_ean=9780061709692\" title=\"Link: http:\/\/chggtrx.com\/click.track?CID=267582&amp;AFID=301076&amp;ADID=1088031&amp;SID=googlemedia&amp;isbn_ean=9780061709692\">What Would Google Do?: Reverse-Engineering the Fastest-Growing Company in the History of the World<\/a>,\n        by Jeff Jarvis<\/li>\n    <li><a href=\"http:\/\/www.amazon.com\/Googled-End-World-As-Know\/dp\/0143118048\/\" title=\"Link: http:\/\/www.amazon.com\/Googled-End-World-As-Know\/dp\/0143118048\/\">Googled: The End of the World As We Know It<\/a>,\n        by Ken Auletta<\/li>\n    <li><a href=\"http:\/\/www.amazon.com\/Plex-Google-Thinks-Works-Shapes\/dp\/1416596585\/\" title=\"Link: http:\/\/www.amazon.com\/Plex-Google-Thinks-Works-Shapes\/dp\/1416596585\/\">In the Plex: How Google Thinks, Works, and Shapes Our Lives<\/a>,\n        by Steven Levy<\/li>\n    <li><a href=\"http:\/\/www.amazon.com\/Filter-Bubble-Personalized-Changing-Think\/dp\/0143121235\/\" title=\"Link: http:\/\/www.amazon.com\/Filter-Bubble-Personalized-Changing-Think\/dp\/0143121235\/\">The Filter Bubble: How the New Personalized Web Is Changing What We Read and How We Think<\/a>,\n        by Eli Pariser<\/li>\n    <li><a href=\"http:\/\/www.amazon.com\/Googlization-Everything-Why-Should-Worry\/dp\/0520258827\/\" title=\"Link: http:\/\/www.amazon.com\/Googlization-Everything-Why-Should-Worry\/dp\/0520258827\/\">The Googlization of Everything (and Why We Should Worry)<\/a>,\n        by Siva Vaidhyanathan<\/li><li><a href=\"http:\/\/www.amazon.com\/The-Search-Rewrote-Business-andTransformed\/dp\/1591841410\" target=\"_blank\" title=\"Link: http:\/\/www.amazon.com\/The-Search-Rewrote-Business-andTransformed\/dp\/1591841410\">The Search: How Google and Its Rivals Rewrote the Rules of Business and Transformed Our Culture<\/a>, by John Battelle<\/li>\n<\/ul>Additional readings and resources will be detailed in the syllabus.","instructor":"Owen R. Youngman","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"First and foremost, students should enjoy reading! They should also be curious about the companies, including but not limited to Google, whose products\nand services have come to define the Internet. Finally, students should also be willing to examine\ntheir own habits and behaviors in new contexts and be open to new ideas and opinions.","links":{}}