{"id":1034,"shortName":"highered","name":"History and Future of (Mostly) Higher Education","language":"en","shortDescription":"In this course we will learn about the features of higher education that were designed specifically to prepare workers and leaders for the Industrial Age, and we’ll strategize ways that, together, we can change learning--inside of school and out--for the world we live in now--and even to help improve our world. #FutureEd","aboutTheCourse":"<p><\/p><p>Welcome!  This course is designed for anyone concerned with the best ways of learning and thriving in the world we live in now.  It's for students, teachers, professors, researchers, administrators, policy makers, business leaders, job counselors and recruiters, parents, and lifelong learners around the globe.  The full,  whimsical name of the class is: “The History and Future of (Mostly) Higher Education: Or, How We Can Unlearn Our Old Patterns and Relearn for a Happier, More Productive, Ethical, and Socially-Engaged Future.”  That subtitle is inspired by Nobel Prize-winning economist Amartya Sen who has said that \"all education is vocational\" in the sense that it is our job, as educators, to help train people for the vocation of leading better lives.  <br><\/p><p>Are we fulfilling that educational objective, from kindergarten to professional school?  Or are we training students with the methods, philosophy, and metrics designed for the Fordist era of the Model T?  Since 1993, when scientists made the Internet widely available, our lives, our work, our occupations, our culture, and our entertainments have changed tremendously.  Far too little has changed inside our educational institutions, in the US and internationally, to prepare us for the demands, problems, restrictions, obstacles,  responsibilities, and possibilities of living in the world we inhabit outside of school.  This course addresses one key question:  How can we all, together, work to redesign higher education for our future... not for someone else’s past? <\/p><p><b><i>Bonus: <\/i><\/b><i>Students enrolled in this Coursera course will also be invited to many onsite and online events, workshops, and conferences offered by more than fifty learning institutions around the world, as part of an initiative on <a target=\"_blank\" href=\"http:\/\/www.hastac.org\/collections\/history-and-future-higher-education\">Shaping the Future of Higher Education<\/a>.<\/i><i><\/i><\/p><br>","targetAudience":3,"courseSyllabus":"<p><\/p>\n<p><b>Learning Objectives<\/b>\n<\/p>\n<ul>\n    <li>Understand how and why we inherited the Industrial Age educational systems.<\/li>\n    <li>Think deeply about the requirements of the world we live in now.<\/li>\n    <li>Discover new ideas, methods, competencies, and subject matter.<\/li>\n    <li>Share our pathways to successful innovation with others around the world.  Together, we can change schools, classrooms, institutions, learning--and maybe ourselves!  \n    <\/li>\n<\/ul>\n<p><b>WEEK ONE - January 27, 2014<br>Guiding Principles and Driving Concepts - Let’s Get Started<\/b>\n    <br>This week we will think about the uses of history: learning how and why educational institutions were constructed in the past helps us think about what we need now, in order to begin to shape a different future of education in order to help shape a more just future for all.<\/p>\n<p><b>WEEK TWO - February 3, 2014<br>The iPod Experiment: Or, Learning vs. Education<\/b>\n    <br>Duke University’s iPod experiment became international news.  Why?  What happens when students are in charge?  What happens when education begins at a place where no one (not even the instructor) knows the answer in advance? What if\n    the actual learning cannot be tested or assessed by the usual methods of higher education? What if learning is also about trying to improve the status quo?  This week we will look at diverse histories and theories of education and learning.\n    <br>\n<\/p>\n<p><\/p>\n<p><b>WEEK THREE - February 10, 2014<br>Teaching Like It’s 1992    <\/b>\n    <br>The World changed on April 22, 1993, when the scientists at the National Center for Supercomputing Applications released the Internet and the World Wide Web to the general public.  From then on, anyone with access to an Internet connection could\n    communicate  to anyone else with an Internet connection.  No editor or publisher provides a safety net now and, at the same time, our data can be hacked, our privacy invaded.  The digital world we live in now comes with tremendous responsibilities and opportunity--and yet it comes with real inequalities, perils, and obstacles too.  Does our educational system prepare us for these challenges?\n    <br>\n<\/p>\n<p><\/p>\n<p><\/p>\n<p><b>WEEK FOUR - February 17, 2014<br>Welcome to the Future: 10 Ways to Change the Paradigm of Higher Education<\/b>\n    <br>We will now be looking at different principles, methods and metrics for redesigning an innovative form of learning that helps us all navigate the complexities of the world we inhabit outside of school.  This week we focus specifically on innovations\n    to the curriculum.\n    <br>\n<\/p>\n<p><\/p>\n<p><\/p>\n<p><b>WEEK FIVE - February 24, 2014<br>Innovations in Pedagogy (Methods) and Assessment<\/b>\n    <br>This week we will focus on innovations in pedagogy (the methods for learning) and assessment.  How you teach is what you teach.  And, we need to think deeply about what we value and make sure what we value is what we count.    \n    <br>\n<\/p>\n<p><b>WEEK SIX - March 3, 2014<br>How to Make Institutional Change<\/b> \n    <br>Even if we make changes in our personal learning and teaching methods, we still have to work mostly within institutions of learning.  Institutional change can be difficult; it takes patience, strategy, and allies. This week offers (and also invites)\n    ideas about what we can do together. It makes a powerful argument that we all need to advocate (in any country) for higher education and shows how, in the U.S., the decline in support for public education has contributed to income inequality and hurt all our future.  This week includes interviews with inspiring people who have worked together to make successful change happen in society ad in education, against odds.  <\/p>\n<p><b><\/b>\n<\/p>\n\n<p><b>Conclusion<\/b>: Thank you for joining this movement on behalf of educational innovation and reform!  This is not the end.  It’s the beginning.  Where will we do from here? Let’s get started! \n    <br>\n<\/p>\n<div><\/div>","courseFormat":"<p>Each week will consist of one hour of video lectures, discussions and interviews, divided into 10-20 minute segments. Readings for each topic will be recommended, but not required. <\/p>\n<p><\/p>\n<p><b>Statement of Accomplishment requirements<\/b>\n    <br>In order to earn a Statement of Accomplishment signed by Cathy Davidson, you will be requried to take weekly multiple choice quizzes (the classic \"summative\" form of testing that is designed to \"sum up\" what you have learned).\n    We’ll strive to make these quizzes into useful “reviews\" of the week's content.  We will also talk a lot about the shortcomings of standardized testing and strategize more effective ways of learning and of measuring achievement (such as\n    <a target=\"_blank\" href=\"http:\/\/www.hastac.org\/digital-badges\">digital badging<\/a>). If you wish to earn a Statement of Accomplishment with Distinction you will need to finish three peer assessments in addition to the quizzes.<br><\/p><b>Optional Participatory Assignments<\/b>\n<br>This course is not just about content but also about designing new ways of learning. Assignments will encourage international contribution to a historical timeline of global educational innovation--a rich new resource that researchers might be able to\nbuild upon.  There will also be an array of practical exercises, examples, methods, and ideas that can be used in any classroom, for home schooling, or in any informal learning or study situation. You will be encouraged to try new methods and to\ndiscuss the results in forums<i>, <\/i>wikis, and on social media.<i> <br><br><b>Bonus:<\/b> Students will also learn about dozens of concurrent online and face-to-face events on the topic of education innovation being run at universities, colleges, and community colleges around the world. <\/i>\n<a target=\"_blank\" href=\"http:\/\/www.hastac.org\/collections\/history-and-future-higher-education\"><i>Find out more<\/i><\/a><i>!<br><\/i>","suggestedReadings":"<p>There will be specific “readings”--articles, blog posts, websites, videos, and other resources--suggested for each lecture. The main “texts” for this course will be:<\/p>\n<ul>\n    <li>Davidson, Cathy N. <i>Now You See It: How Technology and the Brain Science of Attention Will Change the Way We Live, Work and Learn<\/i>. 2011. (This will be made available free online for the first 50,000 students registered for this course and is\n        also available to purchase on <a href=\"http:\/\/www.amazon.com\/Now-You-See-Technology-Transform\/dp\/014312126X\" target=\"”_blank”\">Amazon<\/a>, <a href=\"http:\/\/www.barnesandnoble.com\/w\/now-you-see-it-cathy-n-davidson\/1101098971?ean=9780143121268\"target=”_blank”>Barnes & Nobles<\/a>,\n        and \n        <a href=\"http:\/\/www.indiebound.org\/book\/9780670022823\"target=”_blank”>IndieBound<\/a>).\n        <br>\n    <\/li>\n    <li>\n        <p>The 21st Century Collective, <a href=\"http:\/\/www.hastac.org\/collections\/field-notes-21st-century-literacies\"target=”_blank”>Field Notes for 21st Century Literacies: A Guide to New Theories, Methods, and Practices for Open Peer Teaching and Learning<\/a>.\n            <br>\n        <\/p>\n    <\/li>\n    <li>\n        <p>Davidson, Cathy N. and David Theo Goldberg. <i><a href=\"http:\/\/mitpress.mit.edu\/catalog\/item\/default.asp?tid=12181&ttype=2\" target=\"_blank\">Future of Thinking: Learning Institutions in a Digital Age<\/a><\/i>. MIT Press. Available for free download\n            as a pdf.<\/p>\n    <\/li>\n    <li><a href=\"http:\/\/dukesurprise.com\"target=”_blank”>DukeSurprise.com<\/a>\n    <\/li>\n<\/ul>","estimatedClassWorkload":"2-4 hours\/week","recommendedBackground":"<p>The only background required is passionate interest in the future of learning and higher education. All are welcome! <\/p>","links":{}}