{"id":1182,"shortName":"biblefuture","name":"The Bible's Prehistory, Purpose, and Political Future","language":"en","shortDescription":"How and why was the Bible written? Drawing on the latest archeological research and a wide range of comparative texts, this course synthesizes fascinating recent research in biblical studies and presents a powerful new thesis: Facing catastrophic defeat, the biblical authors created a new form of community—what today we would call \"peoplehood.\" Their achievements bear directly on modern questions of politics, economics, and theology.","aboutTheCourse":"With its walls razed to ground by Babylon’s armies, Jerusalem joined a long line of ancient vanquished cities—from Ur and Nineveh and Persepolis to Babylon itself. While some recovered from the destruction, others did not.&nbsp; But none responded to political catastrophe by fashioning the kind of elaborate and enduring monument to their own downfall that we find in the Bible. Most conquered populations viewed their subjugation as a source of shame. They consigned it to oblivion, opting instead to extol the golden ages of the past.&nbsp; The biblical authors in contrast reacted to loss by composing extensive writings that acknowledge collective failure, reflect deeply upon its causes, and discover thereby a ground for collective hope. &nbsp;<br>&nbsp;<br>Working through colorful biblical and ancient Near Eastern texts, and drawing on an array of comparative examples, the course illustrates the thoroughgoing manner with which biblical authors responded to defeat by advancing a demotic agenda that places the community at the center. The aim of the biblical authors was to create a nation, and they sought to realize this goal via a shared text, which includes stories and songs, wisdom and laws. This corpus of writings belongs, without a doubt, to humanity’s greatest achievements. Whereas the great civilizations of the Near East invested their energies and resources into monuments of stone that could be destroyed by invading armies, the biblical authors left a literary legacy that has been intensively studied until the present day. More important, these authors’ visionary response to defeat brought to light a radical new wisdom:&nbsp; the notion that a people is greater than the state which governs it, and that a community can survive collapse when all of its members can claim a piece of the pie and therefore have a reason to take an active part in its collective life. <br>&nbsp;<br>The objectives of the course are to show: <br>—how biblical scholars work with archaeological and comparative texts to study the Bible's formation;<br>—how the Bible emerged from large-scale corporate crisis and rupture;<br>—that in our present state of uncertainty and instability we have much to learn from the various strategies the biblical authors adopted to create an enduring “people of the book”;<br>—that one doesn’t have to believe in God or accept the historicity of the Bible in order to appreciate its profound political messages;<br>—that the Bible offers modern societies a model for creating communities around a shared collection of texts, songs, and laws;<br>—and that the Bible itself has a major role to play in our futures.<br>","targetAudience":0,"courseSyllabus":"<b>Week 1: The Riddle that Has Yet to Be Solved<\/b><br><b>Week 2: The Rise and Fall<\/b><br><b>Week 3: The Making of the Bible as a Response to Defeat<\/b><br><b>Week 4: Reinventing the Hero<\/b><br><b>Week 5: A Wise and Discerning People&nbsp; <\/b><br><b>Week 6: Beyond Morality: The Bible as a Political Model<\/b><br><br>","courseFormat":"The class will consist of weekly videos with one or two quiz questions per video, as well as various weekly assessments and a final exam.","suggestedReadings":"","estimatedClassWorkload":"2-4 hours\/week","recommendedBackground":"No background is required.","links":{}}