{"id":2889,"shortName":"womeninleadership","name":"Women in Leadership: Inspiring Positive Change","language":"en","shortDescription":"This course aims to inspire and empower women and men across the world to engage in purposeful career development and take on leadership for important causes—to lead change with more conviction and confidence—and improve our workplaces and communities for all. ","aboutTheCourse":"<span><p dir=\"ltr\">This course aims to inspire and empower women and men across the world to engage in purposeful career development and take on leadership for important causes—to learn the skills of leadership and lead change with more conviction and confidence—and improve our workplaces and communities for all. &nbsp;By offering more complex understandings of issues related to professional women and work, the course will help you increase self-knowledge about your own values and vision, as well as enhance your capabilities as a leader, manager, and team contributor. &nbsp;We will examine the opportunities, challenges, trade-offs, and organizational dynamics experienced by women in work organizations, as well as reflect on and practice effective individual behaviors. <\/p><br><p dir=\"ltr\">The course aims at answering questions such as: What are the valued attributes and behaviors of women in the workplace? &nbsp;How does the gendered nature of organizations impact women? &nbsp;What derails our career advancement and what propels us upward? &nbsp;What are your leadership goals and aspirations? &nbsp;How can you best integrate your multiple family and work life commitments? How do you define career success? What can organizations do to provide women with opportunities to excel? &nbsp;What opportunities could our global economy harness by advancing women to leadership? &nbsp;How can the full talents of the workforce be tapped into and developed? &nbsp;<\/p><div><br><\/div><\/span>","targetAudience":1,"courseSyllabus":"<strong>Learning Goals:<br><\/strong><ol><li>Enhance understanding of yourself and your leadership identity.<\/li><li>Gain a deep understanding of the dynamics and experiences of women in organizations, as well as of the interpersonal, organizational, and societal structures and processes impacting women in organizations.<\/li><li>Identify and enhance effective leadership practices for yourself and for women in your organization.&nbsp;<\/li><li>Define your vision of career success and work-life balance, identify necessary resources and networks, and create a plan of action to accomplish your goals.&nbsp;<\/li><\/ol><strong>Course Outline:<br><br>Week 1: Yourself as a Leader - Developing your Leadership Identity<br>&nbsp; &nbsp; &nbsp;<\/strong>A. Welcome to the Course and Women's Strengths in Leadership<br>&nbsp; &nbsp; &nbsp;B. Leadership Values and vision&nbsp;<br><strong><br>Week 2: The Current State of Women's Leadership at the Top<br>&nbsp; &nbsp; <\/strong>&nbsp;A. Women's leadership at the top<br>&nbsp; &nbsp; &nbsp;B. Why so few? Why so slow? Advancement barriers and challenges for women<br><strong><br>Week 3: Women's Leadership Presence<br>&nbsp; &nbsp; <\/strong>&nbsp;A. Self-Confidence<br>&nbsp; &nbsp; &nbsp;B. Navigating organizational&nbsp;politics&nbsp;and gaining influence in organizations&nbsp;<br><strong><br>Week 4: Leadership Tools for Women&nbsp;<br><\/strong>&nbsp; &nbsp; &nbsp;A. Negotiating Effectively<br><strong><br>Week 5: Purposeful Career Development for Women<br>&nbsp; &nbsp;<\/strong> &nbsp;A. Defining Your success and finding work-life&nbsp;integration","courseFormat":"The content in this course will be delivered over a five week period. &nbsp;Each week will have one to two segment. Each segment will consist of a video to watch, required readings, and an assignment. You will be provided with a personal learning journal to take notes and record reflections during this course. The distinction track also requires an additional assignment to be completed. Students will be required to participate in the discussion forums and will earn credit for said participation.&nbsp;","suggestedReadings":"Students should read the required readings either before or soon after each unit, but in advance of the next module. Recommended and supplemental readings can be read at any time throughout the course.&nbsp;","estimatedClassWorkload":"3-4 hours\/week","recommendedBackground":"There are no prerequisites for this course. However, the course will be conducted at the level expected of advanced undergraduate students, graduate students or professionals and executives. Therefore, for all participants, reading and writing comfortably in English at the undergraduate college level is desirable.&nbsp;","links":{}}