{
    "id": 2868,
    "shortName": "foreigneyes",
    "name": "America Through Foreign Eyes",
    "language": "en",
    "shortDescription": "What do foreigners think of the United States? Foreign observers and travelers are rarely indifferent to American culture and people. This course examines historical and contemporary views of America held by Chinese, Mexican, French, and multiple African nationals.  Join us to examine the multiple perspectives of America through foreign eyes.",
    "aboutTheCourse": "The United States has always been a source of fascination— both attraction and repulsion — for the people of France, Mexico, China, and African countries such as Nigeria, Ghana, and Sudan. &nbsp;<em>America Through Foreign Eyes <\/em>is a rich, interdisciplinary, international course that features Rice faculty from a variety of disciplines and area studies. Focused on perceptions of America abroad, the course is a cross between World Cultures and American Studies. The course features four main segments, each covering the perceptions and interactions of particular regions with America, Americans and Americanization.",
    "targetAudience": 0,
    "courseSyllabus": "<p><b>Introduction to the Course<\/b>, Dr. Julie Fette<br><\/p>\n<p><strong>Week 1 &nbsp;<\/strong>Module 1:&nbsp;America through African Eyes, Dr. Jeffrey Fleisher<br><\/p>\n<p><strong>Week 2 &nbsp;<\/strong>Module 2:&nbsp;America through Chinese Eyes, Dr. Anne Chao<br><\/p>\n<p><strong>Week 3 &nbsp;<\/strong>Module 3:&nbsp;America through French Eyes, Dr. Julie Fette<br><\/p>\n<p><strong>Week 4 &nbsp;<\/strong>Module 4: America through Mexican Eyes, Dr. Moramay López-Alonso<br><\/p>\n<p><strong>Week 5 &nbsp;<\/strong>Module 5: Reversing the Gaze: &nbsp;Africa, China, France, and Mexico through &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; American Eyes, Drs. Fleisher,&nbsp;Chao, Fette, López-Alonso&nbsp;<\/p>",
    "estimatedClassWorkload": "3-5 hours\/week",
    "recommendedBackground": "<p>The material is appropriate for anyone with an interest in\nhumanities courses. No special background is required other than knowledge of\nEnglish.<\/p>\n\n<p>&nbsp;<\/p>",
    "links": {

    }
}