{"id":2912,"shortName":"financecapstone","name":"Essentials of Corporate Financial Analysis and Decision-Making Capstone","language":"en","shortDescription":"The final project will require participants to apply the skills they have developed across each of the four courses of the Specialization, by taking on the role of a financial advisor to a corporation that faces a specific strategic decision. ","aboutTheCourse":"The University of Melbourne and BNY Mellon are pleased to provide the following details concerning the Essentials of Corporate Financial Analysis and Decision-Making Capstone. This is the final part of the Essentials of Corporate Financial Analysis and Decision-Making specialization.\n\nThe capstone is designed to allow students to bring together the skills acquired and knowledge gained over the preceding four courses of the specialization by taking on the role of a financial analyst tasked with advising a wealthy private client on a significant strategic investment in a large listed firm operating across the globe.","targetAudience":0,"courseSyllabus":"<p dir=\"ltr\">Each of the four modules within the capstone will require the analyst to respond to a series of requests for advice from the client with the emphasis of each module as follows:<\/p><p dir=\"ltr\"><ul><li>Module 1: Longitudinal and inter-company comparative analysis of the firm’s financial position<br><\/li><li>Module 2: Identification of the major risks faced by firm as well as the steps taken by the firm to address these risks<br><\/li><li>Module 3: An assessment of the quality of the firm’s board and senior management through an analysis of a significant recent transaction initiated by the firm<br><\/li><li>Module 4: A comprehensive analysis of the risk of the firm’s equity and the expected impact on the client’s position (in terms of expected return and risk) from introducing this company into their investment portfolio.&nbsp;<\/li><\/ul><\/p><div><br><\/div>","courseFormat":"Each module’s work-stream will be provided in the form of a video conference run by the analyst’s manager. These video clips will highlight the key deliverables to the client at each stage of the project and will feature another analyst who has been assigned to the project and who will ask questions and seek clarification on a range of issues from the manager. The student analyst will be working with real data to address questions that are asked and answered every day by financial analysts in large investment companies.","suggestedReadings":"All readings will be supplied in the course.","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"You mush have successfully passed all four preceding courses in the Essentials of Corporate Financial Analysis and Decision-Making Specialization.","links":{}}