{"id":439,"shortName":"virtualinstruction","name":"Foundations of Virtual Instruction","language":"en","shortDescription":"Learn what it takes to teach a K-12 course online! Investigate the history of virtual education, explore innovative tools, and examine key issues related to K-12 virtual instruction. ","aboutTheCourse":"This course provides teachers with the foundation for understanding the\nmovement towards virtual instruction. It introduces fundamental knowledge\nneeded by teachers to succeed in a technology-dependent, instructional\nenvironment. You will explore the history of online learning and understand\nhow a variety of delivery models are evolving in the K-12 environment,\nranging from completely online to hybrid or blended classrooms. We will\ndiscuss how the programs work and who they serve, addressing some basics\nabout equity issues, access and school funding, as well as ethical and\nlegal issues that support and challenge the models. Upon completion of\nthe course, you will understand what it takes to transition from teaching\nin the classroom to providing virtual instruction.","targetAudience":1,"courseSyllabus":"Over five weeks, we will cover the following topics:<br><br><strong>Module 1: <\/strong>History of Virtual Education\n<br><strong>Module 2<\/strong>: Synchronous and Asynchronous Technologies\n<br><strong>Module&nbsp;3<\/strong>: Transitioning from the Classroom to a Virtual Environment\n<br><strong>Module&nbsp;4<\/strong>: Equity and Access, Funding, and the Law\n<br><strong>Module&nbsp;5<\/strong>: The Future of Virtual Education and\nReview<br>","courseFormat":"This class will consist of short weekly lecture videos (with embedded\nquiz questions), totaling 1 to 2 hours of viewing. There will also be weekly\nquizzes (4 total),&nbsp;1 assignment, and a final exam.","suggestedReadings":"<p>The texts listed here are recommended, but&nbsp;not required.<\/p>\n<ul>\n    <li>Ko, S. and Rossen, S. (2010), <a href=\"http:\/\/www.chegg.com\/textbooks\/teaching-online-3rd-edition-9780415997263-0415997267?trackid=53284c1f&amp;autosuggest=1&amp;uqry=teaching+online&amp;ii=1\">Teaching Online: A Practical Guide<\/a>, 3rd Edition (ISBN&nbsp;978-0415997263)<\/li>\n    <li>Rice, K. (2011), <a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&amp;AFID=301076&amp;ADID=1088031&amp;SID=virtualinstruction&amp;isbn_ean=9780132107617\">Making the Move to K-12 Online Teaching<\/a> (ISBN 9780132107617)<\/li>\n<\/ul>\n<ul><\/ul>","instructor":"","estimatedClassWorkload":"2-4 hours\/week","recommendedBackground":"<p>The course is primarily for:<\/p>\n<ul>\n    <li>Teachers working with children ages 5 - 18<\/li>\n    <li>Faculty working with further education, community college or vocational\n        students<\/li>\n    <li>Continuing education or in-service facilitators supporting teachers and\n        faculty<\/li>\n    <li>Educators interested in educational technology and\/or online instruction<\/li>\n    <li>Please note that although this program is offered to participants from\n        around the world, many of the examples and experiences shared will be based\n        on the education structure and processes of the&nbsp;United States. Participants\n        will be encouraged&nbsp;to discuss their own country-based experiences\n        in the forums.&nbsp;<\/li>\n<\/ul>","links":{}}