{
    "id": 1800,
    "shortName": "babyboomersanddrugs",
    "name": "Alcohol, Drugs, and Baby Boomers: Are you ready?",
    "language": "en",
    "shortDescription": "As the baby boomer generation ages, the impacts of alcohol and drug use among this generation will become an increasingly important public health issue. This 5-week course will provide primary care givers and health care providers with an overview of this looming issue and provide strategies for the prevention and reduction of substance use associated harm.",
    "aboutTheCourse": "<p><b>ENROLLMENT OPTIONS<\/b><\/p><p>Those interested in participating in this&nbsp;course have three options:<\/p><ol><li><b>Free Enrollment:&nbsp;<\/b>&nbsp;Click “Sign Up” to enroll in course for FREE and earn a statement of accomplishment upon completion.<\/li><li><b>Signature Track Enrollment:&nbsp;<\/b>&nbsp;Click “Signature Track” and follow the enrollment steps.&nbsp; You will be required to pay a $39 non-refundable fee.&nbsp; Upon course completion you will receive a verified certificate, which employers can search.&nbsp;<a href=\"http:\/\/help.coursera.org\/customer\/portal\/articles\/1167998-what-is-a-verified-certificate-how-can-i-use-it-\">What’s this?<\/a><\/li><li><b>Continuing Nursing Education (CNE) Credit:<\/b>&nbsp; For healthcare professionals interested in earning Continuing Nurse Education (CNE) contact hours you must:<\/li><\/ol><ul><li>Complete Signature Track enrollment.&nbsp;<br><\/li><li>Complete registration process through Johns Hopkins University School of Nursing. You will be required to pay an additional non-refundable fee of $60 in addition to the $39 fee for signature track.&nbsp;<br><\/li><\/ul><p><b>SIGNING UP FOR CNE CREDIT<\/b><\/p><p>If you’re interested in signing up for CNE Credit and have already signed up for Signature Track, click this link to register for CNE:&nbsp;<a href=\"https:\/\/www.regonline.com\/babyboomersanddrugs\" target=\"_blank\" title=\"Link: https:\/\/www.regonline.com\/babyboomersanddrugs\">https:\/\/www.regonline.com\/b<\/a><a href=\"https:\/\/www.regonline.com\/babyboomersanddrugs\" target=\"_blank\" title=\"Link: https:\/\/www.regonline.com\/babyboomersanddrugs\">abyboomersanddrugs<\/a><\/p><p><b>ABOUT THE COURSE<\/b><\/p><p>The proportion of the population that is over the age of 65\nis growing globally. Those in the baby boomer cohort will soon all be age 50 or\nolder.&nbsp; Along with the increasing numbers\nin this older age cohort, there is a parallel upward trend of alcohol use and\nother drug use in older adults. As we age alcohol and other drug use places us\nat greater health related harm. This course provides the learner with an\noverview of the growing prevalence of at-risk substance use in older adults and\nstrategies for the prevention and reduction of substance use associated harm.\nThese strategies include an evidenced based approach called screening brief\nintervention and referral to treatment (SBIRT). The course will provide\ninformation relevant to improving health and reducing substance use related\nharm for those who are older, their primary care givers and health care\nproviders.&nbsp; &nbsp;<\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<div>WEEK 1: <strong>Substance use and the older adult: how common is it and why should we care?<\/strong><\/div><div><ul><li>Who is a baby boomer: the aging population<br><\/li><li>Introduction to substance use and the older adult<br><\/li><li>Prevalence of substance use among those over the age of 50<br><\/li><li>Understanding substance use related harm and the older adult<\/li><\/ul><\/div><div>WEEK 2: <strong>The aging body and the use of alcohol and drugs – what are the risks?<\/strong><\/div><div><ul><li>Acute effects of alcohol<\/li><li>Substance use disorders in the older adult<\/li><li>Alcohol and aging<\/li><li>Long term effects<\/li><\/ul>WEEK 3: <strong>Reducing substance-related harm in the older adult<\/strong><br><\/div><div><ul><li>Introduction to prevention<br><\/li><li>Harm Reduction Model for prevention<br><\/li><li>IOM prevention model for substance use disorders<br><\/li><li>Intervention perspectives<\/li><\/ul><\/div><div>WEEK 4: <strong>Screening for at-risk substance use in the older adult<\/strong><\/div><div><ul><li>Introduction to screening<br><\/li><li>Domains of substance use and substance use disorders<br><\/li><li>Screening approaches<br><\/li><li>Screening and assessment<\/li><\/ul><\/div><div>WEEK 5: <strong>Brief interventions and referral to treatment - healthy choices<\/strong><\/div><div><ul><li>Referral to treatment<br><\/li><li>Comorbidity<br><\/li><li>Self-help support programs<br><\/li><li>Care givers&nbsp;<br><\/li><li>Maintenance: healthy living and substance use&nbsp;<br><\/li><\/ul><\/div><div><br><\/div>",
    "estimatedClassWorkload": "3-5 hours\/week",
    "recommendedBackground": "This material is appropriate for anyone interested in the issue of substance use and health as we age. Material is relevant to health professionals, students in the health professions, or families and loved ones of older adults whose substance use may be placing them at risk. No special background is required other than knowledge of English.\n",
    "links": {

    }
}