{"id":2134,"shortName":"portestrangeiros","name":"Pluralidades em Português Brasileiro","language":"pt-br","shortDescription":"Pluralidades em Português Brasileiro  is a four-week long online self-access course whose aim is to expand intercultural awareness and develop reading and listening comprehension skills regarding Brazilian Portuguese as a foreign language for intermediate speakers of other languages.","aboutTheCourse":"Pluralidades em Português Brasileiro is a four-week long online self-access course whose aim is to expand intercultural awareness and develop reading and listening comprehension skills regarding Brazilian Portuguese as a foreign language for intermediate speakers of other languages. From a pluralist perspective, the course aims at exploring cultural topics and linguistic diversity. The course activities are based on contextualized use of Brazilian Portuguese in several communicative situations. Oral,&nbsp; written and multimodal texts are used to develop reading and listening comprehension skills, which requires prior knowledge of Brazilian Portuguese. The course also focus on vocabulary and grammar expansion, pronunciation awareness, meta-cognitive skills&nbsp; and critical thinking.<br>","targetAudience":3,"courseSyllabus":"<strong>Each module of the course aims at developing:<\/strong><br><br>- Intercultural\nawareness and critical thinking skills;<br>- Vocabulary\nand grammar knowledge;<br>- Reading\nand listening strategies;<br>- Meta-cognitive\nskills.<br><br><br>","courseFormat":"<strong>The course consists of four modules<\/strong> <strong>with the following contents:<\/strong><br><br><ul><li>01 video (3- 5 minutes) with transcription<\/li><li>03 to 06 listening comprehension questions <br><\/li><li>01 written text<\/li><li>03 to 06 reading comprehension questions <br><\/li><li>Grammar, pronunciation and vocabulary activities<\/li><li>Extra multimedia material to expand reading skills and critical thinking.<\/li><\/ul><ul><li><u>The video segments will show authentic\nexamples of language in use (interviews, podcasts, etc),&nbsp; so that grammar, vocabulary and reading &amp;\nlistening skills can be exploited.&nbsp;\nMini-video lectures will be used so that listening &amp; reading\nstrategies, as well as critical thinking skills, can be further explored<\/u><\/li><\/ul><br>\n\n\n\n\n\n<br><br><br><br>","suggestedReadings":"","estimatedClassWorkload":"4-5 hours\/week","recommendedBackground":"An intermediate level of proficiency concerning reading&nbsp; and listening comprehension skills in Brazilian Portuguese is required.<br>","links":{}}