{"id":2056,"shortName":"foundationmedneuro","name":"Foundational Neuroscience for Perception and Action","language":"en","shortDescription":"Learn the basic structure and function of the human nervous system, how nerve cells generate electrical signals and communicate, how they reshape their connections with use, and how neural systems integrate external and internal sensory signals to orchestrate action.","aboutTheCourse":"This course is a shorter version of my medical school-caliber course, <a target=\"_blank\" href=\"https:\/\/www.coursera.org\/course\/medicalneuro\"><i>Medical Neuroscience<\/i><\/a>. Like its parent course, this shorter course covers the organization and physiology of the human central nervous system. The focus of <i>Foundational Neuroscience for Perception and Action<\/i> is on the basic components of the brain and spinal cord, the means by which nerve cells generate electrical signals and communicate, the neural mechanisms of synaptic and circuit plasticity, and the organization of the sensory and motor systems that integrate experience and motivate behavior. Unlike its parent course, this shorter course is not so clinically focused. Rather, it aims to explore foundational mechanisms in neuroscience without emphasizing the competency of localizing lesions in the human central nervous system (a major focus of <i>Medical Neuroscience<\/i>).\n\n<br><br>\n\nThe overall goal of this course is to equip learners to be successful in our specialization, <i>Perception, Action and the Brain<\/i>. To help you get the most out of our specialization, this course will teach you the basic neural mechanisms that makes it possible for the human brain to contend with an onslaught of sensory signals and generate successful behavior for survival and flourishing in a complex world. Thus, the other two courses in <i>Perception, Action and the Brain<\/i> will introduce you to the phenomenology of what we see and the means by which the brain generates visual representations (<a target=\"_blank\" href=\"https:\/\/www.coursera.org\/course\/visualpercepbrain\"><i>Visual Perception and the Brain<\/i><\/a>), and challenge you to understand how the brain creates our sense of spatial location from a variety of sensory and motor sources, and how this spatial sense in turn shapes our cognitive abilities (<a target=\"_blank\" href=\"https:\/\/www.coursera.org\/course\/brainspace\"><i>The Brain and Space<\/i><\/a>). The role, then, of <i>Foundational Neuroscience for Perception and Action<\/i> is to give you a \"look under the hood\" so that you can understand the neural mechanisms that operate at the level of synapses, circuits, and sensorimotor systems. You will then use this intimate knowledge of the inner workings of the human central nervous system as you take on the final project in our specialization.\n\n<br><br>\n\nThis course is for advanced baccalaureate and prospective or current graduate students who are pursuing degrees in the brain sciences. It is also for students or professionals in technical fields concerned with human factors in computing, virtual reality, or gaming who are interested in understanding how the brain generates perceptions and actions. Teachers who are interested in understanding how the brain works as a means to enhance their curriculum in science education, or just to enhance student learning more generally will benefit. As will anyone who is simply curious about how the brain contends with sensory information and produces action.","targetAudience":1,"courseSyllabus":"This course comprises four units of content:<br><ul><li><strong>Unit 1 Neuroanatomy<\/strong>. This unit covers the surface anatomy of the human brain, its internal structure, and the overall organization of sensory and motor systems in the brainstem and spinal cord.<\/li><li><strong>Unit 2 Neural signaling<\/strong>. This unit addresses the fundamental mechanisms of neuronal excitability, signal generation and propagation, synaptic transmission, post synaptic mechanisms of signal integration, and neural plasticity.<\/li><li><strong>Unit 3 Sensory systems<\/strong>. Here, you will learn the overall organization and function of the sensory systems that contribute to our sense of self relative to the world around us: somatic sensory systems,&nbsp;proprioception,&nbsp;vision, audition, and balance senses.<\/li><li><strong>Unit 4 Motor systems<\/strong>.  The course concludes with a survey of the brain and spinal mechanisms that govern bodily movement.<br><\/li><\/ul>","courseFormat":"The course consists of video tutorials delivered by Professor White, a \nneuroscientist, educator, and director of courses for undergraduate, graduate, medical, and physical therapy students at Duke University. Typically, the video tutorials contain 1 or more integrated\n multiple-choice questions. Each video tutorial \nwill be accompanied by original tutorial notes that will guide learning. Regular unit quizzes and application experiences, including one peer assessed assignment \nfocused on functional neuroanatomy and neurophysiology, will assist students in keeping pace with course content. Learning will be supported\n by recommended textbook readings and interactive activities using \ndigital atlases of the human brain and spinal cord.<br><p>This course will have a verified certificate option, but will not be accepting payments until the class starts.<br><\/p><div><br><\/div>","suggestedReadings":"Although the course is designed to be self-contained for students with \nthe recommended background, students wanting to expand their knowledge \nand reinforce their understanding are strongly encouraged to complete \nall recommended readings. &nbsp;The primary reference text for this course is\n <a target=\"_blank\" href=\"http:\/\/chggtrx.com\/click.track?CID=267582&amp;AFID=301076&amp;ADID=1088031&amp;SID=medicalneuro&amp;isbn_ean=9780878936953\"><i>Neuroscience, 5th Ed<\/i><\/a>., by Purves et al. (Sinauer Assoc., Inc.). &nbsp;This text is bundled with neuroanatomical software, &nbsp;<a target=\"_blank\" href=\"http:\/\/www.sinauer.com\/detail.php?id=8841\"><i>Sylvius 4 Online: An Interactive Atlas and Visual Glossary of Human Neuroanatomy<\/i><\/a>, (also available as a standalone subscription).","estimatedClassWorkload":"4-5 hours\/week","recommendedBackground":"To be successful in this course, a college-level background in cellular \nand molecular biology is strongly recommended.","links":{}}