{"id":1995,"shortName":"chinesehumanitieseng","name":"Classics of Chinese Humanities: Guided Readings","language":"en","shortDescription":"An introductory yet trenchant exploration of select Chinese classic texts that cover the domains of classical literature, history, philosophy, and fine arts.","aboutTheCourse":"<p>This\nEnglish course is adapted from the Chinese version of the course carrying the\nsame title (中國人文經典導讀<span>),\nwhich was offered in April-June 2014.&nbsp;\nThe present course aims at introducing non-Chinese speakers to four key\nthemes in Chinese humanities: the character of the Chinese hero, the Confucian\ntradition proper, Chinese lyrical aesthetics, and the Chinese ethnic spirit.&nbsp; Participants will deepen both their\nunderstanding and appreciation of, and develop a critical eye in interpreting,\nthe select texts.&nbsp; The course thus\nprovides a general framework for students to explore Chinese humanities. Yet,\nparticipants should take the initiative by doing both the recommended and the\nsupplementary readings, most, if not all, of which are available at good public\nlibraries.<\/span><\/p>","targetAudience":0,"courseSyllabus":"<p>This course consists of four lectures. Each lecture explores one\nkey theme in Chinese humanities:<\/p>\n<p><strong>Week 1: The True Face of Hero<\/strong><br><\/p><p>The lecture examines “Biography of\nXiang Yu”, from Sima Qian’s (145-86?BC) magnum opus “Records of the Grand\nHistorian”. Through analysing Xiang Yu’s complex character, the lecture explores\nthe essence of heroism in ancient China, and how it resonates with and distinguishes\nfrom the Western heroic figures. Sima Qian’s depiction of Xiang Yu has an\nimportant impact on the development of Chinese historical writing, and hence\nthe lecture also covers related modern works in order to delineate this\nmasterpiece’s lasting legacy.<\/p>\n<p><strong>Week 2:  The Way of the Confucian Tradition<\/strong><br><\/p><p><span>The primary text of analysis here\nis “The Original Way” (Yaundao) by Han Yu (768-824AD).&nbsp; This text was the first ever attempt to\nestablish an intellectual&nbsp; genealogy of\nConfucian sages into orthodoxy, in order to refute the sayings and preaching of\nboth the Taoist and the Buddhist schools. It has had considerable influence on\nlater Confucian scholars. <i>&nbsp;<\/i>It is also a representative prose work by\nthe author, who is regarded as the first of the eight great masters of the “ancient\nprose” of Tang and the Song Dynasties – its structure is clear, its arguments\nsuperbly constructed, and its writing vivid and dramatic.&nbsp;<\/span><\/p>\n<p><strong>Week 3: Landscape of Immortality<\/strong><br><\/p><p>The lecture explores three classic\ntexts portraying the famous historical site “Red Cliff”. These texts were\nwritten by Su Dongpo (1037-1101AD), one of the most distinguished Chinese poets\nin history. The persona of Su Dongpo is characterised by the three major\ndimensions of Chinese tradition (Confucianism, Taoism, and Buddhism), all\nelegantly expressed in aesthetic terms in the texts. The lecture traces the\norigin of what may be called the lyrical tradition in Chinese literature, and\nalso examines the intricate yet multifaceted relations between classical\nChinese writings, and calligraphy and ink paintings.<\/p>\n<p><strong>Week 4: In Search of the Chinese Soul<\/strong><br><\/p><p>The focus of the lecture is two\nrenowned tales by Lu Xun (1881-1936): “The True Story of Ah-Q” and “Dairy of a\nMadman”. Lu Xun is full of paradoxes, ideologically and linguistically. His\nworks constitute a modern counter-discourse vis-a-vis the Chinese tradition. He\ncastigates feudal literary norms by creating soulless characters like Ah-Q. Still,\nhe cannot help giving readers hopeful endings in some other stories. Putting\npolitics aside, Lu Xun is considered the father of modern Chinese literature.\nHe endeavours to promote the use of modern vernacular, yet personally he is\nfond for classical Chinese poetry and writes some poems in this form. This\nlecture therefore examines Lu Xun’s entanglement with the Chinese tradition,\nand attempt to find the Chinese national character in his works.<b> <\/b><\/p>","courseFormat":"<p>Four bi-weekly lectures, and corresponding peer-assessed discussions<\/p>\n<p><b>Course Schedule<\/b><br><\/p>\n<ul>\n<li>3 &nbsp; Sep 2014 : The True Face of Hero<\/li>\n<li>17 Sep 2014 : The Way of the Confucian Tradition<\/li>\n<li>1 &nbsp; Oct 2014 : Landscape of Immortality<\/li>\n<li>15 Oct 2014 : In Search of the Chinese Soul<\/li><\/ul>","suggestedReadings":"","estimatedClassWorkload":"5-8 hours\/week","recommendedBackground":"None. However, students are expected to do at least some of the recommended introductory readings in order to develop a founded appreciation of Chinese culture, and to follow up recommended readings of their particular interest.","links":{}}