{"id":41,"shortName":"fantasysf","name":"Fantasy and Science Fiction: The Human Mind, Our Modern World","language":"en","shortDescription":"We understand the world — and our selves — through stories. Then some of those hopes and fears become the world.\n\n","aboutTheCourse":"Fantasy is a key term both in psychology and in the art and artifice of\nhumanity. The things we make, including our stories, reflect, serve, and\noften shape our needs and desires. We see this everywhere from fairy tale\nto kiddie lit to myth; from \"Cinderella\" to <i>Alice in Wonderland <\/i>to <i>Superman<\/i>;\nfrom building a fort as a child to building ideal, planned cities as whole\nsocieties. Fantasy in ways both entertaining and practical serves our persistent\nneeds and desires and illuminates the human mind. Fantasy expresses itself\nin many ways, from the comfort we feel in the godlike powers of a fairy\ngodmother to the seductive unease we feel confronting Dracula. From a practical\nviewpoint, of all the fictional forms that fantasy takes, science fiction,\nfrom <i>Frankenstein<\/i> to <i>Avatar<\/i>, is the most important in our modern\nworld because it is the only kind that explicitly recognizes the profound\nways in which science and technology, those key products of the human mind,\nshape not only our world but our very hopes and fears. This course will\nexplore Fantasy in general and Science Fiction in specific both as art\nand as insights into ourselves and our world.\n<br>\n<br>\n\n<h2>Work Expectations<\/h2>\nFor further information about the coursework, please see the <a href=\"http:\/\/spark-public.s3.amazonaws.com\/fantasysf\/Documents\/WorkExpectations.html\"> Work Expectations<\/a> page.","targetAudience":1,"courseSyllabus":"This course comprises ten units. Each will include a significant reading, typically a novel or a selection of shorter works. I will offer video discussions of each of the readings and also of more general topics in art and psychology that those readings help illuminate. Each unit will include online quizzes and ask you to write a brief essay offering your own insights into the reading. In order, the units are:<ol>\n<li>Grimm — <i>Children's and Household Tales<\/i><\/li>\n<li>Carroll — <i>Alice's Adventures in Wonderland<\/i> and <i>Through the Looking-Glass<\/i><\/li>\n<li>Stoker — <i>Dracula<\/i><\/li>\n<li>Shelley — <i>Frankenstein<\/i><\/li>\n<li>Hawthorne & Poe — Stories and Poems<\/li>\n<li>Wells — <i>The Island of Dr. Moreau<\/i>, <i>The Invisible Man<\/i>, \"The Country of the Blind,\" \"The Star\"<\/li>\n<li>Burroughs & Gilman — <i>A Princess of Mars<\/i> & <i>Herland<\/i><\/li>\n<li>Bradbury — <i>The Martian Chronicles<\/i><\/li>\n<li>LeGuin — <i>The Left Hand of Darkness<\/i><\/li>\n<li>Doctorow — <i>Little Brother<\/i><\/li>\n<\/ol>\n<p>In Unit I, the specific stories are the ones in the Lucy Crane translation (1886) which was published by Dover and is available online through Project Gutenberg. In Unit V, the specific readings are: Hawthorne's \"The Birthmark,\" \"Rappaccini's Daughter,\" \"Dr. Heidegger's Experiment,\" and \"The Artist of the Beautiful\"; Poe's \"The Fall of the House of Usher,\" \"The Tell-Tale Heart,\" \"The Black Cat,\" \"The Oval Portrait,\" \"The Facts in the Case of M. Valdemar,\" \"The Bells,\" \"The Raven,\" \"Annabel Lee.\" All the readings except Ray Bradbury's <i>The Martian Chronicles<\/i> and Ursula K. LeGuin's <i>The Left Hand of Darkness<\/i> will be available online at no charge.<\/p>","courseFormat":"This course includes an introductory unit of video clips discussing how one should proceed plus ten content units.  Each content unit asks for the reading of a book or book-length selection of writings in the field of fantasy and science fiction and offers the chance to write a brief essay about that unit’s reading and to comment on the writing of four other participants.  Each content unit begins with a video clip with some advice about that unit’s reading and later provides a series of clips, totaling about 1 1\/2 hours, discussing both the unit’s reading and general matters that that reading helps explore.  The course also offers an enrichment quiz (ungraded) for each unit and an on-going forum for participant discussion.  That forum will be monitored and may stimulate the creation of a supplementary clip or two per unit.  If any participant desires a grade, the grade will be determined by the quality and quantity of the writing and responses to the writing of others.","suggestedReadings":"I do not ask participants in this course to use any specific editions. However, for some works I believe some editions are better than others. For example, some editions of <i>The Island of Dr. Moreau<\/i> omit Charles Edward Prendick's \"Introduction\"; however, since that \"Introduction\" was actually written by H. G. Wells and included in the original publication of the book, it should not be omitted. For some works, I believe that a printed text is preferable. For example, the paper versions of <i>Alice in Wonderland<\/i> printed with <i>Through the Looking-Glass<\/i> along with James Tenniel's illustrations for both give one a sense of Lewis Carroll's original intent and design. The University of Adelaide's eBooks@Adelaide site makes available both <i>Alice in Wonderland<\/i> and <i>Through the Looking-Glass<\/i>with Tenniel's illustrations placed approximately where they were in the original text, although the chapters themselves are not broken into pages. Thus that online edition, for many people, is a reasonable although not exact substitute for the printed book. For those who choose to use online editions in this course, links for the currently available ones that I would suggest are listed below. <br><br><ol>\n<li>Grimm — <i>Children's and Household Tales<\/i> (<a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=fantasysf&isbn_ean=9780486210803\">Lucy Crane translation with Walter Crane illustrations<\/a>)<\/li>\n<li>Carroll — <a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=fantasysf&isbn_ean=9780199558292\"><i>Adventures in Wonderland<\/i><\/a> and <a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=fantasysf&isbn_ean=9780199558292\/\"><i>Through the Looking-Glass<\/i><\/a><\/li>\n<li>Stoker — <a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=fantasysf&isbn_ean=9780199564095\"><i>Dracula<\/i><\/a> (This reading is somewhat longer than most of the others. You may want to begin it in advance.)<\/li>\n<li>Shelley — <a href=\"http:\/\/openlibrary.org\/books\/OL20443134M\/Frankenstein_Or_The_Modern_Prometheus\"><i>Frankenstein<\/i><\/a><\/li>\n<li>Hawthorne & Poe — Stories and Poems (Hawthorne's <a href=\"http:\/\/www.gutenberg.org\/ebooks\/512\"><i>Mosses from an Old Manse<\/i><\/a> includes \"The Birthmark,\" \"Rappaccini's Daughter,\" and \"The Artist of the Beautiful\" and his <a href=\"http:\/\/www.gutenberg.org\/files\/13707\/13707-h\/13707-h.htm\"><i>Twice-Told Tales<\/i><\/a> includes \"Dr. Heidegger's Experiment\"; <a href=\"http:\/\/www.google.com\/url?sa=t&rct=j&q=&esrc=s&source=web&cd=3&ved=0CG4QFjAC&url=http%3A%2F%2Fmikicafilolosko.pbworks.com%2Ff%2FThe%252BPortable%252BEdgar%252BAllan%252BPoe.pdf&ei=0zjrT5fyPIiS9QTzy73bBQ&usg=AFQjCNFInjyZaqCbms232WCphZaYmPeWug\"><i>The Portable Poe<\/i><\/a> includes all the suggested Poe stories and poems<\/li>\n<li>Wells — <a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=fantasysf&isbn_ean=9780141441023\/\"><i>The Island of Dr. Moreau<\/i>, <i>The Invisible Man<\/i>, \"The Country of the Blind,\" \"The Star\"<\/a><\/li>\n<li>Burroughs & Gilman — <a href=\"http:\/\/www.gutenberg.org\/ebooks\/62\"><i>A Princess of Mars<\/i><\/a> & <a href=\"http:\/\/ebooks.adelaide.edu.au\/g\/gilman\/charlotte_perkins\/herland\"><i>Herland<\/i><\/a><\/li>\n<li>Bradbury — <i>The Martian Chronicles<\/i> (not available for legal, free download)<\/li>\n<li>LeGuin — <i>The Left Hand of Darkness<\/i> (not available for legal, free download)<\/li>\n<li>Doctorow — <a href=\"http:\/\/craphound.com\/littlebrother\/download\/\"><i>Little Brother<\/i><\/a> (This reading is somewhat longer than most of the others. You may want to begin it in advance.)<\/li>\n<\/ol>In whatever form, I hope you enjoy your reading! <br><br>\n<h2>Reading Advice<\/h2>\nShould you read the works for this course as they come up each week or in advance? Different people work best different ways. I like to read slowly, underline, write in the margins, and make up an index to a work when I've finished reading it. For me reading in advance often works nicely because I can, just before the moment when I need to discuss the work, review the underlinings and the index to fully refresh my memory and get an overview of the work. For other people, particularly those who don't take extensive notes, reading quite close to the moment of discussion or of writing about the work is crucial. I think individuals will need to judge for themselves which way to read for this course.","instructor":"Eric Rabkin","estimatedClassWorkload":"8-12 hours\/week","recommendedBackground":"There are no prerequisites for this course.  However, the course\nwill be conducted at the level expected of advanced undergraduate students.\n Therefore, for all participants, reading comfortably in English at\nthe undergraduate college level is desirable.  For those also participating\nin the writing and written responses, which is recommended, some experience\nin writing about literature is desirable. (<a href=\"https:\/\/s3.amazonaws.com\/spark-public\/fantasysf\/Documents\/ReadingWritinginTranslation.html\" target=\"_blank\">A Note on Reading in Translation.<\/a>)","links":{}}