{"id":2900,"shortName":"valuation","name":"Alternative Approaches to Valuation and Investment","language":"en","shortDescription":"In this course, participants will develop an understanding of the intuitive foundations of asset and investment valuation, and how alternative valuation techniques may be used in practice. This is part of a Specialization in corporate finance created in partnership between the University of Melbourne and Bank of New York Mellon (BNY Mellon).","aboutTheCourse":"<p>This course is the fourth in the four-course Specialization <i>Essentials of Corporate Financial\nAnalysis and Decision-Making<\/i><br><\/p><p>In this course you will develop not only an\nunderstanding of how firm risk might be objectively measured using commonly\navailable data, &nbsp;but also an understanding of how such risk measures might\nbe incorporated directly into valuation models.&nbsp;<\/p><p>Instructors from the University\nof Melbourne, together with their partners at BNY Mellon,&nbsp;demonstrate\nthese practical techniques for risk measurement and valuation using real-life\ndata relating to some of the largest listed public companies from around the\nworld.<\/p>\n<p>Courses created in partnership with:<br>\n<img src=\"https:\/\/d396qusza40orc.cloudfront.net\/financialanalysis\/images\/bnym-logo-small.png\"><\/p>","targetAudience":0,"courseSyllabus":"<p><strong>Module 1:<\/strong> Defining attitudes towards and alternative measures of risk&nbsp;<\/p><p><\/p><ul><li>Explain how the total risk of a company’s returns is measured<br><\/li><li>Differentiate between three alternative attitudes towards risk and return and describe how these differences might lead to different rankings of investment proposals<br><\/li><li>Describe how diversification might lead to a benefit for risk-averse investors and explain the key influence on the benefit achieved<br><\/li><\/ul><p><\/p>\n\n<p><strong>Module 2:<\/strong> Linking risk with expected\nreturn<\/p><p><\/p><ul><li>Clearly differentiate between systematic and unsystematic risk<br><\/li><li>Explain the use of the Capital Asset Pricing Model and describe how it might be implemented in practice<br><\/li><li>Describe the empirical evidence concerning how well the CAPM does in practice in explaining realized returns and then explain how multi-factor models have sought to address this evidence<br><\/li><\/ul><p><\/p>\n\n<p><strong>Module 3: <\/strong>Using financial statement\nanalysis to measure cost of capital<\/p><p><\/p><ul><li>Define the Weighted Average Cost of Capital formula<br><\/li><li>Describe the nature of the key inputs into the WACC – specifically with respect to values and rates of return<br><\/li><li>Explain how an unlisted firm might estimate its own WACC<br><\/li><li>Identify the shortcomings of the WACC approach, especially for firms that operate over a diverse range of industries<br><\/li><\/ul><p><\/p>\n\n<p><strong>Module 4:<\/strong> Addressing financial reality\nwith real options analysis<\/p><p><\/p><ul><li>Explain why NPV analysis might lead to incorrect investment decisions<br><\/li><li>Define – using option pricing terminology – the nature of the options to invest, expand and\/or abandon projects<br><\/li><li>Illustrate how decision-trees might be used to approximate the value of a real option and then describe the natural limitations of this approach<br><\/li><li>Describe the key conclusions of survey research that has examined the take-up of real options analysis by corporations and then describe the situations where real options analysis is most likely lead to different decisions relative to standard NPV analysis<br><\/li><\/ul><p><\/p>","courseFormat":"This course will run for 4 weeks, and consist of 4 modules each with a series of lecture videos between 5 to 8 minutes long. Each video will contain a range of integrated quiz questions or reflection questions. Assessment will be multiple-choice questions, and a final peer reviewed assessment.<br><br>Course hero image reproduced with permission from BNY Mellon.<br><img><br>","suggestedReadings":"Graham, J.R. &amp; Smart, S.B. (2012) <i>Introduction to corporate finance: what companies do. <\/i>Australia: South-Wesetern\/Cengage Learning.<br><br>","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"<p><\/p><ul><li>A basic knowledge of statistics and an ability\nto employ simple algebra to solve straightforward problems<br><\/li><li>Familiarity with Microsoft Excel (or a\nfunctionally-equivalent spreadsheet program). Specifically participants should\npossess the ability to summarise data using the graphical tools contained\nwithin that program.<br><\/li><li>Apart from that, a natural curiosity&nbsp;about not only how markets operate, but also how\nparticipants in those markets gather and then transform information so as to\nmake financial decisions that maximise firm value\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/li><\/ul><p><\/p><p><br><\/p>","links":{}}