{"id":2146,"shortName":"linguanegocios","name":"Fundamentos e Linguagem de Negócios: Contabilidade (The Blue Side Up)","language":"pt-br","shortDescription":"Este curso busca estimular os participantes a compreender e refletir sobre organizações e ambiente de negócios, apoiar compreensão de terminologia contábil, de contabilidade e seus relatórios básicos e inspirar uma reflexão sobre carreira e desenvolvimento profissional na área.\n","aboutTheCourse":"Neste curso serão discutidos, de forma inovadora, o ambiente econômico, as organizações e suas relações, negócios, gestores e decisão, informação e controle, relatórios contábeis e financeiros, sistemas e tecnologia de apoio, visando fortalecer compreensão e posicionamento de carreira. Compreender as organizações e suas atividades sem domínio dos fundamentos e linguagem de negócios é um desafio inglório. O ambiente das organizações é de natureza dinâmica e sistematicamente privilegia antecipação e inovação. Quem conhece os modelos de negócios e domina as relações fundamentais de suas variáveis, tem naturalmente enorme vantagem. Porém, tal vantagem não aparece por acaso. Depende do entendimento das variáveis, terminologia e relações, obtidas pela combinação de conceitos e experiência. Neste curso, tanto a parte conceitual quanto experiencial serão organizadamente estimuladas visando fortalecer o potencial profissional, refletir sobre carreira e desenvolvimento no mundo corporativo, com foco em fluência na linguagem dos negócios: a contabilidade. Com estratégias instrucionais diferenciadas e recorte de conteúdo apropriado, este curso se volta aos interessados no tema e motivados pela perspectiva Brasileira.<br>","targetAudience":0,"courseSyllabus":"Semana 1: Sociedade e ambiente econômico.<div>Semana 2: Negócios e decisão.<\/div><div>Semana 3: Informação e controle.<\/div><div>Semana 4: Relatórios contábeis e financeiros.<\/div><div>Semana 5: Sistemas e tecnologia.<\/div><div>Semana 6: Você, amanhã.<\/div><div><br><\/div>","courseFormat":"<div>Cada sessão deste curso de 6 semanas contará com vídeo-aulas intercaladas com recursos visuais (slides, PIP), bem como vídeos de especialistas convidados. Os vídeos conterão testes rápidos para apoiar na retenção e participação. Os slides do curso e alguns materiais adicionais serão disponibilizados para os participantes.<\/div><div><br><\/div>","suggestedReadings":"","estimatedClassWorkload":"3-4 hours\/week","recommendedBackground":"Sem requisitos preliminares. Todas e todos os interessados são bem-vindos!","links":{}}