{"id":457,"shortName":"astronomy","name":"Confronting The Big Questions: Highlights of Modern Astronomy","language":"en","shortDescription":"An introduction to modern astronomy's most important questions. The four sections of the course are Planets and Life in The Universe; The Life of Stars; Galaxies and Their Environments; The History of The Universe.","aboutTheCourse":"<p>This course provides students with a short overview of structure and content of the Universe. &nbsp;Each week will cover one question. &nbsp;In week one we address the issue of extra-solar planets - planets orbiting other stars and ask what do we know about these alien worlds touching on issues of life in the Universe as well. In the second week we explore the life of stars. &nbsp;The third week looks at galaxies their history and their distribution across space. &nbsp;The last two lectures explore cosmology - the history of the Universe as a whole.<\/p>\n<p>By the end of the class students will have gained an overview of the Universe they inhabit and an understanding of its biggest unresolved questions.<\/p>","targetAudience":0,"courseSyllabus":"<p><b>Week 1: Planets and Life in The Universe<\/b><\/p>\n<p>Exoplanets searches, exoplanet census, astrobiology<\/p>\n<p><b>Week 2: The Life of Stars<\/b><\/p>\n<p>\tStar formation, fusion and stellar middle age, black holes and stellar death<\/p>\n<p><b>Week 3: Galaxies and Their Environments<\/b><\/p>\n<p>\tGalaxy types, Active Galactic Nuclei, Clusters of Clusters of Galaxies<\/p>\n<p><b>Week 4: The History of The Universe<\/b><\/p>\n<p>\tWhy the Big Bang? A History of Time, What Happened Before the Big Bang<\/p>","courseFormat":"The class will consist of lecture videos, which are between 8 and 12 minutes in length and interactive exercised developed for the textbook. There will be quiz for each week and a final exam.","suggestedReadings":"<p>No required readings.<br><\/p>","instructor":"Adam Frank","estimatedClassWorkload":"3-4 hours\/week","recommendedBackground":"Students with a background in mathematics and an interest in science and astronomy are welcome!<br>","links":{}}