{
    "id": 2505,
    "shortName": "cloudcomputing2",
    "name": "Cloud Computing Concepts: Part 2",
    "language": "en",
    "shortDescription": "Learn core distributed computing concepts that underlie today’s and tomorrow’s cloud computing systems.",
    "aboutTheCourse": "<p>Cloud computing systems today, whether open-source or used inside companies, are built using a common set of <strong>core techniques, algorithms, and design philosophies<\/strong>—all centered around distributed systems. Learn about such fundamental distributed computing \"concepts\" for cloud computing. <\/p>\n\n<p>Some of these concepts include:<\/p>\n<ul>\n<li>Clouds, MapReduce, key-value stores<\/li>\n<li>Classical precursors<\/li>\n<li>Widely-used algorithms<\/li>\n<li>Classical algorithms <\/li>\n<li>Scalability<\/li>\n<li>Trending areas<\/li>\n<li>And more!<\/li><\/ul><p>Understand&nbsp;<strong>how these techniques work<\/strong>&nbsp;inside today’s most widely-used cloud computing systems. Get your hands dirty using these concepts with provided homework exercises. In the&nbsp;<strong>optional programming track<\/strong>, implement some of these concepts in template assignments provided in C++ programming language.<br><\/p><p>You will also watch interviews with leading managers and researchers, from both industry and academia.<\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<p>This course will be broken up into 5 weekly modules covering the following topics:<br><\/p>\n<p><strong>Week 1: <\/strong>Leader Election, Mutual Exclusion<\/p>\n<p><strong>Week 2: <\/strong>Concurrency Control, Replication Control<\/p>\n<p><strong>Week 3: <\/strong>Stream Processing, Graph Processing, Structure of Networks, Scheduling<\/p>\n<p><strong>Week 4: <\/strong>Distributed File Systems, Distributed Shared Memory, Sensor Networks<\/p>\n<p><strong>Week 5: <\/strong>Security, Datacenter Outage Studies, Wrap-up<\/p>",
    "estimatedClassWorkload": "4-8 hours\/week",
    "recommendedBackground": "<p><strong>You must complete the <a href=\"https:\/\/www.coursera.org\/course\/cloudcomputing\">Cloud Computing course<\/a> before taking this course.<\/strong><\/p>\n\n<p>This course assumes some basic knowledge of working computer systems. This course is generally oriented towards either graduate students (or senior undergraduates) or developers in industry who are working with cloud computing systems. Some familiarity with cloud computing systems helps, but is not a prerequisite. In the optional programming track, familiarity with C++ programming language is required.<\/p>\n\n<p>This course does not teach you how to use cloud computing systems or about networking or Big Data. If we were to draw an analogy, if this course were about cars, then it would teach you the physics relating to the internals of the car (e.g., friction, transmission, gears, etc.) and basics about the internals of the car (e.g., about the carburetor, engine, etc.). The course would not, however, teach you how to drive a car or about automobile accident statistics or about how roads are built.<\/p>\n\n<p>Take this course if you’re curious about cloud computing systems. Do not take this course if you know nothing about computers or computer science.<\/p>",
    "links": {

    }
}