{"id":1495,"shortName":"managerisk","name":"Risk and Opportunity: Managing Risk for Development","language":"en","shortDescription":"Risks are a part of our everyday lives. Losses from risks and missed opportunities affect everyone. In the last two decades the world has experienced international integration, technological innovation, and economic reform, but also financial turbulence and environmental damage. The fear of loss can prevent people from pursuing development opportunities, leaving many poor people trapped in poverty. However, societies that successfully adapt to risks can make dramatic gains in their living standards. ","aboutTheCourse":"This course is based on the World Bank’s flagship report, the World Development Report 2014, Risk and Opportunity: Managing Risk for Development. In this course you can learn how risk management can be used to unlock development opportunities, and handle risks proactively. <br><br>\nThe course synthesizes, in an easily accessible and interactive way, the Report’s main messages and policy recommendations, along with additional up-to-date research and experience related to risk management in the developing world. It will guide you, through expert videos, a game, and several animations, to identify critical gaps in risk management and to move from being a “crisis fighter” to becoming a proactive and systematic risk manager.","targetAudience":3,"courseSyllabus":"<div> \n    <strong>Week 1. Managing risk in a changing world<\/strong>\n  <br>\n    In the first week you will understand what effective risk management for development is; why it is important to both avoiding crises and making the most of opportunities; why contributions from different economic and social systems are needed and why the governments should play an important role in scaling-up these contributions. You will learn the basic terminology and concepts of the course.<br>\n    <br>\n    <strong>Week 2. Digging deeper: What are the components of risk management? Why aren’t people better at managing risk?<\/strong>\n    <br>\n    In the second week you will explore the components of risk management (knowledge, insurance, protection, and coping), and the types of obstacles that often impair risk management and how they arise. You will become aware of the need to account for these obstacles when planning for risks, and of potential institutional solutions to overcome them.<br>\n    <br>\n   <strong>Week 3.  Who is responsible for managing risk? The importance of a holistic approach to risk management<\/strong>\n    <br>\n\n    In the third week you will learn about the complementary roles of key social and economic systems (households, communities, the enterprise sector, the financial system, the state and the international community) in fostering people’s resilience and prosperity. This week consists of four sub-modules. You can choose to concentrate on one module that interests you the most or you can expand your knowledge by making use of the materials provided for several or all modules. <br>\n    <br> \n    <ul> <strong>Module 3.1. Individuals and the risks they face: Protective households and cohesive communities<\/strong>\n    <br>\n    In this module you will understand how households and communities can generally contribute to people’s risk management, which intrinsic characteristics could strengthen their contribution to risk management, and how the state can support their role.\n<br>\n    <br>\n    <strong>Module 3.2. How can the private sector contribute to risk management? A vibrant enterprise sector and an inclusive financial system<\/strong>\n    <br>\n    In this module you will explore the strengths and limitations of two important systems that can help people confront risk – the enterprise sector and the financial system – and the policies that can improve each system’s contributions.<br>\n    <br>\n    <strong>Module 3.3. Risk at the national level: A stable and supportive macroeconomy<\/strong>\n    <br>\n    In this module you will examine the enabling foundation that the macroeconomy provides for other economic activities, and the circumstances in which this function can be counterproductive. The module stresses the vital responsibility of the state in managing the macroeconomy through macroeconomic policies and the importance of generating sustainable resources for long-term development.   <br>\n    <br>\n    \n    <strong>Module 3.4. Beyond the nation-state: A strategic and proactive international community<\/strong>\n    <br>\n    In this module you will analyze how the international community can help with risks that exhaust national capacity or cross national boundaries, identify circumstances in which the international community has successfully come together to manage important global risks, and examine how the international community can improve its contribution.<\/ul>\n\n\n    \n    \n     <br>\n    <strong>Week 4.  Bringing it all together: Proactive, systematic and integrated risk management<\/strong>\n    <br>\n    In this last module you will review the key lessons from the previous modules and the policy principles for managing risk derived through the course. You will also consider the need for integrated risk management, including the possibility of a national risk board.<br>\n    <br>\n    Click <a target=\"_blank\" href=\"http:\/\/www.youtube.com\/embed\/-Ri0jG6dPe8\">here<\/a> to view an animated video outlining some of the MOOC's main ideas.<br>\n \n\n  <h2>Connect<\/h2>\nCommunicate and share resources via Twitter using hashtag <a target=\"_blank\" href=\"https:\/\/twitter.com\/search?q=wdrrisk\">#wdrrisk<\/a>. Sign up for a free account at <a target=\"_blank\" href=\"http:\/\/twitter.com\">http:\/\/twitter.com<\/a>. If you use the tweet button on this, make sure to use the correct hashtag <a target=\"_blank\" href=\"https:\/\/twitter.com\/search?q=wdrrisk\">#wdrrisk<\/a>.\n<\/div>","courseFormat":"The course is offered over a four-week period and contains videos by experts, well-referenced research findings, examples and case studies. It also contains assignments (quizzes, a digital game and a final project) and facilitates discussions through discussion forums.<br><br>\n\nYou will be provided with resources and activities to engage in, including:\n<ul>\n\n                 <li><span>A&nbsp;‘<b>Managing Risk for Development’ video fest<\/b>&nbsp;- 24 video talks by the authors of the World Development Report 2014 and other renowned world experts, and 6 animated videos<\/span>.<\/li>\n\n           <li><span><b>Resources<\/b>:&nbsp;Core and optional (deep dive) materials on the week’s theme.<\/span><\/li>\n              <li><span><b>Quizzes<\/b>&nbsp;that check your knowledge, reinforce the lesson’s material and provide immediate feedback.<\/span><\/li>\n               <li><span><b>Assignments<\/b>&nbsp;that will sharpen your skills of analysis, reflection and communication about risk management for development. <\/span><\/li>\n              <li><span>A specially developed <b>online game<\/b> for participants, which will require you to make your own risk management choices. <\/span><\/li>\n               <li><span><b>Discussion forums and social media<\/b>&nbsp;that enable collaboration with others from around the world, enriching interaction among participants.<\/span><\/li>\n               <li>\n               <span>A live interactive&nbsp;<b>Google Hangouts on Air<\/b>&nbsp;with international experts, who will engage in a Q&amp;A session on how risk management can be a powerful tool for development.<\/span><\/li>\n               <li>\n               As a final project, you will develop a digital resource, which summarizes a key lesson from the course.\n               <\/li>\n             <\/ul>\n\nIf you successfully complete the course requirements, you will receive a Coursera Statement of Accomplishment. Course requirements consist of gaining a cumulative score of 50% in the following activities: two quizzes, one peer-reviewed assignment and the final project. You will receive a distinction if you score 80% or above.<br>\n<br>You can also go much further than this, participating in networking, discussion forums, and diving deeper into our rich selection of additional resources. We also will use e-discussions, Google Hangout and other tools to facilitate dialogue between the learners and experts.","suggestedReadings":"›&nbsp;&nbsp;&nbsp;<a target=\"_blank\" href=\"http:\/\/siteresources.worldbank.org\/EXTNWDR2013\/Resources\/8258024-1352909193861\/8936935-1356011448215\/8986901-1380046989056\/WDR-2014_Complete_Report.pdf\">World Bank, 2013, World Development Report 2014, Risk and Opportunity. &nbsp;&nbsp;&nbsp;&nbsp;Managing Risk for Development<\/a><br>\n›&nbsp;&nbsp;&nbsp;World Bank, 2013, Overview to the World Development Report 2014, Risk and &nbsp;&nbsp;&nbsp;&nbsp;Opportunity. Managing Risk for Development, &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;<a target=\"_blank\" href=\"http:\/\/siteresources.worldbank.org\/EXTNWDR2013\/Resources\/8258024-1352909193861\/8936935-1356011448215\/8986901-1380046989056\/00--Overview.pdf\">English<\/a>&nbsp;|&nbsp;<a target=\"_blank\" href=\"http:\/\/siteresources.worldbank.org\/EXTNWDR2013\/Resources\/8258024-1352909193861\/8936935-1356011448215\/8986901-1380730352432\/SPA_StandaloneOverview.pdf\">Español<\/a>&nbsp;|&nbsp;<a target=\"_blank\" href=\"http:\/\/siteresources.worldbank.org\/EXTNWDR2013\/Resources\/8258024-1352909193861\/8936935-1356011448215\/8986901-1380730352432\/FRE_StandaloneOverview.pdf\">Français<\/a>&nbsp;|&nbsp;<a target=\"_blank\" href=\"http:\/\/siteresources.worldbank.org\/EXTNWDR2013\/Resources\/8258024-1352909193861\/8936935-1356011448215\/8986901-1380730352432\/ARA_StandaloneOverview.pdf\">عربي<\/a>&nbsp;|&nbsp;<a target=\"_blank\" href=\"http:\/\/siteresources.worldbank.org\/EXTNWDR2013\/Resources\/8258024-1352909193861\/8936935-1356011448215\/8986901-1380730352432\/RUS_StandaloneOverview.pdf\">Русский<\/a>&nbsp;|&nbsp;<a target=\"_blank\" href=\"http:\/\/siteresources.worldbank.org\/EXTNWDR2013\/Resources\/8258024-1352909193861\/8936935-1356011448215\/8986901-1380730352432\/POR_StandaloneOverview.pdf\">português<\/a>&nbsp;|&nbsp;<a target=\"_blank\" href=\"http:\/\/siteresources.worldbank.org\/EXTNWDR2013\/Resources\/8258024-1352909193861\/8936935-1356011448215\/8986901-1380730352432\/CHN_StandaloneOverview.pdf\">中文<\/a>","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"This course is relevant for development practitioners, policy makers, students, and the general public. No prior coursework in the subject is assumed. All participants are welcome.","links":{}}