{
    "id": 2437,
    "shortName": "businessandphilo2",
    "name": "On Strategy: What Managers can learn from Philosophy - Part 2",
    "language": "en",
    "shortDescription": "Part 2 of the MOOC: 3 new lectures\n",
    "aboutTheCourse": "<p>This\n entire MOOC is based on one of my strongest beliefs: philosophy is the \nbest tool to help managers in areas where no numbers are available. \nAfter all a strategic vision is an \"idea\", it is translated into a \"concept\", a business model is a … \"model\" etc. And we need to better \nunderstand what is an idea, what is a concept, what is a model etc. In \nother words we need to better understand how do we think. In the first \nsix lectures we made a surprising journey from the ancient Greek \nphilosophers to the corporate world of today. You probably crossed a set\n of \"new territories\" but honestly, it was the same for me ! <\/p><p>Apparently\n this experience has no end in sight! The first six lectures are \nbroadcasted for a second time during this fall and I had the chance to \nrecord three additional lectures last September. Not a surprise: \nphilosophy is like a country you want to visit, there are always new \nroads to discover and even new paths to create.<strong> It is highly recommended\n to have attended lectures 1-6 to take the most out of this part 2.<\/strong><\/p><p>In\n lecture 7, I examine the deep nature of the changes the world is \ncurrently facing and the associated challenges for us. Lecture 8 focus \non one of them: the impact of technology on the way we think. In the \nlast lecture I suggest some tips that might help you to become a better \nmanager, in other words to become a corporate philosopher.<\/p><p>Evaluations\n will be similar to the ones you had so far: open questions that request\n some research. At the end of lecture 9, I will again ask you to submit a short paper about a famous quote of a great philosopher. <br><\/p><p>Moreover, we will organize a Google Hangout during lecture 8.<br><\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<strong>Lecture 7: The Essence of Change<\/strong><br>7.1 The end of...<br>7.2 You need a fixed point<br>7.3 Philosophy as a fixed point<br>7.4 Two first challenges<br>7.5 Another center of gravity<br>7.6 The four causes of Aristotle<br>7.7 'A <em>thus<\/em> B' or 'A <em>and<\/em> B'<br><br><strong>Lecture 8: Is technology making us stupid?<\/strong><br>8.1 Four types of tools<br>8.2 The disappointing equation<br>8.3 A third example: Big Data<br>8.4 The end of Science?<br>8.5 Question what is in front of you<br>8.6 Who is the tool of who?<br><br><strong>Lecture 9: Become a corporate philosopher!<\/strong><br>9.1 Use the right words<br>9.2 Use criteria<br>9.3 Beware the question<br>9.4 Use creativity techniques<br>9.5 Think visual<br>9.6 Never stop thinking<br>9.7 Embrace humor<br><br>",
    "estimatedClassWorkload": "2-3 hours\/week",
    "recommendedBackground": "No\nbackground knowledge or skills are required, though we recommend an\ninterest in philosophy.<br>",
    "links": {}
}