{
    "id": 2454,
    "shortName": "forestshumans",
    "name": "Forests and Humans: From the Midwest to Madagascar",
    "language": "en",
    "shortDescription": "Explore the forests of the world, from the taiga to the tropical rainforest! Learn why humans depend on them, and how we can sustainably manage forests for us and the many species with whom we share them.",
    "aboutTheCourse": "<span><p dir=\"ltr\">Did you know that thousands of people could have been saved during the 2009 tsunami if mangrove forests had been protected… and that the boreal forest holds 40% of the Earth’s soil carbon… and that only 7% of forests are “rain forest,” but this biome holds 50% of the world’s species? Did you hear that big cities like New York and Quito are mandating forest protection to save their city's water supply? This is only a handful of the questions you’ll find answers to in this Forests and Humans online course.<\/p><p dir=\"ltr\"> <\/p>This course provides an overview of the geography, ecology, and economic importance of the world’s forest biomes. You’ll learn how climate influences vegetation and, in-turn, how forests impact global climate. You’ll meet scientists working to understand the astounding biodiversity and ecological complexity of forest ecosystems, and how these ecosystems support human life. We’ll discuss the threats to forest ecosystems around the world, and hear from the people trying to protect them. The course emphasizes the forest resources and services that humans depend upon, and how we can maintain these resources into the future. We’ll analyze the idea of “sustainability” when it comes to forest management, hear alternative viewpoints about what this word means, and discuss potential conflicts. Finally, we’ll take a look at the many real-world programs in place at the global, national, and local level to sustainably manage forests.<\/span>",
    "targetAudience": 3,
    "courseSyllabus": "<span><p dir=\"ltr\"><strong>Week 1<\/strong>: Global climate and diversity patterns; climate as a driver of forest evolution; characteristics of major forest biomes.<\/p><p dir=\"ltr\"> <\/p><p dir=\"ltr\"><strong>Week 2<\/strong>: Forests and the carbon cycle; forests and water; forests and nutrient cycling; direct and indirect values of biodiversity.<\/p><p dir=\"ltr\"> <\/p><p dir=\"ltr\"><strong>Week 3<\/strong>: Exploitation of timber and non-timber forest products; threats to forests; deforestation and land use change; forests and climate change.<\/p><p dir=\"ltr\"> <\/p><strong>Week 4<\/strong>: What is forest sustainability? Systems analysis; life cycle inventory and analysis; forest conservation and sustainable forestry initiatives.<\/span>",
    "estimatedClassWorkload": "1-2 hours\/week",
    "recommendedBackground": "No background in the subject matter is required, and all are welcome! Supplementary resources will be provided for advanced students.",
    "links": {

    }
}