{
    "id": 1383,
    "shortName": "cryptography",
    "name": "Cryptography",
    "language": "en",
    "shortDescription": "This course will introduce you to the foundations of modern cryptography, with an eye toward practical applications.",
    "aboutTheCourse": "<span><p>Historically, cryptography was used to ensure private communication between two people with some prior relationship. More recently, its scope has expanded to include things as diverse as data integrity, secure internet-wide communication, electronic cash, secure distributed computation, and more.<\/p><p>Cryptography has also become ubiquitous. Perhaps unknowingly, we have all encountered applications of cryptography in our daily lives---whether by logging in using a password, making a web purchase over a secure connection, or applying a software update that is digitally signed.<\/p>This course will introduce you to the foundations of modern cryptography, with an eye toward practical applications. We will learn the importance of carefully defining security; of relying on a set of well-studied “hardness assumptions” (e.g., the hardness of factoring large numbers); and of the possibility of proving security of complicated constructions based on low-level primitives. We will not only cover these ideas in theory, but will also explore their real-world impact. You will learn about cryptographic primitives in wide use today, and see how these can be combined to develop modern protocols for secure communication.<\/span>",
    "targetAudience": 1,
    "courseSyllabus": "<span><b>Introduction and Motivation<\/b><br><ul><li><p>Classical Encryption Schemes<\/p><\/li><li><p>Principles of Modern Cryptography<\/p><\/li><\/ul><b>Perfect Secrecy and Its Limitations<\/b><br><p><b>Private-Key Encryption<\/b><\/p><ul><li><p>Computational Security<\/p><\/li><li><p>Pseudorandom Generators and Stream Ciphers<\/p><\/li><li><p>Pseudorandom Functions and Block Ciphers<\/p><\/li><li><p>Modes of Encryption<\/p><\/li><li><p>Security against Chosen-Ciphertext Attacks and Padding-Oracle Attacks<\/p><\/li><\/ul><b>Message Authentication<\/b><br><ul><li><p>Secrecy vs. Integrity<\/p><\/li><li><p>Message Authentication Codes<\/p><\/li><li><p>CBC-MAC<\/p><\/li><li><p>Authenticated Encryption<\/p><\/li><\/ul><b>Hash Functions<\/b><br><ul><li><p>Security Requirements<\/p><\/li><li><p>HMAC<\/p><\/li><li><p>Additional Applications of Hash Functions<\/p><\/li><\/ul><b>Number Theory and Mathematical Background<\/b><br><p><b>The Public-Key Revolution<\/b><\/p><ul><li><p>Key Distribution and Key Management<\/p><\/li><li><p>Diffie-Hellman Key Exchange<\/p><\/li><\/ul><b>Public-Key Encryption<\/b><br><ul><li><p>Definitions of Security<\/p><\/li><li><p>Hybrid Encryption and the KEM\/DEM Paradigm<\/p><\/li><li><p>El Gamal Encryption and DHIES<\/p><\/li><li><p>RSA Encryption and the RSA PKCS #1 Standard<\/p><\/li><\/ul><b>Digital Signatures<\/b><br><ul><li><p>Signatures vs. MACs<\/p><\/li><li><p>RSA-Based Signatures and the RSA PKCS #1 Standard<\/p><\/li><li><p>DSA\/ECDSA<\/p><\/li><li><p>Public-Key Infrastructures<\/p><\/li><\/ul><\/span>",
    "estimatedClassWorkload": "3-5 hours\/week",
    "recommendedBackground": "<ul><li><p>Intended for students majoring in either computer science or mathematics.<\/p><\/li><li><p>A prior course covering discrete mathematics and basic probability. <\/p><\/li><li><p>Prior exposure to algorithms will be helpful, but the necessary background can be picked up quickly.<\/p><\/li><li>Some of the examples and optional exercises will assume familiarity with programming in a C-like language, and some advanced topics will require mathematical maturity.<\/li><\/ul>",
    "links": {

    }
}