{"id":3542,"shortName":"geneticlab","name":"遗传学实验","language":"zh-cn","shortDescription":"遗传学是实验科学。\n本实验课程以研究基因功能为导向，以不同的模式生物为实验对象，通过一系列的实验背景和目的的介绍、实验过程体验，循序渐进地学习遗传学研究设计的精髓，建立遗传学研究的思维理念框架；并进一步引导大家如何运用生物学不同层次的知识和技术，研究感兴趣的生物学问题。为科研入门起抛砖引玉的作用。\n\n","aboutTheCourse":"<p>遗传学实验课一直是北京大学生命科学学院本科生的主干基础课。每年平均上课人数约120人。<\/p><p>本课程的实验设计贯穿以研究基因功能为目的遗传学思维理念及精髓。通过背景知识的介绍和相关的实验操作，使大家建立这样的理念：研究基因功能时，在分子水平通过敲除或者敲入的策略，使基因突变或者修饰，这些突变依赖载体染色体的传递，将稳定地传给下一代。通过设计精巧的遗传杂交实验，追踪易于识别的染色体标记，就可以定位目的基因、获得纯合突变体，研究表型与基因型间的对应关系，从而理解各种表型的分子机制。整个实验过程涉及生物学不同学科知识和实验设计的融合。\n<\/p><p>针对遗传学研究的这些关键点，本课程设计了一系列实验，主要以模式动物果蝇为窗口，通过遗传杂交实验，以遗传信息传递的载体染色体为线索，除验证遗传学基本定律外，还引入科研项目的理念和实验环节，以便让大家参与平时在课堂上接触不到的真实科研实践。每次实验包括背景原理、目的介绍、操作要点和相关的视频演示。让学生亲自保管和观察杂交果蝇培养瓶，写生活史观察日记也是本课程的特色之一。<\/p><p>学生，尤其是高年级本科生和进入国内外科研第一线的研究生，均反馈受益非浅。<\/p><p>参考教材为由张文霞主编，高等教育出版社出版的《遗传学实验指导》。此外相应的实验将提供参考文献。<\/p><p>\n\n\n\n\n\n\n\n\n\n<\/p><p>MOOC实验课虽然无法亲自操作，但我们将提供丰富的图片和视频资料，使大家了解其过程。有实验条件的选课人员，可以依照讲解和演示，亲自操作。<\/p>","targetAudience":0,"courseSyllabus":"<p><b>课程大纲：以研究基因功能为目的导向<\/b><b><\/b><\/p><p><b>实验一<\/b><b>&nbsp; &nbsp;<\/b><b>模式动物与遗传学<\/b><b><\/b><\/p><p>包括线虫、果蝇、斑马鱼的雌雄识别（遗传杂交前必备的技能）并了解其生活史（设计实验的同时，倒推实验材料的准备、遗传杂交的操作以及观察后代的各个时间节点必备知识）。 <\/p><p><b>实验二<\/b><b>&nbsp; &nbsp;<\/b><b>染色体观察及果蝇平衡染色体<\/b><b><\/b><\/p><p>通过微观（观察不同物种染色体玻片标本）和宏观（观察携带显性标记基因的平衡染色体果蝇[Balancer]表型，包括第一、第二、第三平衡染色体果蝇）水平染色体观察，了解染色体是代与代之间遗传信息传递的载体。通过追踪染色体上的表型，准确无误地区分携带不同基因型的后代，进而定位和追踪基因。涉及最常用的平衡染色体工具果蝇，以及如何利用染色体倒位从而抑制重组的知识点和原理。<\/p><p>显微镜与体视解剖镜的使用。<\/p><p><b>实验三<\/b><b>&nbsp; &nbsp;<\/b><b>果蝇唾腺染色体制备及观察<\/b><b><\/b><\/p><p>提供详细的果蝇唾腺染色体制备演示视频，通过亲自解剖果蝇的唾腺组织，在载玻片上经过一系列的处理制备唾腺染色体，体验简便的唾腺染色体制备方法。实验材料可以选择黑腹果蝇<i>Drosophila<\/i><span> <i>melanogaster<\/i><\/span>，也可以选择大果蝇<i>Drosophila<\/i><span> <i>virilis<\/i><\/span>。视频讲解和PPT都提供根据端部横纹特征准确无误识别2个物种的每条染色体的清晰图谱。<\/p><p><b>实验四<\/b><b>&nbsp; &nbsp;<\/b><b>黑腹果蝇雌雄鉴别与突变体观察<\/b><b><\/b><\/p><p>介绍黑腹果蝇在生物学上的分类地位及作为模式动物在遗传学及生物学研究中的地位、介绍识别雌雄及各种突变体的要点和突变体的重要性，观察代表性突变体的同时区别雌雄。<\/p><p><b>实验五<\/b><b>&nbsp; &nbsp;<\/b><b>黑腹果蝇（<\/b><b><i>Drosophila<\/i><\/b><b><span> <i>melanogaster<\/i><\/span><\/b><b>）伴性与非伴性、连锁与非连锁的遗传分析（历时四周，涵盖三点测交实验）<\/b><b><\/b><\/p><p>只用一种基因型的母本和另外一种基因型的父本果蝇杂交，观察和计数分析子二代的果蝇表型和数量，就可以同时验证遗传学的几大定律：分离定律，自由组合，伴性遗传，连锁和交换。学生从挑选处女蝇与雄性果蝇杂交做起，首先获得子一代的雌雄个体，自交后再获得子二代的个体，前后历时4周。在此期间学生亲自保管自己的果蝇杂交瓶，观察果蝇从卵、幼虫、蛹到成虫的发育过程和各种行为，以日记的形式详细记录观察结果。我们将提供压缩视频，供大家详细观察果蝇从卵、幼虫、蛹到成虫的发育过程。<\/p><p><b>实验六<\/b><b>&nbsp; &nbsp;<\/b><b>玉米籽粒性状的遗传分析（基因互作验证）<\/b><b> <\/b><\/p><p>通过计数子一代或者子二代玉米果穗上不同表型性状的玉米籽粒数量，推测可能的亲本基因型，涉及多种基因互作的比例。本基因互作的验证实验，作为经典遗传实验规律验证的一个补充。从数据分析的角度，是通过后代表型性状的比例反推亲本的基因型，而上一个果蝇杂交实验亲本的基因型是已知的。<\/p><p><b>实验七<\/b><b>&nbsp; &nbsp;<\/b><b>利用<\/b><b><span>FLP\/<i>FRT<\/i> <\/span><\/b><b>重组系统获得纯合突变克隆，<\/b><b>Mosaic<\/b><b>杂交实验（历时两周）<\/b><b><\/b><\/p><p>介绍基因功能研究策略的背景知识，以被誉为果蝇遗传学家瑞士军刀的Gal4-UAS系统原理和灵活多样的使用为基础，说明如何通过遗传策略实现目的基因的敲除（敲低）或过表达。转基因果蝇的构建流程和如何利用平衡染色体定位转基因发生在哪条染色体上；果蝇复眼和翅（作为基本问题研究的窗口）的特点介绍等。具体实验：利用简单高效的<span>FLP\/<i>FRT<\/i> <\/span>重组系统，通过遗传杂交获得纯合突变克隆，实现体内对纯合突变基因（包括致死基因）功能的研究。 <\/p><p><b>实验八<\/b><b>&nbsp; &nbsp;<\/b><b>筛选特定表型或者信号通路相关基因实例<\/b><b><\/b><\/p><p>正向遗传学策略，以EMS诱变果蝇，筛选两类表型：1. 睡眠异常表型；2.根据翅的表型筛选与Notch、Hedgehog以及Wingless信号通路相关的基因。然后以平衡染色体为路标工具，确定突变的基因是什么。<\/p><p>反向遗传学策略，针对携带P因子插入的基因品系，通过遗传杂交，获得该基因的突变体。<\/p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p><p>进一步对突变体的功能进行研究：通过rescue实验确认基因突变与表型的特异性的对应关系；确定内源基因表达在哪里（原位杂交, 抗体染色等）；基因间的相互作用，上下游关系的确定；细胞（神经元）间的相互作用等（将陆续地上线）。<\/p>","courseFormat":"<p>一周授课时间约1.5小时，另外附长度不等的实验操作视频。<\/p><p>\n\n<\/p><p>习题和思考题涵盖所有考核内容。<\/p><p><br><\/p>","suggestedReadings":"<p><strong>遗传学实验指导 （张文霞）<\/strong><br><\/p><p><strong>Fly Pushing (by Ralph J. Greespan)<\/strong><strong><br><\/strong><\/p>","estimatedClassWorkload":"1-2 hours\/week","recommendedBackground":"按照要求预习相关的实验指导及阅读文献","links":{}}