{"id":162,"shortName":"nutritionforhealth","name":"Nutrition and Physical Activity for Health","language":"en","shortDescription":"This course will provide a coherent, understandable look at the evidence on how nutrition and physical activity impact health through lower morbidity, longevity, and quality of life.","aboutTheCourse":"Over 65 percent of adults and over 30 percent of children meet the classification\nof being overweight or obese, and with this excess weight comes numerous\nhealth conditions that include heart disease, diabetes, cancer, musculoskeletal\ndisorders, and even impairments in cognitive function. Because in most\ncases the core cause of obesity and its related health conditions is a\npoor quality of diet and lack of sufficient physical activity, it is no\nsurprise that to reverse this health problem a foundation of proper nutrition\nand sufficient physical activity is imperative.\n<br>\n<br>This course is designed to provide a foundation of nutritional knowledge\nto develop a sustainable pattern of healthy eating. To this will be added\na foundation of knowledge related to physical activity and exercise. These\ntwo key lifestyle behaviors are then brought together under the umbrella\nof calorie balance, which is the understanding of how we balance the calories\nthat we eat in our diet with the calories that we burn to sustain life\nand to perform all of our daily tasks and functions.\n<br>\n<br>Ultimately, this information can only be of value if individuals understand\nhow to engage in these healthy behaviors within their daily lives when\nthey are faced with challenges and barriers. This course will address key\nissues and will provide information on effective strategies for adopting\nand maintaining these targeted behaviors as they apply to the adoption\nand maintenance of a healthy lifestyle.\n<br>","targetAudience":1,"courseSyllabus":"There are no required textbooks for this course. Please see the list of\nrecommended readings and references below. There will also be links to\nonline documents and resources provided throughout the course.\n<br>\n<br>\n<b>Week 1:<\/b>\n\n<br>\n<ul>\n    <li>Module 1: Linking Nutrition and Physical Activity to Health Outcomes<\/li>\n    <li>Module 2: Assessing Nutrition, Physical Activity, and Body Composition<\/li>\n<\/ul>\n<b>Week 2: <\/b>\n\n<br>\n<ul>\n    <li>Module 3: Macronutrient Considerations: Carbohydrates<\/li>\n    <li>Module 4: Macronutrient Considerations: Proteins<\/li>\n<\/ul><b>Week 3: <\/b>\n\n<br>\n<ul>\n    <li>Module 5: Macronutrient Considerations: Fats<\/li>\n    <li>Module 6: Vitamins<\/li>\n<\/ul><b>Week 4: <\/b>\n\n<br>\n<ul>\n    <li>Module 7: Minerals<\/li>\n    <li>Module 8: Strategies for Improving Nutritional Habits<\/li>\n<\/ul><b>Week 5: <\/b>\n\n<br>\n<ul>\n    <li>Module 9: Physical Activity Consideration: Aerobic vs. Resistance vs.\n        Lifestyle<\/li>\n    <li>Module 10: Strategies for Improving Physical Activity<\/li>\n<\/ul><b>Week 6: <\/b>\n\n<br>\n<ul>\n    <li>Module 11: Calorie (Energy Balance): The Interaction of Nutrition and\n        Physical Activity<\/li>\n<\/ul><b>Final Examination<\/b>\n\n<br>","courseFormat":"This class will consist of lecture recordings of modules on specific topics.\nEach week will have a quiz focused on the content of that specific module\nto assist students with assessment of their learning. There will also be\nout of class activities and readings, plus a final exam.\n<br><br><br><strong>Pennsylvania Act 48 Credit<\/strong><br><br>Pennsylvania educators who successfully complete all components of the Nutrition and Physical Activity course and earn a Statement of Accomplishment are eligible for 60 hours of Act 48 credit from the University of Pittsburgh. During the last week of the course (Week 6), you will be required to complete a survey that includes information, which will be provided to the Professional Education Record Management System.<br><br>","suggestedReadings":"<ul>\n    <li>Donnelly JE, Jakicic JM, Blair SN, Rankin J, Manore M.  ACSM \"Position\n        Stand on Appropriate Intervention Strategies for Weight Loss and Prevention\n        of Weight Regain for Adults,\" <i>Medicine and Science in Sports and Exercise<\/i>.\n        2009; 41(2): 459-471.  PMID: 19127177.\n        <br>\n        <br>\n    <\/li>\n    <li>\"Position of the American Dietetic Association: Weight Management,\"  <i>Journal of the American Dietetic Association<\/i>. \n        2009; 109: 330-346.\n        <br>\n        <br>\n    <\/li>\n    <li><i>Physical Activity Guidelines for Americans<\/i>.  This can be accessed\n        online at: <a target=\"_blank\" href=\"http:\/\/www.health.gov\/paguidelines\/guidelines\/default.aspx\">http:\/\/www.health.gov\/paguidelines\/guidelines\/default.aspx<\/a>\n\n    <\/li>\n<\/ul>","instructor":"John M. Jakicic and Amy D. Rickman","estimatedClassWorkload":"3-5 hours\/week","recommendedBackground":"There are no prerequisites for this course. However, a general background\nin basic nutrition and physical activity may be helpful to the student\nprior to taking this course.\n<br>","links":{}}