{"id":1207,"shortName":"elearning","name":"e-Learning Ecologies","language":"en","shortDescription":"This course introduces innovative approaches to learning and teaching, with a focus on the use of e-learning and social web technologies.","aboutTheCourse":"<img src=\"https:\/\/d396qusza40orc.cloudfront.net\/elearning\/images\/elearning1.jpg\" style=\"float:right; margin:0 0 0 5px; width:270px;\" alt=\"\">\n<p>For more than 3 decades we have heard educators and technologists making a case for the <strong>transformative power of technology<\/strong> in learning. However, despite the rhetoric, in many sites and many ways <strong>education is still relatively untouched by technology<\/strong>. Even when technologies are introduced, the changes sometimes seem insignificant and the <strong>results seem disappointing<\/strong>. If the print textbook is replaced by an e-book, do the social relations of knowledge and learning necessarily change at all or for the better? If the pen-and-paper test is mechanized, does this change the nature of our assessment systems? Technology, in other words, need not necessarily bring significant change. <strong>Technology might not even represent a step forward in education<\/strong>.<\/p>\n\n<p>This course explores <strong>7 affordances of e-learning ecologies<\/strong>, which open up genuine possibilities for what we call New Learning—transformative, 21st century learning:<\/p>\n\n<ol>\n<li>Ubiquitous Learning<\/li>\n<li>Active Knowledge Making<\/li>\n<li>Multimodal Meaning<\/li>\n<li>Recursive Feedback<\/li>\n<li>Collaborative Intelligence<\/li>\n<li>Metacognition<\/li>\n<li>Differentiated Learning<\/li>\n<\/ol>\n\n<p>These affordances, if recognized and harnessed, will <strong>prepare learners<\/strong> for success in a world that is <strong>increasingly dominated by digital information flows<\/strong> and tools for communication in the workplace, public spaces, and personal life. This course offers a wide variety of examples of <strong>learning technologies<\/strong> and technology implementations that, to varying degrees, <strong>demonstrate these affordances in action<\/strong>.<\/p><br>","targetAudience":1,"courseSyllabus":"<p>This course is broken up into 8 weekly modules covering the following topics:<\/p>\n<p><img src=\"https:\/\/d396qusza40orc.cloudfront.net\/elearning\/images\/elearning2.jpg\" style=\"float:left; margin:0 8px 0 0; width:155px;\" alt=\"\"><\/p>\n<p><strong>Week 1: <\/strong>Conceptualizing Learning<\/p>\n<p><strong>Week 2: <\/strong>Spatio-Temporal Dimensions of Learning (<i>Ubiquitous Learning<\/i>)<\/p>\n<p><strong>Week 3: <\/strong>Epistemic Dimensions of Learning (<i>Active Knowledge Making<\/i>)<\/p>\n<p><strong>Week 4: <\/strong>Discursive Dimensions of Learning (<i>Multimodal Meaning<\/i>)<\/p>\n<p><strong>Week 5: <\/strong>Evaluative Dimensions of Learning (<i>Recursive Feedback<\/i>)<\/p>\n<p><strong>Week 6: <\/strong>Social Dimensions of Learning (<i>Collaborative Intelligence<\/i>)<\/p>\n<p><strong>Week 7: <\/strong>Cognitive Dimensions of Learning (<i>Metacognition<\/i>)<\/p>\n<p><strong>Week 8: <\/strong>Diversity Dimensions of Learning (<i>Differentiated Learning<\/i>)<\/p>","courseFormat":"<img src=\"https:\/\/d396qusza40orc.cloudfront.net\/elearning\/images\/elearning3.jpg\" style=\"float:right; margin:0 0 0 5px; width:270px;\" alt=\"\">\n<p>This course supports 3 levels of participation:<\/p>\n<ol>\n<li><strong>Overview (O): <\/strong>~1 hour per week spent watching videos and participating in the forums<\/li>\n<li><strong>Intermediate (I): <\/strong>~3 hours per week spent watching videos and participating in the forums<\/li>\n<li><strong>Advanced (A): <\/strong>~8–10 hours per week spent watching videos, participating in the forums, and creating a peer-reviewed Case Study<\/li>\n<\/ol>\n<p>Note: Only the Advanced (A) level will have the chance to qualify for a Verified Certificate.<\/p>","suggestedReadings":"<p>If you want to know more about our theory of \"New Learning,\" you may be interested in this book (though there is no need to purchase it for this course): <a href=\"http:\/\/www.amazon.com\/New-Learning-Elements-Science-Education\/dp\/1107644283\/ref=sr_1_1?ie=UTF8&amp;qid=1398701730&amp;sr=8-1&amp;keywords=kalantzis+new+learning&amp;tag=coursera-course1207-20\" target=\"_blank\">New Learning: Elements of a Science of Education<\/a>.<\/p>\n<p>For more information about the research we do, visit our <a href=\"http:\/\/newlearningonline.com\/\" target=\"_blank\">New Learning<\/a> website. During the course you will be encouraged to explore and share with others your findings about a wide range of e-learning technologies and the ecologies they engender. You may also wish to join in our own e-learning research and development endeavor by participating in this course on the <a href=\"http:\/\/info.cgscholar.com\/\" target=\"_blank\">Scholar platform<\/a>, developed with the support of funding from the Institute of Educational Sciences, the US Department of Education, and the Bill and Melinda Gates Foundation.<\/p>","estimatedClassWorkload":"1-10 hours\/week","recommendedBackground":"<p>This course is designed for people interested in the future of education and the \"learning society,\" including people who may wish to join education as a profession, practicing teachers interested in exploring future directions for a vocation that is currently undergoing transformation, and community and workplace leaders who regard their mission to be in part \"educative.\"<\/p>","links":{}}