{"id":157,"shortName":"sciwrite","name":"Writing in the Sciences","language":"en","shortDescription":"This course teaches scientists to become more effective writers, using practical examples and exercises. Topics include: principles of good writing, tricks for writing faster and with less anxiety, the format of a scientific manuscript, and issues in publication and peer review.","aboutTheCourse":"<div>This course trains scientists to become more effective, efficient, and confident writers. This is a hands-on course that emphasizes interactive examples and practice. In the first four weeks, we will review principles of effective writing, examples of good and bad writing, and tips for making the writing process easier. In the second four weeks, we will examine issues specific to scientific writing, including: authorship, peer review, the format of an original manuscript, and communicating science for lay audiences. Students will complete editing exercises, write two short papers, and edit each others’ work.&nbsp;<\/div><div><br><\/div><div>The primary audience is undergraduate science majors, graduate students in scientific disciplines, and professional scientists. Students from non-science disciplines can also benefit from the training provided in the first four weeks (on general principles of effective writing).<br><br><b>Subtitles for<\/b>&nbsp;<b>all video lectures available in<\/b>: English, Portuguese&nbsp;(provided by&nbsp;<a href=\"http:\/\/www.fundacaolemann.org.br\/\" target=\"_blank\">Lemann Foundation<\/a>).<br><\/div>","targetAudience":1,"courseSyllabus":"<b>Week 1 (September 24-30): Introduction; principles of effective writing (cutting unnecessary clutter)<br>Week 2 (October 1-7): Principles of effective writing (verbs)<br>Week 3 (October 8-14): Crafting better sentences and paragraphs<br>Week 4 (October 15-21): Organization; and streamlining the writing process<br>Week 5 (October 22-28): The format of an original manuscript<br>Week 6 (October 29-Nov. 4): Reviews, commentaries, and opinion pieces; and the publication process<br>Week 7 (November 5-11): Issues in scientific writing (plagiarism, authorship, ghostwriting, reproducible research) <br>Week 8 (November 12-18): How to do a peer review; and how to communicate with the lay public<\/b><br>","courseFormat":"<b>The class will consist of lecture videos that are broken into short chunks. Many videos include interactive practice exercises or integrated quiz questions. There will also be standalone writing and editing exercises that are not part of the videos. Workload: one to two hours of video content plus one homework assignment per week; homework will include: editing exercises; two short papers; and peer editing. <\/b><br>","suggestedReadings":"There is no textbook for this course. Students who would like additional reading may enjoy: <i>On Writing Well<\/i>, William Zinsser;&nbsp;<i>The Elements of Style<\/i>, Strunk and White;<i> Sin and Syntax<\/i>, Constance Hale; Essentials of Writing Biomedical Research Papers, Mimi Zeiger;&nbsp;<a href=\"http:\/\/www.aacc.org\/publications\/clin_chem\/ccgsw\/Pages\/default.aspx\">http:\/\/www.aacc.org\/publications\/clin_chem\/ccgsw\/Pages\/default.aspx#<\/a>","instructor":"Kristin Sainani","estimatedClassWorkload":"4-8 hours\/week","recommendedBackground":"The course has no prerequisites other than fluency in English.","links":{}}