{"id":1414,"shortName":"contrats","name":"Rédaction de contrats","language":"fr","shortDescription":"Le cours porte sur les usages généralement admis en matière de rédaction de contrats commerciaux, dans leur forme continentale ou anglo-saxonne. Les principales clauses de ces contrats sont examinées, à l’aide d’exemples tirés de contrats classiques. ","aboutTheCourse":"<p>Selon\nl’expression du code civil français, le contrat vaut loi entre les parties.<\/p><p>C’est en effet le\ncharme du droit privé que de permettre aux parties de créer les principes qui\ns’appliqueront à leur relation contractuelle, d’élaborer la règle avant de s’y\nsoumettre, de ne pas subir le système juridique, mais de le maitriser par ce\npuissant instrument qu’est la liberté contractuelle. Encore faut-il en\nconnaitre le bon usage. Comme toute liberté, la liberté contractuelle contient\nses chausse-trapes, ses dangers, et ses effets indésirables.<\/p>\n\n<p>&nbsp;Le cours sensibilisera\nles étudiants au bon usage de la liberté contractuelle, en examinant étape par\nétape les clauses habituellement utilisée dans les contrats internationaux, de\nfaçon à en analyser l’utilité, les dangers, et les conséquences. Le droit\nsuisse sera parfois cité à titre d’exemple de droit civil, mais le cours se\nréférera essentiellement aux principes généraux du droit privé, qui sont des\nprincipes relativement universels. Il permet donc d’acquérir assez rapidement de\nbons réflexes face à une clause suspecte, ou à un contrat incomplet, quel que\nsoit le droit applicable à ce contrat.&nbsp;<\/p>","targetAudience":1,"courseSyllabus":"<p><b>1ère semaine&nbsp;: première approche du\ncontrat, documents précontractuels<\/b><\/p>\n\n<p>&nbsp;Ce cours introductif\nporte sur la façon d’aborder un contrat, les domaines dans lesquels les ordres\njuridiques prévoient en règles générale des dispositions impératives, et les\ndocuments qui précèdent la conclusion du contrat.<\/p>\n\n<p><b><span>2ème semaine Complexes de contrats,\ndésignation des parties, préambule&nbsp; <\/span><\/b><\/p>\n\n<p>&nbsp;Ce cours porte sur les\nrelations entre des contrats distincts, en particulier les contrats en chaîne\n(contrat principal et contrats de sous-traitance). Les nécessités de\ncoordination des contrats, et les clauses de jonction entre les différents\ncontrats, y seront examinées. Le cours continue avec ce qui constitue les\npremiers éléments d’un contrat, à savoir la désignation des parties, et le\npréambule du contrat. Ces parties très standardisées du contrat peuvent parfois\nposer des difficultés imprévues, qui seront analysées en cours.<\/p>\n\n<p><b>3ème semaine Accord de base et garanties<\/b><\/p>\n\n<p>&nbsp;L’essentiel du contrat\nest l’accord des parties sur les prestations réciproques qui devront être\néchangées. Les juristes ont peu de prises sur cet accord, qui relève avant tout\nde la volonté des parties. Selon le type de contrat, certaines précisions\npeuvent utilement être apportées par les parties sur les modalités d’exécution\ndes prestations prévues. Ces prestations peuvent également faire l’objet de\ngaranties diverses, qui seront examinées pendant ce cours.&nbsp;<\/p>\n\n<p>&nbsp;<b>4ème semaine&nbsp;: clauses relatives à\nla responsabilité<\/b><\/p>\n\n<p>&nbsp;Le système juridique\nprévoit un régime de la responsabilité, qui peut être modulé par le contrat.\nLes parties peuvent ainsi limiter leur responsabilité, en modifier les\nconséquences, l’exclure en cas de force majeure, prévoir une clause\nd’adaptation en cas de hardship, ou encore utiliser diverses clauses pénales.\nLe cours porte sur ces différentes clauses et leur formulation standard.<\/p>\n\n<p>&nbsp;<b>5ème semaine&nbsp;: propriété et durée\ndu contrat<\/b><\/p>\n\n<p>&nbsp;L’exécution du contrat\npeut donner lieu à des transferts d’actifs dont les parties veulent transférer\nou pas la propriété. Diverse clauses standard permettent de clarifier la\nvolonté des parties à ce propos. Le cours portera notamment sur les clauses de réserve\nde propriété permettent de conditionner le transfert de la propriété à\nl’exécution de la contreprestation.&nbsp; Les\nordres juridiques appréhendent cependant de façon très diverses la validité et\nles effets de cers clauses. Dans un deuxième temps, le cours portera sur la\ngestion de la durée du contrat, avec les clauses de résiliation ordinaire ou\nextraordinaire, et les clauses de liquidation du régime contractuel qui doivent\nêtre prévues dans les contrats de durée.<\/p>\n\n<p>&nbsp;<b>6ème semaine: Clauses standards et résolution\ndes litiges<\/b><\/p>\n\n<p>&nbsp;Le dernier cours\nreviendra sur quelques clauses standard (Boiler plate clause) que l’on trouve\ndans tous les contrats sans que les parties ne soient toujours conscientes de\nleur utilité et de leurs effets. Le cours se conclura avec les clauses de\nrésolution des litiges, en particulier les élections de droit et de for, et les\nclauses de règlement alternatif des litiges, qui se trouvent en règle générale\nà la fin du texte du contrat.&nbsp;<\/p>","courseFormat":"<p>Le cours est donné en\nfrançais mais les exemples de clauses sont souvent en anglais. Les clauses ou\nles textes cités se trouvent également dans un document à la disposition des\nétudiants. &nbsp;<\/p>\n\n<p>&nbsp;Le cours est\nstructurés en 6 leçons, comprenant chacune un certain nombre de brèves\nprésentations vidéo (8 à 15 minutes).<\/p>\n\n<p>&nbsp;Chaque semaine de\ncours est validée par un questionnaire (QCM) en ligne. L’étudiant dispose de\ndeux tentatives, seul le résultat de la dernière tentative étant retenu. Un\ntaux de réponses correctes de 60% minimum (moyenne des six tests) est requis\npour la validation.&nbsp;<\/p>","suggestedReadings":"<p><strong>Ouvrages de référence<\/strong><\/p>\n\n<p>&nbsp;Le cours a été\nconstruit sur la base de l’ouvrage suivant&nbsp;:<\/p>\n\n<p><ul><li>&nbsp;Marchand,&nbsp;\nSylvain, Clauses contractuelles - Du bon usage de la liberté\ncontractuelle, Helbing &amp; Lichtenhahn 2008<br><\/li><\/ul><\/p>\n\n<p>&nbsp;Un complément utile du\ncours est le recueil de contrats commerciaux en français et en anglais,\nproposés par des spécialistes du domaine, dans un ouvrage collectif dirigé par\nles prof. Chappuis et Marchand et par Me Laurent Hirsch&nbsp;:<\/p>\n\n<p><ul><li>&nbsp;Marchand,&nbsp;\nChappuis, Hirsch,&nbsp;\néd. , Recueil de contrats commerciaux, Modèles en français et en anglais\ncommentés selon le droit suisse, Helbing Lichtenhahn 2013<br><\/li><\/ul><\/p>\n\n<p>&nbsp;De nombreux autres\nouvrages traitent également de la rédaction des contrats internationaux&nbsp; en particulier les ouvrages suivants&nbsp;:<\/p>\n\n<p><ul><li>Daigneault Edward W.&nbsp; Drafting international agreements in legal\nEnglish, Manzsche Verlags-und Universitätsbuchhandlung, Wien 2005<\/li><li>Fontaine, Marcel, de Ly, Filip Droit des contrats internationaux, analyse et\nrédaction de clauses, 2ème éd. Bruylant, 2003 &nbsp; &nbsp; &nbsp;<\/li><li>Fontaine, Marcel, de Ly, Filip, Drafting international contracts, analyse of\nContract clauses, Transnational publisher Inc, 2006, &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<\/li><li>Lesguillons, Henry, [et al.] La rédaction des\ncontrats internationaux = Drafting of international contracts, Revue de droit\ndes affaires internationale, 2002, no 3\/4 p. 251-473<\/li><li>Sandrock Otto Berger\nKlaus Peter (hrsg)., <a href=\"http:\/\/opac.rero.ch:80\/gateway?host=sarasvati.rero.ch%2b8891%2bDEFAULT&amp;patronhost=sarasvati.rero.ch%208891%20DEFAULT&amp;search=SCAN&amp;function=INITREQ&amp;SourceScreen=CARDSCR&amp;sessionid=2007081021420425140&amp;skin=rero&amp;lng=fr-ch&amp;inst=consortium&amp;conf=.%2fchameleon.conf&amp;elementcount=1&amp;t1=Handbuch%20der%20Internationalen%20Vertragsgestaltung%20%2f%20%20hrsg.%20von%20Otto%20Sandrock%20und%20Klaus%20Peter%20Berger&amp;u1=4&amp;pos=1&amp;rootsearch=KEYWORD&amp;beginsrch=1\" title=\"Link: http:\/\/opac.rero.ch:80\/gateway?host=sarasvati.rero.ch%2b8891%2bDEFAULT&amp;patronhost=sarasvati.rero.ch%208891%20DEFAULT&amp;search=SCAN&amp;function=INITREQ&amp;SourceScreen=CARDSCR&amp;sessionid=2007081021420425140&amp;skin=rero&amp;lng=fr-ch&amp;inst=consortium&amp;conf=.%2fchameleon.conf&amp;elementcount=1&amp;t1=Handbuch%20der%20Internationalen%20Vertragsgestaltung%20%2f%20%20hrsg.%20von%20Otto%20Sandrock%20und%20Klaus%20Peter%20Berger&amp;u1=4&amp;pos=1&amp;rootsearch=KEYWORD&amp;beginsrch=1\">Handbuch der Internationalen Vertragsgestaltung, <\/a>2ème éd. Frankfurt,\nVerl. Recht und Wirtschaft, 2005<\/li><li>Schumacher<a href=\"http:\/\/opac.rero.ch:80\/gateway?host=sarasvati.rero.ch%2b8891%2bDEFAULT&amp;patronhost=sarasvati.rero.ch%208891%20DEFAULT&amp;search=SCAN&amp;function=INITREQ&amp;SourceScreen=CARDSCR&amp;sessionid=2007081021420425140&amp;skin=rero&amp;lng=fr-ch&amp;inst=consortium&amp;conf=.%2fchameleon.conf&amp;elementcount=1&amp;t1=Schumacher,%20Rainer&amp;u1=1003&amp;pos=1&amp;rootsearch=KEYWORD&amp;beginsrch=1\">, Rainer<\/a>, Vertragsgestaltung :\nSystemtechnik für die Praxis, Zürich, Basel, Genf, Schulthess, 2004<br><\/li><\/ul><\/p>","estimatedClassWorkload":"3-4 hours\/week","recommendedBackground":"<p><span>Une\nformation de base en droit (droit des contrats) est souhaitable.&nbsp;<\/span><\/p>","links":{}}