{
    "id": 235,
    "shortName": "lifenutr",
    "name": "Nutrition, Health, and Lifestyle: Issues and Insights",
    "language": "en",
    "shortDescription": "This seven week course will explore nutrition concepts that take center stage in mainstream media outlets and become conversation topics among consumers interested in food choice as it relates to optimal health and physical performance.",
    "aboutTheCourse": "Separate fact from fiction and fads as you learn about core\nnutrition concepts and how to evaluate not only personal food choices and\noverall dietary patterns, but nutrition related content in the media and in\nadvertising. Such topics include\nfundamentals of a healthful eating pattern, nutrition labeling, dietary\nsupplements, fortified and “super” foods, plant-based nutrition, and nutrition and\nfitness. The course will also include an overview of nutrition fundamentals as\nthey relate to human health.\n\n<p>During this course you will have the opportunity to:<\/p><ul><li>Analyze and evaluate your own food and beverage\nintake using a recommended online or cell phone app nutrient database.<\/li><li>Research of a dietary supplement of your\nchoosing using credible informational websites as well as evidence-based\nmedical literature.<\/li><li>Personally examine the concept of energy balance\nthrough determination of your calorie needs, intake and expenditure.<\/li><\/ul>",
    "targetAudience": 0,
    "courseSyllabus": "<p>Week One: Just What is a Healthy Diet? A Balancing Act<\/p>\n\n<p>Week Two: Nutrition Labeling: Facts, Claims, and Challenges<\/p>\n\n<p>Week Three: Dietary Supplements: Evaluating the Evidence<\/p>\n\n<p>Week Four: Functional and “Super” Foods: Their Role in Optimal Nutrition<\/p>\n\n<p>Week Five: Plant-based Nutrition: Controversies and Considerations<\/p>\n\n<p>Week Six: Nutrition and Fitness: Facts, Food, and Fuel<\/p><p>Week Seven:  Food Allergies and Intolerances:  Separating Fact from Fiction<br><\/p><p><br><\/p>\n\n<p> <\/p>",
    "estimatedClassWorkload": "2-4 hours\/week",
    "recommendedBackground": "This is an introductory level nutrition course.  No background required, all are welcome!<i><br><\/i>",
    "links": {

    }
}