{"id":427,"shortName":"globalhighered","name":"Globalizing Higher Education and Research for the ‘Knowledge Economy’","language":"en","shortDescription":"This course is designed to examine an array of issues related to the globalization of higher education and research. The main objective of the course is to enable students to better understand how and why universities are engaged in the globalization process, as well as what the key implications of this development process are.\n","aboutTheCourse":"<p>Universities and higher education systems worldwide are being transformed by new and changing actors, practices, programs, policies, and agendas. From notions of 'global competency' and 'international branch campuses,' to ever more common perceptions that international collaborative research is a desirable objective, through to the phenomena of bibliometrics, rankings and benchmarking that are framed and operate at a global scale, contexts are changing. This massive open online course (MOOC) itself, developed in Madison and Bristol and hosted on the Coursera platform in Silicon Valley, is a perfect case in point!<\/p><p><em>Globalizing Higher Education and Research for the ‘Knowledge Economy’ <\/em>is designed to help students better understand some of these complex changes. Our specific objectives are to:<\/p><p><ul><li>Provide an integrated 'big picture' regarding the globalization of higher education and research. &nbsp;<\/li><li>Reinforce the value of thinking about processes of change by focusing on <em>emergences<\/em> -- the forward edges of change -- as well as the frictions associated with these processes. We attempt to make this tangible by highlighting the role of relevant logics, thinkers, institutions, networks, technologies, ideas, temporalities, and regulations.<\/li><li>Highlight the role of relative and variable forms of power in shaping agendas and practices, as well as uneven development patterns and outcomes.<\/li><\/ul><\/p><p>In the end, we hope to stimulate some exciting globally oriented learning about how the higher education sector - from research to teaching, learning, and service (the 'third mission') - are changing.&nbsp;<\/p>","targetAudience":2,"courseSyllabus":"<div><strong>Week 1:<\/strong> Universities (Starting Monday 24 March)<\/div><div>Keywords: collaboration, competition, global competency, globalization, internationalization, learning, logics, mechanisms, mission, mobility, models, technology<\/div><div><br><\/div><div><strong>Week 2:<\/strong> City-regions (Starting Monday 31 March)<\/div><div>Keywords: academic freedom, branch campuses, cities, city-regions, competition, hubs, gateway cities, global cities, innovation systems, liberal arts colleges, mobility, R&amp;D, networks, urbanization.<\/div><div><br><\/div><div><strong>Week 3:<\/strong> Nations (Starting Monday 7 April)<\/div><div>Keywords: competition, denationalization, exports, mobility, nation-state, revenue, services, students<\/div><div><br><\/div><div><strong>Week 4:<\/strong> Regions (Starting Monday 14 April)<\/div><div>Keywords: collaboration, competition, geopolitics, higher education areas, interregionalism, regionalism<\/div><div><br><\/div><div><strong>Week 5: <\/strong>Globals (Starting Monday 21 April)<\/div><div>Keywords: assessment, benchmarking, competition, desectoralization, framing, governance, hegemony, knowledge, intergovernmental organizations, publishing, R&amp;D, rankings, thinkers<\/div><div><br><\/div><div><strong>Week 6:<\/strong> World Class (Starting Monday 28 April)<\/div><div>Keywords: assessment, benchmarking, bibliometrics, competition, desectoralization, governance, metrics, models, world class universities, world university rankings<\/div><div><br><\/div><div><strong>Week 7:<\/strong> Singapore (Starting Monday 5 May)<\/div><div>Keywords: academic freedom, branch campuses, city-state, competition, developmental state, global cities, hubs, innovation systems, nation-states, networks, R&amp;D, rankings, regionalism, services<\/div><div><br><\/div>","courseFormat":"The design of this course is different from most Coursera-based courses in that it does not rely on video lectures and associated quizzes. Rather, the content will be rolled out weekly via a 4000-7000 word long text with integrated multimedia elements (audio interviews with experts, visualizations, photographs, select videos, and hyperlinks to documents, reports, articles, etc.). <br><br>All seven weeks of the course are associated with dedicated discussion forum space where you can participate in (a) independent discussions on the topics of your choice, and (b) instructor-generated discussions on 2-3 designated topics. The course also is intended to function as a free and open-access resource. Therefore, all submitted material during weekly discussion exercises will be automatically associated with a <a href=\"http:\/\/creativecommons.org\/licenses\/by\/4.0\/\" target=\"_blank\" title=\"Link: http:\/\/creativecommons.org\/licenses\/by\/4.0\/\">Creative Commons Attribution 4.0 license<\/a>.","suggestedReadings":"<p>No required reading apart from what is provided in\nthe course. We do recommend, though, that you track and follow materials posted on\nfully open access sites such as <a href=\"http:\/\/www.insidehighered.com\/\"><i>Inside Higher Ed<\/i><\/a> and <a href=\"http:\/\/www.universityworldnews.com\/\"><i>University\nWorld News<\/i><\/a>, as well as material shared via the <a href=\"https:\/\/twitter.com\/GlobalHigherEd\">GlobalHigherEd Twitter feed<\/a>.<\/p>","instructor":"Kris Olds and Susan L. Robertson","estimatedClassWorkload":"3-5 hours\/week","recommendedBackground":"No formal background knowledge is required; all are welcome. The key thing is to be interested in the contemporary transformation of higher education and research.","links":{}}