{
    "id": 1417,
    "shortName": "meatweeat",
    "name": "The Meat We Eat",
    "language": "en",
    "shortDescription": "The Meat We Eat is a course designed to create a more informed consumer about the quality, safety, healthfulness and sustainability of muscle foods and address current issues in animal agriculture in developed and developing countries.",
    "aboutTheCourse": "<p>The average American is now at least three generations\nremoved from production agriculture.&nbsp;\nThis leads to the disconnection between how the public views agriculture\nand how scientists and producers view it, resulting in consumer distrust of\nscience and commercial food production.&nbsp;\nIt is this lack of trust which leads to consumer confusion and the urge\nto grasp at multiple solutions.&nbsp; However\na growing number of consumers in developed countries are aspiring to “know\nwhere their food comes from”.&nbsp; Animal agriculture\nneeds to explain the technology which will be used to sustainably feed 9\nbillion people by 2050. <\/p>\n\nLectures will cover all aspects of muscle foods production,\nprocessing, preparation, cooking and storage.&nbsp;\nAdditionally, the role of muscle foods in a balanced diet will be\naddressed as will issues which contribute to consumers limiting or eliminating\nmeat from their diets.",
    "targetAudience": 0,
    "courseSyllabus": "<p>Week 1: U.S. history, production systems, and comparison\nwith international systems<\/p><p>Week 2: Humane slaughter and muscle composition<\/p><p>Week 3: U.S. inspection and food safety <\/p><p>Week 4: U.S. grading, fabrication, bulk purchasing, and\npackaging<\/p><p>Week 5: Palatability, cooking &amp; processing<\/p><p>Week 6: The healthfulness of meat in the diet, growth\npromoting technologies &amp; sustainability<\/p><p>Week 7: Final Week - work on peer evaluations<\/p>",
    "estimatedClassWorkload": "5-7 hours\/week",
    "recommendedBackground": "There are no prerequisites for this course; all are welcome to enroll!",
    "links": {

    }
}