{
    "id": 2478,
    "shortName": "sh",
    "name": "Scientific Humanities",
    "language": "en",
    "shortDescription": "« Scientific humanities » means the extension of interpretative skills to the discoveries \nmade by science and to technical innovations. The course will equip future citizens with the means to be at ease with many issues that straddle the distinctions between science, morality, politics and \nsociety.",
    "aboutTheCourse": "<div>« Scientific humanities » means the extension of interpretative skills to the discoveries made by science and to technical innovations. The course will equip future citizens with the means to be at ease with many issues that straddle the distinctions between science, morality, politics and society.<\/div><div><br><\/div><div>The course provides concepts and methods to :<\/div><div><ul><li>learn the basics of the field called “science and technology studies”, a vast corpus of literature developed over the last forty years to give a realistic description of knowledge production.<br><\/li><li>handle the flood of different opinions about contentious issues and order the various positions by using the tools now available through digital media<br><\/li><li>comment on those different pieces of news in a more articulated way through a blog.<br><\/li><\/ul><\/div><p><\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<div>Week 1: How to patrol the borderline between science and politics?<\/div><div>Week 2: How to find one’s way in the scientific literature?<\/div><div>Week 3: How to handle technical innovations?<\/div><div>Week 4: How to deal with controversies?<\/div><div>Week 5: How to understand the shifting nature of the natural world?<\/div><div>Week 6: How to become a citizen in the public life of science and technology?<\/div>",
    "estimatedClassWorkload": "2-3 hours\/week",
    "recommendedBackground": "<div>The course is designed for undergraduates but since the topic of scientific humanities is not widely known, it will be of interest for graduates and for the general public as well. It does not require a degree in science and technology.<\/div>",
    "links": {

    }
}