{
    "id": 31,
    "shortName": "networks",
    "name": "Networked Life",
    "language": "en",
    "shortDescription": "Networked Life will explore recent scientific efforts to explain social, economic and technological structures -- and the way these structures interact -- on many different scales, from the behavior of individuals or small groups to that of complex networks such as the Internet and the global economy.",
    "aboutTheCourse": "<ul>\n<li>What science underlies companies like Facebook, Twitter and Google?<\/li>\n<li>How does your position in a social network (dis)advantage you?<\/li>\n<li>What do game theory and the Paris subway have to do with Internet routing?<\/li>\n<li>How might a social network influence election outcomes?<\/li>\n<li>What are the economics of email spam?<\/li>\n<li>How does Google find what you're looking for... and exactly how do they make money doing so?<\/li>\n<\/ul>\n<p>Networked Life looks at how our world is connected -- socially, strategically and technologically -- and why it matters.<\/p>\n<p>The answers to the questions above are related. They have been the subject of a fascinating intersection of disciplines, including computer science, physics, psychology, sociology, mathematics, economics and finance. Researchers from these areas all strive to quantify and explain the growing complexity and connectivity of the world around us, and they have begun to develop a rich new science along the way.<\/p>\n<p>Networked Life will explore recent scientific efforts to explain social, economic and technological structures -- and the way these structures interact -- on many different scales, from the behavior of individuals or small groups to that of complex networks such as the Internet and the global economy.<\/p>\n<p>This course covers computer science topics and other material that is mathematical, but all material will be presented in a way that is accessible to an educated audience with or without a strong technical background. The majority of the course is grounded in scientific and mathematical findings of the past two decades or less (often much less).<\/p>\n<p>Networked Life is the flagship course of the new <a href=\"http:\/\/www.nets.upenn.edu\/\" target=\"_blank\">Networked and Social Systems Engineering<\/a> program at the University of Pennsylvania.<\/p>",
    "targetAudience": 0,
    "courseSyllabus": "",
    "estimatedClassWorkload": "1-3 hours\/week",
    "recommendedBackground": "",
    "links": {

    }
}