{
    "id": 2656,
    "shortName": "venture",
    "name": "Launching New Ventures \/ Lancer une Startup",
    "language": "en",
    "shortDescription": "Develop your promising idea into a successful business concept proposal, and launch it! Gain practical experience in the key steps of the venture creation process, including marketing and fundraising. Sharpen your entrepreneurial mindset!\n____\n\nTransformez votre idée prometteuse en un projet concret d’entreprise et lancez la pour de vrai. Apprenez les principales étapes du processus de création d’entreprise, y compris marketing et levée de fonds. Affûtez votre esprit d’entrepreneur. ",
    "aboutTheCourse": "Launching New Ventures is a course on Entrepreneurship &amp; Strategy for Technology-Driven Startups designed for professionals, entrepreneurs, and students who are interested in learning more about how to successfully launch their venture idea. Through short, animated lectures, inspiring interviews with entrepreneurs from Africa and around the world, short quizzes, and a practical final project, students will gain a broad overview of entrepreneurship strategy with insights they can apply to their venture regardless of location, industry or venture stage. <br><br>Students will be required to complete quizzes, and develop and submit venture ideas as part of the course’s assessment.&nbsp;<strong> Eligible top performing students will earn a chance to receive seed-funding for their venture concept. <\/strong>Course material has been developed from practical experience and proven insights gained from cutting-edge entrepreneurship research.<br><ul><li>Learn how to develop your ideas into a venture concept<\/li><li>Learn how to craft an opportunity exploitation road-map <\/li><li>Use social media to test market receptiveness to your venture idea and raise money<\/li><li>Learn how to calculate how much money you need, where to find it and how to manage it<\/li><li>Learn how to grow your venture (intelligently!)<\/li><li>Experience the early stages of the entrepreneurial process <\/li><li>Sharpen your entrepreneurial mindset and learn how it can benefit your organization<\/li><\/ul><br>In addition to the lectures, quizzes, and forum on Coursera, we encourage you to join the conversation on our course Twitter and Facebook pages. &nbsp;You'll find relevant, interesting links to additional resources, and these are great channels for engaging with other students, the professors, and the Venture MOOC Team.&nbsp;<br><br>Twitter:&nbsp;@<a href=\"https:\/\/mobile.twitter.com\/compose\/tweet?status=@ventureMOOC\" target=\"_blank\">ventureMOOC<\/a><br>Facebook Page:&nbsp;<a href=\"https:\/\/www.facebook.com\/groups\/1409588802674945\/\" target=\"_blank\">L<\/a><a href=\"https:\/\/www.facebook.com\/groups\/1409588802674945\/\" target=\"_blank\">aunching New Ventures: EPFL MOOC<\/a><br><br>____<br><br><p>Lancer une Startup est un\ncours sur l'entrepreneuriat et la stratégie pour des start-ups orientées\ntechnologie. Il s’adresse aux professionnels, entrepreneurs et étudiants\nsouhaitant en apprendre davantage sur la manière de lancer avec succès leur\nidée d’entreprise. Grâce à des cours précis et dynamiques, à des interviews\nd’entrepreneurs aussi bien d’Afrique que du reste du monde, à des quizz et\nenfin grâce à un cas pratique à la fin du cours, les élèves auront une vue\nd’ensemble sur la stratégie à adopter en entrepreneuriat. Ils pourront\nappliquer les connaissances acquises à leur entreprise en adaptant en fonction\nde leur localisation, de leur industrie et de l’état d’avancement du projet.<\/p>\n\n<p>En ce qui concerne les livrables et\nl’évaluation du cours, les élèves seront tenus de faire les quizz ainsi que de\nrendre une analyse de leur idée d’entreprise. Les meilleurs étudiants auront la\npossibilité de recevoir un premier financement pour leur projet. Les éléments\ndu cours ont été établis à partir de cas concrets et de concepts qui ont fait\nleurs preuves&nbsp;; ils ont été établis à partir des plus récentes recherches\nsur l’entrepreneuriat. <\/p>\n\n<p><\/p><ul><li>Apprendre à\ntransformer vos idées en un concept d'entreprise<br><\/li><li>Apprendre à\nélaborer une feuille de route pour exploiter des opportunités<br><\/li><li>Utiliser les médias\nsociaux pour tester la réceptivité du marché à votre idée et&nbsp; pour lever des fonds<br><\/li><li>Evaluer le montant\nnécessaire pour votre projet, apprendre où le trouver et comment le gérer<br><\/li><li>Apprendre à\ndévelopper votre entreprise (intelligemment !)<br><\/li><li>Vivre les premières\nétapes du processus entrepreneurial<br><\/li><li>Aiguiser votre esprit\nentrepreneurial et voir dans quelles mesures il peut être bénéfique à votre\norganisation<br><\/li><\/ul>En plus des cours, quizz et discussions sur le forum, nous vous encourageons à\nparticiper activement aux discussions sur nos comptes Twitter et Facebook. Vous\ny trouverez des liens intéressants qui viennent en complément du cours. Ce sont\négalement de bons moyens pour échanger avec les autres élèves, les professeurs\net l'équipe du MOOC.<br><br>Twitter (en anglais et français):&nbsp;@<a href=\"https:\/\/mobile.twitter.com\/compose\/tweet?status=@ventureMOOC\" target=\"_blank\">ventureMOOC<\/a><br>Facebook Page:&nbsp;<a href=\"https:\/\/www.facebook.com\/groups\/1409588802674945\/\" target=\"_blank\">L<\/a><a href=\"https:\/\/www.facebook.com\/groups\/1409588802674945\/\" target=\"_blank\">aunching New Ventures: EPFL MOOC<\/a><i><br><\/i><p><\/p><p>\n\n\n\n\n\n\n\n\n\n\n\n<\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<strong>Week 1: What is entrepreneurship? &nbsp;&nbsp;&nbsp; <\/strong><br><ul><li>Learn how entrepreneurial strategy differs from strategy in large firms<\/li><li>Find out what defines an entrepreneur<\/li><li>Learn how the ‘entrepreneurial mindset’ can benefit your organization<\/li><\/ul><strong>Week 2: Identifying &amp; Evaluating Business Opportunities <br><\/strong><ul><li>Understand how technological characteristics can meet customer needs<\/li><li>Learn how to choose between multiple venture opportunities&nbsp;&nbsp;&nbsp; &nbsp;<\/li><li>Craft an opportunity exploitation road-map <\/li><\/ul><strong>Week 3: Entrepreneurial Marketing&nbsp;&nbsp; <\/strong><br><ul><li>Develop a compelling value proposition<\/li><li>Understand your customers and competition<\/li><li>Learn how to launch a successful crowdfunding campaign<\/li><li>Find out what crossing the chasm means<\/li><\/ul><strong>Week 4: Raising and Managing Money<\/strong><br><ul><li>Calculate how much money you need and where to find it<\/li><li>Find out when to seek seed funding or expansion funding<\/li><li>Understand cash management best practices <\/li><\/ul><strong>Week 5: Value Capture – Profiting From your Innovation<\/strong><br><ul><li>Learn to protect your intellectual property<\/li><li>Identify complementary assets and how to capture value<\/li><li>Grow and scale your venture<\/li><\/ul>____<br><br><p><b>Semaine 1: Qu’est-ce que l’entrepreneuriat&nbsp;?<\/b><\/p>\n\n<p><\/p><ul><li>Apprendre les différences entre la stratégie\nentrepreneuriale et la stratégie des grandes entreprises<br><\/li><li>Découvrir ce qui définit un entrepreneur<br><\/li><li>Apprendre comment l’esprit entrepreneurial peut\nêtre bénéfique à votre organisation<\/li><\/ul><p><\/p>\n\n<p><b>Semaine 2: Identifier et évaluer les opportunités d'affaires<\/b><\/p>\n\n<p><\/p><ul><li>Comprendre comment les caractéristiques\ntechnologiques peuvent répondre aux besoins des clients<br><\/li><li>Apprendre à choisir entre plusieurs opportunités\nd’entreprise<br><\/li><li>Apprendre à élaborer une feuille de route pour exploiter\ndes opportunités<\/li><\/ul><p><\/p>\n\n<p><b>Semaine 3: Le marketing entrepreneurial<\/b><\/p>\n\n<p><\/p><ul><li>Elaborer une proposition valable<br><\/li><li>Comprendre vos clients et vos concurrents<br><\/li><li>Apprendre à lancer une campagne de financement\nparticipatif efficace<br><\/li><li>Comprendre ce que signifie&nbsp;«&nbsp;traverser\nle gouffre&nbsp;»&nbsp;<\/li><\/ul><p><\/p>\n\n<p><b>Semaine 4: Lever des fonds et les gérer<\/b><\/p>\n\n<p><\/p><ul><li>Evaluer le montant nécessaire pour votre projet et\napprendre où le trouver<br><\/li><li>Savoir quand chercher un premier financement ainsi\nque les fonds d’expansion<br><\/li><li>Comprendre comment gérer son argent au mieux<\/li><\/ul><p><\/p>\n\n<p><b>Semaine 5: Rentabilité - Tirer profit de votre innovation<\/b><\/p>\n\n<p><\/p><ul><li>Apprendre à protéger sa propriété intellectuelle<br><\/li><li>Identifiez les actifs complémentaires et comment\nen tirer profit<br><\/li><li>Accroitre et faire évoluer votre entreprise<\/li><\/ul><p><\/p><div><div><div>\n\n<\/div>\n\n<\/div>\n\n<\/div>",
    "estimatedClassWorkload": "3-4 hours\/week",
    "recommendedBackground": "There\n are no prerequisites for this course, except for:<br><ul><li>Curiosity<\/li><li>Persistence<\/li><li>Interest in sharpening your entrepreneurial \nmindset<\/li><\/ul>The course is mostly in English, with some interviews in \nFrench. Subtitles will be available in English and French. If you are \ninterested in translating this course into your local language, please \ncontact us at <a href=\"http:\/\/mailto:venturemooc@epfl.ch?Subject=I'd%20like%20to%20be%20a%20Transcription%20Partner%20for%20Venture%20MOOC!&quot; target=&quot;_top&quot;\" target=\"_blank\">venturemooc@epfl.ch<\/a>. Your support is greatly appreciated \nand will be explicitly acknowledged on the course website!<br>____<br><p>Il n’y a pas de prérequis obligatoire pour ce cours, sauf&nbsp;:<\/p>\n\n<p><\/p><ul><li>Curiosité<br><\/li><li>Détermination<br><\/li><li>Envie d’affûter votre esprit entrepreneurial<\/li><\/ul><p><\/p>\n\n<p>Le cours est principalement donné en anglais. Quelques interviews seront\ncependant données en français. Des sous-titres seront disponibles en anglais et\nen français. Si vous souhaitez traduire ce cours dans votre langue nationale,\nn’hésitez pas à nous contacter <a href=\"mailto:venturemooc@epfl.ch\">venturemooc@epfl.ch<\/a>. Votre soutien est le bienvenu et très\napprécié et sera reconnu sur le site du cours.<\/p><strong><\/strong>",
    "links": {

    }
}