{"id":2426,"shortName":"earthenergy","name":"Energy and the Earth","language":"en","shortDescription":"Learn how all energy systems depend on the finite resources of the Earth, and how this relationship can provide a unique “big picture” perspective on energy supply.  ","aboutTheCourse":"Energy consumption and its consequences have spurred some of the most important public debates of our time. We are presently confronted by an unprecedented paradox:&nbsp; the negative consequences of fossil fuel combustion have never been clearer, but oil and gas extraction are experiencing a technological revolution.&nbsp; How long with fossil fuel supplies last? What are the long-term implications of fracking and other technologies that extend their use? At what point will renewable energy systems replace fossil fuels altogether?&nbsp; Such questions have a direct impact on our health, wealth, and security, but reliable answers are scarce. &nbsp;<br><br>In this class we will develop a unique, “big picture” perspective on these issues, based on the concept that all energy systems, fossil and renewable, depend on finite geologic resources of the Earth.&nbsp; Armed with this perspective, energy consumers, producers, and policy makers can make more informed choices for the future.&nbsp; This course will emphasize three universal principles: <br><br><ol><li>Energy quality matters more than quantity,&nbsp;&nbsp; <\/li><li>Technological advances continually redefine reality, and <\/li><li>All energy systems carry their own negative consequences.&nbsp; <\/li><\/ol>We will explore energy options ranging from solar to nuclear, revealing how the above principles apply to each. &nbsp;<br><br><br>","targetAudience":1,"courseSyllabus":"<strong>Week 1:<\/strong>&nbsp; “In the Beginning”: the historic and geologic context of human energy use.<br><br><strong>Week 2<\/strong>:&nbsp; “Leveraging the Past”: energy sources that have been naturally enriched through the leverage of geologic time.<br><br><strong>Week 3:&nbsp;<\/strong> “Living in the Present”: renewable energy sources that draw on the present flux of energy from the Sun.<br><br><strong>Week 4:&nbsp;<\/strong> “Planning for the Future”: prospects and challenges of future energy use.<br><br><br>","courseFormat":"The class will include lecture videos generally between 2 and 10 minutes in length, interviews with recognized experts, and supplemental reading assignments of about 10-15 pages per week.&nbsp; There will also be several easy and fun activities that you can try at home, to help reinforce key concepts.&nbsp; Discussion forums will help you to investigate points that may not be clear, and to share your own knowledge and experience with others.&nbsp; Short quizzes will be used to help assess your progress, and a final exam will be required for those wishing to receive a certificate for the course.&nbsp; <br><br>","suggestedReadings":"This course is based on portions of the book “Geofuels: Energy and the Earth” (<a target=\"_blank\" href=\"http:\/\/www.cambridge.org\/us\/academic\/subjects\/earth-and-environmental-science\/environmental-science\/geofuels-energy-and-earth?format=PB?format=PB\">Publisher’s link<\/a>, <a target=\"_blank\" href=\"http:\/\/www.amazon.com\/s\/ref=nb_sb_noss?url=search-alias%3Daps&amp;field-keywords=geofuels\">Amazon link<\/a>&nbsp; ).&nbsp; The book itself is not required, but is recommended for its more in-depth discussion of the course topics.&nbsp; <br><br><br>","estimatedClassWorkload":"2-3 hours\/week","recommendedBackground":"All are welcome!&nbsp; A high school level understanding of math and science is helpful but not required.<br>","links":{}}