{"id":1398,"shortName":"traumasurgery","name":"Grundlagenkurs Unfallchirurgie","language":"de","shortDescription":"Dieser Kurs vermittelt ein weites Feld an Grundlagen und Fertigkeiten im Bereich der unfallchirurgischen und orthopädischen Traumaversorgung. Dazu verwendet der Kurs ein komplett neues Konzept des Informationstransfers. Wir folgen einem wissenschaftlichen Ansatz und einer ausgeklügelten Kombination aus modernsten Lehrmethoden, um die Inhalte plastisch zu vermitteln. Dazu verwenden wir fallbasiertes Lernen, umfassendes Faktenwissen gefolgt von Quizfragen, die helfen, das Gelernte im Gedächtnis zu behalten und später im unfallchirurgischen Alltag abrufen zu können.","aboutTheCourse":"<p>Dieser Kurs behandelt das Management unterschiedlicher Formen von unfallchirurgischem und orthopädischem Trauma. Daher reicht das Themenspektrum von der Versorgung von multiplen Verletzungen nach ATLS-Kriterien über grundlegende Frakturbehandlung bis hin zu Hand- und Weichteilverletzungen. Das Ziel des Kurses ist, jungen Assistenzärzten, Medizinstudenten, Krankenschwestern und -pflegern, Notfallmedizinern und Rettungssanitätern die grundlegenden Kenntnisse des Traumamanagements und der Behandlung von Frakturen, Luxationen und vielen weiteren Verletzungsarten in einer standardisierten und systematischen Weise zu vermitteln. Dabei werden neueste Erkenntnisse aus der Lehrforschung angewandt und eine Kombination von kurzen theoretischen Einheiten, die die wichtigsten Informationen zum Thema beinhalten und kurzen Filmsequenzen, die die praktischen Fähigkeiten zeigen und schließlich Quizfragen verwendet, die die erlernten Kenntnisse abfragen und dadurch festigen.<br><\/p><p>Jeder, der im Bereich der Unfallchirurgie tätig ist - also Unfallchirurgen, Anästhesisten, Neurochirurgen, Rettungssanitäter und Krankenschwester (oder diejenigen, die es noch werden wollen) - benötigt sein \"Handwerkszeug\". Und das ist nicht nur wörtlich gemeint, sondern bezieht sich auf modernste Methoden, die benötigt werden, um Leben zu retten, Körperfunktionen aufrecht zu erhalten und Lebensqualität nach erlittenen Verletzungen wiederherzustellen.<br><\/p><p>Dieser spannende Kurs wird Sie durch verschiedene Fälle leiten - einige davon sind alltäglich, andere sind lebensbedrohlich - um Sie in die Welt der Unfallchirurgie einzuführen.<br><\/p>","targetAudience":2,"courseSyllabus":"<br>Erste Woche: Polytrauma und Allgemeine Frakturlehre<br><br>Zweite Woche: Klavikulafrakturen und Humeruskopffrakturen<br><br>Dritte Woche: Humerusschaftfrakturen und Olekranonfrakturen<br><br>Vierte Woche: Distale Radiusfrakturen und Metacarpalefrakturen<br><br>Fünfte Woche: Scaphoidfrakturen und Knöcherne Sehnenausrisse<br><br>Sechste Woche: Wirbelsäulenfrakturen und Beckenfrakturen <br><br>Siebte Woche:&nbsp; proximale Femurfrakturen und Femurschaftfrakturen<br><br>Achte Woche: Proximale Tibiafrakturen und Sprunggelenksfrakturen<br><br>Neunte Woche: Thorakale Stichverletzungen und Schnittverletzungen \/ Wundnaht<br><br>Zehnte Woche: Bissverletzungen und Brand- \/ Erfrierungsverletzungen<br><br>Elfte Woche: Schädel-Hirn-Trauma<br><br>Bitte beachten Sie: Der Ablauf des Kurses kann sich noch verändern!<br><br><br><br><br><br>","courseFormat":"Dieser Kurs besteht aus Videos, die jeweils zwischen 20 und 30 Minuten lang sind. Sie enthalten jeweils 5 bis 10 integierte Quizfragen. Zum Abschluss des Kurses sind alle Fragen in einem großen Quiz kombiniert.<br>","suggestedReadings":"Obwohl die Videos in sich abgeschlossen sind, empfehlen wir folgende Sekundärliteratur:<br><br>FU Niethard, J Pfeil, P Biberthaler. Duale Reihe Orthopädie und Unfallchirurgie. 6. Auflage. (2009). Georg Thieme Verlag, Stuttgart, Germany<br><br>AO Manuals of Fracture Management (different volumes concerning different anatomies). Georg Thieme Verlag, Stuttgart, Germany<br><br><br><br>","estimatedClassWorkload":"2-3 hours\/week","recommendedBackground":"Ein Abschluss in Humanmedizin oder ein laufendes Medizinstudium, eine abgeschlossene Ausbildung als Rettungssanitäter oder als Krankenschwester \/ -pfleger sind erforderlich.<br>","links":{}}