{"id":698,"shortName":"biostats2","name":"Mathematical Biostatistics Boot Camp 2","language":"en","shortDescription":"Learn fundamental concepts in data analysis and statistical inference, focusing on one and two independent samples.","aboutTheCourse":"This class presents fundamental concepts in data analysis and&nbsp;statistical inference, focusing on one and two independent samples.&nbsp;Students having taken this class should be able to summarize samples,&nbsp;perform relevant hypothesis tests and perform a collection of two&nbsp;sample comparisons. Classical non-parametric methods and discrete data&nbsp;analysis methods are discussed. &nbsp;The class is taught at a master's of&nbsp;biostatistics introductory level and requires Mathematical&nbsp;Biostatistics Boot Camp 1 as a prerequisite.\n<br><br>\nDeveloped in collaboration with <a href=http:\/\/www.jhsph.edu\/offices-and-services\/center-for-teaching-and-learning\/our-services\/open-education-lab\/index.html>Johns Hopkins Open Education Lab<\/a>.","targetAudience":1,"courseSyllabus":"<ul><li>Hypothesis Testing<br><\/li><li>Power and sample size and two group tests<br><\/li><li>Tests for binomial proportions<br><\/li><li>Two sample binomial tests, delta method<br><\/li><li>Fisher's exact tests, Chi-squared tests<br><\/li><li>Simpson's paradox, confounding<br><\/li><li>Retrospective case-control studies, exact inference for the odds ratio<br><\/li><li>Methods for matched pairs, McNemar's, conditional versus marginal odds ratios<br><\/li><li>Non-parametric tests, permutation tests<br><\/li><li>Inference for Poisson counts<br><\/li><li>Multiplicity<br><\/li><\/ul>","courseFormat":"This course consists of video lectures, weekly homework assignments, discussion forums, and weekly quizzes.","suggestedReadings":"","estimatedClassWorkload":"3-5 hours\/week","recommendedBackground":"Students should take Mathematical Biostatistics Boot Camp 1 before enrolling in this course.&nbsp;Knowledge of calculus, set theory and a high level of mathematical literacy are prerequisites for this class.","links":{}}