{
    "id": 2256,
    "shortName": "taxlaw",
    "name": "Введение в российское налоговое право (Introduction to the Russian Tax Law)",
    "language": "ru",
    "shortDescription": "Изучение российского налогового права позволит слушателям впоследствии самостоятельно работать с Налоговым кодексом РФ и др. источниками налогового права, правоприменительными актами судов и налоговых органов, применять полученные знания в практике налогообложения и налогового планирования, а также для защиты налогоплательщика от неправомерных действий налоговых органов.\n",
    "aboutTheCourse": "<span>\n <span><span>\n  <span>\n  <p>Знание основ налогового права\n  необходимо как для будущих юристов и экономистов, так и для участников\n  предпринимательской деятельности, неизбежно сталкивающихся с различными\n  правовыми проблемами, связанными с необходимостью исполнения своих налоговых\n  обязанностей.<\/p>\n  <p><span>Курс построен так, чтобы максимально\n  возможно расширить целевую аудиторию, охватив не только студентов,\n  обучающихся на юридических, экономических, управленческих&nbsp; факультетах, но и предпринимателей,\n  государственных служащих, на практике регулярно имеющих дело с проблемами\n  налогообложения.<\/span><\/p>\n  <p><span>Знакомство с основными источниками\n  российского налогового права и его принципами, изучение базовых положений законодательства\n  о возникновении налоговой обязанности и ее исполнении, организации и\n  проведении налогового контроля, налоговых правонарушениях и налоговой\n  ответственности, порядке обжалования действий налоговых органов и&nbsp; их должностных лиц позволит получить\n  необходимый минимум знаний для того, чтобы своевременно и в полном объеме\n  выполнить налоговую обязанность и при необходимости защитить права и законные\n  интересы налогоплательщика от посягательств со стороны налоговых органов.<\/span><\/p>\n  <p>&nbsp;<\/p>\n  <p>Knowing the basics of tax law is necessary to both\n  the future lawyer and economist, as well as to anyone who involved in\n  entrepreneurship and therefore inevitably faced with the need to fulfill its\n  tax obligations. <\/p>\n  <p>This course is designed to expand the target\n  audience as much as possible, covering not only the students in the faculties\n  of law and economics, but also entrepreneurs and public servants, who are\n  regularly dealing with the problems of taxation in practice.<\/p>\n  <p>We\n  focuses on learning the main sources of Russian tax law and its principles,\n  on studying the basic provisions of the legislation related to the occurrence\n  of the tax liabilities and its execution, organization and conduct of tax\n  control, tax offenses and tax liability, the procedure for appealing the\n  actions of tax authorities and their officials. Having that knowledge, one\n  can implement the tax liability in time and completely and, if necessary, can\n  protect the rights and legitimate interests of the taxpayer against\n  encroachment by the tax authorities.<\/p>\n  <\/span>\n <\/span>\n<\/span><\/span>",
    "targetAudience": 1,
    "courseSyllabus": "<p><span><strong>Неделя\n1.&nbsp; <\/strong>Налоговое право: понятие, источники и\nпринципы.<\/span><\/p>\n\n<p><strong>Неделя 2.\n<\/strong>Установление налога и налоговая обязанность.<\/p>\n\n<p><span><strong>Неделя 3. <\/strong>Исполнение налоговой обязанности.<\/span><\/p>\n\n<p><strong>Неделя 4. <\/strong>Налоговый\nконтроль.<\/p>\n\n<p><span><strong>Неделя 5.\n<\/strong>Налоговые &nbsp;правонарушения и налоговая\nответственность.<\/span><\/p>\n\n<p><strong>Неделя 6. <\/strong>Защита прав и\nзаконных интересов налогоплательщика.<\/p>",
    "estimatedClassWorkload": "5-5 hours\/week",
    "recommendedBackground": "<p>Для изучения курса не требуется\nспециального образования, он задуман как введение в налоговое право и\nориентирован на широкий круг слушателей.<\/p>\n\n<p>Мы постарались максимально адаптировать\nкурс для тех, кто не имеет базового юридического образования. В то же время\nприветствуется наличие у слушателя минимальных знаний в области правоведения.<\/p>",
    "links": {

    }
}