{
    "id": 382,
    "shortName": "newwayhealthcare",
    "name": "Interprofessional Healthcare Informatics ",
    "language": "en",
    "shortDescription": "This course examines the implications of informatics for practice, in nursing, public health, and healthcare in general. It covers electronic health record issues and relates ethical, legislative and political issues to health informatics. Students will also explore global and future informatics issues.",
    "aboutTheCourse": "Interprofessional health care informatics is a graduate-level, hands-on interactive exploration of real informatics tools and techniques. We will be incorporating technology-enabled educational innovations to bring the subject matter to life. Over the\n10 weeks that we study together, we will create a vital online learning community and a working healthcare informatics network.\n<br>\n<br>We will explore perspectives of clinicians like dentists, physical therapists, nurses, and physicians in all sorts of practice settings worldwide. Emerging technologies, telehealth, gaming, simulations, and eScience are just some of the topics that we\nwill consider.\n<br>\n<br>Throughout the course, we’ll focus on creativity, controversy, and collaboration - as we collectively imagine and create the future within the rapidly evolving healthcare informatics milieu. All healthcare professionals and IT geeks are welcome!\n<br>",
    "targetAudience": 2,
    "courseSyllabus": "<b>Course Objectives:<\/b>\n<p><\/p>\n<ul>\n    <li>Examine theories and frameworks for interprofessional healthcare informatics.&nbsp;\n        <br>\n    <\/li>\n    <li>Describe the role of standards in electronic health records.\n        <br>\n    <\/li>\n    <li>Analyze benefits and issues related to electronic health records.\n        <br>\n    <\/li>\n    <li>Relate informatics to evidence-based practice, decision support, and quality improvement.\n        <br>\n    <\/li>\n    <li>Describe eScience and new research enabled by big data.\n        <br>\n    <\/li>\n    <li>Describe ethical implications of interprofessional healthcare informatics.\n        <br>\n    <\/li>\n<\/ul>\n<p><\/p>\n<p><\/p>\n<p><\/p>\n<p><\/p>\n<p><\/p>\n<p><\/p><b>Weeks and Themes:<br><br><\/b>\n<p><strong>Week 1: Information Theory<\/strong>\n<\/p>\n<ul>\n    <li>Explore and apply theories of healthcare informatics to professional practice.<\/li>\n<\/ul>\n<p><strong>Week 2:&nbsp;<\/strong><b>Data, Information, Knowledge<\/b>\n<\/p>\n<ul>\n    <li>Explore and apply standardized terminologies to professional practice.<\/li>\n<\/ul>\n<p><strong>Week 3: Electronic Health Record (EHR), Evidence-Based Practice (EBP)<\/strong>\n<\/p>\n<ul>\n    <li>Link EHR use to evidence-based practice<\/li>\n<\/ul>\n<p><strong>Week 4: Quality Improvement\/ Workflow Analysis\/ Redesign<\/strong>\n<\/p>\n<ul>\n    <li>Examine quality improvement and principles of workflow analysis and redesign techniques.<\/li>\n<\/ul>\n<p><strong>Week 5: Telehealth\/ Consumer Health\/ Mobile Technology<\/strong>\n<\/p>\n<ul>\n    <li>Examine informatics in relationship to new technologies in healthcare.<\/li>\n<\/ul>\n<p><strong>Week 6: Community\/ Population Health<\/strong>\n<\/p>\n<ul>\n    <li>Relate informatics to community and population health.<\/li>\n<\/ul>\n<p><strong>Week 7: Education\/ Gaming<\/strong>\n<\/p>\n<ul>\n    <li>Describe applications of gaming, simulation, and virtual reality tools in&nbsp;healthcare.<\/li>\n<\/ul>\n<p><strong>Week 8: Informatics and Ethics<\/strong>\n<\/p>\n<ul>\n    <li>Explore ethical issues related to healthcare informatics in the interprofessional context.<\/li>\n<\/ul>\n<p><strong>Week 9:&nbsp;<\/strong><b>Data Exchange and Interoperability<\/b>\n<\/p>\n<ul>\n    <li>Explore interprofessional aspects of healthcare data exchange and interoperability.<\/li>\n<\/ul>\n<p><strong>Week 10:&nbsp;<\/strong><strong>Informatics and the Foundation of Knowledge<\/strong>\n<\/p>\n<div>\n    <ul>\n        <li>Explore the contribution of healthcare informatics to the foundation of knowledge in healthcare.<\/li>\n    <\/ul>\n<\/div>",
    "estimatedClassWorkload": "2-3 hours\/week",
    "recommendedBackground": "Healthcare and\/or&nbsp;information technology professional.\n<br>\n<br>",
    "links": {}
}