{"id":1380,"shortName":"ecojustice","name":"Economic Growth and Distributive Justice","language":"en","shortDescription":"If you really care about the big questions in the economies and societies of the 21st century, such as distributive justice, namely, inequality of income or wealth, and its relationship with economic growth, this course is meant for you. It can truly change your outlook on our world.  ","aboutTheCourse":"<p>After successfully completing this course, we expect you to be able to:<\/p>\n<ul>\n<li>better understand economic issues presented in the media<\/li><li>have an informed opinion on the strengths and weaknesses of presented social economic policies<\/li><li>define and measure inequality and poverty<\/li><li>define the relationship between inequality (income, wealth) and economic growth<\/li>\n<li>explain the foundation of economic growth<\/li>\n<li>design a tax and transfer system to maximize happiness<\/li>\n<\/ul>\n<p>All leading you to better understand the policies being developed around you, and play a larger, more informed role in their development as a conscientious citizen.<\/p>\n<p>The course is founded upon the elemental idea that the role of the state is to maximize the wellbeing - or simply the happiness - of its residents. In 6 fascinating, edifying lessons, using only simple words and decoding professional terminologies, that sometimes baffle the intelligent layman, the course expounds many truths – both intuitive and unintuitive. The course often uses US and European examples, but does not focus on policies from any particular region of the world, and is directly applicable to all countries of the world.<\/p>\n<p>It touches upon the essence of important concepts like efficiency and equity, inequality and poverty, gross domestic product, tax evasion and tax planning; it presents the work of Nobel Laureate James Mirrlees and his followers - promoting a coherent system that integrates tax and government expenditures to maximize social welfare; and illuminates a range of high-profile issues from their economic angle:<\/p>\n<ol>\n<li>Climate change: the atmosphere and oceans as public goods, and how smart (Pigovian) taxation can be used to combat the rapidly increasing threats to our planet;<\/li>\n<li>Technology as the engine of economic growth;<\/li>\n<li>Taxing the Rich. How to Mitigate the Growing Inequality Problem? Should we &nbsp;&nbsp;impose a Global Tax on Capital?<\/li>\n<\/ol>\n<p>The curriculum includes interviews with major figures in the fields of law and of economics:&nbsp; Harvard's Elhanan Helpman, Dan Shaviro from NYU and Richard Epstein from Chicago and NYU.&nbsp;<\/p>","targetAudience":0,"courseSyllabus":"<p dir=\"LTR\"><strong>Week 1<\/strong>:<\/p>\n<p dir=\"LTR\">What is the Goal of the State?; Why do we need a State to achieve this Goal?<\/p>\n<p dir=\"LTR\"><strong>Week 2:<\/strong><\/p>\n<p dir=\"LTR\">The engine of Economic Growth; The relationship between Efficiency and Equality.<\/p>\n<p dir=\"LTR\"><strong>Week 3:<\/strong><\/p>\n<p dir=\"LTR\">Choosing the laws that would maximize Social Welfare (Happiness).&nbsp; &nbsp;<\/p>\n<p dir=\"LTR\"><strong>Week 4:<\/strong><\/p>\n<p dir=\"LTR\">Measuring and Defining Inequality, Poverty and Social Efficiency.<\/p>\n<p dir=\"LTR\"><strong>Week 5:<\/strong><\/p>\n<p dir=\"LTR\">Who Bears the Economic Burden of Tax; Understanding Progressivity.<\/p>\n<p dir=\"LTR\"><strong>Week 6:<\/strong><\/p>\n<p dir=\"LTR\">Designing the Optimal Tax and Transfer System.&nbsp;<\/p>\n<p dir=\"LTR\">&nbsp;<\/p>","courseFormat":"The class will consist of lecture videos, which are between 8 and 12 minutes in length. There will also be two quizzes and a final exam.&nbsp;","suggestedReadings":"","estimatedClassWorkload":"2-3 hours\/week","recommendedBackground":"<p>No professional background is required; all are welcome!<\/p>\n<p>The course will be taught in English: Students should be comfortable with listening to the lectures and expressing themselves in English. &nbsp;<\/p>","links":{}}