{"id":463,"shortName":"lead-ei","name":"Inspiring Leadership through Emotional Intelligence","language":"en","shortDescription":"Emotional intelligence, hope, mindfulness, and compassion help a person reverse the damage of chronic stress and build great leadership relationships. The Positive and Negative Emotional Attractors inspire sustained, desired change and learning at many levels. ","aboutTheCourse":"<p>Great leaders move us through our emotions. They establish a deep emotional\n    connection with others called resonance. Their own levels of emotional\n    intelligence allow them to create and nurture these resonant relationships.\n    They use their EI as a path to resonant leadership through mindfulness,\n    hope, compassion, and playfulness. Unfortunately, most people in leadership\n    and helping positions (i.e., doctors, teachers, coaches, etc.) lose their\n    effectiveness over time because of the cumulative damage from chronic stress.\n    But humans can renew themselves, neurologically, hormonally, and emotionally.<\/p>\n<p>Based on decades of&nbsp;research into emotional intelligence&nbsp;competencies\n    and longitudinal studies of their development, the course will examine\n    resonance and developing \"resonant leadership\" capability,&nbsp;emotional\n    intelligence, and the experiences of mindfulness, hope, and compassion.\n    Using the latest in neuroscience, behavioral, organizational and psychological\n    research, participants will&nbsp;understand the theory, research, and experience\n    of the Positive Emotional Attractor that is an essential beginning to sustained,\n    desired change for individuals, teams, organizations and communities.&nbsp;<\/p><p>The course will consist of nine classes, with three or so\nmodules per class, to be taken over 8 weeks. Each module will consist of a\nvideo, assigned and recommended readings, reflective exercises, writing in your\nPersonal Journal, and on-line, asynchronous discussions. Each class will have personal\nlearning assignments to use and tests of comprehension.&nbsp;<\/p>","targetAudience":1,"courseSyllabus":"<p><b>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/b><b><b>ABOUT THE COURSE<\/b><\/b><\/p><p><b>Week 1: Class 1:\nResonant Leadership and the neuroscience behind it<\/b><\/p><ul><li>Module 1.1: What is great\n     leadership?<br><\/li>\n <li>Module 1.2: Resonant leaders create experiences with the people around them of Hope, Compassion, Mindfulness, and Playfulness<\/li>\n <li>Module 1.3: The\n     neuroscience of resonant leadership<\/li>\n<\/ul><p><b>&nbsp;<\/b><b>Week 2: Class 2:\nRenewal as an antidote to chronic stress<\/b><\/p><ul><li>Module 2.1: Emotions are\n     contagious<br><\/li>\n <li>Module 2.2: Stress and\n     renewal<\/li>\n <li>Module 2.3: Strategies for\n     renewal and building resonant relationships<\/li>\n<\/ul><p><b>Week 3: Class 3:\nEmotional Intelligence and its link to Leadership<\/b><\/p><ul><li>Module 3.1: Emotional,\n     social, and cognitive intelligence competencies<br><\/li>\n <li>Module 3.2: EI and SI in\n     various fields of work and they can be developed<\/li>\n<\/ul><p><b>Week 4: Class 4: Inspiring and Motivating Sustained Development, Growth and Learning<\/b><\/p><ul>\n <li>Module 4.1: People and\n     relationships who inspired you and Intentional Change Theory<\/li>\n<li>Module 4.2: The Positive\n     (PEA) and Negative Emotional Attractors (NEA)<br><\/li><\/ul><p><b>Week 5: Class 5: Coaching with Compassion to Inspire Sustained Learning and Development<\/b><\/p><p><\/p><ul><li>Module 5.1: Doctor\/Patient, teacher\/student studies and neruological evidence of coaching to the PEA<br><\/li><li>Module 5.2: Survive and\n     Thrive – Balancing the PEA and NEA<br><\/li><li>Module 5.3: Practicing\n     conversations that inspire<br><\/li><\/ul><p><\/p><ul>\n<\/ul><p><b>Week 5: Class 6: Peer\nCoaching: With a Little Help from My Friends<\/b><\/p><p><\/p><ul><li><b>&nbsp;<\/b>Modules 6.1 &amp; 6.1: Reviewing and\n     evaluating a Coaching with Compassion essay<br><\/li><\/ul><p><\/p><p><b>Week 6: Class 7:\nInspiring Change through Hope and Vision – Discovery #1 in ICT<\/b><\/p><ul><li>Module 7.1: The battle\n     between the Ideal Self and Ought Self<br><\/li>\n <li>Module 7.2: Components of\n     the Ideal Self\/Personal Vision<\/li>\n <li>Module 7.3: Developing\n     your personal vision, including life and career stage<\/li>\n<\/ul><p><b>Week 7: Class 8: The\nMulti-Level Nature of Sustained, Desired Change<\/b><\/p><ul><li>Module 8.1: Multi-level\n     change: Resonant leadership and social identity groups<br><\/li>\n <li>Module 8.2: Developing\n     Shared Vision in Teams and Organizations<\/li>\n <li>Module 8.3: Recent\n     research on the impact of shared vision <\/li>\n <li>Module 8.4: Team change\n     (Beatles versus Rolling Stones) and Developing social&nbsp;&nbsp;Identity (Trekkers and Apple Users)&nbsp;<\/li>\n<\/ul><p><b>Week 8: Class 9: The Real Self and Learning Agenda- Discoveries #2,3,4\nin ICT<\/b><\/p><p><\/p><ul><li>Module 9.1: The Real Self versus the Faux Self and Learning Agenda (not a Performance Improvement Plan)<br><\/li><li>Module 9.2: Experimentation and Practice<\/li><li>Module 9.3: Review<\/li><\/ul><ul><ul>\n    <\/ul>\n    <p><\/p>\n    <p><\/p>\n<\/ul>","courseFormat":"<p>This course is made up of nine classes. Each class has two to four modules.\n    Each module has a video, plus reflective exercises to be done during the\n    module and a personal learning assignment to follow the class. Students\n    are encouraged to maintain a personal journal of thoughts, observations\n    and experiences during the course. For the advanced Practicum Track, there\n    are 3 action learning assignments which involve you talking to others at\n    work, home, or other aspects of your life. For example, the action learning\n    assignment after Class 5 requires that you conduct two coaching sessions\n    and write a brief essay on them. If you choose this option, these will\n    be read and reviewed by a small group of classmates on-line. Students are\n    expected to offer their opinions, ideas and examples from the videos, readings,\n    personal and action learning exercises, and reflective exercises in on\n    line discussions. Each week &nbsp;will end with a quiz. The final grade\n    will be based on 5 Personal Learning Assignments (60%), 5 weekly exams\n    (20%), and the Final exam (20%).\n    If a person completed the 3 Action Learning Assignments, they would earn\n    “With Distinction” on their Statement or Certificate.&nbsp;<\/p>\n<p><\/p>\n<p><\/p>","suggestedReadings":"<p>Students should read the required readings either before or soon after\n    each unit, but in advance of the next module. Recommended and supplemental\n    readings can be read at any time throughout the course.&nbsp;<\/p>","instructor":"Richard Boyatzis","estimatedClassWorkload":"3-4 hours\/week","recommendedBackground":"<p>There are no prerequisites for this course. However, the course will be\n    conducted at the level expected of advanced undergraduate students, graduate\n    students or professionals and executives. Therefore, for all participants,\n    reading and writing comfortably in English at the undergraduate college\n    level is desirable.&nbsp;<\/p>","links":{}}