{
    "id": 884,
    "shortName": "understandingterror",
    "name": "Understanding Terrorism and the Terrorist Threat",
    "language": "en",
    "shortDescription": "This course will explore questions relating to the who, what and how of terrorism studies by introducing students to cutting edge research and the experts investigating these topics. ",
    "aboutTheCourse": "<p>Terrorism Studies does not fall within any\none traditional academic discipline, and it is often plagued by subjectivity\nand a lack of empirical data. The National Consortium for the Study of Terrorism and Responses to Terrorism (START), a Department of Homeland Security Center of Excellence housed at the University of Maryland, will apply its multi-disciplinary and\nmixed-method approach to research in this course, utilizing theory and quantitative\nand qualitative research from a range of the social and behavioral sciences\nincluding Criminology, Psychology, Political Science and Communications Studies.<\/p>\n\n\n\n<p>The course will begin with a unit looking at\nwidely held myths about terrorism and utilizing empirical data to discuss the\nrealities of broad trends and patterns in terrorist attacks over time.&nbsp; The course will then review the psychological\nfactors at play in individual radicalization and recruitment into terrorism,\nfollowed by an analysis of terrorist group dynamics.&nbsp; The course will next look to factors that\nallow terrorist groups to successfully carry out attacks, such as propaganda,\nuse of media, financing, recruitment, and training. &nbsp;The course will\nconclude by looking at the factors that drive terrorist group\npersistence\/endurance versus terrorist group desistance, and will bring the\nvaried course concepts together through a detailed look at the case of al-Qa’ida,\nincluding the group’s successes, failures, tactics, and strategies.&nbsp; Throughout the course, students will have the opportunity to work\nwith the University of Maryland’s Global Terrorism Database (GTD), the largest\ndatabase of terrorist incidents in the world, learning its capabilities and\ndeveloping basic skills in searching and displaying appropriate and accurate\nsets of terrorism data.<\/p><p><br><\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<b>Module 1:<\/b> <i>Introduction - How Do We Study Terrorism?<\/i><br><b>Module 2:&nbsp;<\/b><i>Individual Radicalization<\/i><br><b>Module 3:&nbsp;<\/b><i>Group Dynamics<\/i><br><b>Module 4:<\/b>&nbsp;<em>Terrorist&nbsp;Operations<\/em><i><br><\/i><b>Module 5: <\/b><i>Putting it all together: Al-Qa'ida Case Study<br><\/i><br>",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": "No background knowledge is required; however both new and advanced learners will be able to cater the course to their needs with additional optional readings for those more versed in terrorism studies. <br><br>",
    "links": {

    }
}