{
    "id": 448,
    "shortName": "law",
    "name": "Law and the Entrepreneur ",
    "language": "en",
    "shortDescription": "This course will highlight the critical legal and business issues entrepreneurs face as they build and launch a new venture.  We will explore real world scenarios, and address the legal and business issues that entrepreneurs face, from the moment they conceive of the \"million dollar idea\" to all of the important junctures along the path to success.",
    "aboutTheCourse": "Are you a passionate entrepreneur with a new business idea, but feeling\nintimidated by the law?  Or perhaps you\nare a lawyer or aspiring lawyer looking to break into the exciting world of\nstart-ups?  This course addresses the\nlegal aspects of entrepreneurship, and is appropriate both for entrepreneurs and\nlawyers who hope to represent entrepreneurs. Entrepreneurs face many challenges\nas they pursue a new business idea.  With\nthe right legal tools, they can take steps that provide significant legal\nprotections and avoid future liability.  Among\nother subjects, the course will cover American law on choice of entity (corporation,\nlimited liability company, partnership, sole proprietorship), selection of a\ncompany name and trademark, protecting intellectual property of the business\nwith patent, trade secret, trademark and copyright law, structuring agreements\namong owners, venture capital and other equity and debt financing arrangements,\nand the relationship between attorneys and entrepreneurs. In\naddition to discussing applicable legal rules, the course will focus on\npractical steps entrepreneurs and their lawyers can take to build and protect a\nnew venture.  The goal of the course will\nbe for students to have a better understanding of practical ways they can\nprotect a new venture and spot potential issues from a business-legal perspective.<br><br><br>",
    "targetAudience": 1,
    "courseSyllabus": "<p>Week One<\/p>\n\n<ul><li>Introduction to\n     Entrepreneurship Law<\/li><li>The Personality of the\n     Entrepreneur <\/li><li>Leaving an Employer to Start a\n     Business<\/li><\/ul>\n\n<p>Week Two<\/p>\n\n<ul><li>Choosing and Forming an Entity<\/li><li>Agreements Among Owners<\/li><\/ul>\n\n<p>Week Three<\/p>\n\n<ul><li>Intellectual Property:\n     trademark, copyright, patent, trade secret, and nondisclosure agreements<\/li><\/ul>\n\n<p>Week Four<\/p>\n\n<ul><li>Financing a New Venture<br><\/li><\/ul>\n\n<p>Week Five<\/p>\n\n<ul><li>Hiring Workers and Employment\n     Law<\/li><\/ul>\n\n<p>Week Six<\/p>\n\n<ul><li>Conducting Business Online<\/li><li>Final Thoughts<br><\/li><\/ul>",
    "estimatedClassWorkload": "5-7 hours\/week",
    "recommendedBackground": "The course is designed for students interested in learning about the business-legal\naspects of entrepreneurship regardless of educational background.<br>",
    "links": {}
}