{"id":482,"shortName":"warandpeace","name":"Conditions of War and Peace","language":"en","shortDescription":"This course aims to nail down some of the basic issues that have been argued in the current research on peace and security.","aboutTheCourse":"<p>\n    Discourse on war and peace has gone through a remarkable transition during the two decades after the end of the Cold War. We do not have to worry of major nuclear wars, and then, no longer can we anticipate stability based on nuclear deterrence. We have\n    no immediate threat emanating from a belligerent adversary equipped with a major arsenal, but we observe a number of small to medium military powers that are more belligerent than the days of the Soviet Union. We have more democracies in the world,\n    and yet are far from the democratic peace that has been imagined by the students of international relations.\n<\/p>\n<p>\n    This course aims to nail down some of the basic issues that have been argued in the current research on peace and security. The questions are all deceptively simple enough, but then the answers will all be ambiguous at best. It is my hope that you will\n    be able to provide better answers than those given in the course by developing your own analytical capacity.\n<\/p>","targetAudience":0,"courseSyllabus":"<p>\n    The course is divided into four parts:\n<\/p>\n<ul>\n    <li>\n        Week 1: \"When is War Necessary?\", raises the question of military intervention in light of theories of just war.\n    <\/li>\n    <li>\n        Week 2: \"Power Transition and War\", discusses the argument that global transitions in power distribution lead to hegemonic wars.\n    <\/li>\n    <li>\n        Week 3: \"Democratic Peace, Democratic Wars\", is a reappraisal of the democratic peace theory, and asks if democratization by force provides international security.\n    <\/li>\n    <li>Week 4: \"Conditions for Peace\", is directed toward&nbsp;our new assessment of paths toward durable peace.\n    <\/li>\n<\/ul>","courseFormat":"<p>\nEach week, a series of lecture videos, which are 1.5-2 hours in total, and homework quizzes are provided. In addition, essay-type assignments will be given at mid-term and final, and they will be peer graded.\n<\/p>","suggestedReadings":"","instructor":"Kiichi Fujiwara","estimatedClassWorkload":"5-7 hours\/week","recommendedBackground":"No background is required; all are welcome!","links":{}}