{"id":1485,"shortName":"representaciones","name":"Representaciones Culturales de las Sexualidades ","language":"es","shortDescription":"En este curso aprenderemos a interpretar cómo se inscriben y materializan los discursos acerca del género y la sexualidad en diversos productos y medios culturales (literatura, cine, televisión, fotografía, internet, etc.). ","aboutTheCourse":"<p>Desde los estudios de género, los estudios queer y\nlos estudios culturales, este curso quiere familiarizar a los estudiantes con\nlas <strong>representaciones culturales de las sexualidades no normativas en la cultura\ncontemporánea<\/strong>.<\/p><p>Planteamos diversos marcos teóricos y ejemplos prácticos a\npartir de los cuales reflexionar sobre las construcciones corporales e\nidentitarias de las personas lesbianas, gays, transgénero, transexuales, queer,\nheterosexuales, etc. en diversos <strong>soportes culturales<\/strong> como el cine, la\nliteratura, internet, la televisión o las artes plásticas.<\/p><p>De este modo,\nqueremos <strong>contribuir al análisis de los discursos normativos sobre el género y\nla sexualidad<\/strong> que nos construyen como sujetos y nos proporcionan posiciones\njerárquicas dentro del marco social.<\/p><p>Entendemos que las representaciones\nculturales son espacios privilegiados para llevar a cabo este análisis, porque\nen ellos se materializan tanto los discursos hegemónicos como sus posibilidades\nde subversión. <\/p>\n\n<p>El contenido teórico, siempre explicado a través del\n<strong>análisis de obras artísticas y productos culturales concretos<\/strong>, se estructura\nalrededor de cuatro unidades, repartidas en las cuatro semanas de duración del\ncurso:<\/p><ol><li>representaciones, textualidad y corporalidades<\/li><li>género\/s<\/li><li>sexualidad\/des<\/li><li>cultura, identidad y comunidad <\/li><\/ol>\n\n<p>El curso está orientado a cualquier persona\ninteresada en la cultura, el género y la sexualidad, <strong>sin necesidad de\nconocimientos previos<\/strong>. Queremos ofrecer contenidos sugestivos para aquellos\nestudiantes ya familiarizados con la temática, sin descuidar las reflexiones y\nexplicaciones necesarias para aquellos que se adentran en ella por primera vez.<\/p><p><br><\/p><p><strong>Colaboradores<\/strong><\/p><p><\/p><p>\n\n<\/p><ul><li>Mireia Calafell<\/li><li>Mayte Cantero<\/li><li>Michelle Gamma<\/li><li>Francisco Lazo<\/li><li>Anna Orta<\/li><li>Irina Sureda<br><\/li><\/ul>","targetAudience":0,"courseSyllabus":"<p>El curso está pensado para trabajar cada semana los\nsiguientes conceptos, teniendo en cuenta que se irán retomando a medida que se\navance la materia:<\/p>\n\n<p><strong>Semana 1. <\/strong>Representación. Textualidad. Corporalidad<\/p>\n\n<p><strong>Semana 2. <\/strong>Sistema sexo\/género<\/p>\n\n<p><strong>Semana 3. <\/strong>Sexualidades<\/p>\n\n<p><strong>Semana 4.<\/strong> Cultura. Comunidad. Identidad<\/p>\n\nSe estudiará el desarrollo teórico de cada uno de\nlos conceptos —así como su interrelación— y se verá el modo en que se hallan\nrepresentados en los discursos culturales y en las distintas formas de\nexpresión artística (literatura, fotografía, pintura, internet, vídeo-arte).<br><br>","courseFormat":"<p><span>El curso tiene una duración de <strong>4 semanas<\/strong>. Cada una\ndemanda por parte del alumnado <strong>entre cinco y seis horas de dedicación.<\/strong><br><\/span><\/p><p>Cada\nsemana estarán disponibles los materiales necesarios para su seguimiento;\nasímismo, se encontrará una serie de lecturas recomendadas para aquellas\npersonas que deseen ampliar su formación y profundizar en la temática.<\/p><p><span>Las\n<strong>actividades propuestas<\/strong> son, en primer lugar, un conjunto de vídeos que\ncontienen la parte teórica de cada unidad; en segundo lugar, una serie de\nlecturas acompañadas de una guía con el fin de que, en tercer lugar, se\nrespondan los cuestionarios propuestos al final de cada semana. Cada cuestionario contará un 15%, sumando así el <strong>60% de la nota final<\/strong>.<\/span><\/p><p><span>Además, entre la segunda y la tercera semana de\ncurso, deberá realizarse un <i>peer-review<\/i>,\nque tiene un valor del <strong>40% de la nota final<\/strong>.<\/span><br><\/p>","suggestedReadings":"Los materiales que se suministran durante el\ncurso son suficientes para seguir el mismo.","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"<p>El curso\nestá orientado a cualquier persona interesada en la cultura, el género y la\nsexualidad, sin necesidad de conocimientos previos. <br><\/p><p>Queremos ofrecer contenidos\nsugestivos para aquellos estudiantes ya familiarizados con la temática, sin\ndescuidar las reflexiones y explicaciones necesarias para aquellos que se\nadentran en ella por primera vez.<\/p><p>Sin embargo, será especialmente provechoso\npara los estudiantes (de cualquier grado) que cursen o hayan cursado estudios\nde arte, literatura, filosofía, gender studies, etc.<br><\/p><br>","links":{}}