{
    "id": 1353,
    "shortName": "metals",
    "name": "Wheels of Metals: Urban Mining for a Circular Economy",
    "language": "en",
    "shortDescription": "Population and welfare are growing. Providing the world with metals is becoming a major challenge. Only by closing the loop will metals be available in sufficient quantities, not just now but also in the future: urban mining, the substantial re-use and recycling of metals. In this MOOC we will explore the challenges related to metals supply, both scarcity and environmental impacts, and the conditions and consequences of a circular economy for metals, based on the reports of UNEP's International Resource Panel.",
    "aboutTheCourse": "<p>Metals are ubiquitous – they are all around us – and\nprovide a foundation upon which our economies are built. Economic development\nis deeply coupled with the use of metals. During the 20th century the production has increased exponentially, and the variety\nof metal applications in society has grown rapidly. In addition to mass\napplications such as steel in buildings, copper in wires and aluminium in\nairplanes, more and more metals are required for innovative technologies such\nas the use of rare earth elements in renewable energy systems.&nbsp;<\/p><p>\n\n<\/p><p>Worldwide, and in particular in emerging economies,\nthe demand for metals is rapidly increasing. The continued increase in metals\ndemand and use over the 20th century has led to substantial social, economic\nand environmental challenges. Mining activities expand but easily accessible\ndeposits are becoming scarce. As a result, the supply of critical metals is\nunder an increasing pressure. This implies recycling, also referred to as “urban\nmining”, is of growing importance in generating raw materials. In the end,\nthe only really effective solution to the metals challenge may be to move\ntowards a circular economy.&nbsp;<\/p><p>To&nbsp;be able to do that, information is needed\non metal stocks in society, their size and residence time, as well as on the\ntechnologies that are available to recover these metals when the stocks become\nobsolete. This course, based on the reports of the Global Metals Flows Working\nGroup of UNEP’s International Resource Panel (IRP), investigates the nature of\nthe metals challenge and the conditions and the consequences of the way out: a\ncircular economy for metals.<\/p>\n",
    "targetAudience": 0,
    "courseSyllabus": "Week 1: Introduction to metals<br>\nWeek 2: The metals challenge: scarcity, environmental impacts, criticality<br>\nWeek 3: Metal stocks and flows<br>\nWeek 4: Re-use and recycling: urban mining<br>\nWeek 5: Towards a circular economy<br>",
    "estimatedClassWorkload": "3-4 hours\/week",
    "recommendedBackground": "<p>No prior background required. Basic chemistry\nknowledge is helpful.<\/p>",
    "links": {}
}