{
    "id": 584,
    "shortName": "clinicaltrials",
    "name": "Practical tips to improve Asian American participation in cancer clinical trials",
    "language": "en",
    "shortDescription": "Internet Enduring Material Sponsored by Stanford University School of Medicine",
    "aboutTheCourse": "<b>Presented by<\/b><br>The Stanford Cancer Institute at Stanford University School of Medicine<br><br><b><h2>This course has expired and has been <\/b><b><b>renewed<\/b> by the Stanford Center for Continuing Medical Education, you can find the renewed course at:<br><br><a target=\"_blank\" href=\"https:\/\/med.stanford.edu\/cme\/learning-opportunities\/online.html\">https:\/\/med.stanford.edu\/cme\/learning-opportunities\/online.html<\/a><\/h2><br><br><br>Dates &amp; Durations<\/b><ul><li>Release Date: August&nbsp; 29th, 2013<br><\/li><li>Expiration Date:August&nbsp; 29th, 2015<br><\/li><li>Estimated Time to Complete: 60 minutes.<\/li><\/ul><b><br>To Obtain CME Credits<\/b><ul><li>CME Processing Fee: $20 fee waived for the first 200 learners who complete all CME activities required for this course.<br><\/li><li>Review the information below and complete the entire activity.<br><\/li><li>Follow the link at the end of the activity to complete course evaluation, post-assessment and post-test.<br><\/li><li>In order to access the link to the CME portion of the course you must stream the videos. Downloaded videos will not contain the CME link.<br><\/li><li>8 out of 11 case-based post-test questions must be answered correctly in order to receive a CME certificate that will be emailed to the address provided within 2 weeks from the date of receipt. Learners will have 3 attempts to pass the post-test.<br><\/li><li>Participation in post-course survey and post-course quiz are not certified for&nbsp;<i>AMA PRA Category 1 Credit™.<\/i><\/li><\/ul><br><b>Intended Audience<\/b><br>This course is designed to meet the educational needs of a national audience of physicians and allied health professionals who specialize in family practice, primary care, internal medicine and oncology.<br><br><b>Course Description<\/b><br>Racial and ethnic diversity is critical to the success of cancer clinical trials. Asian Americans, like other ethnic groups, have low recruitment, accrual and retention rates in cancer clinical trials. This represents a significant challenge on a national level for health advocates, healthcare institutions and the National Cancer Institute. To improve communication and awareness of clinical trials for Asian American patients, it is important to increase learners’ knowledge about cancer clinical trials and cultural humility. This online course will educate healthcare providers and allied health professionals about cancer clinical trials and cultural humility skills as well as provide educational resources and tips for reinforcing change in practice to improve outcomes in Asian American clinical trial participation.<br><br><b>Learning Objectives<\/b><ul><li>Develop strategies to determine appropriate patients for clinical trials.<br><\/li><li>Apply cultural humility skills to effectively communicate with Asian American patients about cancer clinical trials.<br><\/li><li>Identify at least 5 ways that will reinforce change in practice to incorporate clinical trials education and referral among Asian American patients and apply it in practice.<br><\/li><li>Recognize how to access at least 5 cancer clinical trial resources and use them in education and referral.<\/li><\/ul><b>Disclosures<\/b><br><b>The following planner and speaker indicated that he has relevant financial relationships with industry to disclose relative to the content of this activity:<\/b><br><i>Contracted Research for clinical trials with Genentech, Novartis, Bristol, Ipsen, Tercica, Gilead and Newlink<\/i><br>George Fisher, MD. PhD<br>Associate Professor, Medicine<br>Faculty Director, Stanford Cancer Clinical Trials Office<br>Co-Course Director<br><br><b>The following planners, reviewers, speakers and authors have indicated that they have no relationships with industry to disclose relative to the content of this activity:<\/b><br>Kim Rhoads, MD, MPH<br>Assistant Professor, Surgery<br>Director, Community Partnership Program, Stanford Cancer Institute<br>Course Director<br>Reviewer<br><br>Angela Sun, PhD, MPH<br>Founder &amp; President, Asian Alliance for Health, Inc.<br>National Outreach Core Director, AANCART<br>Co-Course Director<br><br>Miriam Bischoff, MS, MBA<br>Executive Administrative Director, Clinical Research, Stanford Cancer Institute<br>Planner<br><br>Rachel J. Mesia, MPH<br>Program Coordinator, Stanford Cancer Institute<br>Planner<br><br>Joyce Cheng, MS<br>Program Manager, Asian Alliance for Health<br>Outreach Core Community Director-San Francisco, AANCART<br>Planner<br><br>Charlene Cuaresma, MPH<br>Outreach Core Community Director-Hawaii, AANCART<br>Planner<br><br>Julie Dang, MPH., CHES<br>Admin Core Director and Community Health Educator, AANCART<br>Planner<br><br>May Sung, MPH<br>Outreach Core Co-Director, AANCART<br>Planner<br><br>Jamie Felicitas, BS<br>Web Tool Project Manager, APICEM<br>AANCART<br>Planner<br><br>Duong Ton, BS<br>Sr. Community Health Program Representative, AANCART<br>Planner<br><br>Parichart Sabado, MPH<br>Outreach Core Community Director, Los Angeles AANCART<br>Planner<br><br>Tina Fung, BS<br>Community Advisory Group Member, AANCART<br>Planner<br><br>Penny Lo, BS<br>Outreach Core Community Director-Sacramento, AANCART<br>Planner<br><br>Thoa Nguyen<br>Community Advisory Group Member (Ex-Officio), AANCART<br>Planner<br><br>Jann Murray Garcia, MD, MPH<br>Betty Irene Moore School of Nursing, University of California, Davis<br>Speaker<br><br>Tung Nguyen , MD<br>Helen Diller Family Comprehensive Cancer Center, University of California, San Francisco<br>Speaker<br><br><b><a target=\"_blank\" href=\"https:\/\/class.coursera.org\/clinicaltrials-001\/wiki\/view?page=coursecontributors\">Technical Design and Development Information<\/a><\/b><br><br><b>Contact Information<\/b><br>For further information regarding the content, CME credit or if you experience any technical difficulties with this enduring material please send an email to&nbsp;<a target=\"_blank\" href=\"mailto:cmeonline@stanford.edu\">cmeonline@stanford.edu<\/a><br><br><b>Accreditation and Designation of Credits<\/b><br>The Stanford University School of Medicine is accredited by the Accreditation Council for Continuing Medical Education (ACCME) to provide continuing medical education for physicians.<br><br>The Stanford University School of Medicine designates this enduring material for a maximum of 1.0&nbsp;<i>AMA PRA Category 1 Credit(s)™.<\/i>&nbsp;Physicians should claim only the credit commensurate with the extent of their participation in the activity.<br><br>The California Board of Registered Nursing recognizes that Continuing Medical Education (CME) is acceptable for meeting RN continuing education requirements; as long as the course is certified&nbsp;<i>AMA PRA Category 1 Credit(s)™<\/i>&nbsp;(rn.ca.gov). Nurses will receive a Certificate of Participation following this activity that may be used for license renewal.<br><br><b>Commercial Support Acknowledgement<\/b><br>Stanford University School of Medicine has received and has used undesignated program funding from Pfizer, Inc. to facilitate the development of innovative CME activities designed to enhance physician competence and performance and to implement advanced technology. A portion of this funding supports this activity.<br><br><b>California Assembly Bill 1195 – Cultural and Linguistic Competency<\/b><br>California Assembly Bill 1195 requires continuing medical education activities with patient care components to include curriculum in the subjects of cultural and linguistic competency. It is the intent of the bill, which went into effect July 1, 2006, to encourage physicians and surgeons, CME providers in the State of California and the Accreditation Council for Continuing Medical Education to meet the cultural and linguistic concerns of a diverse patient population through appropriate professional development. The planners and speakers of this CME activity have been encouraged to address cultural issues relevant to their topic area. The Stanford University School of Medicine Multicultural Health Portal also contains many useful cultural and linguistic competency tools including culture guides, language access information and pertinent state and federal laws. You are encouraged to visit the portal:&nbsp;<a target=\"_blank\" href=\"http:\/\/lane.stanford.edu\/portals\/cultural.html\">lane.stanford.edu\/portals\/cultural.html<\/a><br><br><b>Privacy<\/b><br><a target=\"_blank\" href=\"http:\/\/cme.stanford.edu\/policies\/privacy.html\">cme.stanford.edu\/policies\/privacy.html<\/a><br><br><b>Terms of Use<\/b><br><a target=\"_blank\" href=\"http:\/\/www.stanford.edu\/site\/terms\">www.stanford.edu\/site\/terms<\/a><br><br><br><br>",
    "targetAudience": 2,
    "courseSyllabus": "<p><\/p>\n<p><b><u>Table of Contents:<\/u><\/b><br><\/p>\n<p><\/p><ul><li>Module 1: Cancer clinical trial basics (13:51)<\/li><li>Module 2: Cultural humility in cancer clinical trials education and referral among Asian Americans (14:20)<\/li><li>Module 3:&nbsp;Resources and practical tips for increasing Asian American participation in cancer clinical trials (12:45)<\/li><\/ul><p><\/p>\n\n\n<p><\/p>\n<p><\/p><br>",
    "estimatedClassWorkload": "1-2 hours\/week",
    "recommendedBackground": "",
    "links": {

    }
}