{
    "id": 2208,
    "shortName": "bibrain",
    "name": "The Bilingual Brain",
    "language": "en",
    "shortDescription": "This course explores the brain bases of bilingualism by discussing literature relevant to differences in age of initial learning, proficiency, and control in the nonverbal, single language and dual-language literature.  Participants will learn about the latest research related to how humans learn one or two languages and other cognitive skills.",
    "aboutTheCourse": "<p>How do two languages get processed in one brain? For over 100 years,\nresearchers have asked this question in a variety of manners.&nbsp; From this early literature, there emerged\nthree basic principles that influence the neural bases of bilingualism: when a\nlanguage is learned (age of acquisition), how well it is spoken (proficiency),\nand the control needed to switch or select a particular language (cognitive\ncontrol).&nbsp; Interestingly, age of\nacquisition, language proficiency, and cognitive control are not specific to learning\ntwo languages.&nbsp; The topics appear both in\nthe acquisition of a first language and of nonverbal skills such as music and\nsports.&nbsp; <\/p>\n\n<p>&nbsp;<\/p>\n\n<p>An introduction during the first week sets the stage for how the\ncourse will evolve in each of the subsequent weeks.&nbsp; After that the course is structured across\nthe three main topics, age of acquisition, proficiency and control.&nbsp; For each of these topics, the first week of\nthe course will introduce the nonverbal and single language literature in order\nto arrive at the key concepts for each fundamental principle.&nbsp; The following week will then take the\nconcepts derived from the non-bilingual literature and apply them to the\nacquisition of two languages.&nbsp; The final\nweek will involve a discussion of how each of the factors work together across\ntime.&nbsp; It will consider computer\nsimulations of bilingualism as well as a novel conceptual model of bilingual\nbrain representation.&nbsp; This model\nproposes that bilingualism like other skills emerges from a set of different processing\nmechanisms that are layered over time.&nbsp;\nThe implications of this model for the understanding of language\nlearning in both adults and children will be discussed.<\/p>\n\n\n\n\n\n<br>",
    "targetAudience": 0,
    "courseSyllabus": "<strong>Week 1 - Introduction<\/strong><br>The first week serves as an introduction.&nbsp; It presents the three separate strands that\nwill serve to frame the course. These three issues are age of acquisition,\nlanguage proficiency, and cognitive control. These issues are considered with\nregard to the neuropsychology literature by considering case studies of\nlanguage loss in bilingual patients suffering from brain damage. There is also\nmention of the newer imaging methods that are used to further understand this\nquestion. This section concludes by offering a new way in which biological\n(i.e. brain) approaches serve to elucidate a number of questions in the\ncognitive literature (i.e. the mind). By merging these two approaches, the introduction\nsets up a framing of the main topics that will be considered in the rest of the\ncourse. \n\n\n\n<br><i><strong>Keywords<\/strong>: neuropsychology, cognitive control, language proficiency, age of acquisition<\/i><strong>\n\n<br><br>\nWeek 2 -&nbsp;\n\n\n\n\nAge of Acquisition I\n\n\n\n<\/strong><br>Jean Piaget, the pioneer of cognitive development,\n  proposed that children’s cognitive development occurs in stages as children\n  age. During the first few years of life, thought is centered around a more\n  sensorimotor way of thinking. Slowly this changes as children age and become\n  more focused on the broader patterns that make up the world. This section of\n  the course extends Piaget’s view by looking at how learning changes across\n  age. Specifically, we will consider how early learning is more sensorimotor\n  in nature, with later learning involving more complex cognitive processing.\n  Examples are given from both nonverbal domains as well as from language\n  development in general.\n  \n \n\n\n\n\n\n\n<br><i><strong>Keywords<\/strong>: cognitive development, sensorimotor processing, language development<\/i>\n<br><br>\n<strong>Week 3 -&nbsp;\n\n\n\n\n\nAge of Acquisition II\n\n\n\n<\/strong><br>This section of the course extends the nature of development to two languages. In domains that are close to the sensorimotor system, such as the processing of speech sounds, bilinguals show clear effects of age. Speech sounds in two languages can be learned well early in life, but this becomes much more difficult later in life. Similarly, there is clear evidence that learning grammar in a second language becomes more difficult at older ages. Interestingly, there does not appear to be as strong an age effect for word meaning. This suggests that more cognitive types of processing are not affected by age of learning in bilinguals. The similarities in the ability to use cognitive types of processing by late learners across a variety of domains is discussed.<br>\n<i><strong>Keywords<\/strong>:&nbsp; speech sounds, grammar, bilinguals, development, monolinguals<\/i>\n<br><br>\n<strong>Week 4 - Proficiency I<\/strong><br>The nature of expertise has long been the topic of study outside of the bilingualism literature. This started with seminal work by Adriaan de Groot, who noted that master chess players were more efficient at making chess moves. It was further developed by K. Anders Ericsson, who found that expertise develops through practice as an individual receives feedback about his or her performance over time. The adjustments made eventually lead to automaticity and to the ability to do things in a less conscious manner. The automaticity of these processes is also revealed in the efficiency of neural circuits. As such, experts show much smaller localized regions of brain activity when performing in their particular domain of expertise.&nbsp; The importance of the environment and practice can also been seen in the effect of proficiency on the development of a single language.<br><i><strong>Keywords<\/strong>: expertise, automaticity, practice<\/i>\n<br><br>\n<strong>Week 5 -&nbsp; Proficiency II<\/strong><br>The nature of efficiency is central for the bilingual literature. Pitres was the first to suggest that proficiency was important in bilingual aphasics. He observed that many patients showed preservation of the most familiar language at the time of insult. Proficiency is also a key concept in the bilingual literature. This can be seen in cases of language loss, in which a second language learned in childhood actually replaces the first language. It can also be seen in cases of language immersion, in which the first language comes to represent the weaker language. Finally, this section of the course will consider the distinction between basic language and academic language. It is in academic language that we see the effects of language proficiency. Whereas ability to produce speech sounds is driven by how early a language is learned, the deeper conceptual processing needed for academic language is closely linked with proficiency. <br><i><strong>Keywords<\/strong>: familiarity, language loss, academic language<\/i><br><br>\n\n<strong>Week 6 - Control I<\/strong><br>The first week in this section of the course considers the nature of cognitive control. The importance of switching can be seen in everyday activities. For example, when switching lanes a driver has to pay attention to the traffic in front, behind, and to the side. Most people will switch their attention across all three places, demonstrating flexibility. As such, switching need not contain any language. This section of the course considers switching and control with and without language. It ends by suggesting the importance of adjustments as an essential part of cognitive processing.<br><i><strong>Keywords<\/strong>: switching, control, flexibility <\/i>\n\n<br><br>\n<strong>Week 7 - Control II<\/strong><br>The importance of adjustments is a key concept that emerges from the task shifting literature. Interestingly, it is also something that describes the nature of bilingual language experience. It is not unusual for a person to have to navigate different language scenarios on a daily basis. Recent work suggests that bilinguals show interesting benefits from navigating a dual-language reality. Interestingly, these benefits appear in control tasks even when they involve little use of language. There is also evidence that this enhanced control shows up as enhanced flexibility. This flexibility in processing can be seen in the learning of new foreign language vocabulary. In short, bilingualism may serve as the ultimate delayed gratification task. It requires people to put one thing off in order to do another. This modulation of attention may play a role in the development of cognitive control.<br><i><strong>Keywords<\/strong>: control, flexibility, cognitive benefits<\/i>\n\n<br><br>\n<strong>Week 8 - Conclusion<\/strong><br>The final chapter summarizes and extends the points brought up across the entire course. In previous weeks, age of acquisition, proficiency, and control were covered as separate topics. However, these three factors show considerable interaction. Recent models of bilingualism also suggest an interesting interplay between both languages. The most fascinating aspect is that bilingual researchers have come to describe a language as being parasitic on another or as one language being dominant. The use of biological language suggests that future researchers will need to take both a neural and computational approach in order to further understand how two languages develop in one mind. <br><i><strong>Keywords<\/strong>: age of acquisition, proficiency, control, interplay, computational approach<\/i>",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": "All welcome. No previous knowledge required.<br>",
    "links": {}
}