{
    "id": 527,
    "shortName": "healthcaresafety",
    "name": "The Science of Safety in Healthcare",
    "language": "en",
    "shortDescription": "Health professionals and students and health consumers interested in learning about patient safety will acquire foundational knowledge of the principles of the science and culture of safety in healthcare in this five-week course.",
    "aboutTheCourse": "<p><b>ENROLLMENT OPTIONS<\/b><\/p><p>Those interested in participating in this&nbsp;course have three options:<\/p><ol><li><b>Free Enrollment:&nbsp;<\/b>&nbsp;Click “Sign Up” to enroll in course for FREE and earn a statement of accomplishment upon completion.<\/li><li><b>Signature Track Enrollment:&nbsp;<\/b>&nbsp;Click\n “Signature Track” and follow the enrollment steps.&nbsp; You will be \nrequired to pay a $39 non-refundable fee.&nbsp; Upon course completion you \nwill receive a verified certificate, which employers can search.&nbsp;<a href=\"http:\/\/help.coursera.org\/customer\/portal\/articles\/1167998-what-is-a-verified-certificate-how-can-i-use-it-\">What’s this?<\/a><\/li><li><b>Continuing Nursing Education (CNE) Credit:<\/b>&nbsp; For healthcare professionals interested in earning Continuing Nurse Education (CNE) contact hours you must:<\/li><\/ol><ul><li>Complete Signature Track enrollment.&nbsp;<br><\/li><li>Complete\n registration process through Johns Hopkins University School of \nNursing. You will be required to pay an additional non-refundable fee of\n $60 in addition to the $39 fee for signature track.&nbsp;<br><\/li><\/ul><p><b>SIGNING UP FOR CNE CREDIT<\/b><\/p><p>If\n you’re interested in signing up for CNE Credit and have already signed \nup for Signature Track, click this link to register for CNE: <a href=\"https:\/\/www.regonline.com\/scienceofsafety\">https:\/\/www.regonline.com\/scienceofsafety<\/a><\/p><p><b>ABOUT THE COURSE<\/b><\/p><div>Almost everyone will be a patient at some point in their lives. Estimates suggest that over 98,000 patients die in US hospitals each year due to medical errors; making medical errors a leading cause of death. Adverse events in healthcare often result from problems in the complex systems of care. Improving patient safety demands a complex system-wide effort, involving a wide range of actions in performance improvement, environmental safety and risk management. Healthcare professionals and consumers must partner in these efforts.<\/div><div><br>The content of this course has been adapted from the intensive five-day Patient Safety Certificate Program offered by the Johns Hopkins Armstrong Institute for Patient Safety and Quality as well as the Helene Fuld Fellows Program undergraduate course content from the Johns Hopkins University School of Nursing.<\/div>",
    "targetAudience": 1,
    "courseSyllabus": "<p>WEEK I: <b>Overview:<\/b> In this module, an overview of the science of safety and an introduction to a culture of safety in healthcare will be provided.<\/p>\n\n<ul><li>Patient Safety Q&amp;A<br><\/li><li>Creating a Culture of Safety<\/li><li>The Science of Safety<\/li><\/ul>\n\n\n\n\n\n\n\n<p>WEEK 2: <b>Enabling and Contextual Factors Influencing Patient Safety and Quality: <\/b>Enabling and contextual factors, including communication, teamwork, and healthcare human factors, that influence patient safety and quality will be explored in this module.&nbsp; Complementary presentations by JHU faculty will introduce strategies to enhance communication and teamwork.<\/p>\n\n<ul><li>Leadership to Enhance Communication<\/li><li>Communication Toolkit I: Effective Communication<\/li><li>Communication Toolkit II: Teamwork <\/li><li>Human and Environmental Factors: Contribution to Error<\/li><li>Patient Involvement in Patient Safety<\/li><li>Increasing Family Participation in Care<\/li><\/ul>\n\n<p>WEEK 3: <b>Methods to Improve Safety and Quality<\/b>: Given the system complexity and various sources of healthcare safety and quality defects, multiple methodologies are required to improve safety and quality.&nbsp; In addition, sound measurement approaches are required to know whether risk has been reduced.&nbsp; In this module, several examples of available methodologies to improve safety as well as measurement strategies will be examined.<\/p><ul><li>Understanding CUSP and the CUSP Team<\/li><li>Learning from Defects in Patient Care<\/li><li>Using Event Reports to Design Safer Systems<\/li><li>Measuring Success in Safety Initiatives<\/li><li>Disclosing Adverse Events<\/li><li>Patient Centered Care<\/li><\/ul>\n\n\n\n<p>WEEK 4: <b>Translating Evidence Into Practice and Leading Change:<\/b> In this module learners will explore the TRiP Model for translating evidence into practice, review an integrated approach to improving the reliability of care, and distinguish the technical and adaptive challenges of safety and quality improvement.<\/p>\n\n<ul><li>Translating Evidence into Practice<\/li><li>Leading Change<\/li><li>The Need for Improvement Science<\/li><li>What Can You Do to Improve Patient Safety?<\/li><li>The Business Case for Patient Safety<\/li><li>Q\nand A&nbsp; \"Ask us anything\"<\/li><\/ul>\n\n<p>WEEK 5: <b>Summary\nand future challenges <\/b><\/p>\n\n<ul><li>Meet the Patient Safety Experts<br><\/li><li>Patient Safety Fellowship<br><\/li><li>Opportunities for Learning at the Armstrong Institute<br><\/li><li>Opportunities for Learning at the JHU School of Nursing<br><\/li><\/ul>",
    "estimatedClassWorkload": "2-5 hours\/week",
    "recommendedBackground": "",
    "links": {}
}