{"id":2854,"shortName":"entstrategicmgmt","name":"Entrepreneurial Strategic Management","language":"en","shortDescription":"Este curso presenta a los estudiantes una comprensión fundamental del desarrollo de una ventaja competitiva sustentable en un negocio existente o nuevo.\n\n\nThis course introduces students to a fundamental understanding of development of a sustainable competitive advantage in a new or existing business.","aboutTheCourse":"Este curso utiliza un enfoque basado en la investigación para entender las fuentes de las ventajas competitivas en las compañias y otras organizaciones.<br><br>This course utilizes an inquiry based approach to understanding sources of competitive advantages in companies and other organizations.<br><br>","targetAudience":0,"courseSyllabus":"1. How do we measure the success of a business?<br>2. How does the business environment influence the success of a company?<br>3. How can a company develop unique internal sources of competitive advantage?<br>4. How can you predict which company will win in competition?<br>5. How can companies deal with disruptions in the marketplace?<br>","courseFormat":"This course will consist of lecture videos given by the instructor which will be 8-12 minutes in<br>length. Each week will include several videos Each week will begin with a question. The videos will explore that question with a combination of the the professor speaking, the professor in a picture in picture and a PowerPoint or the PowerPoint and instructor audio. In addition, there will be standalone homework (peer graded writing) assignments and quizzes at the end of each weekly module. Video content will be complemented with the PowerPoint slides and supplementary freely available print, audio and video resources.<br>","suggestedReadings":"The lectures are designed to be self-contained; no additional readings are necessary.<br>","estimatedClassWorkload":"3-6 hours\/week","recommendedBackground":"No background is required; all are welcome!<br>","links":{}}