{
    "id": 2291,
    "shortName": "neurofinalproject",
    "name": "Neuroscience: Perception, Action and the Brain Capstone",
    "language": "en",
    "shortDescription": "In this capstone students will have a choice of three projects related to perception, to be completed across 6 weeks: (1) write a research proposal, (2) write a popular press article, or (3) create a video demonstration or multimedia application. ",
    "aboutTheCourse": "After completing the three required courses in this Specialization, learners will have a good background in the overall organization and function of the human brain and how it supports visual perception, spatial processing and successful interaction with a complex world. We know participants in this Specialization come from a variety of backgrounds and are interested in applying the knowledge gained in neuroscience and perception in different ways; therefore, this final capstone project will offer three options from which to choose:<br><br>(1) write a research proposal (for experimental research on perception and action) OR<div>(2) write a popular press article (in non-technical language) that summarizes \ncurrent knowledge about a topic pertinent to perception and action OR<br>(3) create a video demonstration or multimedia application (a virtual or real-world demonstration of how sensory signals give rise to perceptions and\/or actions)<br><\/div><br>We hope one of these project options will be intrinsically interesting to you, as well as guiding you to create a practical product for your future needs, such as enhancing skills in your current career area, or preparing for future career opportunities.<br><br>",
    "targetAudience": 1,
    "courseSyllabus": "This 6-week capstone project offers students a choice of three options related: (1) write a research proposal (2) write a popular press article OR (3) create a video demonstration or multimedia application. The development of the capstone project will occur across 6 weeks, and participants will receive peer feedback at each phase of development.<br><br>Week 1: Proposal Idea - Identify which project you will complete, your intended audience, and how you intend to carry out your idea. How does your idea relate to concepts discussed in the component courses of “Neuroscience: Perception, Action, and the Brain?\" (Your proposal idea will be informally assessed and participants will receive feedback in the capstone discussion forum.)<br><br>Week 2: Summary - Your summary will take the form of a well developed outline or storyboard. (Your summary will be informally assessed and learners will receive feedback in the course discussion forum.)<br><br>Weeks 3 - 4: Develop first draft of project submission (Your submission will be assessed by other students using peer assessment.)<br><br>Weeks 5 - 6: Final project submission due (this will be assessed by other students using&nbsp; peer assessment).<br><br>Throughout the course, students will be engaged in active discussion and will receive timely feedback on their peer assessed projects.<br>",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": "None necessary, but some familiarity with the principles of neuroscience will be useful.<br><br><br>",
    "links": {

    }
}