{"id":243,"shortName":"needpsych","name":"Why We Need Psychology","language":"en","shortDescription":"For adults with an interest in the study of human behaviour – especially those who have often considered studying psychology but who have yet to begin.   ","aboutTheCourse":"<b>PLEASE NOTE: due to an unforeseen delay in the launch of the University of London International Programmes' undergraduate Psychology programme, on which our Why We Need Psychology Coursera MOOC is based, we will not be able to launch this MOOC as planned in 2013. &nbsp;<\/b><div><br><\/div><div><b>We will announce a confirmed launch date as soon as we can: if you are already registered for this course, you will be notified once a new date has been announced; if you have yet to register, feel free to click the ‘add to watchlist’ button above this message to receive a notification.<\/b><\/div><br>This course will introduce students to the discipline of psychology: in particular to the main schools of thought employed to explain human behaviour and to the potential applications of psychology in practice.&nbsp;","targetAudience":0,"courseSyllabus":"","courseFormat":"<p>This course includes 6 sessions. The first\nwill introduce a complex, challenging ‘real life’ problem and explore the range\nof potential explanations. The following sessions will consider how five of the\nmain schools of psychology might support our understanding. <\/p>\n\nIn\neach session students will be guided through a range of study activities: they\nwill watch short video tutorials, undertake independent reading, take part in learning\nactivities and complete short assignments. There will be opportunities to\nengage online with other students. Each session will require students to\nundertake up to 10 hours study.","suggestedReadings":"<p>For those students who would like to\nundertake some initial background reading, the following text is recommended: &nbsp;<\/p>\n\n<p><span>Holt, A., Bremner, A., Sutherland, E.,\nVliek, M., Passer, M.W. and Smith. R.E. (2012). <i><a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=needpsych&isbn_ean=9780073532127\">Psychology: The science of mind\nand behaviour, 2nd Ed<\/a><\/i><a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=needpsych&isbn_ean=9780073532127\">.<\/a> Maidenhead, UK: McGraw-Hill.<\/span><\/p>","instructor":"Simon  Green","estimatedClassWorkload":"8-10 hours\/week","recommendedBackground":"<p>This is an open access course that assumes\nno previous knowledge of psychology.&nbsp;<\/p>","links":{}}