{"id":192,"shortName":"genrx","name":"Generation Rx: The Science Behind Prescription Drug Abuse","language":"en","shortDescription":"Think that a prescription medication must be safer than a “street drug”? Think again. Investigate the epidemic rise of prescription drug abuse and use science to debunk commonly held misconceptions regarding this phenomenon.","aboutTheCourse":"<span>We are Generation Rx. <br><br>As a society, we have become more and more “pharmaceuticalized”. We expect a quick fix for almost any medical problem. We refer to ample amounts of medical information (or mis-information) online, sometimes without the guidance of a health professional. We are taking prescription and over-the-counter medications at unprecedented rates, and there are benefits to this phenomenon, including in many cases, improved disease treatment. Sadly, a darker consequence has also emerged: the epidemic rise of injuries and fatalities due to prescription drug abuse. <br><br>This course uses science to investigate the prevalence, dangers, and misperceptions regarding this growing health problem. Using a myth-busting design, we will investigate the biology behind both therapeutic and illicit drug action and tie that biology to the real dangers of abusing prescription drugs. Additionally, we will explore societal influences on drug-taking behaviors and identify best medication-taking practices for our benefit as well as others’.<\/span>","targetAudience":0,"courseSyllabus":"Module One: What is Generation Rx?<br>Module Two: Myth - <i>Everyone else is doing it, so why shouldn't I?<\/i><br>Module Three: Myth - <i>Prescription drugs must be safer than street drugs.<\/i><br>Module Four: Myth - <i>It is only a problem if I'm trying to get high.<\/i><br>Module Five: Myth - <i>Prescription drugs cannot be addictive.<\/i><br>Module Six: Where to go from here...<br>","courseFormat":"The class will consist of short lecture videos (5-10 minutes), each typically investigating the statistics and basic science underlying the prescription drug abuse epidemic.  Supplementary readings will also be assigned and may be used in online peer discussions.","suggestedReadings":"To be assigned during the class<br>","instructor":"Nicole Cartwright Kwiek, Ph.D.","estimatedClassWorkload":"1-2 hours\/week","recommendedBackground":"None. However, we will investigate the basic science of drug action, and therefore a high school level-understanding of biology is recommended.","links":{}}