{"id":774,"shortName":"pmhdepression","name":"Major Depression in the Population: A Public Health Approach","language":"en","shortDescription":"Illustrates the principles of public health applied to depressive disorder, including principles of epidemiology, transcultural psychiatry, health services research, and prevention.","aboutTheCourse":"<p>Public\nMental Health is the application of the principles of medicine and social\nscience to prevent the occurrence of mental and behavioral disorders and to\npromote mental health of the population.&nbsp;This course illustrates the principles of public health applied to\ndepressive disorder, including principles of epidemiology, transcultural\npsychiatry, health services research, and prevention.&nbsp;It is predicted that by 2020 depressive disorder will be the\nmost important cause of disease burden in the entire world!&nbsp; Every human being suffers from feeling\ndepressed at some point or other, but only about one fifth of the population\nwill experience an episode of depressive disorder over the course of their\nlives.&nbsp;This course\nilluminates the public health approach to disease, and the particular\ncomplexities of applying this approach to mental disorders, using depression as\nthe exemplar.&nbsp;&nbsp;<\/p>\n<br>\nDeveloped in collaboration with <a href=http:\/\/www.jhsph.edu\/offices-and-services\/center-for-teaching-and-learning\/our-services\/open-education-lab\/index.html>Johns Hopkins Open Education Lab<\/a>.","targetAudience":1,"courseSyllabus":"<p><\/p><ul><li>What is depression and what is depressive\ndisorder?<br><\/li><li>How common is depressive disorder<br><\/li><li>The Global Burden of Depressive\nDisorder<br><\/li><li>Crosscultural variation in\ndepression and depressive disorder<br><\/li><li>Epidemiologic research to uncover\nthe causes of depression<br><\/li><li>Research on prevention of depression<br><\/li><li>The system of care for psychiatric\ndisorders and depression<br><\/li><\/ul><p><\/p>","courseFormat":"Instruction in this course will consist of a series of video lectures delivered by experts in the field. Each week, students will view lectures, take a quiz, and participate in online discussions. Students will also complete two peer-assessed assignments during the course and perform evaluations of their classmates' submissions.","suggestedReadings":"<a href=\"http:\/\/www.amazon.com\/Public-Mental-Health-William-Eaton\/dp\/0190211164\/\" target=\"_blank\">Public Mental Health<\/a>&nbsp;edited by William W. Eaton is recommended, but not required.","estimatedClassWorkload":"2-5 hours\/week","recommendedBackground":"","links":{}}