{"id":924,"shortName":"chem99","name":"Introduction to Chemistry","language":"en","shortDescription":"This is an introductory course for students with limited background in chemistry; chemical problem solving will be emphasized with the goal of preparing students for further study in chemistry.","aboutTheCourse":"<br><strong>Please Note: &nbsp;If you are signing up for the new run of Introduction to Chemistry that begins August 25th, the course has been split into two parts.<\/strong><br><br><strong>To sign up for the new run of Introduction to Chemistry, please go to this url<\/strong><br><a href=\"https:\/\/class.coursera.org\/chem991-001\" title=\"Link: https:\/\/class.coursera.org\/chem991-001\"><strong>https:\/\/class.coursera.org\/chem991-001<\/strong><\/a><strong>&nbsp;and enroll in this new version of the course.<\/strong><br><br>This is an introductory course for students with limited or no background in chemistry; chemical problem solving will be emphasized. The goal of the course is to prepare students for further study in the chemistry needed\nfor many science, health, and policy professions. Topics include introductions to atoms, molecules, ions, the periodic table, stoichiometry, chemical reactions, bonding, thermochemistry, and gas laws.\n<br>\n<br>Each week the course will contain short video lectures with interactive questions embedded in the lectures. Students will have opportunities to practice each week via exercises at two levels of depth: one set of foundational\nproblems directly related to lecture videos and another set of problems requiring more synthesis of ideas and application of pre-existing algebra skills. Students who complete the course while earning an average of 70% of more on the foundational problem\nsets, writing assignment, and exams will receive a signed statement of accomplishment. Students who complete the course and achieve an average of 85% or more on the foundational problem sets, advanced problem sets, writing assignment, and exams will receive\na signed statement of accomplishment with distinction.<br><br>Course icon from <a href=\"http:\/\/commons.wikimedia.org\/wiki\/File:Glass_is_Liquide.jpg\" target=\"_blank\">Wikimedia commons<\/a>.<br>","targetAudience":0,"courseSyllabus":"<u>Week One<\/u>: Introductions with an overview of scientific methods, scientific notation, measurements, units and unit conversions, using proper significant figures to indicate precision, general concepts in matter and energy including definitions of\natoms, elements, molecules, and compounds, chemical formula stoichiometry, basic layout of the periodic table, endothermic and exothermic reactions, Coulomb’s law, and heat capacity.\n<br>\n<br>\n<u>Week Two<\/u>: More study of atomic and molecular structure, information on the periodic table including some periodic trends, the subatomic particles most critical to chemical reaction and calculations, ions, isotopes, atomic and molecular mass, moles,\nintroduction to ionic and covalent bonding concepts, and nomenclature including some polyatomic ions.\n<br>\n<br>\n<u>Week Three<\/u>: Introduction to chemical composition calculations (compound stoichiometry); introduction to chemical reaction equations, including identifying and balancing simple acid-base, redox, dissolution, and precipitation reactions; more practice\nwith gram\/mole calculations.\n<br>\n<br>\n<u>Week Four<\/u>: Reaction calculations, including limiting reagent, yield, and enthalpy changes; practice writing and balancing chemical reaction equations; stoichiometry practice and review. Work on writing assignment.\n<br>\n<br>\n<u>Week Five<\/u>: No new topics this week. Complete mid-term exam and peer review process on writing assignment.<br><br>\n<u>Week Six<\/u>:  Introduction to light, Bohr model of the hydrogen atom, atomic orbitals, electron configurations, valence versus core electrons, more information about periodicity.<br><br>\n\n<u>Week Seven<\/u>:   Introduction to chemical bonding concepts including sigma and pi bonds, Lewis dot structures, resonance, formal charge, hybridization of the main group elements, introduction to molecular shapes.<br><br>\n\n<u>Week Eight<\/u>:  Introduction to intermolecular forces, states of matter, phase changes and phase diagrams, ideal gas laws, kinetic molecular theory of gases, properties of solids and liquids.<br><br>\n\n<u>Week Nine<\/u>:  Review solutions, review polarity, electrolytes, concentration units including molarity and mass percent, solubility, solubility product constant, and dilutions.  Complete final exam.","courseFormat":"The class will consist of lecture videos, which are generally between 8 and 15 minutes in length. These each contain some integrated concept check questions. There will also be standalone homework exercises for practice that are not part of video lectures, one short writing assignment (less than a page) with peer review, and a required mid-term and final exam.<br>","suggestedReadings":"Students can benefit from reading the relevant sections of any introductory college general chemistry textbook.&nbsp; I recommend Nivaldo Tro’s book <i><a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=chem99&isbn_ean=9780321725998\" target=\"_blank\">Introduction to Chemistry: Essentials<\/a><\/i>, but this is completely <b>optional<\/b>.\n<br>","estimatedClassWorkload":"6-8 hours\/week","recommendedBackground":"Students should have a background in high school level algebra and should bring their enthusiasm for learning and curiosity to the course.<br>","links":{}}