{
    "id": 20,
    "shortName": "gametheory",
    "name": "Game Theory",
    "language": "en",
    "shortDescription": "The course covers the basics: representing games and strategies, the extensive form (which computer scientists call game trees), repeated and stochastic games, coalitional games, and Bayesian games (modeling things like auctions).",
    "aboutTheCourse": "Popularized by movies such as \"A Beautiful Mind\", game theory is the mathematical modeling of strategic interaction among rational (and irrational) agents. Beyond what we call 'games' in common language, such as chess, poker, soccer, etc., it includes the modeling of conflict among nations, political campaigns, competition among firms, and trading behavior in markets such as the NYSE. How could you begin to model eBay, Google keyword auctions, and peer to peer file-sharing networks, without accounting for the incentives of the people using them? The course will provide the basics: representing games and strategies, the extensive form (which computer scientists call game trees), Bayesian games (modeling things like auctions), repeated and stochastic games, and more. We'll include a variety of examples including classic games and real-world applications.",
    "targetAudience": 1,
    "courseSyllabus": "<p><b>Week 1. Introduction:<\/b>  Introduction, overview, uses of game theory,\nsome applications and examples, and formal definitions of: the normal form,\npayoffs, strategies, pure strategy Nash equilibrium, dominated strategies.<\/p>\n\n<p><b>Week 2. Mixed-strategy\nNash equilibria:<\/b> Definitions, examples, real-world evidence.<\/p>\n\n<p><b>Week 3. Alternate\nsolution concepts: <\/b>iterative removal of strictly dominated strategies,\nminimax strategies and the minimax theorem for zero-sum game, correlated equilibria.<\/p>\n\n<p><b>Week 4.\nExtensive-form games:<\/b> Perfect information games: trees, players assigned to\nnodes, payoffs, backward Induction, subgame perfect equilibrium, introduction\nto imperfect-information games, mixed versus behavioral strategies.<\/p>\n\n<p><b>Week 5. Repeated\ngames:<\/b> Repeated prisoners dilemma, finite and infinite repeated games,\nlimited-average versus future-discounted reward, folk theorems, stochastic\ngames and learning.<\/p>\n\n<p><b>Week 6. Coalitional games:\n<\/b>Transferable utility cooperative games, Shapley value, Core, applications.<\/p>\n\n<p><b>Week 7. Bayesian\ngames: <\/b>General definitions, ex ante\/interim Bayesian Nash equilibrium.<\/p>",
    "estimatedClassWorkload": "5-7 hours\/week",
    "recommendedBackground": "You must be comfortable with mathematical thinking and rigorous \narguments. Relatively little specific math is required; the course \ninvolves lightweight probability theory (for example, you should know \nwhat a conditional probability is) and very lightweight calculus (for \ninstance, taking a derivative).<br>",
    "links": {

    }
}