{"id":2177,"shortName":"techcommercialpart1","name":"Technology Commercialization, Part 1: Setting up your Idea Filtering System","language":"en","shortDescription":"New ideas based on high-technology research have a high failure rate because they hit the ground running with lopsided priorities and misalignments. Students complete this course with an Innovation Creed (“Why are you doing this?”) and a customized Idea Filter (“Are you working on the right priorities?”)—2 simple tools that steer concept-stage commercialization to success.","aboutTheCourse":"This course is applicable to anyone in any setting who wants to improve their ability to generate winning entrepreneurial ideas and shape them for success. <br><br>While the course nomenclature will align most directly to high-technology for-profit new product ideas, its content is also applicable to all types of entrepreneurs, engineers, technology transfer offices, garage start-up companies, venture capital firms, angel investors, low-tech-no-tech ideas, not-for-profit ideas, lifestyle businesses, and social entrepreneurship.<br><p><span><br><\/span><\/p><p><span>Launching an engineered\nproduct based on hard-science, research, and patents takes an average of 3 to 5\nyears with $5 to $10 million dollars at stake.&nbsp;\n<i>Hard-science <\/i>technology products\nare profoundly different than <i>information\n<\/i>technology products, such as websites and apps, e.g., that can be\nprototyped in a weekend, tested with little risk of death or destruction, and easily\nimproved or pivoted with software revisions.<\/span><\/p>\n\n\n\n<p>Given the time and money\ninvolved, the exponentially ratcheting costs of changes, and an often-underrepresented\nappreciation of critical market factors, the commercialization process for\nR&amp;D-based ideas deserves a front-end framework.<\/p>\n\n\n\n<p><span>Despite this obvious\nrationale, the road of startup companies and new products is littered with\nfailures because <i>the idea had no rudder\nduring the early concept stage. &nbsp;<\/i>Given\nthe complexity of possible offerings, a general enthusiasm for certain\npriorities and disregard for others; lack of discussion around the purpose of\nthe undertaking; little consideration for how success will be measured; and a natural\ntendency to avoid obstacles, a team often jumps in over enthusiastically toward\na commercial market, spending months (or years) and thousands of dollars (or\nmillions) committed to a pathway that latter turns out to be stunted by\n“obvious” shortcomings. <\/span><\/p>\n\n\n\n<p><span>In this course, we will delve\ninto the most fundamental question every entrepreneur should ask themselves\nright up front: “<i>Why am I doing this<\/i>?”\nThe need for an <i>Innovation Creed<\/i>\napplies to any scenario: from garage start-up to new product development to\nradical business development to mergers and acquisitions.&nbsp;&nbsp; <\/span><\/p>\n\n<p><span>While the subtleties of failures\nare infinite, the general categories are quite small.&nbsp; Sixteen top challenges stunting technology\ncommercialization will be presented and then built into an <i>Idea Filter<\/i> that helps force-rank a portfolio of ideas, screen\nideas for strong and weak points, prioritize next critical action, and shape\nideas to maximize their chance of success and alignment with the Creed.<\/span>\n\n\n\n\n\n<br><\/p>","targetAudience":1,"courseSyllabus":"<strong>Week One<\/strong><br>•&nbsp;&nbsp; &nbsp;Welcome to the technology commercialization revolution!<br>•&nbsp;&nbsp; &nbsp;Foundational starting point: Your Innovation Creed<br><br><strong>Week Two<\/strong><br>•&nbsp;&nbsp; &nbsp;Top reasons why commercializing technology is so difficult<br><br><strong>Week Three<\/strong><br>•&nbsp;&nbsp; &nbsp;Turning those challenges into an Idea Filter<br><br><strong>Week Four<\/strong><br>•&nbsp;&nbsp; &nbsp;Customizing Your Idea Filter: the best ideas for your particular Creed<br>•&nbsp;&nbsp; &nbsp;Examples of various Filters for differing dimensions of Creed<br>•&nbsp;&nbsp; &nbsp;A sneak-peak at Part Two: Using the Filter to Optimize Ideas for Success.<br>","courseFormat":"The class will consist of lecture videos, \nwhich are between 8 and 12 minutes in length. These contain 1 \nintegrated quiz question per video. There will also be exercises and activities that are submitted as well as online quizzes. <br>","suggestedReadings":"<p>There is no required or\nsuggested prerequisite reading needed to understand the course content.<\/p>","estimatedClassWorkload":"1-3 hours\/week","recommendedBackground":"No formal\npre-requisites.&nbsp; \n\n<p><span>You do not need “ideas” to\nparticipate; actual idea screening will not occur in this course (that is the focus of Part 2)<\/span>. Nonetheless, having a collection of new business\nand\/or new product ideas in the back of your mind will be helpful.\n\n<\/p>\n\n<p>Additionally, the following\nis recommended:&nbsp;\n\n<\/p><p><span>Background knowledge in\nhard-science, engineered products: <i>pharmaceuticals\nand biologics; implantable and disposable medical devices; laboratory, hospital\nand industrial equipment; military systems; telecommunication and computer\nhardware; traditional and alternative energy products; etc.<\/i><\/span><\/p>\n\n\n\n<p><span>A general working knowledge\nof (or desire to learn more about) such things as: <i>the process behind new product development; improving the concept stage\nof ideas;&nbsp; portfolio management; managing\ncreative thinking; tools for problem-solving and decision-making; etc.<\/i><\/span><\/p>","links":{}}