{"id":38,"shortName":"sna","name":"Social Network Analysis","language":"en","shortDescription":"This course will use social network analysis, both its theory and computational tools, to make sense of the social and information networks that have been fueled and rendered accessible by the internet.","aboutTheCourse":"Everything is connected: people, information, events and places, all the more so with the advent of online social media. A practical way of making sense of the tangle of connections is to analyze them as networks. In this course you will learn about the structure and evolution of networks, drawing on knowledge from disciplines as diverse as sociology, mathematics, computer science, economics, and physics. Online interactive demonstrations and hands-on analysis of real-world data sets will focus on a range of tasks: from identifying important nodes in the network, to detecting communities, to tracing information diffusion and opinion formation.","targetAudience":1,"courseSyllabus":"<div><b>Week 1:<\/b> What are networks and what use is it to study them?<\/div>\n<div><\/div>\n<div>Concepts: nodes, edges, adjacency matrix, one and two-mode networks, node degree<\/div>\n<div>Activity: Upload a social network (e.g. your Facebook social network into Gephi and visualize it ).<\/div>\n<div><\/div>\n<div><b>Week 2:<\/b> Random network models: Erdos-Renyi and Barabasi-Albert<\/div>\n<div><\/div>\n<div>Concepts: connected components, giant component, average shortest path, diameter, breadth-first search, preferential attachment<\/div>\n<div>Activities: Create random networks, calculate component distribution, average shortest path, evaluate impact of structure on ability of information to diffuse<\/div>\n<div><\/div>\n<div><b>Week 3:<\/b> Network centrality<\/div>\n<div><\/div>\n<div>Concepts: betweenness, closeness, eigenvector centrality (+ PageRank), network centralization<\/div>\n<div>Activities: calculate and interpret node centrality for real-world networks (your Facebook graph, the Enron corporate email network, Twitter networks, etc.)<\/div>\n<div><\/div>\n<div><b>Week 4:<\/b> Community<\/div>\n<div><\/div>\n<div>Concepts: clustering, community structure, modularity, overlapping communities<\/div>\n<div>Activities: detect and interpret disjoint and overlapping communities in a variety of networks (scientific collaborations, political blogs, cooking ingredients, etc.)<\/div>\n<div><\/div>\n<div><b>Week 5:<\/b> Small world network models, optimization, strategic network formation and search<\/div>\n<div><\/div>\n<div>Concepts: small worlds, geographic networks, decentralized search<\/div>\n<div>Activity: Evaluate whether several real-world networks exhibit small world properties, simulate decentralized search on different topologies, evaluate effect of small-world topology on information diffusion.<\/div>\n<div><\/div>\n<div><b>Week 6:<\/b> Contagion, opinion formation, coordination and cooperation<\/div>\n<div><\/div>\n<div>Concepts: simple contagion, threshold models, opinion formation<\/div>\n<div>Activity: Evaluate via simulation the impact of network structure on the above processes<\/div>\n<div><\/div>\n<div><b>Week 7:<\/b> Cool and unusual applications of SNA<\/div>\n<div><\/div>\n<div>Hidalgo et al. : Predicting economic development using product space networks (which countries produce which products)<\/div>\n<div>Ahn et al., and Teng et al.: Learning about cooking from ingredient and flavor networks<\/div>\n<div>Lusseau et al.: Social networks of dolphins<\/div>\n<div>Activity: hands-on exploration of these networks using concepts learned earlier in the course<\/div>\n<div><\/div>\n<div><b>Week 8:<\/b> SNA and online social networks<\/div>\n<div><\/div>\n<div>Concepts: how services such as Facebook, LinkedIn, Twitter, CouchSurfing, etc. are using SNA to understand their users and improve their functionality<\/div>\n<div>Activity: read recent research by and based on these services and learn how SNA concepts were applied<\/div>","courseFormat":"The class will consist of lecture videos, which are between 8 and 12 minutes in length. These contain 1-2 integrated quiz questions per video. There will also be standalone homeworks that are not part of video lectures, optional programming assignments, and a (not optional) final exam.","suggestedReadings":"If you’d like to get a head start, download <a href=\"http:\/\/gephi.org\/\" target=\"_blank\">Gephi<\/a> and explore some of its tutorials. To explore networks interactively, you can visit the <a href=\"http:\/\/www.ladamic.com\/netlearn\" target=\"_blank\">NetLogo<\/a> demonstrations. If you’re itching to read, the Easley and Kleinberg free text on <a href=\"http:\/\/www.cs.cornell.edu\/home\/kleinber\/networks-book\" title=\"Link: http:\/\/www.cs.cornell.edu\/home\/kleinber\/networks-book\">Networks, Crowds and Markets<\/a> is excellent. The chapters pertinent to this class are 1-5, 13-14,19-21.","instructor":"Lada Adamic","estimatedClassWorkload":"5-7 hours\/week (8-10 if completing additional programming exercises)","recommendedBackground":"There are no math or programming prerequisites for the class. There will be a few additional assignments for those with a programming background, which will use the R statistical programming language along with NetLogo.","links":{}}