{
    "id": 1970,
    "shortName": "epiapps",
    "name": "软件包在流行病学研究中的应用 Using software apps in epidemiological research",
    "language": "zh-cn",
    "shortDescription": "课程的主要目标是：（1）了解流行病学研究过程中，从研究设计、现场数据采集和录入、到数据清理和分析，常用的几种软件包的使用方法；（2）加强研究中对流行病学基础理论知识的灵活应用。",
    "aboutTheCourse": "<p>开展一项流行病学研究需要经历研究设计、现场数据采集和录入、数据清理和分析、报告撰写等众多环节。随着计算机软件包的发展，上述的每个环节都可以通过利用不同的软件包高效率、高质量的实现。本课程期望通过众多的实例练习，并配以必要的流行病学基础知识讲解，使学生能够了解几种常见软件包的使用方法，并能将流行病学基础理论等书本知识更加灵活地应用于实际的研究中。<\/p>\n\n<p><\/p><ul><li>计算样本量是研究设计环节中的关键内容之一。在很多流行病学的教科书中可较容易的查到不同类型研究设计的样本量计算公式；在Google中搜索，也可以找到一些基于Web的样本量计算模块。但是，通过这些途径只可以计算有限设计类型的样本量。本课程将重点介绍PASS软件的使用方法。该软件可以用于230余种统计检验和可信区间估计的样本量计算及功效分析。<br><\/li><li>流行病学研究中的数据可以通过问卷调查、体格检查、生物样本的实验室检测、环境调查与检测、既往记录或档案查阅等方式获取。现阶段，通过这些过程直接获取的仍然以纸介质数据为主，需要利用一些数据录入软件转录为可分析的数据库。本课程将重点介绍EpiData软件的使用方法。该软件的优势在于软件小巧和免费，可满足数据录入的基本功能要求。<br><\/li><li>通过纸质问卷收集调查对象的信息，然后再录入到电脑中，在这个过程中，尽管我们可以通过培训调查员、在问卷上突出注明必要的跳转或合法值要求、调查员自查和互查问卷、在录入数据库中设置必要的核查语句等质量控制措施保证数据质量，但仍然常见数据缺失、逻辑错误等问题。平行双录入耗时耗力，发现问题后可能还需要回访、修正数据。整个过程耗人心力。本课程将简要介绍基于移动设备和网络技术的无纸调查方式，帮助理解如何将数据质量控制的关口前移到调查当时。<br><\/li><li>流行病学研究有多种不同的设计类型，每种设计又对应着一些特有的分析指标。常用的统计软件包可以获得这些指标，但是由于软件是按统计分析方法组织模块，需要使用者熟悉哪个指标对应的是哪种统计方法得来。STATA作为常用的统计软件包之一，专门设计有一个流行病学相关的分析模块，按研究设计组织菜单。因此，本课程以STATA软件包为基础，介绍常用流行病学指标的计算。<br><\/li><li>抽样调查是最常开展的流行病学研究类型之一。在较大范围的抽样调查中，很少单独使用单纯随机抽样，更多的是使用整群抽样或整合单纯、系统、分层、整群抽样的多阶段抽样。这样抽样设计得来的数据通常被称为复杂抽样调查数据（complex survey data）。常见的流行病学教科书中通常只介绍单纯随机抽样时的样本量计算方法，然后给出“整群抽样时再增加一定数量”的简单原则。而通常统计教学中介绍的统计方法更适用于针对单纯随机抽样获得的数据。本课程通过介绍CSurvey软件包的使用，帮助学生更好地理解复杂抽样调查时样本量计算的通用原则；通过介绍STATA中专门针对复杂调查数据的分析模块，使学生能够了解针对此类数据合理的分析方法。<br><\/li><\/ul><p><\/p>\n\n\n\n\n\n\n\n\n\n《软件包在流行病学研究中的应用》是北京大学医学部流行病与卫生统计学学科研究生的专业必修课。本课程也在同期面向北京大学医学部正常选课的研究生开课，采用翻转课堂的教学模式，选课学生在观看MOOC视频、自学相关资源和完成练习后，还需参与教室内的答疑互动。",
    "targetAudience": 1,
    "courseSyllabus": "<p><b>第一周：<\/b><b>PASS<\/b><b>软件包在样本量与功效计算中的应用<\/b><b><\/b><\/p>\n\n<p>介绍利用PASS软件包进行常用流行病学研究设计的样本量和功效计算。<\/p>\n\n<p><b>第二周：<\/b><b>CSurvey<\/b><b>软件包在整群抽样调查中的应用<\/b><b><\/b><\/p>\n\n<p>介绍在两阶段整群抽样调查中利用CSurvey软件包实现样本量计算、PPS抽样和生成随机数字表。<\/p>\n\n<p><b>第三周：<\/b><b>EpiData<\/b><b>软件包在数据录入过程中的应用<\/b><b><\/b><\/p>\n\n<p>介绍利用EpiData软件包建立调查问卷数据库、设置核查语句和录入数据。<\/p>\n\n<p><b>第四周：<\/b><b>EpiData<\/b><b>软件包在数据录入过程中的应用<\/b><b><\/b><\/p>\n\n<p>介绍利用EpiData软件包建立关联数据库，以及后期平行双录入的设置、数据导出等功能。<\/p>\n\n<p><b>第五周：基于移动设备和网络技术的无纸调查方式在调查数据采集过程中的应用<\/b><b><\/b><\/p>\n\n<p>介绍基于B\/S结构的后台管理系统中调查问卷的设置方法，体验基于Android平台的调查软件或基于B\/S结构的浏览器（WAP）客户端在现场调查数据采集中的应用。<\/p>\n\n<p><b>第六周：<\/b><b>STATA<\/b><b>软件包的基本操作<\/b><b><\/b><\/p>\n\n<p>介绍STATA软件包的基本操作方法。<\/p>\n\n<p><b>第七周：<\/b><b>STATA<\/b><b>软件包在常用流行病学指标分析中的应用<\/b><b><\/b><\/p>\n\n<p>重点介绍STATA中Tables for Epidemiologists模块的应用，同时讲解与其他常用分析模块的对应性。<\/p>\n\n<p><b>第八周：<\/b><b>STATA<\/b><b>软件包在复杂抽样调查数据分析中的应用<\/b><b><\/b><\/p>\n\n<p>介绍STATA中Survey data analysis模块在复杂抽样调查数据分析中的应用。<\/p>\n\n<p><b>第九周：<\/b><b>Sublime Text<\/b><b>语句编辑器的简单应用<\/b><b><\/b><\/p>\n\n<p>介绍利用语句编辑器Sublime Text软件包提高统计语句编写的效率和准确性。<\/p>\n\n<p><b>第十周：考试<\/b><b><\/b><\/p>",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": "<p>选课者最好系统学习过本科《流行病学》和《医学统计学》课程，并具备较熟练的计算机基本操作能力。<\/p>",
    "links": {

    }
}