{
    "id": 3252,
    "shortName": "coaching",
    "name": "Conversations that Inspire: Coaching Learning, Leadership and Change",
    "language": "en",
    "shortDescription": "Coaching can inspire and motivate people to learn, change and be effective leaders, among other roles in life. Although most attempts are “coaching for compliance” (coaching someone to your wishes or expectations), decades of behavioral and neuroscience research show us that “coaching with compassion” (coaching someone to their dreams and desires) is more effective. ",
    "aboutTheCourse": "<p>We develop throughout life. Those of us who are able to\ncontinuously develop toward sustained, desired change do so, in part, with the\nhelp of others. This form of helping is called coaching. The result of\neffective coaching is that a person feels excited, motivated and inspired to\nlearn, change and try new things in life. Although not required, this course\nbuilds on concepts introduced in the MOOC entitled Inspiring Leadership through\nEmotional Intelligence.<\/p>\n\n<p>Effective\ncoaching should result in a combination of three changes: (1) the person being\ncoached finds, articulates or reaffirms his or her personal vision, that is\ntheir dreams and passion; (2) the person changes their behavior, thoughts or\nfeelings to move closer to their personal vision; and\/or (3) the person builds\nor maintains a resonant relationship with one or more people. We call this the\nPositive (PEA) and Negative Emotional Attractors (NEA) through Intentional\nChange Theory. Most efforts at trying to help or motivate others are what we\ncall “coaching for compliance,” whether by managers, teachers, doctors, or\nparents. In this approach, the person is brought into the negative emotional\nattractor by someone trying to fix them or tell them how to change. An alternative\nis what we call “coaching with compassion” in which the person is brought into\nthe positive emotional attractor by initially discussing their dreams, values,\nand invoking hope, mindfulness, compassion and even playfulness.<\/p>\n\n<p>Based on decades of our longitudinal\nand neuroscience research into coaching, the course will examine the theory,\nresearch, as well as techniques and skills in effective coaching (i.e.,\ncoaching with compassion). We will explore the building of a coaching\nrelationship, the ethics of helping others. <\/p>\n\n<p>The\ncourse will consist of five weeks, with three modules per week. Each module\nwill consist of a video, some will have assigned and recommended readings, many\nwill have reflective exercises, writing in your Personal Learning Journal, and\non-line, asynchronous discussions. There will be four personal learning\nassignments and five tests of comprehension that will constitute successful\ncompletion of the course.<\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<p><b>Week 1 Coaching to\nInspire and Motivate<\/b><\/p>\n\n<p>Module 1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Introduction to Helping and Coaching<br>Module 2&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Tipping Points in the 5 Discoveries of Sustained, Desired\nChange<br>Module 3&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Role of Positive and Negative Emotional Attractors<br><\/p>\n\n\n\n\n\n<p><b>Week 2 Physiology and Neuroscience of\nCoaching<\/b><\/p>\n\n<p>Module 4&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Physiology of PEA and NEA<br>Module 5&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Our\nNeuroscience Studies of Coaching<br>Module 6&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; \nSeeing Coaching in Action<br><\/p>\n\n\n\n<p><b><\/b><\/p>\n\n<p><b>Week 3 Coaching for the Ideal Self and\nRelationships<\/b><\/p>\n\n<p>Module 7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Pulling\nfor Dreams Not Just Goals: Whose Dream is it?<br>Module 8&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Two\nForms of Empathy<br>Module 9&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Listening\nand Noticing<br><\/p>\n\n\n\n<p><b><\/b><\/p>\n\n<p><b>Week 4\nCoaching for the Real Self, Balance and Learning Agenda<\/b><\/p>\n\n<p>Module 10&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Being\nin Sync<br>Module 11&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Social\nIdentity, Strengths and Weaknesses<br>Module 12&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Old\nand New Ways to Create a Learning Agenda and Planning<br><\/p>\n\n\n\n\n\n<p><b>Week 5 Establishing\na Culture of Coaching<\/b><\/p>\n\n<p>Module 13&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; \nCoaching in Leadership Development<br>Module 14&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Peer\nCoaching as an Organization-wide Sustaining Source of Help<br>Module 15&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In\nSearch of the Coachable Moment<br><\/p>\n\n\n\n\n\n<p><b>&nbsp;<\/b><\/p>",
    "estimatedClassWorkload": "2-3 hours\/week",
    "recommendedBackground": "There are no prerequisites for this course. However, the course will be conducted at the level expected of advanced undergraduate students, graduate students or professionals and executives. Therefore, for all participants, reading and writing comfortably in English at the undergraduate college level is desirable. Although not required, others have found it desirable to have completed the MOOC Inspiring Leadership through Emotional Intelligence.",
    "links": {

    }
}