{"id":56,"shortName":"geneticsevolution","name":"Introduction to Genetics and Evolution","language":"en","shortDescription":"A whirlwind introduction to evolution and genetics, from basic principles to current applications, including how disease genes are mapped, areas or research in evolutionary\ngenetics, and how we leverage evolutionary concepts to aid humanity.","aboutTheCourse":"Introduction to Genetics and Evolution is a college-level class being offered simultaneously to new students at <a href=\"http:\/\/biology.duke.edu\/\" target=\"_blank\">Duke University<\/a>. The course gives interested people a very basic overview of some principles behind these very fundamental areas of biology. &nbsp;We often hear about new \"genome sequences,\" commercial kits that can tell you about your ancestry (including pre-human) from your DNA or disease predispositions, debates about the truth of evolution, why animals behave the way they do, and how people found \"genetic evidence for natural selection.\"&nbsp; This course provides the basic biology you need to understand all of these issues better, tries to clarify some misconceptions, and tries to prepare students for future, more advanced coursework in Biology. &nbsp;No prior coursework is assumed.<br><br>","targetAudience":0,"courseSyllabus":"<div>\n<ul>\n<li>Evidence for evolution<\/li>\n<li>Introduction to basic genetics<\/li>\n<li>Recombination and genetic mapping simple traits<\/li>\n<li>Complications to genetic mapping<\/li>\n<li>Genes vs. environment<\/li>\n<li>Basic population genetics and Hardy-Weinberg<\/li>\n<li>Gene flow, differentiation, inbreeding<\/li>\n<li>Natural selection and genetic drift<\/li>\n<li>Molecular evolution<\/li><li>Adaptive behaviors and sexual selection<\/li><li>Species formation and phylogenetics<br><\/li>\n<li>Evolutionary applications and misapplications<\/li>\n\n<\/ul>\n<\/div><br>","courseFormat":"The class will consist of watching multiple lecture mini-videos which are mostly 10-20 minutes in length. &nbsp;These sometimes contain 1-3 integrated quiz questions per video. &nbsp;There will also be 2 test assessments, including a non-cumulative final exam.","suggestedReadings":"Although the class is largely self-contained, students wanting reinforcement on some of the lecture topics and\/ or to expand their knowledge beyond what we cover in class can find a compelling treatment of the evidence for evolution (as well as related\ntopics) in this short book:\n<br>\n<ul>\n    <li>Coyne, Jerry. 2009. <a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&amp;AFID=301076&amp;ADID=1088031&amp;SID=geneticsevolution&amp;isbn_ean=9780143116646\">Why Evolution Is True<\/a>\n        <img width=\"1\" src=\"http:\/\/www.assoc-amazon.com\/e\/ir?t=coursera-20&amp;l=as2&amp;o=1&amp;a=0143116649\" height=\"1\" style=\"border: none !important; margin: 0px !important;\">\n    <\/li>\n<\/ul>\n<br>For assistance with the genetics and more in-depth evolutionary concepts, these textbooks may be helpful as a supplements to the lectures:\n<br>\n<ul>\n    <li>Griffiths, Anthony, et al. 2010. <a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&amp;AFID=301076&amp;ADID=1088031&amp;SID=geneticsevolution&amp;isbn_ean=9781429229432\">Introduction to Genetic Analysis<\/a>\n        <img width=\"1\" src=\"http:\/\/www.assoc-amazon.com\/e\/ir?t=coursera-20&amp;l=as2&amp;o=1&amp;a=1429229438\" height=\"1\" style=\"border: none !important; margin: 0px !important;\">\n    <\/li>\n    <li>Freeman, Scott, and John Herron. 2013. <a href=\"http:\/\/www.amazon.com\/Evolutionary-Analysis-5th-Edition-Herron\/dp\/0321616677\/\" target=\"_blank\">Evolutionary Analysis<\/a><a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&amp;AFID=301076&amp;ADID=1088031&amp;SID=geneticsevolution&amp;isbn_ean=9780132275842\"><\/a>\n    <\/li>\n<\/ul>\n<br>Various alternative freely available readings will be specified in the course as well.\n<br>\n<br>Finally, if you have an iOS device (e.g., iPhone, iPad, iPod Touch), we recommend this free app, specifically designed to be a supplement to the course and written in part by a former Coursera student in the course:\n<br><a href=\"https:\/\/itunes.apple.com\/us\/app\/genetics-and-evolution\/id650401749\" target=\"_blank\">Genetics and Evolution app<\/a>\n<br>Use of this app is NOT required, however-- it's simply a supplemental tool that can help by allowing you to simulate concepts, test yourself on terms, generate practice problems, and solve some kinds of problems used in the course.\n<br>","instructor":"Mohamed Noor","estimatedClassWorkload":"5-6 hours\/week","recommendedBackground":"No prior coursework in the subject is assumed. It would be helpful for the application of some concepts to have a working knowledge of High School level math, including basic algebra. While useful for solving the assigned problems, this is not essential to understand and follow the general concepts and otherwise enjoy the class.","links":{}}