{
    "id": 469,
    "shortName": "basicwriting",
    "name": "Crafting an Effective Writer: Tools of the Trade (Fundamental English Writing)",
    "language": "en",
    "shortDescription": "Learn to become an effective builder of sentences using the basic tools of English grammar, punctuation, and writing in this FREE and open course.  This is a fundamental English writing course.\n\n",
    "aboutTheCourse": "Learn to become an effective builder of sentences using the basic tools of grammar, punctuation, and writing in this FREE and open course. By dedicating yourself to the craft of writing English, you will learn to use the eight parts of speech and grammar to develop the four basic sentence\ntypes into a well-organized, detailed paragraph. This course is designed for anyone who wants to become a better writer. If you need to write more clearly for work, prepare for a placement test for a college, or improve your skills for current writing\nprojects, this class is beneficial.\nPlease be aware that basic writers are the targeted audience for this course. <br>\n<br>\n<b><i>Objectives:\n<\/i><\/b>\n<br>\n<ul>\n    <li>Students will be able to identify and correct some sentence level grammatical and punctuation errors.<\/li>\n    <li>Students will be able to develop four sentence types: simple, compound, complex and compound-complex.<\/li>\n    <li>Students will be able to recognize and use all four sentence types.<\/li>\n    <li>Students will be able to develop a clear topic sentence.<\/li>\n    <li>Students will be able to write a well-organized, detailed paragraph.<\/li>\n<\/ul><b><i>Why would you want to take this course?<\/i><\/b><br>\n<ul>\n    <li>As a pre-Assessment activity<\/li>\n    <li>As a petition for English placement<\/li>\n    <li>As a brush-up for students while in writing classes<\/li>\n    <li>As a brush-up for students who don’t\/can’t enroll in an English class<\/li>\n    <li>As a resource for flipped\/blended classrooms<\/li>\n    <li>To become a better writer\n        <br>\n    <\/li>\n    <a target=\"_blank\" href=\"https:\/\/www.qualitymatters.org\/continuing-and-professional-education-rubric-program\"><img style=\"box-sizing: border-box; max-width: 100%; height: auto; vertical-align: middle; border: 0px;\" src=\"https:\/\/d396qusza40orc.cloudfront.net\/basicwriting%2Fimages%2FQM_ConProfEdProg2013.jpg\" height=\"200\" width=\"145\"><br>Certified Cours<\/a>e<br>\n<\/ul>\n<a target=\"_blank\" href=\"http:\/\/creativecommons.org\/licenses\/by-nc\/3.0\/deed.en_US\"><img alt=\"Creative Commons License\" style=\"border-width:0\" src=\"http:\/\/i.creativecommons.org\/l\/by-nc\/3.0\/88x31.png\"><\/a>&nbsp; &nbsp;&nbsp;<a target=\"_blank\" href=\"https:\/\/www.qualitymatters.org\/continuing-and-professional-education-rubric-program\"><br><\/a><br>Crafting an Effective Writer by <a target=\"_blank\" href=\"http:\/\/msjc.edu\">Mt. San Jacinto College<\/a> is licensed under a <a target=\"_blank\" href=\"http:\/\/creativecommons.org\/licenses\/by-nc\/3.0\/deed.en_US\">Creative Commons Attribution-NonCommercial 3.0 Unported License<\/a>.",
    "targetAudience": 0,
    "courseSyllabus": "<b>Unit 1:&nbsp; Becoming a Successful Online Learner<\/b>\n<br>\n<blockquote>Introduction to the course with a course navigation tutorial; strategies\n    for being successful in the course and in any online learning environment;\n    information about how you might make your success in the course useful\n    in your future educational experience.\n    <br>\n<\/blockquote><b>Unit 2:&nbsp; Parts of Speech<\/b>\n<br>\n<blockquote>The eight main parts of speech; why knowing the parts of speech will help your writing; the\n    sentence; observing the world.<br><\/blockquote><b>Unit 3:&nbsp; Subjects and Verbs<\/b>\n<br>\n<blockquote>Another way of looking at the parts of speech -- the building materials\n    put to use in the structure of the sentence; gerunds, imperatives, and infinitives; thinking about verb tense and voice; regular and irregular verbs; building your confidence with empowered\n    sentences.&nbsp;<\/blockquote><b>Unit 4:&nbsp; Clauses and Phrases<\/b>\n<br>\n<blockquote>\n\n<p>Adding to your basic sentences with clauses and phrases;\ncombining ideas and creating complexity; the four sentence types; creating your writing style.&nbsp; <\/p>\n\n<\/blockquote><b>Unit 5:&nbsp; Composing and Writing<\/b>\n<br>\n<blockquote>The writing process; revision vs. editing; punctuation, spelling, and commonly confused words; writing a paragraph.<\/blockquote><br>",
    "estimatedClassWorkload": "4-5 hours\/week",
    "recommendedBackground": "The course is designed for three main types of learners:\n<br>\n<ol>\n    <li>College bound, underprepared students: The course provides fundamental writing skills\n        for college bound students prior to taking placement tests, saving them\n        from spending unwarranted time and money for remediation should they be\n        placed below transfer level. Successful completion of the course <b>may <\/b>be\n        accepted as an alternative to a placement test.<\/li>\n    <li>Current high school and college students in regular c<i><\/i>lasses: This course provides writing\n        support for any student taking any course at any time.<\/li>\n    <li>Global Community Members: This course will assist people in improving their writing skills\n        to satisfy their need to be productive citizens in a global society.<\/li>\n<\/ol>",
    "links": {

    }
}