{
    "id": 33,
    "shortName": "healthpolicy",
    "name": "Health Policy and the Affordable Care Act",
    "language": "en",
    "shortDescription": "This course will explore the many problems of the American health care system and discuss the specific ways that the Affordable Care Act will impact access, quality, costs, as well as medical innovation.",
    "aboutTheCourse": "<p>The American health care system has many problems. 50 million people are uninsured. Quality is extremely uneven, with peaks of greatness at leading academic centers but overall poor quality in both process measures and outcomes such as asthma deaths. Finally, the U.S. health care system spends over $8000 per patient per year, nearly double the next highest country. In March 2010, the Affordable Care Act was enacted. Over the next decade or more, the Act will dramatically re-structure the American health care system.<\/p>\n<p>This course will explore the history and structure of the current American health care system, including the history of and problems with employment-based health insurance, the challenges surrounding access, cost and quality, and the medical malpractice conundrum. The course will then explore the history of health care reform and the challenges that were overcome to achieve health reform in America. Finally, we will delineate the specific ways that the Affordable Care Act improves access and quality, and will control costs. Throughout lessons regarding health economics, health policy, and medical practice will be elucidated.<\/p>\n<p>This class is open to anyone that is interested in gaining a better understanding of the US health care system and the challenges of health care reform. There are no prerequisites or required knowledge of the health system.<\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<b>Week 1 – Growth in US Health Care<\/b><br>Much of the impetus for health care reform is provided by\nthe need to “bend the cost curve.”  Over\nthe past few decades, health care cost growth has consistently outpaced overall\neconomic growth, taking up an increasing share of our Gross Domestic Product (GDP)\nand government budgets.  We will discuss\nthe factors that drive cost growth.<br><p> <i><b>Live Q & A with\nDr. Emanuel<\/b><\/i><br>Dr. Emanuel will host a live online Q & A session on\ntopics related to health care and current events. <\/p><p><b>Week 2 – Structure of the US Health Care<\/b><br>How do Americans get their health care? Who pays\nfor it? How did the system we have today come to be?  These are some of the questions we will answer\nthis week when we look at the structure of the US health care system<\/p>\n\n\n\n\n\n<p><b>Week 3 – Access to and Quality of Health Care in the US<\/b><br>Most Americans receive insurance through their employer or\nthe government (e.g. Medicaid, Medicare, CHIP). \nBefore the ACA, approximately 50 million Americans did not have health\ninsurance. This week we explore access to health care insurance, the profile of\nthe average uninsured person, disparities in quality and outcomes, and the link\nbetween insurance and access to health care.<\/p>\n\n\n\n<p><b>Week 4 – Health Care Malpractice<\/b><b><\/b><br>In some physician specialties, as many as one in four\npractitioners a year have a medical malpractice claim filed against them,\nmaking this a matter of frequent public and policy debate. We will discuss medical\nerrors, the workings of the malpractice system, liability insurance, and the\ncontribution of negligence and malpractice costs to the health system’s overall\nbottom line.  <\/p>\n\n<p><b>Week 5 – History of health care reform; The ACA: An Overview <\/b><br>Health care reform in America has been 100 years in the\nmaking, starting with Theodore Roosevelt and continuing through the Clinton\nadministration. We discuss past attempts at health care reform and why they met\nwith resistance. We then move on to an overview of the 2010 Affordable Care\nAct.<\/p>\n\n\n\n\n\n<p><b>Week 6 - The ACA: Access to Health Care<\/b><br>The overview of the ACA continues with a discussion of the provisions\ndesigned to expand access to health care. \nWe will cover employer-sponsored health insurance provisions. This session will feature a guest\nlecture by J. Sanford Schwartz, M.D.<\/p>\n\n\n\n\n\n\n\n<p><b>Week 7 – The ACA: Cost Control<\/b><br>This week we will discuss projections of health care cost\ngrowth under the ACA, followed by mechanisms through which the ACA aims to\ntackle health care cost growth. <br><\/p>\n\n<p><b>Week 8 – The ACA: Health Care Delivery and Quality<\/b><br>The final topic of\nthe course is the ACA’s impact on the quality and delivery of care. The ACA includes\nprovisions for institutional innovations, i.e. changes in how the system\ndelivers care.  It also contains rules\nand incentives for providers to cut down on mistakes and deliver proven,\nvaluable care. This week will provide a forward-looking overview of what we\nwill change in the medical sector.<br><\/p><br>",
    "estimatedClassWorkload": "3-6 hours\/week",
    "recommendedBackground": "No background is required; all are welcome.<br>",
    "links": {

    }
}