{"id":1821,"shortName":"chem992","name":"Introduction to Chemistry:  Structures and Solutions","language":"en","shortDescription":"This is an introductory course for students with limited background in chemistry; basic concepts such as atomic and molecular structure, solutions, phases of matter, and quantitative problem solving will be emphasized with the goal of preparing students for further study in chemistry.","aboutTheCourse":"<p>This is the second part of a two-part introductory course for students with limited or no background in chemistry; it may be taken independently of the first part as much of the material is modular in nature. &nbsp;In this part of the course, atomic and molecular structures, interactions of atoms with light, phases of matter, solutions, and quantitative chemical problem solving will be emphasized. The goal of the course sequence is to prepare students for further study in chemistry as needed for many science, health, and policy professions. Topics include introductions to electron configurations and transitions, Lewis dot structures, valence shell electron pair repulsion theory, phases and the energetics of phase transitions, and calculations involving gas laws and solutions.<\/p>\n<p>Each week the course will contain short video lectures with interactive questions embedded in the lectures. Students will have opportunities to practice each week via exercises at two levels of depth: one set of foundational problems directly related to lecture videos and another set of problems requiring more synthesis of ideas and application of pre-existing algebra skills.&nbsp;<\/p><p>Students interested in the possibility of earning a certificate have the option to enroll in a verified certificate option. Students who complete the course while earning an average of 70% or more on the foundational problem sets and exam will receive a signed statement of accomplishment if a student has chosen to enroll in the certificate option. Students who complete the course, participate fully in the peer-reviewed writing assignment, and achieve an average of 85% or more on the foundational problem sets, advanced problem sets, and exam will receive a signed statement of accomplishment with distinction&nbsp;if a student has chosen to enroll in the certificate option.<br><\/p>","targetAudience":0,"courseSyllabus":"<p><u>Week One:<\/u> Introduction to light, Bohr model of the hydrogen atom, atomic orbitals, electron configurations, valence versus core electrons, introduction to quantum numbers, and more information about periodicity.<\/p>\n<p><u>Week Two:<\/u> Introduction to chemical bonding concepts including Lewis dot structures, resonance, bond order, the octet rule and expanded octets, and formal charge.<\/p>\n<p><u>Week Three:<\/u>  Introduction to valence shell electron pair repulsion (VSEPR) theory, sigma and pi bonds, hybridization of the main group elements, and introduction to molecular shapes.<\/p>\n<p><u>Week Four:<\/u> Introduction to phases of matter, the importance of thermal energy, ideal gas law calculations, kinetic molecular theory of gases, partial pressures, and some properties of the liquid phase.<\/p>\n<p><u>Week Five: <\/u>No new topics this week<\/p>\n<p><u>Week Six:<\/u>&nbsp; Introduction to intermolecular forces, phase changes and phase diagrams, and an exploration of the solid phase.<\/p>\n<p><u>Week Seven:<\/u> Introduction to the chemistry of solution formation, such as polarity, review of concentration units such as molarity and mass percent, factors affecting solubility, dilutions, and calculations involving solutions.<\/p>\n<p><u>Week Eight:<\/u>  No new topics this week.  Complete final exam and course survey.<\/p>","courseFormat":"<p>The class will consist of lecture videos and chemical demonstrations; many of the videos contain integrated concept-check questions. Students will also be able to practice and earn points through standalone weekly quizzes and advanced problem sets.  At the end of the course students will take a two-part exam.<\/p>","suggestedReadings":"<span>Students can benefit from reading the relevant sections of any introductory college-level general chemistry textbook. &nbsp;I recommend Nivaldo Tro’s book <a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&amp;AFID=301076&amp;ADID=1088031&amp;SID=chem99&amp;isbn_ean=9780321725998\" title=\"Link: http:\/\/chggtrx.com\/click.track?CID=267582&amp;AFID=301076&amp;ADID=1088031&amp;SID=chem99&amp;isbn_ean=9780321725998\">Introduction to Chemistry: Essentials<\/a>, but this is completely <strong>optional<\/strong>.<\/span>","estimatedClassWorkload":"8-10 hours\/week","recommendedBackground":"<p>Students should have a background in high school level algebra and should bring their enthusiasm for learning and curiosity to the course! If possible, students should take the first part of the course series first (Introduction to Chemistry:  Reactions and Ratios), but it is not required.<\/p>","links":{}}