{"id":1720,"shortName":"healthleadership","name":"Health Leadership","language":"en","shortDescription":"In this course, we explore what it means to be a leader in the context of healthcare. How is it different to leadership in other industries?  What are the particular skills and attitudes leaders need to have to navigate the complexity of healthcare leadership?  \n","aboutTheCourse":"Strong leadership is essential for the creation of strong, effective and equitable healthcare systems and services. The question is, how can health organisations provide high quality and safe healthcare to growing populations, with increasingly complex needs, while remaining within budget constraints?&nbsp; And how can health leaders respond effectively to consumer and community concerns and demands, while at the same time managing a highly skilled workforce, all within organisational, regulatory and political constraints?&nbsp; <br><br>This course will look at these questions from the perspective of healthcare leaders.&nbsp; We will consider what the latest research, practitioners, and opinion leaders tell us about how to ensure a safe, efficient and equitable healthcare service.&nbsp; We will also explore what it means to take on a leadership role in the context of current healthcare challenges, including that of ensuring the quality, safety and equity of care.&nbsp; Throughout the course, we will be discussing the knowledge, skills and capabilities individuals require to lead effectively, and will outline approaches leaders can take to leading health teams and organisations.&nbsp; <br><br>By the end of this course, you should be able to:<br><br>1.&nbsp;&nbsp;&nbsp; Identify current healthcare challenges and discuss how effective leadership might contribute&nbsp; to meeting these <br>2.&nbsp;&nbsp;&nbsp; Analyse approaches to leading yourself and other individuals, teams and organisations in healthcare<br>3.&nbsp;&nbsp;&nbsp; Develop a systems leadership perspective on healthcare and explore how leadership contributes to quality and safety <br><br>","targetAudience":3,"courseSyllabus":"Module One – Challenges in Contemporary Healthcare Leadership\u2028<br>Module Two – Know Thy Self<br>Module Three – Leadership for Engagement in Healthcare\u2028<br>Module Four –&nbsp;Leading Healthcare Teams<br>Module Five – Leading Health Organisations\u2028<br>Module Six – Leadership’s contribution to Healthcare Quality and Safety<br><br>","courseFormat":"One module is covered per week. Lessons are provided in video format, which will include an overview of up-to-date research, as well as interviews with international experts and practitioners. Learning activities – such as Quizzes, Discussion Boards and Pause &amp; Reflect prompts - are provided throughout to help you engage with the content and to allow you to interact with your fellow students on key topics of interest.<br><br>","suggestedReadings":"<p>The course is self-contained, with no formal text book. A range of extra readings and resources for each module are provided and although it is recommend you view the weekly video, how much extra reading you do is your choice depending on your level of interest in each module.&nbsp; <br><\/p><br>","estimatedClassWorkload":"1-3 hours\/week","recommendedBackground":"<p>This course is directed at people working in or affiliated with healthcare systems – such as clinicians, staff, leaders, managers and board members. It will also be useful to people working in related areas, including aged care, community or welfare work, advocacy, emergency response, the defense forces, or education. Clients or consumers of healthcare services may find the course a useful way to engage with their healthcare providers.<\/p><br>","links":{}}