{"id":1872,"shortName":"initprogcpp","name":"Initiation à la programmation (en C++)","language":"fr","shortDescription":"Ce cours initie à la programmation en utilisant le langage C++. Il ne présuppose pas de connaissance préalable. Les aspects plus avancés (programmation orientée objet) sont donnés dans un cours suivant, «Introduction à la programmation orientée objet (en C++)».","aboutTheCourse":"Ce cours présente des concepts de base de la programmation tels que&nbsp;&nbsp; : variables, expressions, structures de contrôle, fonctions\/méthodes, ...<br>en les illustrant dans la syntaxe du langage C++.<br><br>Ces notions simples seront pratiquées de façon intensive pour vous faire réaliser de façon de plus en plus autonome&nbsp; les étapes allant de la conception d'un programme (algorithme) à sa mise en oeuvre concrète.<br><br>Ce cours est conçu pour être prolongé par les aspects orienté-objet, présentés dans le cours&nbsp;&nbsp;<a href=\"https:\/\/www.coursera.org\/course\/intropoocpp\">«Introduction à la programmation orientée objet (en C++)»<\/a>.&nbsp;<br>","targetAudience":0,"courseSyllabus":"<li>Introduction à C++<\/li><li>Structures de contrôle<\/li><li>Tableaux, chaînes de caractères<br><\/li><li>Fonctions et réutilisabilité<\/li><li>Structures de données<\/li><li>Pointeurs et références<\/li>","courseFormat":"Nos cours sont donnés sous forme de courtes séquences vidéo d'environ 10 minutes ponctuées d'une ou deux questions. La mise en pratique prend ensuite plusieurs formes :&nbsp;<br><ul><li>des quizz vous permettent d'évaluer votre acquisition des concepts de base,<\/li><li>des exercices de programmation libres, dont le corrigé est fourni, vous permettent de mettre en pratique ces concepts.<\/li><li>Enfin, des exercices notés, progressifs, vous permettent de valider les connaissances acquises.<br><\/li><\/ul>La mise en pratique des concepts au travers des exercices, qu'ils soient libres ou notés, constitue une des clés essentielles de l'apprentissage de la programmation. Nous avons donc conçu ce matériel de sorte à ce qu'il soit riche et varié et qu'il vous permette de bien comprendre l'intérêt de tel ou tel concept.&nbsp;<br><br>Des aspects de méthodologie, de bonnes pratiques, seront aussi abordés au travers des vidéos de cours et au travers de certains exercices.<br>&nbsp;<br>L'apprentissage de la programmation nécessite un travail rigoureux et assidu. Si vous vous investissez dans les exercices et réussissez les devoirs demandés, vous devriez acquérir de bonnes bases de programmation, lesquelles seront au final validées par un certificat Coursera.<br>","suggestedReadings":"","estimatedClassWorkload":"5-7 hours\/week","recommendedBackground":"Aucune expérience préalable de la programmation n'est supposée.","links":{}}