{"id":2902,"shortName":"valuecreation","name":"Corporate Financial Decision-Making for Value Creation","language":"en","shortDescription":"In this course, participants will learn about the key financial decisions modern corporations face, as well as the alternative methods that can be employed to optimize the value of the firm’s assets. This is part of a Specialization in corporate finance created in partnership between the University of Melbourne and Bank of New York Mellon (BNY Mellon).","aboutTheCourse":"<p>This course is the third in the four-course Specialization <i>Essentials of Corporate Financial\nAnalysis and Decision-Making<\/i>.&nbsp;<br><\/p><p>In this course you will develop not only an\nunderstanding of the different decisions that firms face on a day-to-day basis,\n&nbsp;but also an appreciation for how these decisions might be made in a way\nthat can maximize firm value.&nbsp;<\/p><p>Instructors from the University of Melbourne,\ntogether with their partners at BNY Mellon,&nbsp;demonstrate the importance of\nthese decisions by direct reference to a wide array of real-life examples\nfeaturing some of the largest public companies in the world.&nbsp;<\/p>\n<p>Courses created in partnership with:<br>\n<img src=\"https:\/\/d396qusza40orc.cloudfront.net\/financialanalysis\/images\/bnym-logo-small.png\"><\/p>","targetAudience":0,"courseSyllabus":"<p><strong>Module 1:<\/strong> Alternative approaches to making\nthe optimal investment decision<\/p><p><\/p><ul><li>Explain the key discounted cash flow (DCF) approaches to investment evaluation<br><\/li><li>Explain the role, and relative popularity, of non-DCF approaches to investment evaluation<br><\/li><li>Demonstrate how sensitivity analysis might be employed and explain the key assumptions underlying the technique<br><\/li><\/ul><p><\/p>\n\n<p><strong>Module 2: <\/strong>Raising capital and the choices\nfirms face<\/p><p><\/p><ul><li>Explain the mechanics behind a firm being listed for the first time on a stock exchange<br><\/li><li>Survey the evidence concerning the initial pricing of IPOs and describe the reasons put forward in the literature for this empirical evidence<br><\/li><li>Describe the impact of debt on returns to shareholders and explain why we might expect firms with particular characteristics to have different levels of debt<br><\/li><li>Describe the various influences on the firm’s payout policy<br><\/li><\/ul><p><\/p>\n\n<p><strong>Module 3: <\/strong>Creating value via takeovers,\nmergers and corporate restructuring<\/p><p><\/p><ul><li>Describe the key terms used in, and the mechanics behind, the evaluation of takeovers, mergers and acquisitions<br><\/li><li>Develop an approach to financial modelling that clearly answers the question “what is the wealth impact of this deal for shareholders?”<br><\/li><li>Explain the different forms of corporate restructuring<br><\/li><li>Describe the empirical evidence with respect to the wealth effects of various categories of deals undertaken in the market for corporate control<br><\/li><\/ul><p><\/p>\n\n<p><strong>Module 4:<\/strong> Alternative approaches to risk\nmanagement<\/p><p><\/p><ul><li>Define and differentiate between forwards and futures contracts<br><\/li><li>Describe the key features of options contracts and explain the key influences on their value<br><\/li><li>Illustrate how different options contracts might be combined with positions in the underlying asset to provide a desired payoff structure<br><\/li><li>Explain how risk management might create value for shareholders<br><\/li><\/ul><p><\/p>","courseFormat":"<p>This course will run for 4 weeks, and consist\nof 4 modules each with a series of lecture videos between 5 to 8 minutes long.\nEach video will contain a range of integrated quiz questions or reflection\nquestions. Assessment will be multiple-choice questions, and a final peer\nreviewed assessment.<\/p><p><br><\/p><p>Course hero image reproduced with permission from BNY Mellon.<br><\/p><p><br><\/p><p><img><br><\/p>","suggestedReadings":"<p>Graham, J.R. &amp; Smart, S.B. (2012) <i>Introduction\nto corporate finance: what companies do. <\/i>Australia: South-Western\/Cengage Learning.<\/p>","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"<ul>\n <li>A basic\n     knowledge of statistics and an ability to employ simple algebra to solve\n     straightforward problems<\/li>\n <li>Familiarity with\n     Microsoft Excel (or a functionally-equivalent spreadsheet program).\n     Specifically participants should possess the ability to summarise data\n     using the graphical tools contained within that program.<\/li>\n <li>Apart from that,\n     a natural curiosity&nbsp;about not only how markets operate, but also how\n     participants in those markets gather and then transform information so as\n     to make financial decisions that maximise firm value<\/li>\n<\/ul>","links":{}}