{"id":621,"shortName":"k12virtualtrends","name":"Emerging Trends & Technologies in the Virtual K-12 Classroom","language":"en","shortDescription":"Learn about emerging trends and technologies in K-12 virtual instruction. Join us as we explore this dynamic landscape and investigate how we can more deeply engage students in the virtual classroom through the use of innovative practices and technologies.","aboutTheCourse":"<p>Emerging technologies are quickly gaining momentum in the field\nof virtual K-12 instruction. In this course we will explore how the latest trends in the use of technology affect student learning and engagement. What innovative learning spaces and tools are available to instructors? &nbsp;How can instructors best utilize free and open resources to more deeply engage students in their learning? What impact can the use of emerging technologies have on student retention and&nbsp;performance? As a class we will discuss the possibilities and\nchallenges of using technology in fully online environments, although many of the ideas can be applied to blended and traditional environments as well. Learners will compare and contrast tools for use in K-12 virtual instruction, as well as examine\nbest practices for implementing and managing these tools. <\/p>","targetAudience":1,"courseSyllabus":"<p>There are a total of five modules. All modules and their content&nbsp;will be made available at the start of the course.&nbsp;<\/p><p><strong>Module 1<\/strong>: Role of technology in&nbsp;K12 virtual&nbsp;education, evaluating technologies for use, and implementing technologies<br><strong>Module 2:<\/strong> Collaborative and social learning technologies<br><strong>Module 3: <\/strong>Game-based learning, badging, augmented reality, and wearable technologies<br><strong>Module 4:<\/strong> Open educational content, including MOOCs<br><strong>Module 5<\/strong>: Balancing student needs and challenges<\/p><p><\/p>","courseFormat":"<ul><li>A series of short video lectures<\/li><li>Four short quizzes<\/li><li>A final quiz<\/li><li>One peer reviewed assignment<\/li><li>Several synchronous activities (These are optional, but highly encouraged.)<\/li><li>Forum discussions (These are optional, but highly encouraged.)<\/li><li>And lots of resources<\/li><\/ul>","suggestedReadings":"Free, publicly available articles and resources will be provided throughout the course. Learners will also be encouraged to explore various free, online technologies, tools, learning spaces, and resource repositories.","instructor":"","estimatedClassWorkload":"2-4 hours\/week","recommendedBackground":"<p>The course is primarily for:<\/p><ul><li>Teachers working with children ages 5 - 18<\/li><li>Instructors working with further education, community college or vocational        students<\/li><li>Continuing education or in-service facilitators supporting teachers and        faculty<\/li><li>Educators interested in educational technology and\/or online instruction<\/li><li>Please note that although this program is offered to participants from        around the world, many of the examples and experiences shared will be based        on the education structure and processes of the United States. Participants        will be encouraged to discuss their own country-based experiences        in the forums. <\/li><\/ul>","links":{}}