{
    "id": 1093,
    "shortName": "abortion",
    "name": "Abortion: Quality Care and Public Health Implications",
    "language": "en",
    "shortDescription": "Abortion is a common experience for women around the world; yet, abortion is often excluded from the curricula of health professionals.  This course, geared toward clinicians, health care workers, and students, aims to address this gap and will contextualize abortion care within a public health framework from both clinical and social perspectives.  ",
    "aboutTheCourse": "<p>Abortion is\na common experience for reproductive-aged women around the world.&nbsp; In the US, half of all pregnancies are\nunintended and half of these end in abortion. (Finer 2013) Around the world,\n43.8 million abortions were done in 2008 representing one fifth of all\npregnancies. (Sedgh 2012)&nbsp; Abortion is\nsafe and has lower morbidity and mortality than childbirth when carried out by\ntrained practitioners in sanitary conditions (Raymond 2012), but nearly half of\nthe abortions done in the world are unsafe, according to the WHO definition.<\/p>\n\n<p>Despite\nits universality, abortion remains controversial and inaccessible for many\nwomen. Both the clinical and public health contexts of abortion are often\nexcluded from curricula in medicine, nursing, and other health professions. Restrictions\nat the hospital or clinic level, and conscientious objection at the provider\nlevel compounded with legal restrictions further reduce women’s access to\nservices.&nbsp;<\/p>\n\n<p>In this six-week\ncourse, over twenty faculty from various institutions and multiple disciplines will place abortion within the context of\npublic health and fill in the gaps left by its exclusion from mainstream\ncurricula in health professions. Each week’s lectures will incorporate the\nstories of women who seek abortion in order to better portray abortion significance and rationale.&nbsp; Other topics will include a brief\nhistory of abortion, the clinical aspects of medication and procedural\nabortions in and after the first trimester, an overview of patient-centered\nabortion-care, the basics of abortion counseling, the professional obligations\nof health care practitioners to ensure that women have access to safe abortion\ncare, and the maze of restrictions that make safe abortion care inaccessible to\nmany women.&nbsp; <\/p>\n\n<p>In addition to video lectures, there will be\nweekly quizzes, peer assessments, and optional additional content and reading\nfor learners who want to explore the topic further.&nbsp;&nbsp;<\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<p><b>WEEK 1: <\/b><b>Abortion in the U.S. And Around the World<\/b><\/p>\n\n\n\n\n\n\n\n\n\n<p><\/p><ul><li>Introduction to the public-health framework\nof this course<br><\/li><li>Who has abortions, why, and how do they\naccess care<br><\/li><li>History of abortion and abortion stigma<br><\/li><\/ul><p><\/p>\n\n\n\n\n\n<p><b>WEEK 2:&nbsp;<\/b><b>Abortion, Professionalism, and Patient-Centered Counseling<\/b><\/p>\n\n\n\n\n\n\n\n<p><\/p><ul><li>Principles of pregnancy options counseling, abortion counseling,\nand informed consent<br><\/li><li>Abortion in the United States after legalization<br><\/li><li>Professional responsibilities around abortion care<br><\/li><li>Values clarification about abortion care<br><\/li><li>Conscientious provision and refusal in abortion care<br><\/li><\/ul><p><\/p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p><p><\/p>\n\n\n\n\n\n<p><b>WEEK 3:&nbsp;<\/b><b>Abortion in the First Trimester<\/b><\/p>\n\n\n\n\n\n\n\n\n\n<p><\/p><p><\/p><ul><li>Clinical aspects of medication abortion, aspiration abortion,\npost-abortion contraception, and pain management for abortion<\/li><li>Legislative and policy obstacles to abortion access<br><\/li><\/ul><p><\/p><p><\/p>\n\n\n\n\n\n\n\n<p><b>WEEK 4:&nbsp;<\/b><b>Abortion after the First Trimester: Obstacles to Accessing Safe Abortion in the U.S. And Worldwide<\/b><\/p>\n\n\n\n\n\n\n\n\n\n<p><\/p><p><\/p><ul><li>Who has abortions after the first trimester and how do they\naccess care<br><\/li><li>Clinical aspects of abortion after the first trimester<br><\/li><li>Role of patient preference in appropriate care<br><\/li><li>Guidelines for safe abortion care and the principles of high-quality abortion care across settings<\/li><li>Complications and myths about abortion<br><\/li><\/ul><p><\/p><p><\/p>\n\n\n\n\n\n\n\n<p><b>WEEK 5: Overcoming Obstacles to Abortion\nAccess<\/b><\/p>\n\n<p><\/p><p><\/p><ul><li>Sociology of abortion especially related to health and\nhealth-care disparities<br><\/li><li>Impact of obstacles on clinical care<br><\/li><li>Importance of abortion training for health professionals<br><\/li><\/ul><p><\/p><p><\/p>\n\n\n\n\n\n\n\n<p><b>WEEK 6: Early Pregnancy Loss and Course\nConclusions<\/b><\/p>\n\n<p><\/p><ul><li>Patient-centered care for early pregnancy\nloss<br><\/li><li>Counseling and decision making for early\npregnancy loss<br><\/li><li>Relationship between early pregnancy loss\ncare and abortion care<br><\/li><li>Course conclusions<br><\/li><\/ul><p><\/p>",
    "estimatedClassWorkload": "3-5 hours\/week",
    "recommendedBackground": "<p>This course\n  is intended for any clinician, physician, health care worker or student who\n  will care for women of reproductive age.&nbsp;\n  While a basic knowledge of public health terminology may be helpful,\n  there are no specific prerequisites.<\/p>",
    "links": {

    }
}