{"id":1250,"shortName":"career","name":"Enhance Your Career and Employability Skills","language":"en","shortDescription":"Learn how to make effective decisions about your future career and how to take control of your professional development by honing your critical thinking and employability skills.\nSuitable for anyone undertaking some form of study, regardless of academic discipline, interests or employment background.\n","aboutTheCourse":"<p>This course is different to others. Unlike many Coursera courses which are discipline-specific,\nthis MOOC would be complementary to any additional course of study as it\nenables you to recognise your own strengths and skills and understand how\nto best articulate those preferences and achievements to future employers or\nacademic institutions in the future.<\/p><p>By the end of this course, you will be able to:<\/p>\n\n<ul>\n <li>Understand\n     the drivers behind your career preferences and choices<\/li>\n <li>Identify\n     the skills which you can offer and know your current skills gaps<\/li>\n <li>Recognise\n     opportunities for your career enhancement both within and beyond your\n     current employer<\/li>\n <li>Summarise\nyour achievements and skills in appropriate formats for future employers\n     or academic institutions<\/li>\n <li>Perform\n     effectively in a face-to-face encounter such as an interview or during a\n     presentation<\/li><li>Extend and make most effective use of your professional\nnetwork both on and off line<\/li><\/ul><span><br>Whichever stage you are at in your career development, you will learn more about yourself and how to manage your career in the future by joining us on this course!<\/span>","targetAudience":3,"courseSyllabus":"<p><b>Week One: <\/b><i><b>What do you want? – Self Awareness<\/b><\/i><\/p>\n\n<ul>\n <li>What do\n     you need from your career? Identifying and assessing careers values.<\/li>\n <li>Self-discovery\n     or self-creation – where does your true career identity reside?<\/li><li>\nCan you predict what will make you happy? Common\nproblems in anticipating the future.<\/li><\/ul><b>Week <\/b><b>Two<\/b>: <b><i>What can you offer? – Skills Awareness\n<\/i><\/b>\n<ul>\n <li>Can you\n     speak the secret language of skills? Evidence your achievements in a\n     meaningful way.<\/li>\n <li>Making\n     yourself instantly attractive. What skills are employers asking for? <\/li><li>\nHow can you build your skills? Education and\nexperience – what’s the best investment?<\/li><\/ul><b>Week Three:<\/b><span><b>\n<i>Are you ready to find success? – Career Readiness<\/i>\n\n<\/b><ul>\n <li>Are you\n     open to opportunities? What behaviours increase your chances of getting\n     lucky breaks?<\/li>\n <li>Are you\n     using the right methods? Which ways of finding opportunities are right for\n     you?<\/li><li>Can you create your own job? Intrapreneurship\nand entrepreneurship.<\/li><\/ul><span><b>Week Four: <i>How do you express yourself? – Articulating Your Experiences<\/i><\/b><i>\n\n<\/i><ul>\n <li>Are you\n     using the right medium for the message? CVs, portfolios and other ways of\n     selling yourself.<\/li>\n <li>Your\n     personal brand. What does your on-line profile say about you?<\/li><li>Can you decode job descriptions? A step-by-step\nprocess for preparing better applications<\/li><\/ul><span><b>Week Five: <i>What impact do you make? – Making a Good Impression in Person\n\n<\/i><\/b><ul>\n <li>Do\n     interviews always have to be nerve-wracking? The secrets to interview\n     confidence.<\/li>\n <li>Can you\n     deal with bad interviewers? Common interviewer weaknesses and how to use\n     them.<\/li><li>Can you increase the chances that people will\nlike you? Maximising first impressions.<\/li><\/ul><span><strong>Week Six: <\/strong><i><strong>How do you build fruitful relationships? – Networking Online and in Person<\/strong>\n<\/i><ul>\n <li>Does\n     networking actually work? The benefits of loose ties.<\/li>\n <li>Are you\n     using online media effectively? How LinkedIn, Facebook and Twitter can\n     help your career.<\/li><li>Is networking just for job hunting? The social\nworkplace and the power of relationships<\/li><\/ul><\/span><ul><\/ul><ul><\/ul><ul><\/ul><ul><\/ul><\/span><ul><\/ul><\/span><\/span><ul><\/ul>","courseFormat":"This course will consist of a variety of methods with material being presented in clear, sequential units and regular opportunities to reflect on the non-linear aspects of this subject. The course will consist of self-reflective exercises and questionnaires, active reading tasks, short segmented videos of lecturer-led delivery accompanied by slides, practical assignments (e.g. informational interviewing) and short segmented videos of related activities (e.g. mock interviews) to provide feedback on. <br>There will be activities to complete and opportunities to contribute each week. There will be self-evaluation questionnaires to help you monitor your own progress. However, given the nature of this course, there will be no final examination. ","suggestedReadings":"<p>The lectures are designed to be self-contained and there are no critical resources that cover the whole of the course.<br><br>Nevertheless, students interested in this course may find the following websites useful and interesting to explore:\n<\/p><ul><li><a href=\"http:\/\/www.careers.lon.ac.uk\/blog\/library\/\">http:\/\/www.careers.lon.ac.uk\/blog\/library\/<\/a> <\/li><li><a href=\"http:\/\/careersintheory.wordpress.com\/\">http:\/\/careersintheory.wordpress.com\/<\/a><\/li>\n <li><a href=\"http:\/\/www.careerstagged.co.uk\/\">http:\/\/www.careerstagged.co.uk\/<\/a><\/li><li><a href=\"http:\/\/bps-occupational-digest.blogspot.co.uk\/\">http:\/\/bps-occupational-digest.blogspot.co.uk\/<\/a><br><\/li>\n<\/ul><span>\n\nThroughout the course we may also make reference to articles from a number of academic journals, but we will summarise the findings.<\/span>","estimatedClassWorkload":"3-6 hours\/week","recommendedBackground":"No background is required as this course is designed to be useful and informative regardless of your professional background or stage of career development. Experienced professional or current student - all are welcome!","links":{}}