{
    "id": 704,
    "shortName": "scicontentsurvey",
    "name": "Inquiry Science Learning: Perspectives and Practices 3 - Science Content Survey",
    "language": "en",
    "shortDescription": "This is the third in a series of four courses; each addressing a different set of skills science educators need to meet the demands of their career. In this course, teachers will develop a deeper understanding of several broad topics in the major science content areas by examining common misconceptions.\n",
    "aboutTheCourse": "<p>A revolution is underway in science classrooms. The demands of the new workplace and the ready access to information afforded by new technologies have radically changed the way we define a scientifically literate society. <\/p><p>More than ever teachers need professional development that provides them with the resources they need and empowers them to take the action required to build classrooms where the next generation of scientifically literate students will flourish. <\/p><p><i>Inquiry Science Learning: Perspectives and Practices<\/i> consists of four courses, each designed to address a different strand in the development of skills teachers need to meet the demands of their career, including the following.<\/p><p><\/p><ol><li><a href=\"https:\/\/www.coursera.org\/course\/scileadership\" target=\"_blank\">Science Leadership<\/a><br><\/li><li><a href=\"https:\/\/www.coursera.org\/course\/inquirytechniques\" target=\"_blank\">Techniques for Success<\/a><br><\/li><li><b>Science Content<\/b><br><\/li><li><a href=\"https:\/\/www.coursera.org\/course\/scistudentinquiry\" target=\"_blank\">Student-Centered Inquiry<\/a><\/li><\/ol><p><\/p><p>In this third course we will focus on helping teachers explore their own and their students misconceptions over a broad array of topics within science and engineering.<\/p>",
    "targetAudience": 3,
    "courseSyllabus": "The specific content explored by each participant will be determined by the needs and interests of that participant. Each week, however, there will be a focus as described below.<br><br><b>Week 1: Misconceptions in Physical Science<br><\/b><br><b>Week 2: <\/b><b>Misconceptions in Earth\/Space Science<br><\/b><br><b>Week 3: Misconceptions in Life Science<br><\/b><br><b>Week 4: Misconceptions in Engineering<\/b>",
    "estimatedClassWorkload": "2-4 hours\/week",
    "recommendedBackground": "No previous coursework is recommended, but the course will be most helpful to teachers with 3 or more years of teaching experience who are willing to directly apply experiences in their schools. While the course was designed with the K-8 teacher in mind, the topics covered are appropriate for all teachers, including those teaching in high school.",
    "links": {}
}