{
    "id": 2350,
    "shortName": "anatomy",
    "name": "Anatomy of the Abdomen and Pelvis; a journey from basis to clinic",
    "language": "en",
    "shortDescription": "In this anatomy course you will explore the organs involved in our food digestion and discover the common causes of abdominal and pelvic pain. The latest graphics and animations will help us to find new insights and understanding of the part of the body, that has been the focus of anatomical research for centuries and presently arouses renewed scientific interest.\n\n",
    "aboutTheCourse": "<p> In this course we explore the 3D anatomy of the organs from a basic level, providing thorough anatomical understanding, to its advanced application in surgical procedures. This course will challenge you to discover and help you to understand the anatomy of the abdomen and pelvis in all its aspects, ranging from its embryological underpinnings, via digital microscopy to gross topography and its clinical applications.<\/p>\n<p>The course is unique in that it continuously connects basic anatomical knowledge from the lab with its medical applications and current diagnostic techniques. You’ll get the chance to discuss anatomical and clinical problems with peers and experts in forum discussions and you’ll receive guidance in exploring the wealth of anatomical information that has been gathered over the centuries. Follow us on an exciting journey through the abdomen and pelvis where we digest our food but also where new life starts.<\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<p><b>Week 1: Mapping the abdomen and pelvis<\/b><br><\/p>\n<p>Ever wondered what’s inside the belly? Do you know where the spleen or appendix is situated? Would you like to know how the physician looks at it or get the basics of the physical examination of the abdomen as performed by a physician? Do you want to understand how all these structures can be seen on scans or X-rays? In the first module of this course you’ll get a better understanding of all that in this module. We also lay foundations for the following modules of the course, with basics you need on things as vascularization, the nervous system, embryology, and the wonderful membrane holding all these structures together: the peritoneum.<br>\n\n<b>Special attention: <\/b>Overview of topography, localization and relationships of the abdominal organs and their projection on the body wall.<br>\n<b>Clinical applications: <\/b> Interpretation of abdominal X-ray, CT, and MRI images. Examination of the pelvis and abdomen.<\/p>\n\n<p><b>Week 2: Trip into the gut<\/b><\/p>\n<p>Would you like to know how you actually digest your food? Learn how the oesophagus transports your food, while its lower sphincter prevents food from returning - even if you're upside down! Would you like to learn how the stomach drenches all in an extremely acid pool, attacking ingested bacteria and starting the digestion? The same acid, however, is an aggressive actor in the duodenum, so the latter should prevent itself against it. Follow the digestion further, along extensive folds and specialized cells, to end up with more and more solid bowel contents when water is extracted in the colon.  Interested? Then join us on this trip into the gut with all its nifty structural specializations along the way!<br>\n<b>Special attention: <\/b>Development and composition of the various building blocks of the intestinal system: general building plan of the gut and local adaptations.<br>\n<b>Clinical applications: <\/b>Diseases of the alimentary tract and some congenital malformations.<\/p>\n\n<p><b>Week 3: The gut and its “suppliers and purchasers”<\/b><\/p>\n<p>The gut cannot do it alone: it needs additional organs supplying digestive chemicals such as enzymes and bile, and organs that further process the resorbed food. These organs are the pancreas (an organ loaded to the brim with enzymes that can even dissolve itself) and the liver (one of the body's largest organs) and its gall bladder. The gut and these organs also need a blood supply. You will learn where their blood vessels are situated. Also, the less prominent, but nevertheless very important 'sewage' system, the lymphatics, will be dealt with. In the area of the gut the lymphatics have specialized in transporting our fats that are absorbed from the food! In the meantime the lymphatics keep an eye on pathological invaders. Unfortunately they may also spread tumours. In short, a module for everyone that is interested in the collaboration between the abdominal organs.<br>\n<b>Special attention: <\/b>The anatomy and function of the accessory organs needed for digestion such as the liver, gallbladder and pancreas and the alimentary tract vasculature and lymphatics.<br>\n<b>Clinical applications: <\/b>Pancreatic cancers, cholelithiasis (gallstones) and mesenteric thrombosis.<\/p>\n\n<p><b>Week 4: From Embryo to Adulthood: Knowing your peritoneal relationships<\/b>\nWould you like to know more about the origins of your intestines and related organs? Understand why the bowels are not left-right symmetrically arranged as the rest of our body, but encircle and cross over each other intricately? Get to grips with difficult concepts as 'intraperitoneal' and 'retroperitoneal' that determine why some structures lie easily accessible in the abdomen and others hidden away? And maybe even get a starter in abdominal surgery?  You will learn its secret: The best way to mobilize the abdominal and pelvic organs is to separate what got adhered when the patient was an embryo! Please feel free to dive into these embryonic matters and enjoy all the twists and turns! <br>\n\n<b>Special attention:<\/b>Organ rotation during embryonic development. Topographic relationships between the internal organs, their great arteries and veins and the peritoneum.<br><b>Clinical applications: <\/b> Surgical approaches into the abdomen.<\/p>\n\n<p><b>Week 5: Protecting the internal organs<\/b>\n<\/p><p>The abdominal body wall and the pelvis are the topics of this module. What happens if you push hard to pass a stool, or in reverse, how do you prevent unwantedly passing a stool when you sneeze or cough hard? It may not seem the most attractive area of the body, but the rectum and anus hold many intricacies and some are even being discovered right now! Weak areas in the body wall are a frequent cause of problems, for instance leading to inguinal hernias. You'll learn their complicated anatomy. And finally, we'll dive deep in the pelvis and learn about its hidden gems: the internal genitals.<br>\n\n<b>Special attention:<\/b> Functional anatomy of the body wall and pelvic floor. Weak spots in the abdominal wall. Sensory information from the skin.<br>\n<b>Clinical applications: <\/b> Umbilical, femoral and inguinal hernia’s. Inguinal and pelvic surgery.<\/p>\n\n<p><b>Week 6: Pain!<\/b><\/p>\nPain in my belly! Probably all of us have experienced abdominal pains and have witnessed its many different forms. Sometimes it can just be a slight discomfort, or it can come in waves of agony. The aches can develop gradually over several days, or strike suddenly as severe abdominal pain. In many cases the patient cannot easily locate the pain. Even shoulder pain can even be caused by something going on in the abdomen. Abdominal pain is one of the most frequent reasons to seek medical attention; however diagnosing the cause of the pain can be very difficult. Many different diseases may cause abdominal pain. Many of those do not require immediate treatment, yet others are life threatening. The challenge is to correctly identify those dangerous cases that require prompt surgical intervention. You will learn the anatomical basis of pain and how to apply this knowledge to the diagnostic process, to wrap up with an overview of several abdominal diseases that might all present with pain.<br>\n\n<b>Special attention: <\/b>Innervation of the internal organs.<br>\n<b>Clinical applications: <\/b>distinguishing 'alarming' abdominal and pelvic pain from pain that allows further observation, different pain types: referred pain, visceral pain, parietal pain.<p><\/p>",
    "estimatedClassWorkload": "6-8 hours\/week",
    "recommendedBackground": "No specific background is required. Anyone with an interest in medicine\nor human biology is welcome to join us during this basic exploration of the\nabdomen and pelvis.",
    "links": {

    }
}