{"id":2483,"shortName":"teachcapstone","name":"Foundations of Teaching for Learning Capstone: The Reflective Practitioner","language":"en","shortDescription":"We are excited to provide this course for graduates of Foundations of Teaching for Learning Courses 1-8. This further enrichment of key themes in learning and teaching we have entitled ‘The Reflective Practitioner’ in order to emphasise the importance of standing back from practice to review, extend and challenge what we know, what we do and what we aspire to do better.","aboutTheCourse":"<p>This course is open to learners who have completed all\neight courses on the Foundations of Teaching for Learning MOOC. It revisits\ntopics covered and focuses on what it really means to be a reflective\npractitioner. One of the great paradoxes\nof learning is that the more you know the more you become aware of what you\ndon’t know... and the more you want to know! This course offers an opportunity\nto further deepen and broaden your professional expertise. It provides an\nopportunity to participate in practical tasks and assessments that draw on the\nknowledge and skills gained in the previous courses.\u2028\u2028<\/p><p>If you have completed\nthe eight courses, signed up to the Signature track, met all the assessment\nrequirements of the programme and would like to continue to build on your\ninterest and achievements, this course is for you! There is enough challenge\nand scope for learners who already have teaching experience, but this course is\nalso suitable for less experienced learners who may not have a great deal of teacher\neducation or may not yet hold a teaching\nqualification.<\/p><p><b>Announcement for US based teachers:<\/b><\/p><p><span>Coursera and its\npartners are proud to offer eligible teachers&nbsp;in the US&nbsp;free Verified Certificates&nbsp;for\nthis course and other high-quality teacher professional development courses,\nthrough the ConnectED effort announced by President Obama.<\/span><\/p><p>To\nparticipate in this opportunity,&nbsp;US&nbsp;district leaders simply need to\napprove Coursera teacher professional development by completing a brief form\nat:&nbsp;<a href=\"http:\/\/www.coursera.org\/tpd\" target=\"_blank\">www.coursera.org\/tpd<\/a><u>.<\/u><\/p><p>US&nbsp;Teachers\ninterested in this opportunity are also encouraged to follow the link to learn\nmore and <a href=\"http:\/\/www.coursera.org\/tpd\" target=\"_blank\" title=\"Link: http:\/\/www.coursera.org\/tpd\">www.coursera.org\/tpd<\/a><u>.<\/u><\/p><p>Once a\ndistrict’s form has been verified, the district leader will be notified and\nteachers in the district will receive access to free verified certificates for\nCoursera professional development.<\/p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p><p>Coursera and the\nCommonwealth Education Trust thank educators for the hard work they do every\nday and hope this opportunity will assist US teachers&nbsp;to continue\ndeveloping their craft in a meaningful and flexible way.<\/p>","courseSyllabus":"<b>Week 1<\/b><span>&nbsp;–&nbsp;<b>Introduction\nand Review phase:&nbsp;<\/b><\/span>Review some of the\nkey ideas from previous courses in order to choose one idea you would like to\nwork on further.&nbsp;Understand what is\nmeant by <i>reflection-in-action<\/i> and <i>reflection-on-action<\/i> and how it applies\nto the everyday work of the teacher in the classroom. With the one idea you have chosen, consider how you might take\nforward and refine that idea, as you apply the <i>reflection-in-action<\/i> model to it.<p><b>Week 2<\/b><span>&nbsp;–&nbsp;<b>Practical\nTask Creation:&nbsp;<\/b>Draw on key learnings and apply new reflective models, so\nas to create a lesson plan for peer assessment. Assess peer lesson plans using\na new assessment rubric.<\/span><\/p><p><b>Week 3<\/b><span>&nbsp;–<b>&nbsp;Evaluation\nphase:&nbsp;<\/b>Evaluate what is good and what is challenging using the <i>reflection-in-action<\/i> model. Undertake\ntasks and activities drawing on your portfolio and new knowledge gained.<\/span><\/p><p>\n\n\n\n\n\n\n\n\n\n\n\n<\/p><p><b>Week 4<\/b><span>&nbsp;–&nbsp;<b>Reflection-on-action\nphase:&nbsp;<\/b>Revisit and<b> <\/b>make\nchanges to your first peer assessment (based on your peer evaluated lesson\nplan). Submit your assignment and updated lesson plan for feedback and marking\nby Course Instructors. Network and collaborate with peers to complete the course\nand discover 'where to from here'.<\/span><\/p>","courseFormat":"Each module consists of lecture videos and an outline of readings and tasks. There are two assessments during this four week course, the first assessment requires the completion of practical material, and is peer assessed. The second assessment will be personally marked by our esteemed Instructors and then feedback will be provided to learners after completion of the course.","suggestedReadings":"Lectures are self-contained, and no purchased readings are required.","estimatedClassWorkload":"2-3 hours\/week","recommendedBackground":"Successful completion of all eight courses on the Foundations of Teaching for Learning is a requirement before taking this course.","links":{}}