{
    "id": 106,
    "shortName": "datasci",
    "name": "Introduction to Data Science",
    "language": "en",
    "shortDescription": "Join the data revolution. Companies are searching for data scientists. This specialized field demands multiple skills not easy to obtain through conventional curricula. Introduce yourself to the basics of data science and leave armed with practical experience extracting value from big data. #uwdatasci",
    "aboutTheCourse": "Commerce and research are being transformed by data-driven discovery and\nprediction. Skills required for data analytics at massive levels – scalable\ndata management on and off the cloud, parallel algorithms, statistical\nmodeling, and proficiency with a complex ecosystem of tools and platforms\n– span a variety of disciplines and are not easy to obtain through conventional\ncurricula. Tour the basic techniques of data science, including both SQL\nand NoSQL solutions for massive data management (e.g., MapReduce and contemporaries),\nalgorithms for data mining (e.g., clustering and association rule mining),\nand basic statistical modeling (e.g., linear and non-linear regression).<br>",
    "targetAudience": 1,
    "courseSyllabus": "<i>Part 0: Introduction<\/i>&nbsp;<br>\n<ul>\n    <li>Examples, data science articulated, history and context, technology\n        landscape<\/li><\/ul>\n<i>Part 1: Data\nManipulation at Scale<\/i><br>\n<ul>\n    <li>Databases and the relational algebra&nbsp;\n        <br>\n    <\/li>\n    <li>Parallel databases, parallel query processing, in-database analytics&nbsp;<\/li><li>MapReduce, Hadoop, relationship to databases, algorithms, extensions,\n        languages &nbsp;<\/li><li>Key-value stores and NoSQL; tradeoffs of SQL and NoSQL<\/li><\/ul>\n<i>Part 2: Analytics\n<\/i><br>\n<ul>\n    <li>Topics in statistical modeling: basic concepts, experiment design, pitfalls<br>\n    <\/li>\n    <li>Topics in machine learning: supervised learning (rules, trees, forests, nearest neighbor, regression), optimization (gradient descent and variants), unsupervised learning<\/li><\/ul>\n<i>Part 3: Communicating Results <\/i><br>\n<ul>\n    <li>Visualization, data products, visual data analytics&nbsp;\n        <br>\n    <\/li>\n    <li>Provenance, privacy, ethics, governance&nbsp;<\/li><\/ul><i>Part 4: Special Topics<\/i><ul>\n    <li>Graph Analytics: structure, traversals, analytics, PageRank, community detection, recursive queries, semantic web<\/li><li>Guest Lectures<\/li>\n<\/ul>",
    "estimatedClassWorkload": "10-12 hours\/week",
    "recommendedBackground": "We expect you to have intermediate programming experience and familiarity with\ndatabases, roughly equivalent to two college courses. &nbsp;We will have four programming assignments: two in Python, one\nin SQL, and one in R. The target audience is undergraduate students across\ndisciplines who wish to build proficiency working with large datasets and a range of tools to\nperform predictive analytics.<br><br>After taking this course, you may be interested in participating in the three-course&nbsp;<a href=\"http:\/\/www.pce.uw.edu\/certificates\/data-science.html\" target=\"_blank\" title=\"Link: http:\/\/www.pce.uw.edu\/certificates\/data-science.html\">Certificate in Data Science<\/a>&nbsp;offered through the <a href=\"http:\/\/www.pce.uw.edu\/\" target=\"_blank\" title=\"Link: http:\/\/www.pce.uw.edu\/\">University of Washington Professional and Continuing Education program<\/a>. &nbsp;This online course will provide an overview and introduction to the more extensive material covered in that program, which offers classroom-based instruction by data scientists from Microsoft and other Seattle players, networking opportunities with peers, case studies from the \"front lines,\" and deep dives into selected topics.",
    "links": {

    }
}