{
    "id": 2043,
    "shortName": "electricity2",
    "name": "Электричество и магнетизм. Часть 2 (Electricity and Magnetism. Part 2)",
    "language": "ru",
    "shortDescription": "Курс освещает базовые законы электромагнитной индукции и электрических колебаний",
    "aboutTheCourse": "<div>Предлагаемый курс «Электричество и магнетизм. Часть 2» является естественным продолжением курса&nbsp;<a href=\"https:\/\/www.coursera.org\/course\/electricity\" target=\"_blank\">«Электричество и магнетизм. Часть 1»<\/a>&nbsp;&nbsp;и включает в себя обсуждение явления электромагнитной&nbsp;индукции, относительности характера электрического и магнитного полей, круга вопросов, связанных с квазистационарными процессами и электрическими колебаниями в линейных электрических системах, а так же спектральным анализом электрических сигналов.&nbsp;<br><br><\/div><div>Электричество и магнетизм. Часть 2» представляет собой абсолютно самостоятельный курс, для прохождения которого прослушивание курса «Электричество и магнетизм. Часть 1» не является обязательным. Тем не менее, авторы рекомендуют ознакомиться с его материалами для создания необходимого фундамента знаний.<br><\/div>",
    "targetAudience": 0,
    "courseSyllabus": "<div><b>Неделя&nbsp;1. <\/b>Электромагнитная индукция в движущихся и неподвижных проводниках. Закон электромагнитной индукции. Правило Ленца. Относительный характер электрического и магнитного полей. Коэффициенты само- и взаимоиндукции. Теорема взаимности. Магнитная энергия и её локализация в пространстве. Объёмная плотность энергии. Энергетический метод вычисления сил в магнитном поле. Подъёмная сила электромагнита.<\/div><div><br><\/div><div><b>Неделя&nbsp;2<\/b>. Квазистационарные процессы. Процесс установления тока в цепи, содержащей индуктивность. Колебания в линейных системах. Колебательный контур. Свободные затухающие колебания. Коэффициент затухания, логарифмический декремент и добротность. Энергетический смысл добротности.<\/div><div><br><\/div><div><b>Неделя&nbsp;3<\/b>. Вынужденные колебания под действием синусоидальной силы. Амплитудная и фазовая характеристики. Резонанс. Процесс установления стационарных колебаний. Комплексная форма представления колебаний. Векторные диаграммы. Комплексное сопротивление (импеданс). Правила Кирхгофа для переменных токов. Работа и мощность переменного тока.&nbsp;<\/div><div><br><\/div><div><b>Неделя&nbsp;4<\/b>. Вынужденные колебания под действием несинусоидальной силы. Амплитудная и фазовая модуляции. Понятие о спектральном разложении. Спектр одиночного прямоугольного импульса и периодической последовательности импульсов. Соотношение неопределённостей. Спектральный анализ линейных систем. Колебательный контур как спектральный прибор. Частотная характеристика и импульсный отклик. Понятие о детектировании модулированных сигналов.<\/div><div><br><\/div><div><b>Неделя&nbsp;5<\/b>. Параметрическое возбуждение колебаний. Понятие об автоколебаниях. Обратная связь. Условие самовозбуждения. Роль нелинейности.<br><br><strong>Неделя 6.<\/strong>&nbsp;Экзаменационная работа<br><\/div>",
    "estimatedClassWorkload": "4-12 hours\/week",
    "recommendedBackground": "<span><p dir=\"ltr\">Слушателям курса необходимо владеть: <\/p><ul><li><p dir=\"ltr\">знаниями по физике в объеме школьной программы,<\/p><\/li><li><p dir=\"ltr\">основами дифференциального и интегрального исчисления, <\/p><\/li><li>основами векторного исчисления.<\/li><\/ul>Необходимо иметь представление о ключевых понятиях электростатики и магнитостатики, таких как заряды, поля, принцип суперпозиции, уравнения Максвелла, записанные в статическом случае как внутри вещества, так и вне его, энергия электрического поля, энергетические подходы для вычисления сил, действующих на объекты, находящиеся электростатическом поле. <br>Требуется представление о свойствах постоянного тока, в частности, законе Ома, правилах Кирхгофа и законе Джоуля-Ленца. В курсе предполагается, что слушатели знакомы с законом Био-Савара-Лапласа и имеют представление о силе Лоренца и силе Ампера. <br>Также необходимо владение основами векторного анализа, представление о понятиях градиента, дивергенции, ротора.<br><\/span>",
    "links": {

    }
}