{
    "id": 1158,
    "shortName": "animal",
    "name": "Animal Behaviour and Welfare",
    "language": "en",
    "shortDescription": "Animal welfare has been described as a complex, multi-faceted public policy issue which includes important scientific, ethical, and other dimensions. Improving our understanding of  animal welfare, involves the fascinating study of animal behavior as well as the challenge of accessing the emotions of animals. This is the second time we have run this course, and we have revised some of the content and assessments in line with the great feedback we gained from our first run through. We have also added some subtitles to the videos for the Spanish and Mandarin speakers who wish to participate. Talk about this course using the hashtag #EdAniWelf",
    "aboutTheCourse": "<p><span>Animals occupy a huge part of the planet and\nour lives, and although we rely on them for all aspects of our own wellbeing - food, draught power, medical advances, clothing, sport as well as pleasure,\nprotection and comfort - often their quality of life is questionable. Appreciating how animal's&nbsp;experience the world they live in and&nbsp;the different behavioural needs of the various species we&nbsp;interact with,&nbsp;enables us to gain a better&nbsp;understanding of their welfare requirements, so that long term improvements to animal lives can be made.&nbsp;&nbsp;<br><\/span>\n<\/p>\n<p><span>There are now more than 60 billion\nland animals raised for meat <i>each year<\/i> around the world, and with\nincreasing human populations and a rise in meat consumption in many parts of the world, these figures are set to double by 2050. Added to this is a huge and growing&nbsp;world population of dogs and cats, many of whom are strays&nbsp;with associated health and welfare issues.&nbsp;&nbsp;International concern for animal welfare\ncontinues to grow with rising demand for measures to protect animals and\nimprove their care and wellbeing. The link between animal welfare and human\nwellbeing is clear, and yet we still have a long way to go if we are to address\nwelfare needs globally. Finding ways to <\/span>achieve higher standards of animal welfare, is therefore a key priority for any developed and developing nation. Due to gaining in importance internationally, there is increasing recognition of the need for animal welfare issues to be addressed objectively in a scientifically credible manner. <br><\/p><p>In this animal behaviour and welfare course, you will learn about animal welfare and why it matters, develop an understanding of some of the main welfare issues animals have to cope with as well as gaining an insight into the behavioural needs and the emotions&nbsp;of dogs, cats, farmed animals and\n    captive wildlife.<\/p><p><br><\/p>\n<p><a href=\"https:\/\/twitter.com\/JMICAWE\" target=\"blank\"><strong>Follow us on\ntwitter<\/strong><\/a><br>@JMICAWE<br><strong>#EdAniWelf<\/strong><\/p>\n\n<p><a href=\"https:\/\/www.youtube.com\/watch?v=r8cfBTmlx-k\" target=\"blank\">Watch\nour <strong>Behind The Scenes Video Diary<\/strong><\/a><\/p><p><br><\/p>\n<br>\n<p><\/p>\n<p>\n<\/p><p>\n<img src=\"https:\/\/d396qusza40orc.cloudfront.net\/animal\/sruc_uoe.png\" style=\"width:35%\" alt=\"SRUCUOE logo\" title=\"Image: https:\/\/d396qusza40orc.cloudfront.net\/animal\/sruc_uoe.png\">\n    <br>\n<\/p>\n<p>\n    <i>This course is delivered collaboratively by academics from the <a href=\"http:\/\/www.ed.ac.uk\/home\" target=\"_blank\">University of Edinb<\/a><\/i><i><a href=\"http:\/\/www.ed.ac.uk\/home\" target=\"_blank\">ur<\/a><\/i><i><a href=\"http:\/\/www.ed.ac.uk\/home\" target=\"_blank\">gh<\/a> and <a href=\"http:\/\/www.sruc.ac.uk\/\" target=\"_blank\">Scotland's Rural College (SRUC)<\/a>.<\/i><\/p><p><br><\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<p><span>Week 1:<b>&nbsp; <\/b>Introduction, <\/span>History, and Concepts of Animal Welfare.<\/p>\n\n<p>During\nthis week, we will consider what animal welfare is, the meanings and\ndefinitions of animal welfare and the history of animal welfare in different\nparts of the world and how views on animal welfare are influenced by cultural,\nsocial, economical, political and other factors.<\/p>\n\n<p>&nbsp;<\/p>\n\n<p>Week\n2: Animal Behaviour and Animal Welfare Assessment<\/p>\n\n<p>Animals show both short-term and long-term\nbehavioural, physiological responses and immunological responses to challenges\nin their environment. We can use knowledge of animal physiology and both normal\nand abnormal behaviour as complementary approaches in the assessment of the\nwelfare of an animal in its captive environment. We can also employ\nexperimental techniques to try to understand animal emotions in relation to their living conditions, for example; to determine their preferences, or what they don't like or find aversive&nbsp;about a &nbsp;procedure or environment. These experimental techniques allow us to ‘ask’\nthe animals how they feel about their environment. In week 2 we will explore a\nvariety of techniques used practically and experimentally to provide an insight\ninto the animal’s experience of its world. <\/p>\n\n<p>&nbsp;<\/p>\n\n<p>Week\n3: Practical Animal Welfare: Companion Animal Welfare<\/p>\n\n<p>In\nmany countries dogs and cats are traditionally kept as pets in the home, with\nstray\/abandoned or unwanted animals usually housed in shelters, where there are\nfrequently questions about their behavioural needs. In other parts of the world\ndogs and cats may exist very successfully as part of a ‘community’ or as\n‘street’ animals, and this existence also presents unique challenges and\nbenefits to the welfare of these species. In this lecture we will explore the\nplace of dogs and cats in human society and how different attitudes and\nmanagement styles impact on their welfare.<\/p>\n\n<p>&nbsp;<\/p>\n\n<p>Week\n4: Practical Animal Welfare: Production Animal Welfare<\/p>\n\n<p>Production animal welfare is a hot topic. In this\nsession you will gain an appreciation of the relevance of farm animal welfare\nand the issues that impact on production animal species.&nbsp; We shall also look at the way that scientists\nhave contributed to our understanding of the importance of these impacts from\nan animal's point of view. We will explore societal concerns, the scientific\nunderstanding of animal welfare within a variety of production methods and how\nwe gain insight to the animal's viewpoint.&nbsp;\n<\/p>\n\n<p>&nbsp;<\/p>\n\n<p>Week\n5: Practical Animal Welfare: Captive Wild Animal Welfare<\/p>\n\n<p>During\nthe fifth week we will summarise key welfare issues relating to the management\nof captive wild animals in zoos. Primarily conservation-focussed, the zoo community is\nbecoming increasingly aware of the welfare concerns arising from the management\nof captive wild animals and is developing strategies to address these issues.\nWe will look at the conflicts between welfare and conservation, the methods for\nassessing welfare within a zoo environment and the challenges associated with\nthis.<\/p><p><br><\/p>",
    "estimatedClassWorkload": "1-3 hours\/week",
    "recommendedBackground": "&nbsp;\n\n\n\n\n\n\n\n\n\n\n\n\n\nNo background is\nrequired.<br><br><br>",
    "links": {}
}