{
    "id": 1148,
    "shortName": "corpfin",
    "name": "Основы корпоративных финансов (Fundamentals of Corporate Finance)",
    "language": "ru",
    "shortDescription": "Мы рассмотрим принципы и модели финансового анализа компании, а также оценку стратегических решений компании с точки зрения их влияния на фундаментальную стоимость компании.\nIn this course you will learn the principles and models of financial analysis of a firm based on the criteria of value creation.\n",
    "aboutTheCourse": "<p>Курс посвящен новой для российской\nпрактики&nbsp; методологии анализа компании,\nсфокусированной на задаче максимизации ее фундаментальной стоимости. Он основан\nна концепциях современной финансовой теории и выходит далеко за рамки\nинтерпретации финансовой отчетности компании.&nbsp;\n<\/p>\n\n<p><\/p><p>Применяя\nпринципы универсальной финансовой теории, мы, тем не менее, отразим и специфику\nроссийского рынка капитала, который относится к группе развивающихся рынков. Курс\nоснован на изучении публичных компаний,&nbsp;\nоднако его концепции применимы к компаниям любой организационно-правовой\nформы. <\/p>\n\n<p>Мы сфокусируемся на анализе ключевых\nкорпоративных решений: решений о привлечении капитала и решений об инвестициях.\nИнвестиционные решения – это выбор компанией проектов для долгосрочных вложений.\nНаша задача : научить вас современным методам оценки и критериям выбора\nинвестиционных проектов.&nbsp; Решения о привлечении капитала – это выбор\nисточников финансирования инвестиций (внутренние средства, заемные средства,\nсредства привлеченные путем выпуска новых акций). Наша задача – объяснить\nмотивы выбора конкретной комбинации&nbsp;\nинструментов финансирования в компании и показать, чем определяется\nоптимальная структура капитала компании (соотношение заемного и собственного\nкапитала).<br><\/p>\n\n<p>Мы также рассмотрим решения компании о\nвыплатах акционерам, и продемонстрируем как полученные в этом курсе знания\nпозволяют оценивать стоимость компании в целом, с учетом выбранной структуры\nкапитала.<\/p><p><\/p><p>\n\n<p>Наконец, мы\nобсудим роль корпоративного управления (corporate governance) в создании\nстоимости компании.<\/p>\n\n<\/p>\n\n<p>In\nthis course we will present the modern approach to analysis of a company, with\na focus on value maximization. We will apply the principles of the modern\nfinance theory. At the same time, we will show how to take into account\nspecificities of a typical firm in an emerging market, such as Russia.<br><\/p>\n\n<p>The\ncore of the course is the analysis of financing, investment and payout\ndecisions of a firm. We will teach you the principles and techniques of\nselecting projects for investment. We will examine the determinants of the\ncapital structure choices by firms as well as the notion of the optimal capital\nstructure. We will analyze how firms decide on their payouts to shareholders\nand what the optimal payout policy should be. Finally, we will show how to\nvalue a company, taking into account its capital structure, and discuss the\neffects of corporate governance on firm value.<\/p><br><br>",
    "targetAudience": 1,
    "courseSyllabus": "<p>Неделя 1. Цели корпорации. Потоки\nденежных средств корпорации. <\/p>\n\n<p>Неделя 2. Стоимость денег с учетом фактора времени (time value of money). Дисконтирование и приведенная стоимость. Фундаментальная стоимость облигаций.<br><\/p>\n\n<p>Неделя 3. Риск и доходность. Модель ценообразования финансовых активов (Capital Asset Pricing Model, CAPM)<br><\/p>\n\n<p>Неделя 4. Использование модели CAPM для определения требуемой доходности проекта. Критерии принятия инвестиционных решений<br><\/p>\n\n<p>Неделя 5. Как корпорации привлекают\nкапитал. Структура капитала компании на совершенном рынке капитала. Стоимость\nкапитала для компании (cost of capital)<br><\/p>\n\n<p>Неделя 6. Структура капитала компании на\nнесовершенном рынке:&nbsp; Эффект налогов и\nиздержек банкротства (financial distress costs). Теория компромисса (Trade-off theory).<\/p>\n\n<p>Неделя 7. Структура капитала на\nнесовершенном рынке:&nbsp; эффект агентских\nпроблем и асимметричной информации. Порядок выбора источников финансирования. (Pecking order of financing).<\/p>\n\n<p>Неделя 8. Политика выплат инвесторам.\nМодель для совершенного рынка. Загадки дивидендов. Эффект налогов и асимметрии\nинформации.<br><\/p>\n\n<p>Неделя 9. Оценка стоимости&nbsp; компании методами дисконтирования денежных\nпотоков.&nbsp;<br><\/p>\n\n<p>Неделя 10. Стратегические сделки:\nслияния,&nbsp; поглощения, выкупы компаний,\nреструктуризация.<br><\/p>\n\n<p>Неделя 11. Корпоративное управление (corporate governance)\nи стоимость компании&nbsp;<\/p>",
    "estimatedClassWorkload": "5-8 hours\/week",
    "recommendedBackground": "<span>Курс задуман как вводный курс по финансам и, поэтому, не предполагает\nпредварительных знаний в этой области. Тем не менее, базовые знания бухучета,\nценообразования активов, теории вероятности будут полезны.<\/span>",
    "links": {

    }
}