{"id":2687,"shortName":"droit","name":"Droit international et droit comparé: regards croisés","language":"fr","shortDescription":"Introduire aux problématiques contemporaines du droit international et du droit comparé.\n\nAn Introduction to the contemporary issues on international law and comparative law. ","aboutTheCourse":"<span>Ce cours propose d'aborder quinze thèmes qui font l'objet de problématiques contemporaines à la fois&nbsp;dans les ordres juridiques nationaux et dans le droit international.<br>Partant du constat que de plus en plus de questions et de procès sont réglés aujourd'hui par l'application de règles émanant de plusieurs droits différents, nous proposons de confronter le point de&nbsp;vue du comparatiste (sur les ressemblances et les différences entre ordres juridiques nationaux) et le point de vue de l'internationaliste (sur les règles formulées par les Etats et les \"créatures\" qu'ils établissent).<br>Ce cours part de la notion classique d'ordre juridique (national ou international), en considérant que ces ordres juridiques ne constituent pas des \"bulles\" parfaitement indépendantes les unes des autres, mais sont souvent en&nbsp;interaction via une relative circulation des notions et règles juridiques. Le croisement des deux perspectives amène à mettre en valeur les continuités et discontinuités, parfois les imbrications et les oppositions entre les droits nationaux, régionaux et internationaux.<\/span>","targetAudience":1,"courseSyllabus":"Semaine 1:<br>Cours 1: Méthodologie et approches des ordres juridiques\ninternes<br>Cours 2: &nbsp;Méthodologie et approches des ordres juridiques&nbsp;internationaux.<br>Cours 3: L’identification de l’État (droit comparé)<br><br>Semaine 2:<br>Cours 4: L'identification de l'Etat (droit international)<br>Cours 5: La responsabilité interne de l'Etat<br>Cours 6: la responsabilité internationale de\nl’État<br><br>Semaine 3 :<br>Cours 7: Les constitutions<br>Cours 8: La Charte des Nations Unies<br>Cours 9: Les autorités indépendantes.<br><br>Semaine 4 :<br>Cours 10: Les organisations internationales.<br>Cours 11: Le fédéralisme<br>Cours 12: les organisations régionales<br><br>Semaine 5 :<br>Cours 13: La loi<br>Cours 14: le droit international coutumier<br>Cours 15: Le droit des contrats<br><br>Semaine 6:<br>Cours 16: Le droit des traités.<br>Cours 17: Les limites à la liberté de contracter (droit comparé)<br>Cours 18: Les limites à la liberté conventionnelle (droit international)<br><br>Semaine 7 :<br>Cours 19: La\nfonction du juge national<br>Cours 20: La fonction du juge international<br>Cours 21: L'usage du droit international par le juge (perspective de droit comparé)<br><br>Semaine 8: <br>Cours 22: L'usage du droit international par le juge (perspective de droit international)<br>Cours 23: Le droit pénal<br>Cours 24: La sécurité collective<br><br>Semaine 9:<br>Cours 25: Les garanties des droits de l’homme&nbsp;&nbsp;(perspective de droit comparé)<br>Cours 26: Les garanties internationales et régionales des droits de l'homme<br>Cours 27: Les statuts personnels et la nationalité&nbsp;&nbsp;(perspective de droit comparé)<br><br>Semaine 10:<br>Cours 28: La nationalité en droit international<br>Cours 29: Droit commercial<br>Cours 30: Droit de l’OMC","courseFormat":"Le cours est constitué de 30 sessions d'environ 20 minutes chacune. En alternance 15 sessions sont consacrées au droit comparé et 15 sessions au droit international. Chaque semaine sont présentées trois sessions, ce qui aboutit à 10 heures de cours sur 10 semaines.<br>Les étudiants sont appelés à compléter leur information par la bibliographie indiquée pour pouvoir participer de manière efficace aux trois examens sous forme de questionnaire.&nbsp;","suggestedReadings":"La littérature en matière de droit comparé et de droit international est considérable.<br><br>Le recours aux manuels classiques (pour le droit comparé, R. David et C. Jauffret-Spinosi, <em>Les grands systèmes de droit contemporains<\/em>, Dalloz; M. Fromont, <em>Grands systèmes de droit étranger,<\/em> Dalloz; K. Zweigert, H. Kötz, <em>Introduction to Comparative Law<\/em>, Clarendon Press; pour le droit international, C. Santulli, <em>Introduction au droit international<\/em>, Pedone; P. Daillier, A. Pellet, M. Forteau, <em>Droit international public<\/em>, LGDJ; M. Perrin de Brichambaut, J.-F. Dobelle, M.-R. d'Haussy, <em>Leçons de droit international public,<\/em> Presses de Sciences Po\/Dalloz; A. Cassese, <em>International Law<\/em>, Oxford University Press) sera des plus utiles.<br>Les étudiants peuvent se référer aux ouvrages des enseignants du cours: F. Couveinhes-Matsumoto, <em>L'effectivité en droit international<\/em>, Bruylant; J.-L. Halpérin, <em>Profils des mondialisations du droit<\/em>, Dalloz.&nbsp;<br>Des indications bibliographiques plus précises pourront être fournis pour chaque cours.","estimatedClassWorkload":"2-3 hours\/week","recommendedBackground":"Des connaissances juridiques de base sur le vocabulaire juridique, sur au moins un ordre juridique national et des éléments de droit international sont nécessaires à la compréhension du cours. La bibliographie indiquée sera en français et en anglais.&nbsp;","links":{}}