{
    "id": 82,
    "shortName": "econ1scientists",
    "name": "Principles of Economics for Scientists",
    "language": "en",
    "shortDescription": "Quantitative and model-based introduction to basic ideas in economics, and applications to a wide range of real world problems.",
    "aboutTheCourse": "The impact of economic forces in our lives is sizable and pervasive. For this reason, it is impossible to understand the social and economic forces shaping our lives without a good understanding of basic economic principles. This course provides a quantitative and model-based introduction to such principles, and teaches how to apply them to make sense of a wide range of real world problems. Examples of applications include predicting the impact of technological changes in market prices, calculating the optimal gasoline tax, and measuring the value of new products. <br><br>This is a real Caltech class. It will be taught concurrently to Caltech and on-line students. This has two implications. On the costs side: the class is challenging, highly quantitative, and will demand significant effort. On the benefit side: successful completion of the class will provide you with an in-depth understanding of basic economics, and will permanently change the way you see the world.",
    "targetAudience": 0,
    "courseSyllabus": "<div><strong>Week 1.<\/strong> Principles of optimizing behavior.<\/div>\n<div><\/div>\n<div><strong>Week 2.<\/strong> Consumer Theory.<\/div>\n<div><\/div>\n<div><strong>Week 3.<\/strong> Producer Theory.<\/div>\n<div><\/div>\n<div><strong>Week 4.<\/strong> Outcome of competitive markets.&nbsp;<\/div>\n<div><\/div>\n<div><strong>Week 5.<\/strong> Effects of government intervention in competitive markets: taxes and regulation.&nbsp;<\/div>\n<div><\/div>\n<div><strong>Week 6.<\/strong> Imperfect competition 1: monopolistic markets.<\/div>\n<div><\/div>\n<div><strong>Week 7.<\/strong> Imperfect competition 2: oligopoly and monopolistic competition.<\/div>\n<div><\/div>\n<div><strong>Week 8.<\/strong> Externalities with and without government intervention.<\/div>\n<div><\/div>\n<div><strong>Week 9.<\/strong>&nbsp;Markets with asymmetric information.<\/div>",
    "estimatedClassWorkload": "8-10 hours\/week",
    "recommendedBackground": "A strong quantitative background, and basic (univariate) calculus (equivalent of Caltech’s Math 1a).",
    "links": {

    }
}