{"id":1146,"shortName":"publiceconom","name":"Public Economics","language":"en","shortDescription":"This course is a brief introduction into public economics theory. It covers main economic functions of government, including taxation, regulation, and social service delivery, and touches upon economic, social, political and administrative aspects of government’s involvement in economy.","aboutTheCourse":"<p>This course offers an introduction into the public economics theory. It does not aspire to cover theories of taxation, public expenditures, regulation etc. at length and in-depth. Rather, our ambition is to give a bird's-eye view of central themes of public economics and related disciplines, and teach concepts, logic, and ideas, rather than methods of analysis, which would require an entirely different course format.<\/p><p>Our choice of topics covered by the course reflects a trade-off between salience and centrality, on the one hand, and suitability for a brief online introductory course, on the other. The course content is neither comprehensive (which would be a \"mission impossible\" for virtually any public economics course\"), nor representative of other such courses. With these limitations and caveats in mind, we encourage our students to continue their public economics studies in a more regular fashion, and see our role inter alia in motivating interest in such \"continued education\".<\/p><p>The central theme of the course is the role of government as a mechanism of resource allocation which complements and augments markets. Governments are viewed as public agencies set to correct market failures. Such agencies however are prone to failures of their own, and hence markets and governments are two imperfect alternatives. We deal with government's limitations, with particular emphasis on those that have to do with informational asymmetry, limited administrative capacity, and imperfect accountability to society. Otherwise the course's man themes are economics of taxation, regulation, politics of public economics, incentives in government, and government vis-à-vis (civil) society.<\/p><p><\/p>","targetAudience":1,"courseSyllabus":"<p><strong>Week 1. Government in a Market Economy<\/strong><\/p><p>Resource Allocation by Markets and Governments. Market Failures. Coase Theorem and Its Limitations. Collective Action Problem in Public Good Provision. Tools of Government. Example: Contract Enforcement. Productive Activities and Rent-Seeking.<\/p><p><strong>Week 2. Design of Government: A Tax Theory Primer<\/strong><\/p><p>Normative and Positive Approaches. Scale and Scope of Government. Variety of Taxes. Optimal Taxation: Constraints and Objectives. Lump-Sum as First-Best. Informational Asymmetry and Income Taxes. Ramsey Rule. Time (In)Consistency. Protection from Leviathan.<\/p><p><strong>Week 3. Scope of Government<\/strong><\/p><p>2nd Best Approach. How to Control Externalities: Courts vs. Government Regulation. Coasean Alternatives. Public Service Delivery: In-House vs. Outsourcing. Property Rights and Incomplete Contracts. Regulatory Capture. De Soto Effect and Regulation of Entry. Public Interest Vs. Public Choice.<\/p><p><strong>Week 4. Politics of Public Economics<\/strong><\/p><p>Tax and Expenditure Decisions in Democracies and Autocracies. Democratic Accountability and Social Optimum. Preference Aggregation Problem. Single-Peaked Preferences and Median Voter. Democratic (in)Efficiency and Political Conflict. Public Economics of Separation. Equal Treatment Through User Fees.<\/p><p><strong>Week 5. Working of the Government<\/strong><\/p><p>External and Internal Agency Problem. Factors and Limitations of Ex Post Accountability. Accountability Ex Ante and Optimal majority Rule. Performance Incentives in Public Sector. Limitations of Vertical Monitoring. Career Concerns as an Incentive Mechanism in Public Sector. Rational expectations. Economics of Corruption Primer.<\/p><p><strong>Week 6. Government and Society<\/strong><\/p><p>Costs of Disorder and Costs of Dictatorship. Role of Social Capital. Philanthropy and \"Warm Glow\". Social Capital and Public Regulation. Paradox of Social Capital. Civic Culture and Political Collective Action Problem. Picking Up Where Government Left Off: Dark Side of Social Capital. Social Capital and Welfare State.<\/p>","courseFormat":"The course will be delivered in six lectures&nbsp;each 1.5-2 hours long. Lectures are subdivided into relatively self-contained&nbsp;segments each dealing with a particular topic of episode and often based on a particular research article. To each lecture there will be Lecture Notes offering a preview of the lecture material, drawing attention to central topics and ideas as well as lessons learned, and providing other relevant details. Also, each of 6 lectures will be accompanied by a quiz and there will be a final exam.<br>","suggestedReadings":"<p>Lecture materials will be self-contained and sufficient to get the main ideas and to correctly answer quiz and final exam questions. Still, for those of you who are interested public we recommend for references two following textbooks (without ruling out others, of course):<\/p><p>• Arye Hillman. Public Finance and Public Policies. Responsibilities and Limitations of Government. Cambridge University Press, 2009.<\/p><p>• Jean Hindriks and Gareth D. Myles. Intermediate Public Economics. MIT Press, 2006.<\/p>","estimatedClassWorkload":"6-8 hours\/week","recommendedBackground":"<p>We expect students to be familiar with key microeconomic methods and concepts at the intermediate level. The course such as this cannot be made entirely non-technical (although ideas and intuition are given precedence over technical tools), and hence some familiarity with basic calculus and game theory are expected, too.<br><\/p>","links":{}}