{
    "id": 1051,
    "shortName": "megafauna",
    "name": "Marine Megafauna: An Introduction to Marine Science and Conservation",
    "language": "en",
    "shortDescription": "An introduction to the basics of marine science and conservation, brought to you with the help of sea turtles, marine mammals, seabirds and many more of the most compelling creatures in the ocean.\n",
    "aboutTheCourse": "<b>This course is about sea turtles, whales, dolphins, seals, penguins, sharks, giant squid and other large ocean creatures - <\/b><i><b>collectively known as marine megafauna<\/b><\/i><b> - and what they can tell us about how the ocean works and why it is so important\nfor all life on earth.\n<\/b><br>\n<br>This course will help you learn about life in the ocean, how ocean ecosystems function, how scientists study the ocean, and the challenges we face in sustaining healthy oceans for the future. These topics will be explored using case studies that focus\non charismatic marine megafauna species – the most compelling creatures in the ocean that capture our attention and inspire us to learn more.\n<br>\n<br>The course starts with an examination of the physical dimensions of the world’s ocean and how we describe ocean zones based on the ecosystems found within them. Once these basics are covered, we will work through the evolution of life in the oceans and\nexplore how marine animals have adapted to the challenges of a cold, dark and deep ocean. Throughout the class we will highlight how scientists study the oceans and the animals that live in them, providing glimpses of new technologies that boost our understanding\nof marine ecology. The course will also cover some of the challenges the oceans face due to human activities - exploring issues such as bycatch and climate change - and how they are affecting ocean species and systems.\n<div><span><p> <\/p><p><a href=\"http:\/\/www.plosone.org\/\"><img width=\"191\" src=\"http:\/\/www.plosone.org\/images\/logo.png\" height=\"41\" alt=\"PLOS ONE\"><\/a><\/p><p>Throughout the course we will connect with real marine science through the use of open access scientific articles published in the journal PLOS ONE. This means you will have to learn how to read scientific papers and extract the important bits of information from them. The articles you’ll be reading are all part of a new PLOS Collection focused on using open access research to teach marine science and conservation. You will also get to look at real datasets produced by scientists studying marine creatures and visualize them in freely available programs such as Google Earth.<br><\/p><\/span>\n<\/div>",
    "targetAudience": 0,
    "courseSyllabus": "<div><b>Week 1. Getting Started&nbsp;<\/b><\/div><div><ul><li>Welcome to Marine Megafauna - some basic introductions are in order!<\/li><li>Cracking the code: How to read a PLOS ONE journal article. Students will learn how to approach reading a PLOS ONE article.<br><\/li><li>Ocean Basics. Students will learn the basics about the ocean(s).<br><\/li><li>Origins of Marine Megafauna. Students will learn the evolutionary origins of the major groups of megafauna that live in the sea.<br><\/li><\/ul><\/div><div><br><\/div><div><b>Week 2. Introductions to Marine Megafauna - Diversity and Taxonomy I<\/b><\/div><div><ul><li>Introduction to Sea Turtles. Students will learn basics about sea turtle diversity, biology and ecology.<br><\/li><li>Introduction to Seabirds. Students will learn basics about seabird diversity and ecology with a focus on colonial living.<br><\/li><li>Introduction to Penguins. Students will learn basics about penguin biology and ecology.<br><\/li><\/ul><\/div><div><br><\/div><div><b>Week 3. Introductions to Marine Megafauna - Diversity and Taxonomy II<\/b><\/div><div><ul><li>Introduction to Marine Mammals. Students will learn basics about diversity of marine mammals.<br><\/li><li>Introduction to Large Fishes. Students will learn basics about diversity, biology and ecology of large fishes.<br><\/li><li>Introduction to Marine Mega-Invertebrates. Students will learn basics about mega-invertebrate diversity and ecology.<\/li><\/ul><\/div><div><br><\/div><div><b>Week 4. Adaptations to life in the ocean I<\/b><\/div><div><ul><li>Ecophysiology of large marine animals. Students will learn about physiological challenges posed by living in the ocean: thermoregulation, pressure, osmoregualtion and more.<br><\/li><li>Functional morphology and diving physiology. Students will learn about adaptations that allow animals to move efficiently and dive.<br><\/li><li>Movements, migrations, and behaviors. Students learn about movements of animals in the ocean - vertical migrations, latitudinal trips and ontogentic descents.<br><\/li><\/ul><\/div><div><br><\/div><div><b>Week 5. Adaptations to life in the ocean II<\/b><\/div><div><ul><li>Foraging and Feeding in the sea. Students learn about how animals forage and feed in the ocean.<br><\/li><li>Bioenergetics and the challenges of ocean living. Students learn about energy flow in individuals and populations.<br><\/li><li>Trophic ecology\/foraging theory. Students learn about trophic structures and the complexity of marine food webs.<\/li><li>Life history and reproductive strategies. Student learn basics of life history and reproductive approaches in marine animals<br><\/li><\/ul><\/div><div><br><\/div><div><b>Week 6. Oceanography and Deep Sea Biology - Robots and Subs<\/b><\/div><div><ul><li>Oceanography techniques. How we study ocean currents and water properties.<br><\/li><li>Deep sea biology and ecology. An introduction to the ecology of deep sea systems.<br><\/li><li>Chemosynthetic life in the ocean. How life exists without light.<br><\/li><li>ROVs, AUVs, Ocean Gliders and manned submarines. An introduction of the use of robots and subs to study marine systems.<br><\/li><\/ul><\/div><div><br><\/div><div><b>Week 7. Marine Conservation I<\/b><\/div><div><ul><li>What is marine conservation biology? A description of conservation and how conservation conflicts proceed.<br><\/li><li>The role of individuals and science in conservation. An overview of how individuals shaped the terrestrial conservation movement and how science fits into the overall process of sustaining marine resources.<br><\/li><li>Marine Acoustic Ecology. Introduces students to ocean acoustics and why sound is so important to animals in the sea.<br><\/li><li>Anthropogenic noise.\tProvide an overview of the most pressing issues in marine bioacoustics: seismic, shipping, sonar.<br><\/li><\/ul><\/div><div><br><\/div><div><b>Week 8. Marine Conservation II<\/b><\/div><div><ul><li>Seals, Fisheries and coastal conflicts. &nbsp;Provides an overview of the classic marine predator problem in marine systems - the recovery of pinnipeds from persecution\/exploitation and how that may affect coastal communities.<br><\/li><li>Bycatch. Students learn about bycatch and how it affects marine systems.<br><\/li><li>Whales and whaling conflicts. Students learn about historical commercial whaling and the current conflicts surrounding it.<br><\/li><li>Climate change. Students learn about the basics of climate change and how it affects marine species.<br><\/li><\/ul><\/div>",
    "estimatedClassWorkload": "6-8 hours\/week",
    "recommendedBackground": "Some familiarity with basic biological and ecological concepts as they relate to the ocean. <br>",
    "links": {

    }
}