{"id":1510,"shortName":"genphysem","name":"普通物理學 - 電磁學、光學及近代物理","language":"zh-tw","shortDescription":"物理學是描述世上質量與能量交互作用的學問，在這門課中我們將為大家介紹近代物理對於世界的認識。我們會從電磁學出發，進展到光學，並進而說明近代物理對人類觀念的突破。","aboutTheCourse":"以牛頓為首的古典力學，結合重力解釋了從地表到星空中許多肉眼可見物體的運動行為。但是生活中顯然還有許多現象，是光靠重力無法解釋的。例如你現在正在看的這台電腦，為何不會因為重力穿過桌面落到地上？要詳細解釋這個現象的起源，就需要用到電磁學的知識。在我們的身邊，電與磁的現象以及兩者的交互作用事實上不斷發生，例如肉眼可見的閃電，在神經中傳導的電信號，或是在原子尺度的鍵結。而所謂的可見光以及光學現象事實上只是強度不斷變化的電磁波造成的。所以了解電磁作用對於我們認識這個世界扮演了非常關鍵的角色。<br><br>而且就物理學來說，電磁學提供了一個很好的例子，說明物理學希望用一套簡單的理論來解釋周圍所有現象的企圖。例如電與磁乍看之下是兩個毫不相干的現象（想想一根柱狀磁鐵和一個電池有何相同之處？），但是卻透過許多物理學家的努力，發現這兩者只是同一個現象的不同表現，並建立了一致的理論。而這套\"簡單的\"電磁學理論（可縮減到只有四個方程式），卻可以用來非常精確的預測許多生活中的物理現象，例如發電機，無線電傳輸，以及光速等。<br><br>在十九世紀末期，當力學與電磁學都已經發展到相當完備的程度時，英國著名的物理學家Kelvin爵士曾感嘆「晴朗的天空只剩下遠方的兩朵小烏雲，物理學家們今後的工作，只不過剩下把數字算得更精確罷了！」。但是沒想到就是這兩個在光學上的實驗無法解釋（小烏雲），因而促成了二十世紀近代物理的兩大發現，亦即相對論與量子力學。<br><br>這門課希望以淺顯易懂的內容，引領聽眾從電磁學看到近代物理的發展，是如何劇烈地改變了我們人類對於大自然的認知方式。並能欣賞物理中使用數學作為語言的美麗，一些簡單的方程式，如何能告訴我們世界怎麼運轉？<br><br>具體的課程目標為<br>1. 希望學生可以了解生活中有哪些地方用到電磁學或近代物理的概念，並能用適當的文字敘述<br>2. 希望學生可以掌握基本的數學模型，用來解釋電磁學與近代物理現象<br>","targetAudience":0,"courseSyllabus":"第一週 － 電場概念簡介<br>從電荷與電場開始，生活中哪裡看的到？<br>超厲害的庫侖定律<br>到底什麼是「場」？<br>無所不在的高斯對電磁學的貢獻<br><br>第二週 － 電位能概念簡介<br>重力場有重力位能，那電場有電位能嗎？<br>電阻我知道，但是電容是什麼？<br>電阻加電容可以做什麼？<br>歐姆定律好吃嗎？<br><br>第三週 － 神秘的磁場<br>換個主題談磁場，生活中哪裡看的到？<br>磁場與電流之間的關係 － 很厲害的安培定律<br>也很厲害的法拉第電磁感應定律<br>電容儲存電能，電感儲存磁能<br>電阻＋電容＋電感 － 上帝也瘋狂<br><br>第四週 － 電磁學方程式<br>馬克斯威爾，關鍵時刻的大膽猜測可以讓你歷史留名<br>從馬克斯威爾到電磁波，偉大推導的來臨<br>光就是一種電磁波！你確定嗎？<br><br>第五週 － 就是那個光！<br>電磁波的基本與神奇特性<br>基本特性：偏振，反射，折射<br>神奇特性：干涉，繞射<br><br>第六週 － 相對論從哪冒出來的？<br>天邊的第一朵烏雲：光的傳播需要介質嗎？<br>愛因斯坦的時空假設：又一個關鍵時刻的大膽猜測<br>我的時間和你的時間真的一樣嗎？<br>我們看到的長度真的一樣嗎？<br>好吧，就算時間跟長度可以不一樣，這又跟E=mc^2有什麼關係？<br><br>第七週 － 量子力學又是怎麼想到的？<br>另外一朵烏雲：黑體輻射的光譜如何解釋？<br>普朗克的光子說：我們德國人真的很會大膽猜測喔<br>光電效應：愛因斯坦也來參一腳<br>光的本質：粒子還是波動？<br>超神奇的測不準原理<br><br>","courseFormat":"這門課會以演講授課為主，另外偶爾會搭配實驗的演示，讓同學對課程內容能夠有更深刻的印象。","suggestedReadings":"無","estimatedClassWorkload":"6-7 hours\/week","recommendedBackground":"須具備微積分基礎，以及對於基礎牛頓力學和波動力學的概念。","links":{}}