{"id":938,"shortName":"ntumlone","name":"機器學習基石 (Machine Learning Foundations)","language":"zh-tw","shortDescription":"Machine learning is the study that allows computers to adaptively improve their performance with experience accumulated from the data observed. The course teaches the most fundamental algorithmic, theoretical and practical tools that any user of machine learning needs to know. [機器學習旨在讓電腦能由資料中累積的經驗來自我進步。本課程將介紹各領域中的機器學習使用者都應該知道的基礎演算法、理論及實務工具。]","aboutTheCourse":"Welcome! The instructor has decided to teach the course in Mandarin on Coursera, while the slides of the course will be in English to ease the technical illustrations. We \nhope that this choice can help introduce Machine Learning to more \nbeginners in the Mandarin-speaking world. The English-written slides will not require advanced English ability to understand, though. If you can understand the following descriptions of this course, you can probably follow the slides. <b>[歡迎大家！這門課將採用英文投影片配合華文的教學講解，我們希望能藉這次華文教學的機會，將機器學習介紹給更多華人世界的入門者。課程中使用的英文投影片不會使用到艱深的英文，如果你能了解以下兩段的課程簡介，你應該也可以了解課程所使用的英文投影片。]<\/b><br><br>Machine learning is an exciting field with lots of applications in engineering, science, finance, and commerce. It is also a very dynamic field, where many new techniques are being designed every day, and the hot techniques and theories at times can rise and disappear rapidly. Thus, users of machine learning from other fields often face the problem of choosing or using the techniques properly. In this course, we emphasize the necessary fundamentals that give any student of machine learning a \nsolid foundation, and enable him or her to exploit current techniques properly, explore \nfurther techniques and theories, or perhaps to contribute their own in the future.<br><br>The course roughly corresponds to the first half-semester of the National Taiwan University course \"Machine Learning\", and the second half-semester is expected to be on Coursera under the name \"Machine Learning Techniques\" soon in the future. Based on five years of teaching this popular course successfully (including winning the most prestigious teaching award of National Taiwan University) and discussing with many other scholars actively, the instructor chooses to focus on what he believes to be the core topics that every student of the subject should know. The students shall enjoy a story-like flow moving from \"When Can Machines Learn\" to \"Why\", \"How\" and beyond. <br><br>","targetAudience":1,"courseSyllabus":"<span>Each of the following items correspond to approximately one hour of video lecture.<b> [以下的每個小項目對應到約一小時的線上課程]<\/b><br><br>When Can Machines Learn? <b>[何時可以使用機器學習]<\/b><br>   -- The Learning Problem <b>[機器學習問題]<\/b><br>   -- Learning to Answer Yes\/No <b>[二元分類]<\/b><br>   -- Types of Learning <b>[各式機器學習問題]<\/b><br>   -- Feasibility of Learning <b>[機器學習的可行性]<\/b><br> <br> Why Can Machines Learn? <b>[為什麼機器可以學習]<\/b><br>   -- Training versus Testing <b>[訓練與測試]<\/b><br><span>   -- Theory of Generalization <b>[舉一反三的一般化理論]<\/b><br>   -- The VC Dimension <b>[VC 維度]<\/b><br>   -- Noise and Error <b>[<\/b><\/span><\/span><span><b><b>雜訊一<\/b>錯誤]<\/b><br> <br> How Can Machines Learn? <b>[機器可以怎麼樣學習]<\/b><br><\/span><span><span>-- Linear Regression <b>[線性迴歸]<\/b><br>   <\/span>-- Linear `Soft' Classification <b>[軟性的線性分類]<\/b><br>   <\/span><span><span>   -- Linear Classification beyond Yes\/No <b>[二元分類以外的分類問題]<\/b><br>   <\/span>-- Nonlinear Transformation <b>[非線性轉換]<\/b><br> <br> How Can Machines Learn Better? <b>[機器<\/b><\/span><span><b>可以怎麼樣學得更好]<\/b><br>   -- Hazard of Overfitting <b>[過度訓練的危險]<\/b><br>   <\/span><span>-- Preventing Overfitting I: Regularization <b>[避免過度訓練一：控制調適]<\/b><br><b>   <\/b>-- Preventing Overfitting II: Validation <\/span><span><span><b>[避免過度訓練二：自我檢測]<\/b><br><\/span>-- Three Learning Principles<\/span> <b>[三個機器學習的重要原則]<\/b><br><br>","courseFormat":"The class will consist of lecture videos that contain integrated quiz questions. There will also be bi-weekly homeworks that are not part of video lectures. <b>[這門課主要以線上錄影課程及其中的小測驗組成，每兩週我們會有另外的作業練習。]<br><\/b><br>","suggestedReadings":"Although the lectures are designed to be self-contained, we recommend (but do not require) that students refer to the book <span><a target=\"_blank\" href=\"http:\/\/amlbook.com\">Learning from Data<\/a>, which contains<\/span> most of the materials covered in this course. <b>[雖然這門課的錄影課程及投影片應該足以幫大家了解所有的內容，我們推薦有興趣的同學們閱讀 <\/b><span><a target=\"_blank\" href=\"http:\/\/amlbook.com\"><b>Learning from Data<\/b><\/a><b> 一書，該書包含了本課程中所介紹的大部份的內容。]<\/b><\/span><br><br>","estimatedClassWorkload":"8-20 hours\/week","recommendedBackground":"The basic knowledge on Calculus (differentiation), Linear Algebra (vector and matrix operations) and Probability (independent and dependent events) will be helpful. Some homeworks will require writing simple code so some programming background (on any platform) is recommended. <b>[我們希望修課的同學對於基本的微分、向量與矩陣運算、及機率的工具有所了解。有些作業會需要寫作或執行一些程式，所以我們建議修課的同學能在你所熟悉的平台上有一些程式寫作的背景。]<\/b><br><br>","links":{}}