{"id":1774,"shortName":"hcqualityimprovement","name":"Take the Lead on Healthcare Quality Improvement","language":"en","shortDescription":"This course presents the concepts and processes of quality improvement (QI) and the importance of QI in improving patient outcomes.  Its aim is to enhance the competence of working healthcare professionals to lead and participate in interprofessional healthcare teams that are focused on quality improvement.  ","aboutTheCourse":"<p>In this course you will learn about the importance of quality in healthcare and how you can contribute by implementing a project to improve processes of care and patient outcomes. By learning the methods of QI and implementing these methods, you will add powerful QI tools to your ‘toolbox.’ You will learn the steps in the QI process during short lectures and reflective exercises, Then you will identify a clinically relevant project&nbsp; to address in your own practice setting or a personal improvement project and apply the QI tools.<\/p><p>The QI project will be considered within the context of interprofessional teams and from a systems perspective. Care environments are complex settings and call for a sophisticated set of collaborative teamwork skills and systems thinking. The objective of this course is to empower you, the working healthcare professional, to improve your knowledge and skills in the science of quality improvement so that you can take action in your own clinical setting to improve the quality of care for your patients and their families.<\/p>\n<p>This course has been approved for 27.7 contact hours and for module by module contact hours. See module agenda for number of contact hours available for specific modules. These contact hours will be awarded to participants who complete individual modules and the evaluation components.&nbsp;Frances Payne Bolton School of Nursing (OH-216\/11-01-15) is an approved provider of continuing nursing education by the Ohio Nurses Association (OBN-001-91), an accredited approver by the American Nurses Credentialing Center's Commission on Accreditation.<\/p><div><br><\/div>","targetAudience":1,"courseSyllabus":"<p>The 5-week course provides healthcare professionals across the world with the basic knowledge and skills to improve the quality and safety of health care using process improvement methods.&nbsp; Quality and safety in healthcare is an international priority.&nbsp; In the United States, it is a driver for change that is mandated by regulation, accreditation and reimbursement. Therefore it is essential to educate&nbsp;<u>all healthcare professionals, faculty and students<\/u>&nbsp;about contemporary approaches to improve quality and safety, supporting the goal to move quality improvement out of the ‘quality department’ and into the ‘hands of the professionals who deliver care.<\/p><p>This is an interprofessional course. The audience for the course includes front-line healthcare professionals, faculty and students in health professions schools, and other interested individuals. It is most relevant for nurses, physicians, pharmacists, social workers, therapists, dietitians, and healthcare administrators. An interdisciplinary framework is used that includes both theory and experiential components. The emphasis is on acquiring competence in quality improvement methods and teamwork and collaboration. The course will transform healthcare professionals to not only ‘do their work, but also to ‘improve their work.<\/p><p>Upon completion of the course, learners will be able to apply methods of continuous quality improvement to:<\/p><ul><li>Define quality and safety problems in the healthcare system;<\/li><li>Assess organizational contextual factors and benchmarks of best practices in quality and safety;and<\/li><li>Design, implement, and evaluate tests of change to improve healthcare systems.<\/li><\/ul><p>Learners will integrate the principles of interprofessional teamwork as an essential feature of the improvement process.<\/p><p>For each of five weeks there are two 1-hour didactic modules with active learning that include:<\/p><ul><li>Videos of core learning content (see syllabus outline);<\/li><li>Lessons learned from the field that include stories from healthcare professionals;<\/li><li>Active interaction using assignments and case studies;&nbsp;<\/li><li>Reflective exercises on the discussion board to apply the learning to the participants’ work settings; and&nbsp;<\/li><li>Required readings in advance of each module.<\/li><\/ul><p>Evaluation consists of achievement of learner competencies that are assessed with:<\/p><ul><li>Pre and post course evaluation for QI knowledge, attitudes, systems thinking and pre and post module evaluation of self-efficacy;<\/li><li>Quiz after each module; and<\/li><li>Learner evaluation of the course.<\/li><\/ul><b>Continuous Quality Improvement in Action<\/b><p>Through case study analysis and individual clinically based projects, participants will experience and reflect on the dimensions of improvement:<\/p><ul><li>Explain the system of care;&nbsp;<\/li><li>Identify factors related to psychology of change;<\/li><li>Differentiate the types of variation (common and special) present in a process; and<\/li><li>Describe one Plan-Do-Study-Act cycle.<\/li><\/ul><b>Interdisciplinary Team Work<br><\/b><p>Through work within teams within the clinical setting, participants will:<\/p><ul><li>Describe why and how disciplines, each representing a body of scientific knowledge, must work together to achieve continual improvement of health care;<\/li><li>Demonstrate an appreciation for various health disciplines and a realization that improvement will occur by cooperative problem solving;<\/li><li>Analyze the contributions of each discipline to the group project;&nbsp;<\/li><li>Identify ways to improve collaborative efforts; and<\/li><li>Demonstrate the ability to give and receive constructive feedback.<\/li><\/ul><p>The course is divided into modules addressing:<\/p><p><b>Week #&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;Module #&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Content<\/b><\/p><p><b>1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<\/b>1 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Overview of Healthcare Quality Improvement<br><\/p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 2 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Evidence for Improvement, Literature, Internet and More<br><\/p><p><b>2&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<\/b>3&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Interprofessional Teams for Improvement Work<br><\/p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 4 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Knowledge of Systems<br><\/p><p><b>3&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<\/b>5&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Targeting Your Aim from Global to Specific<br><\/p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 6 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Measuring for Improvement<br><\/p><p><b>4&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<\/b>7&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Data Variation and Control Charts<\/p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 8 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Human Side of QI: Psychology of Change<br><\/p><p><b>5&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<\/b>9&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Pilot, Implement &amp; Spread Change: The Model for &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Improvement&nbsp;<br><\/p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 10 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Putting it All Together: Facilitating &amp; Leading Change<br><\/p><div><br><\/div>","courseFormat":"<p>For each of five weeks there are two 1-hour didactic modules with active learning that include:<\/p><ul><li>Videos of core learning content (see syllabus outline);<\/li><li>Lessons learned from the field that include stories from healthcare professionals;<\/li><li>Active interaction using assignment and case studies;&nbsp;<\/li><li>Reflective exercises on the discussion board to apply the learning to the participants’ work settings; and &nbsp; &nbsp;<\/li><li>Required readings in advance of each module.<\/li><\/ul>Evaluation consists of achievement of learner competencies that are assessed with:<ul><li>Quiz after each module;<\/li><li>Evaluation of responses to unfolding case; and<\/li><li>Learner evaluation of the course.<\/li><\/ul>","suggestedReadings":"<p><a href=\"http:\/\/store.jcrinc.com\/fundamentals-of-health-care-improvement-a-guide-to-improving-your-patients-care-second-edition-\/fundamentals-of-heath-care-improvement-a-guide-to-improving-your-patients-care-second-edition-soft-cover-\/\" target=\"_blank\">Fundamentals of Heath Care Improvement: A Guide to Improving Your Patients' Care (2012), Second Edition<\/a> Ogrinc, G., Headrick, L, Moore, S.M., Barton, A.J., Dolansky, M.A., Madigosky, W. S. ISBN-10: 1599405695, ISBN-13: 978-1599405698<\/p>","estimatedClassWorkload":"5-7 hours\/week","recommendedBackground":"<p>The audience for the course includes front-line healthcare professionals, faculty and students in health professions schools, and other interested individuals. It is most relevant for nurses, physicians, pharmacists, social workers, therapists, dietitians, and healthcare administrators.<\/p><p>Students should be able to read and write comfortably in English at a high school level.<\/p>","links":{}}