{"id":1761,"shortName":"chem991","name":"Introduction to Chemistry:  Reactions and Ratios","language":"en","shortDescription":"This is an introductory course for students with limited background in chemistry; basic concepts involved in chemical compositions, periodic trends, reactions, and quantitative problem solving will be emphasized with the goal of preparing students for further study in chemistry.","aboutTheCourse":"This is the first part of a two part introductory course for students with limited or no background in chemistry; in this part of the course, chemical reactions, stoichiometry, the periodic table, periodic trends, nomenclature, and chemical problem solving will be emphasized. The goal of the course sequence is to prepare students for further study in chemistry as needed for many science, health, and policy professions. Topics include introductions to atoms, molecules, ions, the periodic table, stoichiometry, and chemical reactions. &nbsp;The pattern of the use of ratios in chemical problem solving will be emphasized.<br><br>\nEach week the course will contain a series of short video lectures with interactive questions embedded in the lectures. Students will have opportunities to practice each week via exercises at two levels of depth: one set of foundational problems directly related to lecture videos and another set of problems requiring more synthesis of ideas and application of pre-existing algebra skills. <br><br>Students interested in the possibility of earning a certificate have the option to enroll in a verified certificate option. Students who complete the course while earning an average of 70% or more on the foundational problem sets and exam will receive a signed certificate if a student has chosen to enroll in the verified certificate option. Students who complete the course, participate fully in the peer-reviewed writing assignment, and achieve an average of 85% or more on the foundational problem sets, advanced problem sets, and exam will receive a signed certificate with distinction&nbsp;if a student has chosen to enroll in the verified certificate option.<br><br>\n\nCourse icon from <a href=\"http:\/\/commons.wikimedia.org\/wiki\/File:Glass_is_Liquide.jpg\" target=\"_blank\">Wikimedia commons<\/a>.","targetAudience":0,"courseSyllabus":"<u>Week One:<\/u> Introductions with an overview of scientific methods, scientific notation, measurements, units and unit conversions, using proper significant figures to indicate precision, general concepts in matter and energy including definitions of atoms, elements, molecules, compounds, and moles, chemical formula stoichiometry, basic layout of the periodic table, examples of endothermic and exothermic reactions, and Coulomb’s law.&nbsp;<div><br><\/div><div><u>Week Two:<\/u> More study of atomic structure including ions and isotopes, information on the organizations of the periodic table of elements including some periodic trends (orbital energy, ionization energy, electronegativity, and atomic radius), identification of the subatomic particles most critical to chemical reactions, and introduction to ionic bonding.&nbsp;Introduction to calculations involving heat capacity and density.&nbsp;<\/div><div><br><\/div><div><u>Week Three:<\/u> &nbsp;Determination of oxidation states, comparison of ionic and covalent bonding concepts, nomenclature for both ionic and molecular compounds including those containing polyatomic ions, and introduction to calculations involving formula mass and\/or density.&nbsp;<\/div><div><br><\/div><div><u>Week Four:<\/u> Introduction to chemical composition calculations (compound stoichiometry); application of mole ratios and more practice with gram\/mole and mass percent calculations; determination of empirical and molecular formulas; balancing chemical reaction equations.<br>&nbsp;<\/div><div><u>Week Five:<\/u>&nbsp; No new topics this week. &nbsp;Optional peer-reviewed writing assignment due for students interested in earning a statement of accomplishment with distinction.<br><br><u>Week Six:&nbsp;<\/u>Practice writing and balancing chemical reaction equations for dissolution processes; reaction stoichiometry application exercises; introduction to equilibrium constants using the solubility product constant as an illustration; electrolytes.&nbsp;<\/div><div>&nbsp;<\/div><div><u>Week Seven:<\/u> Introduction to precipitation, acid-base, and redox reactions; more practice applying reaction stoichiometry concepts; reaction calculations including limiting reagent, yield, and enthalpy changes.&nbsp;<\/div><div><br><\/div><div><u>Week Eight:<\/u> No new topics this week. Complete exam and course survey.<\/div>","courseFormat":"The class will consist of videos of lectures and chemical demonstrations; many of the videos contain integrated concept check questions. Students will also be able to practice and earn points through standalone weekly quizzes and biweekly advanced problem sets. &nbsp;Interested students can participate in an optional writing assignment (required for \"distinction\" level statement of accomplishment.) &nbsp;At the end of the course all students will take a two part exam.","suggestedReadings":"Students can benefit from reading the relevant sections of any introductory college general chemistry textbook. I recommend Nivaldo Tro’s book&nbsp;<em><a href=\"http:\/\/www.chegg.com\/textbooks\/introductory-chemistry-essentials-4th-edition-9780321725998-0321725999?trackid=RoQ6Rn0a&amp;ii=1&amp;om_ss=1\" target=\"_blank\" title=\"Link: http:\/\/www.chegg.com\/textbooks\/introductory-chemistry-essentials-4th-edition-9780321725998-0321725999?trackid=RoQ6Rn0a&amp;ii=1&amp;om_ss=1\">Introduction to Chemistry: Essentials<\/a><\/em>, but this is completely <strong>optional<\/strong>.","estimatedClassWorkload":"8-10 hours\/week","recommendedBackground":"Students should have a background in high school level algebra and should bring their enthusiasm for learning and curiosity to the course.","links":{}}