{"id":620,"shortName":"earlychildhood","name":"Effective Classroom Interactions: Supporting Young Children’s Development","language":"en","shortDescription":"During the early childhood years children gain knowledge and skills that provide the foundation for later learning. Young children learn many of these skills through the interactions they have with their teachers. This course is intended to increase teachers’ knowledge about specific types of teacher-child interactions that promote young children’s development. The course will focus on helping teachers to offer emotionally supportive interactions to the children in their care.","aboutTheCourse":"<p>When we look at the research about what teachers actually do each day\n    that makes a difference in children’s lives, there’s clear evidence that\n    it’s the daily interactions that teachers have with children that are most\n    important.  And we know quite a bit about the specific type of interactions\n    that lead to children’s development and learning.  So this course\n    focuses on those interactions.  By the end of the course, you should\n    have a deep knowledge and understanding of the types of interactions that\n    foster learning and development among your students. <br><\/p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p><p>Although there are many types of interactions that are critical to\nyoung children’s development, this course will focus on one area in particular\n– Emotional Support. <\/p>\n\n<p>This course focuses on Emotional Support because it is really the\nfoundation of every early childhood classroom. In classrooms that are\nEmotionally Supportive children and adults are comfortable with one another and\nexcited about learning. They look forward to spending time together and know\nthat, even when times are tough, there will be someone there to help them.\n\n\n\n\n\n\n<\/p><p>What do you need to <b>know<\/b> to be a really effective early childhood\n    teacher? Teachers need many types of knowledge – knowledge about children’s\n    development, about the content they’re teaching, about effective teaching\n    practices, about the needs and abilities of the children in their classrooms,\n    and about themselves. In this course we’ll focus a bit on knowledge about\n    children’s development and we’ll spend lots of time focused on knowledge\n    about specific types of classroom interactions that promote learning and\n    development.<\/p>\n<p>Another part of effective teaching is <b>seeing<\/b>. All the knowledge\n    in the world about effective teaching is only a piece of the puzzle. Good\n    teachers need to see what effective teaching looks like – in lots of different\n    types of classrooms, with lots of different types of children. Teachers\n    tell us they don’t get nearly enough opportunities to see other teachers\n    teach and they report how helpful these experiences are when they do get\n    them. We’ll spend lots of time in this course focused on observing classroom\n    videos and we’ll also ask you to spend some time watching yourself teach.<\/p>\n<p>Ultimately we can’t learn to be an effective teacher without practice\n    – we need to spend some time <b>doing<\/b> – enacting the teaching practices\n    that we’ll learn about. Just as young children need to do things to really\n    learn about them – you need to spend some time practicing the types of\n    interactions we’ll be talking about.<\/p>\n<p>There’s one last important element to being an effective teacher. Effective \n    teachers spend time <b>reflecting<\/b> on their practice. We think of this\n    a bit like taking time to really look at your teaching through a magnifying\n    glass – we’ll give you time to reflect on your teaching and what you have\n    learned throughout this course.<\/p>\n<p>Much of this course is based on the research of Drs. Robert Pianta, Bridget\n    Hamre and many colleagues UVA and other institutions using the Classroom\n    Assessment Scoring System – or CLASS(™). CLASS is an observational measure\n    used in research and practice that defines specific elements of effective\n    teaching. In this course you will see examples of the kinds of teaching\n    practices assessed by the CLASS. And you will get opportunities to observe\n    and analyze your own teaching practice in ways that have been shown to\n    increase the effectiveness of teachers' interactions with young children.  <\/p><span>\n <span><span>\n  <span>\n  <p>*********************************************************************<\/p>\n  <\/span>\n <\/span>\n<\/span><\/span><p>\n\n<\/p><p>The development of the course was funded, in part, by the\nInstitute of Education Sciences, U.S. Department of Education, through Grant\nR305A100154-11 to the University of Virginia. \nThe opinions expressed are those of the authors and do not represent\nviews of the U.S. Department of Education. <\/p><br>","targetAudience":1,"courseSyllabus":"<p><b>Week One – Creating Emotionally Supportive\nClassrooms:<\/b> <br><\/p><p>We’ll take a closer look at the importance of interactions and the\npower that teachers have in the development of young children. This week will\ninclude an overview of the areas and dimensions of the Teaching through\nInteractions Framework. For this course, we’ll focus specifically on the area\nof Emotional Support.<\/p>\n\n<p> <\/p>\n\n<p><b>Week Two – Building Positive Relationships\nwith Children – The dimension of Positive Climate: <\/b><br><\/p><p>This week will focus on the\nfirst dimension of Emotional Support – Positive Climate. You’ll learn about the\nimportance of Positive Climate, see examples of real teachers as they\ndemonstrate effective Positive Climate interactions with their students, and get\na chance to analyze what you’re seeing. There will also be an optional homework\nassignment in which you will videotape your own teaching interactions with\nchildren and then analyze what you see based on what you have learned about\nPositive Climate.<\/p>\n\n<p> <\/p>\n\n<p><b>Week Three – Providing Individualized Support\nto Young Children – The dimension of Teacher Sensitivity:<\/b> <br><\/p><p>This week will focus on the next\ndimension of Emotional Support – Teacher Sensitivity. You’ll learn about the\nimportance of sensitive interactions with children and what sensitive\ninteractions look like in real classrooms. You’ll have the opportunity to\nanalyze classroom videos based on what you know about Teacher Sensitivity.\nAgain, there will be an optional homework assignment in which you will\nvideotape your own teaching and analyze your interactions looking specifically\nat the dimension of Teacher Sensitivity.<\/p>\n\n<p> <\/p>\n\n<p><b>Week Four – Supporting Children’s\nIndependence and Sense of Self – The dimension of Regard for Child Perspectives:<\/b> <br><\/p><p>In the final week, you’ll learn about the last Emotional Support dimension –\nRegard for Child Perspectives. You’ll learn how important it is for young\nchildren to have opportunities for their voices and perspectives to be heard,\nas well as how to foster children’s feelings of self-efficacy and positive\nself-concepts through your daily interactions. In addition to opportunities to\nview and analyze classroom interactions based on your knowledge of Regard for\nChild Perspectives, you’ll have an optional homework assignment allowing you to do\nthe same thing with videotape of your own classroom interactions. Finally,\nwe’ll sum up all that you have learned about all of the dimensions of Emotional\nSupport across the course.<\/p>\n\n\n\n\n\n<br>","courseFormat":"<p>The course will consist of video lectures,\nwhich are between 6 and 15 minutes in length. There will also be a number of\nin-video quizzes, and Test Your Knowledge quizzes at the end of each week.\nThere are also optional weekly homework assignments.<\/p>\n\n\n\n\n\n<br>","suggestedReadings":"","instructor":"","estimatedClassWorkload":"2-3 hours\/week","recommendedBackground":"<p>\n\n\n\n\n\n\n\n\n\n\nThis course was developed specifically for\nteachers working with preschool children, but the information you will learn\nabout providing emotionally supportive interactions is relevant to anyone\nteaching or working with young children.<\/p>\n\n\n\n\n\n\n\n\n\n\n\n<br><br>","links":{}}