{"id":2803,"shortName":"pla","name":"Practical Learning Analytics","language":"en","shortDescription":"Everyone in education has questions – Practical Learning Analytics is about answering them. To be practical, we’ll focus on data every university records; to keep things interesting, we’ll examine questions raised by many audiences; to ensure impact, we’ll provide realistic data and example code. ","aboutTheCourse":"<p>Everyone involved in higher\neducation has questions. Students want to know how they’re doing and which\nclasses they should take. Faculty members want to understand their students’\nbackgrounds and to learn whether their teaching techniques are effective. Staff\nmembers want to be sure the advice they provide is appropriate and find out whether\ncollege requirements accomplish their goals. Administrators want to explore how\nall of their students and faculty are doing and to anticipate emerging changes.\nThe public wants to know what happens in college and why.<\/p>\n\n<p>Everyone has questions. We have\nthe chance to help them find answers. <\/p>\n\n<p>Learning analytics is about using\ndata to improve teaching and learning. You might wonder why there’s suddenly so\nmuch conversation about this previously invisible topic.<a>[1]<\/a> After\nall, institutions of higher education have maintained careful records of\nstudent progress and outcomes for more than a century. &nbsp;They have always been ready to provide a\ntranscript for every student, reporting all courses taken, grades received,\nhonors awarded, and degrees conferred. Institutional research offices provide\nsummaries of these student records to campus leaders, accreditation agencies,\nand the public. Why learning analytics now?<\/p>\n\n<p>Two major trends drive the\ncurrent emergence of learning analytics. First, data informing teaching and\nlearning are increasingly extensive and accessible. Second, innovative new analytic\napproaches to digesting, visualizing, and acting on these data emerge every day.<\/p><p><u>What’s special about this\ncourse?<\/u><\/p><p><i>Practical Learning Analytics<\/i> has a specific goal: to help us\ncollectively ponder learning analytics in a concrete way. To keep it practical,\nwe will focus on using traditional student record data, the kinds of data every\ncampus already has. To make it interesting, we will address questions raised by\nan array of different stakeholders, including campus leaders, faculty, staff,\nand especially students. To provide analytic teeth, each analysis we discuss\nwill be supported by both realistic data and sample code.<\/p><p><u>Who should take this course?<\/u><\/p><p><i>Practical Learning Analytics<\/i> should provide something for anyone\ninterested in higher education: current, former, or future students, policy\nmakers, academic advisors, data scientists, university administrators, ed-tech\nentrepreneurs, faculty members, even the curious public. <\/p><p>This course has been designed to\nwork for a wide variety of audiences. Its structure is modeled on something\neveryone can enjoy: a <a href=\"http:\/\/en.wikipedia.org\/wiki\/Sm%C3%B6rg%C3%A5sbord\">smörgåsbord<\/a> –\nwe’re going to treat the class like one big meal. After we set the table, each\nguest may wander the room, taking either a small plate or a full entrée from a\nseries of courses we offer up. When everyone is full, we’ll gather again over\ncoffee to hear what people thought. There is no defined way to pursue such a\nmeal – each diner chooses what’s right for them. And there is no defined way to\ntake this course – every student must choose what’s right for them.<\/p><p>\n\n\n\n\n\n\n\n\n\n<\/p><p>The course will open with a two\nweek introduction, exploring the landscape of learning analytics in higher\neducation and setting the table for the main event. This is followed by a four\nweek meal during which participants may choose among an array of five different\ntopics, each presented at two levels: a small plate providing a quick\nintroduction, or a more filling entrée. Those choosing small plates will still have\nthe opportunity to work with realistic data, analyzing it with code we provide.\nThose choosing entrées will make creative contributions of their own: writing\nnew code for analysis or visualization of the data we provide, perhaps bringing\nin data of their own. After this month of exploration, the final two weeks will\nfeature a concluding coffee. In them, we’ll review what students learned while\nwandering through all five courses, share the best things class members\ninvented, and provide some concluding remarks.<\/p><div>\n\n\n\n\n\n<div>\n\n<p><a>[1]<\/a>\nTry searching for “<a href=\"https:\/\/books.google.com\/ngrams\/graph?content=learning+analytics&amp;year_start=1800&amp;year_end=2008&amp;corpus=15&amp;smoothing=3&amp;share=&amp;direct_url=\">learning\nanalytics<\/a>” in the Google Ngram server…nothing comes up!<\/p>\n\n<\/div>\n\n<\/div>","targetAudience":3,"courseSyllabus":"<p><u>The menu:<\/u><\/p>\n\n<p>Our smörgåsbord will include five\nmajor courses, each offered in both small plate and full entrée sizes. Each\ncourse will provide both a realistic data set and a set of example R code which\ncan be used to conduct the basic analyses we will discuss. Small plate users\nwill watch a few video lectures about their topic, complete a short quiz on the\ncontent, download the data and R code, and run an analysis to answer some simple\nquestions. Users who choose the entrée will go further, extending the code in\nboth instructor-specified and student defined ways. The really ambitious will\nrepeat and extend these analyses using their own, local data. An introductory\nvideo for each course will outline what it includes and provide some sense of\nwhat users at each level will experience.<\/p>\n\n<p>To keep the focus on the\npractical, the five courses are designed to explore analyses of interest to\ndifferent audiences: students, instructors, department leaders, campus-wide\nleaders, and course designers.<\/p>\n\n<ol><li>LA for students: How to become the student you\nwant to be? Exploring courses, majors, comparing your performance to others\nrealistically and richly.<\/li><li>LA for instructors: Performance prediction in a\ncourse: up to and including grade penalties, placement analyses, performance\ndisparities and their correlates, course-to-course correlation<\/li><li>LA for department leaders: Persistence in a\nmajor, first through short course sequences and then from intention to degree<\/li><li>LA for college\/university leaders:\nCharacterizing the student experience, program evaluation – observing\ndifferences and probing impact, capturing more and better information,\ncomparing the experience of different groups.<\/li><li>LA for course designers: What affects\nperformance – behavior measurement, establishing the evidence basis for advice,\nthen acting to affect performance with technological and human behavior change\ntechniques, putting real-time data to work – early warning systems and\npersonalized communication<\/li><\/ol>","courseFormat":"","suggestedReadings":"","estimatedClassWorkload":"2-8 hours\/week","recommendedBackground":"This course is meant for anyone who has questions about higher education and would like to learn something about how data can help us answer those questions.&nbsp;<br><p>Participation should be rewarding\nat many levels:<\/p>\n\n<p><ul><li><b>The\nmerely curious: <\/b>Anyone interested should benefit from the brief table\nsetting, perhaps returning at the end for a summary of what the more active\nparticipants discovered. This approach will provide insight into what practical\nlearning analytics is and where it might be headed – useful for those who want\nto know about this but are unlikely to do it themselves.<br><\/li><li><b>The\nsamplers: <\/b>Most students will probably want to wander the dining room,\nsampling at least a few small plates during the meal. This level of engagement\nwill let the participant use data to answer some of their own questions, gaining\na more visceral sense of what’s possible here, and facing some of the\nchallenges up close.<br><\/li><li><b>Hungry\ndiners: <\/b>Some will choose just one entrée, focusing on a topic of particular\ninterest. This will require really getting to know the code we provide, and extending\nit in meaningful ways. It will also require a detailed understanding of the\ndata we provide, and provide an opportunity to contribute your own data into\nthe discussion. It should be possible for a single diner to pursue several\nentrées, but probably not all five.<br><\/li><li><b>Teams of\ndiners – the smörgåsbord review:&nbsp; <\/b>A particularly\nhungry team of diners might gather together, perhaps on their own home campus,\nand pursue all the entrées, loading up their plates and making real\ncontributions to all the topics. Ideally, teams like this will really bring the\ncourse to life, making original contributions to all of the analyses and\nreporting out results based on analysis of their own local data.<br><\/li><\/ul><\/p>\n\n\n\n\n\n\n\n<p>You choose the meal you prefer –\nno one else knows what you want or why.<\/p>","links":{}}