{
    "id": 215,
    "shortName": "sports",
    "name": "Sports and Society",
    "language": "en",
    "shortDescription": "This course explores the role of sports around the world, and how the games we watch and play shape identity, culture, and society. ",
    "aboutTheCourse": "Sports play a giant role in contemporary society worldwide. But\nfew of us pause to think about the larger questions of money, politics,\nrace, sex, culture, and commercialization that surround sports everywhere. This course draws on the tools of anthropology, sociology, history,\nand other disciplines to give you new perspectives on the games we watch\nand play. We will focus on both popular sports like soccer (or “football,”\nas anyone outside America calls it), basketball, and baseball, and also\nlesser-known ones like mountain-climbing and fishing. The course features special guest lectures about the Olympics, skateboarding, and the Afro-Brazilian martial art of capoeira.&nbsp; We will also have Google Hangouts with several prominent figures from the sports and sports studies world (guests last time the course was offered included former major league baseball player and ESPN commentator Doug Glanville; the German soccer star and gay rights spokesperson Thomas Hitzlsperger; and leading sports journalist Selena Roberts). You will never watch or think\n        about sports in the same way again.<br><br>***If you'd like to watch a sample lecture to get a better idea of the class, you can do so by <a target=\"_blank\" href=\"https:\/\/www.youtube.com\/watch?v=gQhO8a0oP9A\">clicking here<\/a>.&nbsp; This one is about sports videos games and their explosively growing popularity, and a little unusual in that it was filmed at Professor Starn's house near the Duke University campus.&nbsp; All the lectures, as this one does, features a list of keywords that are introduced near the lecture's beginning and defined over its course.<br>",
    "targetAudience": 0,
    "courseSyllabus": "<p><b>Week One:<\/b> Introduction to key concepts in sports studies, including the\n    distinctions between play, games, and sports; examination of the 19th century\n    rise of organized professional sports.  Case study focus on the Afro-Brazilian\n    martial art of capoeira.<\/p>\n<p><b>Week Two:<\/b> exploration of the globalization of sports, and the relationship\n    between sports and politics, nationalism, and social protest.  Case\n    study focus on the rise of South American soccer, originally imported from\n    England in the 19th century; Hitler’s 1936 Berlin Olympics; and the Black\n    Power Protest at the 1968 Mexico City Olympics.<\/p>\n<p><b>Week Three:<\/b> race and race relations in sports, including the history of\n    African Americans in sports and new Asian sports stars.  Case study\n    of golf superstar Tiger Woods.<\/p>\n<p><b>Week Four:<\/b> gender and sexuality; how sports have been linked to idea of\n    male prowess, and, more recently, the rise of women’s sports; the question\n    of homophobia and its continuing presence in the sports world.  Case\n    study focus on women’s figure-skating and the American NFL.<\/p>\n<p><b>Week Five:<\/b> sports fans and sports performance. Examines the question of why so many of us spend so\n    much time watching and going to games, including the role of aesthetics\n    and beauty in sports. Case study focus on the debate about big-time American college sports. <\/p>\n<p><b>Week Six:<\/b> the business of sports; considers the enormous growth of the\n    multibillion dollar business of sports, including video games, apparel,\n    licensing, and other forces.  Case study focus on sports apparel megacompany Nike and the vast new popularity of sports videogames.<\/p><b>Week Seven:<\/b> the\ngrowth of extreme sports, and larger questions about the relation between\nsports and the purpose and meaning of life.  Case study focus\non mountain-climbing, fishing, and skateboarding.    \n<br>",
    "estimatedClassWorkload": "3-5 hours\/week",
    "recommendedBackground": "All welcome. No previous knowledge required.",
    "links": {

    }
}