{"id":2156,"shortName":"chickens","name":"Chicken Behaviour and Welfare","language":"en","shortDescription":"This course explains the general principles of chicken behaviour and welfare, and the behavioural and physiological indicators that can be used to assess welfare in chickens kept in hobby flocks through to commercial farms. ","aboutTheCourse":"This course explains the general principles of chicken behaviour and welfare, and the behavioural and physiological indicators that can be used to assess welfare in chickens kept in hobby flocks through to commercial farms. The focus is primarily on laying hens and meat chickens (broilers) although many of the principles&nbsp;are relevant to other types of poultry. The course is likely to be of interest to people who own chickens as pets or keep a small hobby flock, commercial egg and chicken meat producers, veterinarians and vet nurses.\n\n<br><br><strong>Learning Objectives<\/strong> <br>At the end of this course, you will be able to:\n<ol><li>Describe avian sensory perception and motivation.<\/li><li>Explain the main behaviour patterns of poultry.\n<\/li><li>Define welfare&nbsp;and explain the bases of welfare standards.\n<\/li><li>Assess chicken welfare, using behavioural and physiological means<\/li><li>Understand common welfare problems of chickens.<\/li><\/ol><br>This course is taught by staff from <a href=\"http:\/\/www.sruc.ac.uk\/\" target=\"_blank\"><strong>Scotland's Rural College (SRUC)<\/strong><\/a>, University of Glasgow,&nbsp;and St David's Poultry Team.<br>","targetAudience":0,"courseSyllabus":"<p>The course syllabus includes:<\/p><p><strong>Week 1: Introduction to behaviour<\/strong>&nbsp;<\/p><ul><li>Introduction to online learning and the course structure and content <br><\/li><li>Introduction to the study of animal behaviour, domestication <br><\/li><li>Behavioural development: prehatch, imprinting, learning, hormonal influence <br><\/li><li>The senses (vision, hearing, smell, taste, touch)&nbsp;and  motivation<\/li><\/ul><p>\n\n<br><strong>Week 2<\/strong>: <strong>Behaviour patterns of chickens: maintenance and social behaviours<\/strong><\/p><ul><li>Maintenance behaviour: feeding, drinking, comfort activities. <br><\/li><li>Social behaviour: communication, spacing, dominance, aggression, social spacing\n<\/li><\/ul><p><strong>Week 3: Behaviour patterns of chickens: reproductive and abnormal behaviours<\/strong><\/p><ul><li>Reproductive behaviour: male (courtship and mating), female (nesting, laying and brooding) <br><\/li><li>Abnormal behaviours: overdrinking, feather pecking, egg and litter eating\n\n<\/li><\/ul><p><strong>Week 4: Chicken welfare<\/strong><\/p><ul><li>What is welfare? <br><\/li><li>Ethics of meeting animals’ welfare needs <br><\/li><li>Recommendations and standards used by accreditation schemes <br><\/li><li>Indicators of welfare\n(behavioural\nand\tphysiological) <br><\/li><li>Is free-range always best?  Challenging the perception of what is good for welfare\n<\/li><\/ul><p><strong>Week 5:<\/strong> <strong>Welfare problems of common production systems including hobby flocks<\/strong><\/p><ul><li>Welfare of layers: cage and non-cage systems <br><\/li><li>Welfare of broilers:&nbsp; indoor to free range <br><\/li><li>Transport, slaughter and emergency killing<br><\/li><\/ul>","courseFormat":"This course consists of short lecture videos of approximately&nbsp;2-10 min each. There&nbsp;are integrated quizzes within the videos, so that you can check your understanding of the material. At the end of each week, there is an assessed quiz.&nbsp;All five quizzes contribute to your final mark.&nbsp;","suggestedReadings":"Although not required to participate in the course, an excellent text book would be:<br><br>M.C. Appleby, J.A. Mench and B.O. Hughes <a target=\"_blank\" href=\"http:\/\/www.cabi.org\/bookshop\/book\/9780851996677\"><strong>Poultry Behaviour and Welfare<\/strong><\/a> (published by CABI, 2004)<br><br>","estimatedClassWorkload":"1-3 hours\/week","recommendedBackground":"No background reading required, just an interest in chickens.","links":{}}