{"id":559,"shortName":"ucimacroeconomics","name":"The Power of Macroeconomics: Economic Principles in the Real World","language":"en","shortDescription":"In this course, you will learn all of the major principles of macroeconomics normally taught in a quarter or semester course to college undergraduates or MBA students.   ","aboutTheCourse":"<p>In this course, you will learn all of the major principles of macroeconomics\n    normally taught in a quarter or semester course to college undergraduates\n    or MBA students.&nbsp;&nbsp;&nbsp;<\/p>\n<p>Perhaps more importantly, you will also learn how to apply these principles\n    to a wide variety of situations in both your personal and professional\n    lives. In this way, the Power of Macroeconomics will help you prosper\n    in an increasingly competitive and globalized environment.<\/p>\n<p><\/p>","targetAudience":1,"courseSyllabus":"<p>Week One: An Overview of Modern Macroeconomics<br><\/p>\n<p>Week Two: The Aggregate Supply-Aggregate Demand Model and the Classical-Keynesian\n    Debate<\/p>\n<p>Week Three:&nbsp;&nbsp;The Keynesian Model and Fiscal Policy<\/p>\n<p>Week Four: The Federal Reserve and Monetary Policy<\/p>\n<p>Week Five: Unemployment, Inflation, and Stagflation<\/p>\n<p>Week Six: The Warring Schools of Macroeconomics<\/p>\n<p>Week Seven: Economic Growth and Productivity<\/p>\n<p>Week Eight: Budget Deficits and the Public Debt<\/p>\n<p>Week Nine: International Trade and Protectionism<\/p>\n<p>Week Ten: Exchange Rates, The Balance of Payments, and Trade Deficits<\/p>\n<p>Week Eleven: The Economics of Developing Countries<\/p>","courseFormat":"<p>This is a complete college and MBA-level course in the principles of macroeconomics\n    as normally taught in a quarter or semester timeframe.&nbsp;<\/p>\n<p>The centerpiece of the course is a set of eleven lectures, broken down\n    into 5 to 7 topics per multimedia presentations,&nbsp;specifically designed\n    to simulate the traditional classroom lecture experience; and each lecture\n    covers topics such as inflation, unemployment, fiscal policy, monetary\n    policy, and, in this age of globalization, exchange rates and the economics\n    of free trade.<\/p>\n<p>These multimedia presentations feature a digitally-mastered audio sound\n    track; and each slide in a typical presentation will include an outline of material\n    from the audio track, dynamically constructed graphs such as the Keynesian\n    model, animated charts and figures, and historical photos of people such as\n    Adam Smith, John Maynard Keynes and Ben Bernanke, or some combination thereof.<\/p>\n<p>To make these lectures as interesting – and as fun -- as possible, each\n    is highly interactive so that throughout each lecture, you will be asked\n    numerous questions and you should feel free at any time to put the presentation\n    on pause as you contemplate possible answers.<\/p>\n<p>After each lecture, you will be able to take an online quiz and immediately\n    after you complete the quiz, you also will be able to check both your grade\n    and your answers.&nbsp; At the end of the course, you will then be able\n    to take a final exam online to see how well you did in the course.<\/p>","suggestedReadings":"<p>It is unnecessary to use a standard macroeconomics textbook to learn the\n    material presented in this course.&nbsp; However, if you are interested in a companion book to this course, I can heartily recommend\n    <a href=\"http:\/\/www.amazon.com\/Macroeconomics-Connect-Mcgraw-Hill-Series-Economics\/dp\/0077398084\/ref=sr_1_1?ie=UTF8&amp;qid=1354117355&amp;sr=8-1&amp;keywords=david+colander\"><i>Macroeconomics<\/i>\n        <\/a>by David Colander published by McGraw-Hill-Hill as an optional text.&nbsp;\n        This is perhaps my favorite textbook because it emphasizes the historical\n        evolution of macroeconomic theory and practice – one of the major themes\n        of this course.<\/p>\n<p>As you take this course, you may also want to keep up with the latest\n    macroeconomic news by reading newspapers like the Financial Times or Wall\n    Street Journal or perhaps subscribing to the weekly magazine, the Economist.<\/p>\n<p>My own book, <a href=\"http:\/\/www.amazon.com\/Always-Winner-Finding-Competitive-Advantage\/dp\/0470497203\/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1354117760&amp;sr=1-1&amp;keywords=always+a+winner\">Always a Winner<\/a>,\n    may be useful if you are interested in learning more about forecasting\n    the economy and business cycle and using that forecasting information to\n    strategically manage a firm or organization.<\/p>\n<p>If you are more interested in a career in money management or want to\n    learn more about how an understanding of macroeconomics can help you better\n    manage your own investment portfolio, you may also want to read my book\n    <a href=\"http:\/\/www.amazon.com\/When-Market-Moves-Will-Ready\/dp\/0071410678\/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1354117805&amp;sr=1-1&amp;keywords=when+the+market+moves+will+you+be+ready\">When the Market Moves, Will You Be Ready?<\/a>&nbsp;as an optional text.<\/p>","instructor":"Peter Navarro","estimatedClassWorkload":"2-4 hours\/week","recommendedBackground":"<p>This course is suitable for everyone from advanced secondary or high school students to billion\n    dollar hedge fund managers.&nbsp; It requires no complicated mathematical\n    training.&nbsp; While a previous study of microeconomics might be useful\n    in more quickly assimilating some of the graphical material, it is certainly\n    not a pre-requisite.<\/p>","links":{}}