{"id":803,"shortName":"clintrials","name":"Design and Interpretation of Clinical Trials","language":"en","shortDescription":"Learn the basic principles for design of randomized clinical trials and how they should be reported. ","aboutTheCourse":"<p>Clinical trials are experiments designed to evaluate new\ninterventions to prevent or treat disease in humans.&nbsp; The interventions evaluated can be drugs, devices (e.g.,\nhearing aid), surgeries, behavioral interventions (e.g., smoking cessation\nprogram), community health programs (e.g. cancer screening programs) or health\ndelivery systems (e.g., special care units for hospital admissions).&nbsp; We consider clinical trials experiments\nbecause the investigators rather the patients or their doctors select the\ntreatment the patients receive.&nbsp; Results\nfrom randomized clinical trials are usually considered the highest level of\nevidence for determining whether a treatment is effective because trials\nincorporates features to ensure that evaluation of the benefits and risks of\ntreatments are objective and unbiased. &nbsp;The FDA requires that drugs or biologics (e.g., vaccines) are\nshown to be effective in clinical trials before they can be sold in the US.<\/p>\n\n<p>The course will explain the basic principles for design of\nrandomized clinical trials and how they should be reported.&nbsp; In the first part of the course, students\nwill be introduced to terminology used in clinical trials and the several\ncommon designs used for clinical trials, such as parallel and cross-over\ndesigns.&nbsp; We will also explain some\nof the mechanics of clinical trials, like randomization and blinding of\ntreatment.&nbsp; In the second half of\nthe course, we will explain how clinical trials are analyzed and\ninterpreted.&nbsp; Finally, we will\nreview the essential ethical consideration involved in conducting experiments\non people.<\/p>\n<br>\nDeveloped in collaboration with <a href=http:\/\/www.jhsph.edu\/offices-and-services\/center-for-teaching-and-learning\/our-services\/open-education-lab\/index.html>Johns Hopkins Open Education Lab<\/a>.","targetAudience":1,"courseSyllabus":"<p><\/p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><\/p>The course will mainly focus on the nuts and bolt of\nclinical trials design.&nbsp; Lecture\ntopics are:<br><ul><li>Terminology and Common Trial Designs<br><\/li><li>Randomization – what is it and how do we do it<br><\/li><li>Blinding treatment – why and how we keep\neveryone in the dark about the treatment<br><\/li><li>Selecting outcome – good and bad ones<br><\/li><li>Analyzing the data – principle of intention-to-treat,\nwhy it’s not crazy<br><\/li><li>Reporting the results – CONSORT guidelines, a\ngood road map for readers and writers<br><\/li><li>Ethical issues – why they are important and what\nthey are<br><\/li><\/ul><p><\/p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><\/p>","courseFormat":"<p>There will be 2 to 4 lectures segments each week that&nbsp;will cover one or two topics.&nbsp; Each week there will be a quiz with up to 10&nbsp;questions.&nbsp; The quizzes will be graded and&nbsp;used to evaluate student performance.&nbsp; You will have 3 attempts to take&nbsp;each quiz, the highest score will be used.&nbsp; In order to successfully complete the class you must take each quiz and achieve an overall average of 70%.&nbsp; The course will require 2 to 3 hours per week and be 6 weeks long.&nbsp; There will be one week after the last lecture to complete any unfinished quizzes.<\/p><p>\n\n\n\n\n\n\n\n\n<\/p><p>We will be posting periodic questions on the discussion forum that highlight different issues in clinical trials.&nbsp; We encourage students to participate in the forum but it will not be part of the student performance evaluation.<\/p>","suggestedReadings":"<p>The book Fundamentals of Clinical Trials by Lawrence\nFriedman, Curt Furberg and David DeMets is an excellent resource but is not\nrequired. We will post some readings that are related to specific parts of the\ncourse.<\/p>","estimatedClassWorkload":"2-3 hours\/week","recommendedBackground":"<p>Student should have an interest in health sciences.&nbsp; Some fundamental knowledge of epidemiology,\ne.g., types of bias, and statistics, e.g., mean and standard deviation, hypothesis\ntesting, will be helpful.&nbsp;&nbsp;<\/p>","links":{}}