{"id":614,"shortName":"tinkering","name":"Tinkering Fundamentals: A Constructionist Approach to STEM Learning","language":"en","shortDescription":"Tinkering activities provide a powerful way to inspire students' interest, engagement, and understanding in science. The Tinkering Fundamentals course will help educators and enthusiasts develop a practice of tinkering and making. This course will focus on key design elements of high-quality, science-rich tinkering activities, effective facilitation strategies and environmental organization.","aboutTheCourse":"<div>The Tinkering Fundamentals course offers educators and enthusiasts an opportunity to develop a practice of tinkering and making. &nbsp;We see tinkering as a serious endeavor--one that is generalizable across content and especially good at interweaving disciplines in a way that leads to complex projects and individualized learning opportunities. &nbsp;<\/div><div><br><\/div><div>Tinkering has recently been introduced into the educational field as a potential driver of creativity, excitement, and innovation in science learning. It is seen by many as an effective means to engage in exploring STEM concepts, practices and phenomena. For over a decade, the Exploratorium has been developing science-rich tinkering activities. Working with learning scientists, we have identified a set of design principles and indicators of learning that can help you to integrate tinkering activities into your elementary and middle school science programs.&nbsp;<\/div><div><br><\/div><div>Tinkering typically blends the high- and low-tech tools of science along with a strong aesthetic dimension that supports self-expression among children as well as&nbsp;adults. &nbsp;This course focuses on key design elements of high quality, science-rich tinkering activities, along with helpful facilitation strategies, and tips for organizing the learning environment. Selected tinkering activities are centered on circuits for this course. &nbsp;We review the ways in which tinkering supports science learning by providing opportunities to deepen engagement, intentionality, innovation, collaboration, and understanding. This course will excite you, inspire you, and get you tinkering in no time.<br><br><strong>NOTE: This is a hands-on workshop, so you need to obtain or purchase course&nbsp;materials as soon as possible.<\/strong> Material bundles are available from the Exploratorium store online at <a href=\"http:\/\/www.artoftinkering.com\" title=\"Link: http:\/\/www.artoftinkering.com\">www.artoftinkering.com<\/a>, or you can gather your own supplies using our&nbsp;<a href=\"https:\/\/docs.google.com\/document\/d\/1ggyeYdACmhMsBMd4UM-eo2qivwQN_2Ww34oyfzNIrmg\/edit?usp=sharing\" target=\"_blank\">recommended materials list<\/a>.<br><\/div>","targetAudience":3,"courseSyllabus":"<div><strong>Week One: Introduction to Tinkering<\/strong><br><\/div><div>What is tinkering? Is it different from engineering or other forms of making?<\/div><div><br><\/div><div><strong>Week Two: Initial Explorations<br><\/strong>What better way to learn about tinkering than to try it! We invite you to start by playing with circuit boards.<\/div><div><br><\/div><div><strong>Week Three: Learning Dimensions<\/strong><\/div><div>This week, it's scribbling machines! We'll also investigate how tinkering maps on to different indicators of learning.<\/div><div><br><\/div><div><strong>Week Four: Tinkering Tenets and Personal Expression<\/strong><\/div><div>Try your hand with paper circuits and sewn circuits, and explore the aesthetic dimensions of tinkering, including key design elements and basic principles.<\/div><div><br><\/div><div><strong>Week Five: Coding, Computation and Facilitation Strategies<\/strong><\/div><div>A look at the high-tech side of tinkering, plus strategies for facilitation and deep engagement.<br><\/div><div><br><\/div><div><strong>Week Six: Putting It All Together<\/strong><\/div><div>How will you take what you've learned in this class and apply it to your own life? We'll help you come up with a detailed action plan and get feedback from other students in the class.<\/div>","courseFormat":"<div>This course is designed as a participatory workshop, where we'll be making and tinkering together—aided by video content, activity guides, readings, forum discussions and facilitation by the instructors.&nbsp;<\/div><div><br><\/div><div>Every week there will be several short videos to watch, each designed to highlight elements of the tinkering process we’ve developed. We’ll also ask you to try hands-on tinkering activities on your own and to share your thoughts and reflections in the discussion forums.&nbsp;<\/div><div><br><\/div><div>We encourage participants to keep a design journal or notebook to record their thoughts, ideas, and experiences, and see how those change or develop during the course. At the end of the course, you’ll have the opportunity to create a tinkering action plan and get feedback and suggestions from your peers.<\/div><div><br><\/div><div>Students who wish to earn a Verified Certificate or Statement of Accomplishment will need to complete all weekly assignments and receive a passing grade on a peer-reviewed final project.<\/div><div><br>Instructors will also host a weekly live Hangout to answer questions, highlight interesting conversations taking place in the discussion forums, and bring in guest speakers.&nbsp;We hope to offer weekly opportunities for live informal conversations among participants, and weWe encourage participants to use other digital tools and social media platforms to share their work and interact with one another.&nbsp;<\/div>","suggestedReadings":"Wilkinson, K. &amp; Petrich, M.&nbsp; (Oct 2013).&nbsp; The Art of Tinkering. San Francisco: Weldon Owen.&nbsp;<a href=\"http:\/\/www.artoftinkering.com\/\">http:\/\/www.artoftinkering.com\/<\/a><br><br>Petrich, M., Wilkinson K., &amp; Bevan, B. (2013). It looks like fun,\nbut are they learning? In M. Honey &amp; D. Kanter (Eds.), Design, Make,\nPlay: Growing the Next Generation of STEM Innovators. New York and Abingdon,\nOxon., Eng.: Routledge.<br>","instructor":"","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"This course is appropriate for anyone interested in incorporating tinkering\nactivities into their educational programs. No prior knowledge is required. <br><br>","links":{}}