{"id":1520,"shortName":"cancer","name":"Introduction to the Science of Cancer","language":"en","shortDescription":"Cancer strikes individuals, affects families and causes economic hardship. The burden of cancer will rise globally in coming years due to a growing, aging world population. \n\nThis open course is designed for people who may be unfamiliar with science but are interested in developing a sound understanding of cancer and how it is diagnosed, treated, prevented and studied. ","aboutTheCourse":"<div>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In this&nbsp;<i>Introduction to the Science of Cancer <\/i>course, oncologists and researchers\nat The Ohio State University Comprehensive Cancer Center – Arthur G. James\nCancer Hospital and Richard J. Solove Research Institute (OSUCCC – James) explain\nthe scientific basis of cancer and key concepts in learner-friendly terms. The course\nis divided into five modules organized to facilitate engaged learning.<\/p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In 2012, an estimated 14.1 million\npeople developed cancer, and 8 million people died from it. The number of\ncancer cases is expected to grow to 22 million over the next 20 years due to the\ngrowing and aging of the world population. Cancer treatment can certainly be a challenge for\nsome in high-income countries. However, 60 percent of cancer cases and 70 percent of\ncancer deaths occur in low- and middle-income countries in Africa, Asia and\nCentral and South America, which have much fewer resources for cancer care. The rising\nnumber of cancer cases presents a serious global problem that requires an\nequally serious commitment to cancer prevention. <\/p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The OSUCCC – James offers\nIntroduction to the Science of Cancer&nbsp;to encourage that global commitment to\ncancer prevention. The course could be helpful to anyone who wants a better\nunderstanding of cancer, but further, we hope it will be particularly useful to stakeholders\nin under-resourced areas, such as medical and nursing students, hospital staff,\nsecondary-school teachers, news reporters and editors, social workers and\npublic health workers. A better understanding of cancer by <strong>all<\/strong> could help\ninitiate and promote cancer prevention efforts by both individuals and nations.<\/p><\/div><div>Important concepts explored in this course include:<div><ul><li>How cancer is not one disease, it is many complex diseases<\/li><li>How many cancers are preventable<\/li><li>How preventing cancer helps prevent heart disease, hypertension and diabetes<\/li><li>Why healthy cells turn cancerous<\/li><li>The main types of cancer<\/li><li>The differences between childhood and adult cancers<\/li><li>How cancer is treated<\/li><li>Responding to the psychological stress of cancer<br><\/li><li>How genomics is changing cancer diagnosis and treatment<\/li><li>What the different imaging technologies show<\/li><li>The promising field of epigenetics and cancer<\/li><li>How targeted and immune therapies work<\/li><li>The importance of vaccination and screening for preventing cancer<\/li><li>How basic, clinical and other types of research improve cancer care<\/li><\/ul><\/div><\/div>","targetAudience":0,"courseSyllabus":"<ul><\/ul><div><div><strong>Module One : What is Cancer<\/strong><br><ul><li>Anatomy of a cell<\/li><li>DNA, genes and mutations<\/li><li>Solid tumors<br><\/li><li>Childhood cancer<\/li><\/ul><\/div><div><strong>Module Two : Diagnosis of Cancer<\/strong><br><ul><li>Genomics<\/li><li>Epigenetics<br><\/li><li>Imaging<\/li><\/ul><\/div><div><strong>Module Three : Treatment of Cancer<\/strong><ul><li>Radiation<\/li><li>Chemotherapy<\/li><li>Targeted therapy<br><\/li><li>Immune therapy<\/li><\/ul><\/div><div><strong>Module Four : Prevention of Cancer<\/strong><ul><li>Tobacco&nbsp;<\/li><li>Alcohol&nbsp;<\/li><li>Diet&nbsp;<\/li><li>Chronic infections&nbsp;<\/li><li>Heredity and cancer&nbsp;<\/li><\/ul><\/div><div><strong>Module Five : Cancer Research<\/strong><br><ul><li>Epidemiology and population science research<\/li><li>Clinical trials<br><\/li><li>Correlative research<\/li><\/ul><\/div><\/div>","courseFormat":"The class will consist of short video lectures presented by Ohio State University cancer physicians and researchers. This course will feature readings including articles from&nbsp;<a href=\"http:\/\/cancer.osu.edu\/about\/publications\" target=\"_blank\" title=\"Link: http:\/\/cancer.osu.edu\/about\/publications\">Frontiers<\/a>,&nbsp;Ohio State's cancer research magazine.<br><br>Learners planning to complete the course will be required to complete one project-based peer-evaluated assignment and each of the module quizzes.<br>","suggestedReadings":"Each module will feature readings provided in the course.","estimatedClassWorkload":"2-4 hours\/week","recommendedBackground":"<div>All that is needed to take this course is an interest in gaining a solid understanding of cancer – its causes, prevention, diagnosis and treatment.<\/div>","links":{}}