{
    "id": 2647,
    "shortName": "genpython",
    "name": "Python for Genomic Data Science",
    "language": "en",
    "shortDescription": "This class provides an introduction to the Python programming language and the iPython notebook. This is the third course in the Genomic Big Data Science Specialization from Johns Hopkins University.",
    "aboutTheCourse": "<p>This class will provide an introduction to the Python\nprogramming language to people who are not computer scientists but who want to analyze\ngenomic data. The course will teach participants basic concepts of\nbioinformatics programming, and introduce them to computational tools that deal\nwith large amounts of data. The goals of the class is to enable students to\nwrite basic programs in Python, to adapt existing programs to their needs, and\nto interface Python programs with various bioinformatics packages through the\nuse of Biopython.&nbsp;<strong>This course has a $99 value but being offered at a significant discount.<\/strong><\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<ol>\n<li>Introduction to Programming\n<ul>\n<li>Numbers and Strings\n<\/li><li>Variable types\n<\/li><li>String Functions\n<\/li><li>Data input and output\n<\/li><\/ul>\n<\/li><li>Data structures\n<ul>\n<li>Lists\n<\/li><li>Tuples\n<\/li><li>Sets\n<\/li><li>Dictionaries\n<\/li><\/ul>\n<\/li><li>Controls and Repetitions\n<\/li><li>Defining and Using Functions\n<\/li><li>Modules and Packages\n<\/li><li>Reading and Writing Files\n<\/li><li>Interfacing with External Programs\n<\/li><li>Biopython\n<ol><\/ol><\/li><\/ol>",
    "estimatedClassWorkload": "3-5 hours\/week",
    "recommendedBackground": "Prerequisite: <a href=\"https:\/\/www.coursera.org\/course\/genintro\" target=\"_blank\">Introduction to Sequencing Technologies<\/a><br><br>The target audience of this course are individuals in the molecular or computational sciences who want how to learn how to perform basic computational biology. This class is “hands on” and designed to get you started with the tools you need to perform Genomic Data Science. <br>",
    "links": {

    }
}