{"id":2283,"shortName":"movimento","name":"Análise do Movimento","language":"pt-br","shortDescription":"Por que os corpos se movem? Entenda como ocorreu a evolução da ideia do movimento dos corpos e aprenda a prever e a analisar o movimento de um objeto de forma moderna e interessante.","aboutTheCourse":"<p>O movimento dos objetos ao nosso redor tem intrigado as pessoas\ndesde a Antiguidade. Já naquela época, os gregos tinham hipóteses para explicar\nporque as pedras caem no solo e a fumaça sobe. No século XVI, as observações\nexperimentais de Galileu ajudaram a introduzir princípios gerais para descrever\no movimento dos objetos. Neste mesmo período, foram inúmeras as contribuições\nvindas da Astronomia. Mas foi Isaac Newton, um dos grandes pensadores da\nhistória da humanidade, quem resumiu a explicação do movimento dos corpos em\napenas 3 (três!) leis no fim do século XVII. Estas leis são validas até hoje, e\nsó não são apropriadas para descrever o movimento de objetos muito pequenos (com dimensões microscópicas) ou de corpos com velocidades\nmuito altas, próximas da maior velocidade que podemos ter: a velocidade da luz. (Para estas situações, precisamos recorrer à mecânica quântica ou à formulação de movimento descrita\npor Einstein em 1905.)<\/p>\n\n<p>Neste curso, você vai estudar a evolução do pensamento sobre o\nmovimento dos objetos. Ao final, você deverá ser capaz de entender porque as ideias formuladas por Aristóteles são\nequivocadas (embora pareçam muito&nbsp;intuitivas no nosso dia-a-dia!), e porque&nbsp;Newton de fato enxergou longe (apoiado no ombro de gigantes!). Você também será capaz de entender a contribuição de Einstein (totalmente não intuitiva) para descrever o\nmovimento em velocidades altas. Ao longo do caminho, você aprenderá a analisar e discutir diferentes\nformulações físicas para explicar como o movimento acontece, descrever o movimento dos corpos considerando situações reais (incluindo até mesmo a\nresistência do ar!) com a ajuda de computadores, e comparar os modelos físicos com os movimentos reais na natureza (afinal, a física é uma ciência experimental!).<\/p>\n\nAo final deste curso, você\ndeverá ser capaz de responder perguntas como: por que os objetos se movem? Por\nque nossa intuição sobre o movimento as vezes é totalmente diferente das\nprevisões dos modelos usados na Física?&nbsp;Como prever a posição de um objeto\ndepois de um certo tempo? É possível descrever (e resolver) o movimento dos\nobjetos em situações reais no nosso dia-a-dia?&nbsp;O que significa força? Qual\na relação entre movimento e energia? O que é e quando se usa a teoria da\nrelatividade?&nbsp; &nbsp;&nbsp;<br>","targetAudience":0,"courseSyllabus":"<p>Este curso tem duração de 4 semanas, que são planejadas da\nseguinte forma:&nbsp;<\/p>\n\n<p>Semana 1: vamos viajar de volta no tempo e entender como\ndiferentes pensadores formularam explicações sobre o movimento dos corpos. O\nprincipal objetivo será fazer você entender porque o pensamento de Aristóteles durou tanto\ntempo (e até hoje está presente no nosso dia-a-dia). Nossa primeira parada será\nem 1687, data da publicação das leis de Newton.&nbsp;<\/p>\n\n<p>Semana 2: você aplicará os princípios descritos por Newton para\nestudar o movimento de vários objetos que encontramos na natureza. No entanto,\nao contrário da abordagem matemática tradicional, vamos analisar o movimento\ndos objetos usando ferramentas computacionais modernas, bastante intuitivas e fáceis de usar.&nbsp;<\/p>\n\n<p>Semana 3: na terceira semana vamos aprofundar o conceito de\nreferencial. Discutiremos o princípio de relatividade estabelecido por Galileu,\nque mais tarde foi modificado por Einstein. Discutiremos os princípios da\nrelatividade restrita, estendendo nossa análise de movimento para corpos com\nvelocidades próximas da velocidade da luz.&nbsp;<\/p>\n\n<p>Semana 4: por fim, encerraremos nosso curso apresentando uma\nforma alternativa (e mais geral) para descrever o movimento: a ideia de\nenergia. Veremos como podemos utilizar esta grandeza para descrever o movimento\ndos objetos, e terminaremos apresentando um dos princípios mais fundamentais da\nnatureza: o fato de que a energia se conserva.&nbsp;<\/p>","courseFormat":"<p>O curso compreenderá um conjunto de vídeo-aulas, cada uma com 5\na 10 minutos de duração, além de vídeos complementares com experimentos reais e\nentrevistas. Você poderá testar sua compreensão do material através de\nperguntas ao longo dos vídeos. &nbsp;<\/p>\n\n<p>Ao fim de cada semana, haverá um questionário que deverá ser feito e submetido para avaliação, bem como sugestões de atividades opcionais relacionadas com o tema. Por fim, você terá a oportunidade de integrar o conhecimento adquirido através de um projeto final.<\/p>","suggestedReadings":"<p><b>Todo o material necessário para o acompanhamento do curso será disponibilizado\nnesta plataforma. <\/b>Não é necessário adquirir nenhum outro\nmaterial.&nbsp;<\/p>","estimatedClassWorkload":"3-6 hours\/week","recommendedBackground":"<p><span>Espera-se que os interessados tenham familiaridade com\nmatemática elementar (a nível de ensino médio) para acompanhar o curso. No\nentanto, este curso <b>NÃO<\/b> é focado para alunos da área de exatas apenas.\nTodos os interessados em entender a natureza - e como usamos modelos para\nexplicar fenômenos naturais - são bem-vindos!<\/span><\/p>","links":{}}