{
    "id": 376,
    "shortName": "introtoclassical",
    "name": "Introduction to Classical Music",
    "language": "en",
    "shortDescription": "This course will focus on Western classical music of the eighteenth and nineteenth centuries; it is designed for people who are passionate about classical music but who have not necessarily had any advanced training or taken any college-level music courses.  The only prerequisite is a basic knowledge of how to read musical notation.",
    "aboutTheCourse": "This is a course for students who are passionate about classical music\nand eager to learn more about it, but who have not necessarily had any\nadvanced technical training or taken any college-level music courses. The\nonly prerequisite is a basic knowledge of how to read musical notation.\nOtherwise, no prior experience is needed; all concepts will be explained\nin class, and musical terms will be defined as they arise. This course\nwill focus on Western classical music of the eighteenth and nineteenth\ncenturies, music that exemplifies tonality, the system of major and minor\nkeys, including pieces composed by Bach, Mozart, Beethoven, Schubert, Schumann,\nChopin, Wagner, Brahms, Richard Strauss, and others. This course will tell\ntwo competing stories about tonal music and try to reconcile them. On one\nhand, we will explore what all tonal pieces have in common, the shared\nmusical language that makes them intelligible and allows them to communicate;\non the other hand, we will try to discover what makes each piece unique,\nhow composers bend the common language to say something new. Although the\ncourse will incorporate historical perspectives, it will not be a chronological\nsurvey. Instead, it will combine music theory with aesthetics, balancing\nprinciples of structural organization with insights into the aesthetic\nmeaning and effects of these principles. By illustrating his lectures with\nhis own performances at the keyboard, Professor Korsyn will bring the music\nto life.",
    "targetAudience": 0,
    "courseSyllabus": "<a title=\"Link: https:\/\/d396qusza40orc.cloudfront.net\/introtoclassical%2Fdocuments%2Fintrotoclassical_Syllabus_121613.pdf\" target=\"_blank\" href=\"https:\/\/d396qusza40orc.cloudfront.net\/introtoclassical%2Fdocuments%2Fintrotoclassical_Syllabus_121613.pdf\">Download Syllabus<\/a>\n<br><a target=\"_blank\" href=\"https:\/\/d396qusza40orc.cloudfront.net\/introtoclassical%2Fdocuments%2Flinks%20to%20recordings.pdf\">Download Recording Links<\/a><br><a target=\"_blank\" href=\"https:\/\/d396qusza40orc.cloudfront.net\/introtoclassical%2Fdocuments%2FLinks%20to%20Scores.doc\">Download Score Links<\/a>\n<br>",
    "estimatedClassWorkload": "3-4 hours\/week",
    "recommendedBackground": "",
    "links": {

    }
}