{
    "id": 1431,
    "shortName": "personalizedmed",
    "name": "Case Studies in Personalized Medicine",
    "language": "en",
    "shortDescription": "Learn how advances in biomedicine hold the potential to revolutionize drug development, drug treatments, and disease prevention: where are we now, and what does the future hold? This course is intended for healthcare providers 5+ years out of training--a lot has changed!! Other providers, medical\/health sciences students, and members of the public may also be interested. ",
    "aboutTheCourse": "<p>Doctors have been personalizing care for patients since the time\nof Hippocrates – we know that not every patient derives benefit from drug\ntreatments and that side effects are common with almost any treatment.&nbsp; Studies in the mid-20th century\nbegan to identify the basis of variability in response to drug treatments, and\nin particular the role of genetic factors in that variability.&nbsp; With the development of new technologies to\nunderstand human genetic diversity has come the opportunity to identify how\ncertain diseases run in families and why some patients respond very well to drug\ntreatment while others develop catastrophic side effects. This understanding presents the possibility of developing new\ndrugs targeting specific molecular and genetic mechanisms of disease.&nbsp; <\/p>\n\n<p>This course will present short primers in genetics and mechanisms\nunderlying variability in drug responses. A series of case studies will be used\nto illustrate principles of how genetics are being brought to bear on refining\ndiagnoses and on personalizing treatment in rare and common diseases. The ethical\nand operational issues around how to implement large scale genomic sequencing\nin clinical practice will be addressed.&nbsp;\n<\/p><p>This course is intended for working healthcare professionals. Other providers, medical and other students, and members of the public may also be interested.<\/p>",
    "targetAudience": 3,
    "courseSyllabus": "Below is a general outline of this course. We have organized the topics into weekly segments that represent about two hours of video content each. However, if you choose not to follow this pace, you are welcome to move through this course at your own pace, participating as much or as little as fits your needs.&nbsp; <br><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <i>-week 1-<\/i><br><br>INTRODUCTION TO PERSONALIZED MEDICINE<br><br><strong>Fundamental Definitions and Concepts<\/strong><br>The first week of this course will focus on introducing the concept of personalized medicine. We will very briefly review fundamentals of genetics as these apply to personalized medicine (DNA structure; RNA; protein structures; function of DNA; coding; DNA variations; types of genetic variants), as well as review statistical concepts and skills important to clinical data analysis (odds ratios, relative risk, P values, multiple testing, sensitivity, specificity, ROCs).<br><br><strong>Drug Actions and Reactions<\/strong><br>This week we will also explore drug actions and reactions as we look closely at the general mechanisms underlying variability in drug responses, drug metabolism and transport, and genetic variability in drug-handling molecules.<br><br><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <i>-week 2-<\/i><br><br>STUDYING GENETIC VARIATION<br><br><strong>Finding Genetic Variants in Families and Populations<\/strong><br>This week we will focus on how we study genetic variation. We'll start by looking at families and populations. Topics that will be introduced include family history and inheritance patterns, ancestry, and linkage. <br><br><strong>Contemporary Techniques and Technologies<\/strong><br>Then we will shift our focus to studying the contemporary techniques and technologies used to study genetic variation, including genome-wide association and sequencing. <br><br><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <i>-week 3-<\/i><br><br>CASE STUDIES IN PERSONALIZED MEDICINE<br><br><strong>From Rare Disease to Common Medication: Familial Hypercholesterolemia<\/strong><br>This week we will begin to discuss specific cases as these apply to personalized medicine. We will first look very closely at a case of familial hypercholesterolemia as we investigate how we use genomic medicine to move from a rare disease to a common medication, using genomics to find new drug targets, and a discussion of the side effects of statin therapy. <br><br><strong>High Risk Pharmacogenetics<\/strong><br>We will then look at a collection of \"high risk pharmacogenetics\"cases that illustrate adverse reactions due to drug metabolism and variable drug responses (skin rash, long QT syndromes; a second heart attack a month after a first; headache during venlafaxine; respiratory arrest after tonsillectomy; bleeding complication after starting warfarin).<br><br><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <i>-week 4-<\/i><br><br><strong>From Mechanisms to Treatment<\/strong><br>We will continue looking at case studies with a focus on those that illustrate how personalized medicine informs treatment decisions related to specific diseases\/conditions. These include cystic fibrosis, Marfan syndrome, heart failure, neuropsychiatric diseases, and diabetes. Three cases\/lessons focus specifically on how genomic medicine informs testing for and treatment of cancer (genomics to subtype cancer; a family member with breast cancer; a family member with colon cancer).&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <br><br><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <i>-week 5-<\/i><br><br><strong>Where We Are &amp; Where We’re Going<\/strong><br>This week we will review and continue discussion of the cases presented in weeks 3-4 as we take a look at where we are now and what's on the horizon in personalized medicine. <br><br>IMPLEMENTING PERSONALIZED MEDICINE IN A SYSTEM OF CARE<br><br><strong>The Role of the Electronic Medical Record<\/strong><br>We will also explore some critical considerations for implementing and operationalizing personalized medicine in a system of care, particularly in the area of informatics. We will discuss the role of the electronic medical record in a learning healthcare system, how electronic records support discovery, and using electronic records in the delivery of personalized medicine.<br><br><br>",
    "estimatedClassWorkload": "2-4 hours\/week",
    "recommendedBackground": "This course is recommended for health science professionals. There are no specific prerequisites but a background in biology and\/or health sciences will be useful.",
    "links": {

    }
}