{
    "id": 1488,
    "shortName": "teachinghist",
    "name": "The Art of Teaching History: A Global Conversation for Secondary Educators ",
    "language": "en",
    "shortDescription": "This class provides secondary history teachers with practical guidelines for developing and delivering a history curriculum that will engage students and make history a relevant and vital subject.",
    "aboutTheCourse": "The development and delivery of a good history class for secondary students requires more than memorization of laundry lists of information – it requires students to read and write, to ask questions and think analytically, to be curious about the past. Students may be able to live perfectly fulfilled and happy lives unaware of what may seem like trivial historical information, but they cannot thrive in today's information society without the ability to read, write, and think at the highest levels. History, taught well, can help students develop those skills. History can also help students understand the world in which they live and how they fit into that world. <br><br>This class will lead secondary teachers through an exploration of the importance of studying history and what it means to think historically. Teachers who take the class will learn how to explain the historical process of questioning and analytical thinking, creating rigorous lesson plans that help students develop the skills that will serve them well in any academic discipline.",
    "targetAudience": 3,
    "courseSyllabus": "<p>The central idea of this course is to bring secondary history teachers together for an international conversation about how to teach history well. Throughout the course, teachers will be asked to<strong> participate in the discussion  forums.<\/strong> Teachers will be asked to <strong>write personal reflections <\/strong>designed to help them clarify their own approach to teaching history and <strong>post reflective comments <\/strong> as a way to actively engage in the online conversation. At the end of the course teachers will be asked to<strong> create an action plan<\/strong> for use in their classrooms.<\/p>",
    "estimatedClassWorkload": "2-3 hours\/week",
    "recommendedBackground": "This course is designed for secondary history educators at all levels of instruction.",
    "links": {

    }
}