{"id":525,"shortName":"structures","name":"L'art des structures 1 : Câbles et arcs","language":"fr","shortDescription":"L'art des structures propose une découverte du fonctionnement des structures porteuses, telles que les bâtiments, les toitures ou les ponts. Ce cours présente les principes du dimensionnement et les structures en câbles et en arcs. Un deuxième cours présentera les structures en treillis, en poutres et en cadres.","aboutTheCourse":"Vous y découvrirez comment se comportent les matériaux de construction courants, comment dimensionner une structure porteuse économiquement et sans risque pour le public.\n<br>\n<br>Vous comprendrez le comportement des structures composées de câbles, d'arcs et de combinaisons d'arcs et de câbles.\n<br>\n<br>La détermination des efforts dans les structures s'effectue au moyen de la statique graphique, ce qui donne une approche très visuelle du processus et ne requiert que des connaissances mathématiques de base.\n<br>\n<br>Les exercices hebdomadaires permettent d'approfondir la connaissance de la matière et d'appliquer les concepts vus à des exemples de structures réelles.\n<br>\n<br><b>NEW ! ENGLISH subtitles will be available for all course videos !<\/b>\n<br>","targetAudience":0,"courseSyllabus":"<ul>\n    <li>Introduction, forces et charges<\/li>\n    <li>Matériaux de construction<\/li>\n    <li>Equilibre dans le plan<\/li>\n    <li>Câbles avec une ou deux charges<\/li>\n    <li>Câbles avec plusieurs charges, stabilisation<\/li>\n    <li>Arcs<\/li>\n    <li>Arc-et-câbles<\/li>\n<\/ul>Le cours est annoncé sur 9 semaines. Cependant, la première \"semaine\" s'étendra effectivement sur deux semaines, pour donner le temps à tous de se mettre au travail et pour accueillir d'éventuels retardataire. Par la suite, les cours\net exercices suivront un rythme hebdomadaire, avec une exception.\n<br>","courseFormat":"Le cours consiste en une série de séquences vidéos, accompagnées par des notes de cours à compléter pendant que vous suivez les vidéos. La mise en pratique commence par une maîtrise des constructions graphiques faites pendant les vidéos et se poursuit\npar un exercice hebdomadaire qui sera corrigé et noté.\n<br>","suggestedReadings":"Le livre <a target=\"_blank\" href=\"http:\/\/www.ppur.org\/produit\/74\/9782880749804\/Lart des structures\">L'art des structures<\/a> par Aurelio Muttoni sert de base à ce cours. Sa lecture constitue un complément très utile au cours en ligne.\n<br>\n<br>Le site <a target=\"_blank\" href=\"http:\/\/i-structures.epfl.ch\/secure\/coursera\/goto.php?c=IM4U&amp;p=\/\">i-structures.epfl.ch<\/a> sera utilisé pour les exercices. Vous pouvez être intéressé à le visiter pour vous rendre compte du contenu du cours, qui en traitera\nla première partie. Une fois connecté à i-structures (en entrant votre identifiant Coursera), Choisissez le lien en <a target=\"_blank\" href=\"http:\/\/i-structures.epfl.ch\/secure\/coursera\/goto.php?c=R38M&amp;p=\/cours\/cours_f.php\">français<\/a> pour accéder\nau contenu du site.\n<br>","instructor":"","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"Un bon bagage général et une familiarité avec les mathématiques sont recommandés. Dans la mesure où le cours y fera fréquemment référence, une bonne capacité à faire des dessins précis à la règle est requise.\n<br>Les aspects mathématiques ne sont pas primordiaux, mais des réponses nécessitant un certain calcul numérique seront fréquemment posées. Il est nécessaire de maîtriser la notion de vecteur et de <a title=\"Link: http:\/\/fr.wikipedia.org\/wiki\/Addition#Addition_vectorielle\" target=\"_blank\" href=\"http:\/\/fr.wikipedia.org\/wiki\/Addition#Addition_vectorielle\">somme vectorielle<\/a>.\n<br>","links":{}}