{
    "id": 415,
    "shortName": "interorg",
    "name": "International Organizations Management",
    "language": "en",
    "shortDescription": "This course provides an overview of the management challenges international organizations & NGOs are faced with. You will learn key theoretical frameworks and practical tools to excel in this environment. ",
    "aboutTheCourse": "International and not-for-profit organizations present an increasingly complex environment to work in and therefore require for their successful management an unprecedented level of managerial skills on top of a deep understanding of the socioeconomic\nand political context they operate in. This course is designed to provide students with (1) basic notions of the practice of international relations (2) a general overview of the management challenges international and not-for-profit organizations are\nfaced with as well as key theoretical frameworks and practical tools for managers to excel in this environment. Key areas of management will be reviewed, from strategy setting to implementation through marketing &amp; fund raising, and assessment. (3)\nGiven the growing interaction between public and private sectors, this course also touches upon the management of public\/private partnerships.\n<br>\n<br>This course is coordinated by <b>Dr. Gilbert Probst<\/b>, Professor, Organization and Management, and Co-Director of the Executive-MBA program at the University of Geneva.\n<br>A panel of instructors, all visiting professors at the University of Geneva’s International Organizations MBA, will be invited to give you a general overview of international and not-for-profit organizations. Among them are:\n<br>\n<br>\n<ul>\n    <li>Dr. <b>Sebastian Buckup<\/b>, Director and alumnus of the Global Leadership Fellows Programme at the World Economic Forum in Geneva, Switzerland, with previous experience at the ILO, UNDP and the private sector.<\/li>\n    <li><b>Julian Fleet <\/b>has experience and training in both public health and in law. Recently retired from his former post as Director of the Department of Human Resources Management in the Joint United Nations Programme on HIV\/AIDS (UNAIDS).\n\n    <\/li>\n    <li><b>Claudia Gonzalez<\/b>, Head of Public Advocacy, UNICEF NY and former Head of Marketing for the Global Fund to fight AIDS, TB and malaria, with more than 18 years leading marketing, PR, branding, social media and communications for international organizations like the World Economic Forum and\n        UNHCR.&nbsp;\n    <\/li><li><strong>Cassandra Quintanilla<\/strong> is a Communications consultant at the Global Fund to Fight AIDS, Tuberculosis and Malaria. She has been working as a teacher and research assistant for Claudia Gonzalez in the Marketing and Fundraising course at the International Organizations MBA since 2011 after graduating from the program herself.<br><\/li>\n    <li><span>Dr. <b>Bruce Jenks<\/b> served as Assistant Secretary General at UNDP until\n2010 and in 2013 he was appointed by the Secretary General to be a member of\nthe Council of the University for Peace. In his career, he served as Director\nof the Office of Strategic Planning (1997-99), as Director of the UN Office in\nBrussels (1995-97) Director of Budget and Chief of Staff (1990-95). Since 2010,\nDr. Jenks has consulted with a number of Organizations.<\/span> Dr. Jenks is an adjunct professor at the Columbia University School of International and Public Affairs, and lectures at the Geneva Graduate Institute of International and Development Studies\n        and at the University of Geneva.<\/li>\n    <li><b>Stephan\nMergenthaler<\/b>\n        is Associate Director, Strategic Foresight at the World Economic Forum in Geneva, as well as Non-resident Fellow with the Global Public Policy Institute in Berlin (GPPi).<\/li>\n    <li>Dr. <b>Lea Stadtler<\/b> is Research Fellow at the University of Geneva, DHEC, as well as Visiting Scholar at INSEAD and has previous work experience in the private sector. &nbsp;&nbsp; &nbsp;&nbsp;\n        <br>\n    <\/li>\n    <li>Prof. <b>Gilbert Probst<\/b> is Managing Director, Leadership Office and Academic Affairs, and Dean of the Global Leadership Fellows Program at the&nbsp;World Economic Forum. He is also a full professor for organizational behavior and management and Co-director of the Executive-MBA program at the University of Geneva.&nbsp;Professor Probst is an award-winning author and editor of a number of books and articles in prestigious journals (Organization Science, Academy of Management Executive, and European Management Journal). He served as a consultant for various major companies such as Kuoni, Holcim, Hewlett Packard, Siemens, Winterthur Insurance, Deutsche Bank, DaimlerChrysler or Swisscom, and has been a board member for Holcim, Kuoni and several SMEs.<\/li>\n\n<\/ul>",
    "targetAudience": 1,
    "courseSyllabus": "This course is part of the Specialization track 'The Challenges in Global Affairs', which contains three courses and a capstone project. The courses do not have to be taken in any particular order.&nbsp;<br><b><br>Week 1:<\/b> Introduction to International Organizations and NGOs (Julian Fleet)<br><b>Week 2:<\/b> The Shifting Context for International Organizations (Stefan Mergenthaler and Sebastian Buckup)<br><b>Week 3: <\/b>Public Private Partnerships (Gilbert Probst and Lea Stadler)<br><b>Week 4: <\/b>Leadership in the UN System (Bruce Jenks)<br><b>Week 5: <\/b>Marketing &amp; Fundraising (Claudia Gonzalez and Cassandra Quintanilla)<br>",
    "estimatedClassWorkload": "2-3 hours\/week",
    "recommendedBackground": "Graduate students of international relations\/business management\/international\nlaw, aspiring to join an international or not-for-profit organization and\/or\nprofessionals with a minimun of 3 years of relevant work experience.\n<br>",
    "links": {

    }
}