{"id":901,"shortName":"health","name":"Global Health and Humanitarianism","language":"en","shortDescription":"Is humanitarianism an effective, justifiable and sustainable response to ill-health, inequality, injustice and war?","aboutTheCourse":"<p><\/p>\n\n<p>Global health is public health at the global level. It deals\nwith the interconnections between people from all over the world. It is based\non the idea that it is necessary to cooperate internationally to respond to diseases,\ndisasters and conflicts which now threaten us all. Humanitarianism, in all its\nvarious forms, is one response. In\nattempting to organise a humanitarian intervention, though, we are confronted\nby a wide range of problems. Most acute of these is the intense inequality\nwhich marks the contemporary world. Public health – its capacities, delivery\nstructures and finances – is profoundly different for the 1 billion people who\nlive in the world’s wealthier countries. Those elsewhere have much more limited\naccess to publicly funded or privately insured medicine. As a consequence,&nbsp;humanitarian&nbsp;non-governmental organisations (NGOs) now deliver a large proportion of\nthe world’s health care.<\/p>This course introduces these issues by looking first at the\nvague, yet highly contested, notion a global health agenda. It then goes on to\nconsider how and why the world’s wealthier countries have sought to develop a\nresponse to the emergencies and crises that the vulnerabilities of others have\nproduced. Here, public pressure and the ethical imperative to bear witness when\nconfronted with&nbsp;suffering are especially important. Finally, the course\nconsiders whether or not humanitarian assistance can be considered a right. It\nlooks at the emerging Responsibility to Protect agenda and the associated moral\ndilemmas around sovereignty, post-colonialism and duty-based ethics.\n\n<p>&nbsp;Within this context, the course explores these critical questions:<\/p>\n\n<ul><li>Is humanitarian\naid, as a concept, as simple as the rich helping the poor?<\/li><li>Are these\ninterventions well-meaning and effective? <\/li><li>Should governments\nbe committing tax revenues – involuntarily given – to improve the health of\nothers far away?<\/li><li>Do those that can\nafford it have a responsibility to act in some way?<\/li><li>What does receipt\nof aid mean for the recipient country, its leadership, its future, and its\nresponsibility?<\/li><li>Must people be\nhelped only according to need, regardless of what a regime might have done?<\/li><li>Must humanitarians\nremain neutral – silent perhaps – in the face of injustice in order to ensure\naccess?<\/li><li>Must the causes of\ninequality, suffering and violence be ignored in favour of access, action and\noutcome?<\/li><\/ul>\n\n\n\n<p>Each of the 3 sessions below is built around a series of\ninterviews with 3 leading figures in the humanitarian world. The first,\n<strong>Professor Tony Redmond OBE<\/strong>, is a Consultant in Emergency Medicine and a\nfounding member of the College of Emergency Medicine. He was founding Editor of\nthe Emergency Medicine Journal and a founder the Resuscitation Council. His\ninterest in disaster management began with the earthquake in Armenia in 1988\n(where he was appointed to the Soviet Order for Personal Courage) and he has since\nresponded to a range of humanitarian crises in Kurdistan, Bosnia, Serbia,\nMacedonia, Montenegro, Cape Verde, Kosovo, Kenya, Iran, Pakistan, China and\nHaiti. In 1994 he established UK-Med, an NGO that now hosts the\nUK International Emergency Trauma Register. He is currently Professor of\nEmergency Medicine at the Humanitarian and Conflict Response Institute at the\nUniversity of Manchester and Chair of the Foreign Medical Teams Working Group\nat the World health Organisation.<\/p>\n\n<p>The second, <strong>Professor Rony Brauman<\/strong>, is Director of the\nHumanitarian and Conflict Response Institute at the University of Manchester.\nHe has worked in the field of international medical assistance since 1977. He\nhas served as a field physician in Thailand, Chad, Somalia, El Salvador,\nNicaragua, Lebanon, Angola, Somalia, Afghanistan, primarily with Médecins Sans Frontières (France). He became the President of the organization from 1982\n-1994. During this period, MSF became recognized as the largest and the most\neffective transnational not-for-profit medical agency in the world and was\nawarded the Nobel Peace Prize in 1999. He was awarded the \"Prix Henry\nDunant\" in 1997 and currently lectures at the Institut d'Études Politiques\n(Paris) and is Director of Research at the MSF Foundation also in Paris.<\/p>\n\n<p>&nbsp;The third, <strong>Professor Mukesh Kapila CBE<\/strong>, is Professor of\nGlobal Health and Humanitarian Affairs in the Humanitarian and Conflict Response\nInstitute at the University of Manchester. He is also Special Representative of\nthe Aegis Trust and Chair of Minority Rights Group International. Previously,\nhe was Under Secretary General at the International Federation of Red Cross and\nRed Crescent Societies. Earlier, he served as Special Adviser to the United\nNations High Commissioner for Human Rights in Geneva and then to the UN Mission\nin Afghanistan. Subsequently, he led the UN’s largest country mission at the\ntime as the United Nations Resident and Humanitarian Coordinator for the Sudan,\nand then became a Director at the World Health Organization. Prior to the UN,\nProfessor Kapila was at the UK's Department for International Development,\ninitially as senior health and population adviser and latterly as the first\nhead of a new Conflict and Humanitarian Affairs Department that he set up.<br><\/p>","targetAudience":0,"courseSyllabus":"<b>Week One: What is <\/b><b>Global Health?<\/b><br>\n\n<p>This introductory session will address global differences in access to healthcare, using maternal health as a key example. It will suggest factors that are significant in understanding those differences including logistics, culture, public spending and education, and the consequences on inequity in access to healthcare for individuals and communities.<\/p><p><strong>Week Two: Global Health definitions, case studies and evolution<\/strong><\/p>\n\n<p>The session looks at the evolution of the terminology and practice of 'global health'. It gives an overview of two key agencies (World Health Organisation and the International Committee of the Red Cross) and their development, reflecting the broader development of global health concepts and praxis. Finally we examine case studies relating to the causes, communication and management of disease spread.<\/p>\n\n<p><strong>Week Three: Humanitarian Responses<\/strong><\/p>\n\n<p>Humanitarian crises exert great cost. The Japanese tsunami in\n2011 is estimated to have cost $300billion. The Indian Ocean tsunami of 2004 probably\nkilled in excess of 400,000 people (mostly in Indonesia).&nbsp; Civil wars have, since 1945, killed over 20\nmillion people and displaced a further 67 million, 90% of whom have been\nnon-combatants. Responding to such a litany of misery has increasingly taken\nthe form of humanitarianism, which has seen large increases in expenditure\nsince the 1980s. In this part of the course, we will look at the\nvulnerabilities that underpin war and disaster in the developing world (as the\nhome of the great majority of these events). We will consider the phases,\nchallenges and politics of humanitarian responses and ask why is that\nresource-poor environments are so prone to such occurrences.<\/p>\n\n<p><strong>Week Four: Humanitarian Dilemmas&nbsp;<\/strong><\/p>\n\n<p>Humanitarianism is, at its very heart, political. It\nimmediately opens up profound ethical questions. This has become increasingly\napparent as aid agencies have moved away from the single-mandate approach of\nthe Cold War and towards combined programmes of relief, development and\npeace-building. This part of the course will trace some of the difficulties\nthat this has generated. In particular, it will consider the shift from duty-based\nethics to a focus on the consequences of humanitarian intervention. We will\nlook at two organisations' responses to two seminal crises in the 1990s -\nMSF France's decision to withdraw from the refugee camps on the Rwanda border\nin 1994, and the International Committee of the Red Cross's refusal to testify to the International Criminal\nTribunal for the Former Yugoslavia in 1999.<\/p>\n\n<p><strong>Week Five: The Right to Humanitarian Assistance<\/strong><\/p>\n\n<p>As the world becomes more interconnected as a result of\nglobalisation, increased migration and technology, disasters (both natural and\nman-made) are no longer of local but global concern. The right to assistance\nfor those affected by such conflict (internal and international) and natural\ndisasters are at the forefront of humanitarian action. Multiple humanitarian\nagencies and government bodies are heavily involved in the provision of\nassistance to those in need. Yet the right to humanitarian assistance is very\nmuch an area of humanitarianism that is open to debate: does a right to\nhumanitarian assistance actually exist? In many cases the rights of the\nindividual in need of assistance are often compromised by broader\nconcerns of national sovereignty and international politics.<\/p>\n\n<p><strong>Week Six: Responsibility to Protect<\/strong><\/p>\n\n<p>Moving on from the previous section where we examined the\nright to humanitarian assistance and the obstacles and challenges surrounding\nits practice, this session will explore another controversial issue within\nhumanitarianism: the responsibility to protect (hereafter referred to as R2P).\nThe principle R2P recognizes not only the need for states to protect their own\ncitizens from genocide and other mass atrocities, it also sets the precedent\nthat if such states are unable to do so, then the international community will\nstep in and provide the much needed protection and humanitarian assistance to\nthose affected. Since its adoption by UN members in 2005, the practice of R2P\nhas suffered from inconsistent application around the world, raising concerns\nover national sovereignty and the motivations of those behind R2P operations.\nThis session will explore the concept in more depth, charting its rise from\n2001 as well as shedding light on some of the main challenges it faces.<\/p>","courseFormat":"The class will consist of lecture videos, which are between 8 and 12 minutes in length. Particpants will be asked to contribute regularly to the discussion board.<br>","suggestedReadings":"No preparatory reading is required - all reading will be provided.<br>","estimatedClassWorkload":"1-3 hours\/week","recommendedBackground":"None, all welcome.<br>","links":{}}