{
    "id": 3569,
    "shortName": "politicalphilosophyalumni",
    "name": "Revolutionary Ideas: An Introduction to Legal and Political Philosophy (Alumni)",
    "language": "en",
    "shortDescription": "Political and legal institutions are built on foundational, philosophical ideas--ideas about freedom, equality, justice, and happiness.  In this course, we will explore those ideas, taking the institutions around us not as fixed and unquestionable, but as things to evaluate and, if necessary, to change.",
    "aboutTheCourse": "What is the purpose of government?  Why should we have a State?  What kind of State should we have?<br><br>Even within a political community, there may be sharp disagreements about the role and purpose of government.  Some want an active, involved government, seeing legal and political institutions as the means to solve our most pressing problems, and to help bring about peace, equality, justice, happiness, and to protect individual liberty.  Others want a more minimal government, motivated, perhaps, by some of the disastrous political experiments of the 20th Century, and the thought that political power is often just a step away from tyranny.  In many cases, these disagreements arise out of deep philosophical disagreements.<br><br>All political and legal institutions are built on foundational ideas.  In this course, we will explore those ideas, taking the political institutions and political systems around us not as fixed and unquestionable, but as things to evaluate and, if necessary, to change.  We will consider the ideas and arguments of some of the world’s most celebrated philosophers, including historical thinkers and contemporary theorists. <br><br>The aim of the course is not to convince you of the correctness of any particular view or political position, but to provide you with a deeper and more philosophically-informed basis for your own views, and, perhaps, to help you better understand the views of those with whom you disagree.",
    "courseSyllabus": "<p><b>Module One: Why should we have a State? &nbsp;Happiness<\/b><br><\/p><p>Many have suggested that the role of the State is to promote peace, stability, and human flourishing—in short, to bring about various kinds of good consequences.&nbsp; We’ll consider some questions about this kind of view.&nbsp; Should we use an objective measure of happiness or utility, or a subjective measure, based on what people think is good for them or makes them happy?&nbsp; What is the relationship between happiness and economic activity?&nbsp; How can States promote happiness or individual welfare?&nbsp; What should the State’s role be in structuring economic activity?&nbsp; In solving ‘collective action’ problems?&nbsp; Are States good at promoting domestic and international peace?&nbsp; If one role for the State is to prevent people from harming each other, how should we define harm?&nbsp; How does concern about happiness and flourishing differ if there is disagreement within the political community about what is worthwhile? &nbsp; &nbsp;<\/p><p><b>Module Two: Why should we have a State? &nbsp;Justice<\/b>&nbsp;<\/p><p>One role offered for the State is in helping to bring about justice.&nbsp; What does justice require?&nbsp; Is justice about matching merit and effort with reward?&nbsp; About making sure the good prosper and the bad suffer?&nbsp; About making sure that all have enough before some have a lot?&nbsp; What role does or should the State play in all of this? &nbsp; &nbsp;<\/p><p><b>Module Three: Political Community—Should our State have borders?&nbsp;<\/b><\/p><p>What is the appropriate size and basis of political community?&nbsp; Should we be in a political community together because we share a geographic region, a religion, a cultural tradition, a set of values, a planet?&nbsp; Should we be allowed to change or to choose what political community we are a part of?&nbsp; If so, how easily?&nbsp; Should we have open borders?&nbsp; What is the value of political community?&nbsp; What is the relationship between community and autonomy?&nbsp; Who should have a say in how the community is governed?&nbsp;<\/p><p><b>Module Four: Crime and Punishment—Should our State have prisons?&nbsp;<\/b><\/p><p>What should happen to people who break the law?&nbsp; Should we punish people?&nbsp; How?&nbsp; Why?&nbsp; How much?&nbsp; What do a practices of punishment reveal about our moral views of people?&nbsp; Are those views plausible?&nbsp; Problematic?&nbsp; Should we be troubled if a disproportionate number of people who are punished are of a certain race, economic class, or mental health status?&nbsp; What is the point of putting people in prison?&nbsp; What are alternatives to incarceration?<\/p>",
    "estimatedClassWorkload": "2-3 hours\/week",
    "recommendedBackground": "",
    "links": {

    }
}