{"id":1168,"shortName":"neuromarketing","name":"An Introduction to Consumer Neuroscience & Neuromarketing ","language":"en","shortDescription":"This course will introduce you to the multidisciplinary field of consumer neuroscience and neuromarketing. It will go through to the basic concepts of the human brain, the elements of the consumer mind, how it is studied, and how its insights can be applied in commercial and societal understandings of consumer behaviour.","aboutTheCourse":"<p>How do we make decisions as consumers? What do we pay attention to, and how do our initial responses predict our final choices? To what extent are these processes unconscious and cannot be reflected in overt reports? This course will provide you with an introduction to some of the most basic methods in the emerging fields of consumer neuroscience and neuromarketing. You will learn about the methods employed and what they mean. You will learn about the basic brain mechanisms in consumer choice, and how to stay updated on these topics. The course will give an overview of the current and future uses of neuroscience in business.<\/p>","targetAudience":1,"courseSyllabus":"<span><p>Week 1: PROLOGUE - What is neuromarketing all about?<\/p><p>Week 2: Senses, attention and consciousness<\/p><p>Week 3: Sensory neuromarketing<\/p><p>Week 4: Emotions &amp; feelings, wanting &amp; liking<\/p><p>Week 5: Learning &amp; memory<\/p><p>Week 6: Neuroethics and consumer aberrations<\/p><\/span><br>","courseFormat":"<p>The class will consist of lecture videos. Each lecture video contains integrated quiz questions. Video lectures will be given by the Instructor, but with contributions from some of the leading international scholars and practitioners in this field - providing students with multiple perspectives. There will also be homework that is not part of the video, primarily in the form of reading a textbook text and short articles. For each topic a list of internet resources and key references will be listed for further self-study.<\/p>","suggestedReadings":"<p>Although the lectures and weekly contents are designed to be self-contained, we recommend (but do not require) that students refer to the book \"<a href=\"http:\/\/www.amazon.com\/Introduction-Neuromarketing-Consumer-Neuroscience-Thomas-ebook\/dp\/B00M9ISQFW\" target=\"_blank\" title=\"Link: http:\/\/www.amazon.com\/Introduction-Neuromarketing-Consumer-Neuroscience-Thomas-ebook\/dp\/B00M9ISQFW\">Introduction to Neuromarketing &amp; Consumer Neuroscience<\/a>\" (soon out as print book), which was written specifically for this course.<\/p>\n<p><span>We also recommend \"<a href=\"http:\/\/www.amazon.com\/Neuromarketing-For-Dummies-Stephen-Genco\/dp\/1118518586\" target=\"_blank\" title=\"Link: http:\/\/www.amazon.com\/Neuromarketing-For-Dummies-Stephen-Genco\/dp\/1118518586\">Neuromarketing for Dummies<\/a>\".&nbsp;<\/span><\/p>\n<p>And finally we recommend the freely available \"<a href=\"https:\/\/app.neuronsinc.com\/lp\/neuromarketing-compendium-2014.php\" target=\"_blank\" title=\"Link: https:\/\/app.neuronsinc.com\/lp\/neuromarketing-compendium-2014.php\">Selected Readings in Consumer Neuroscience &amp; Neuromarketing – 2nd edition<\/a>\"<\/p>","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"<span><p>No background is required; all are welcome!<\/p><p>The course is on an introductory level, but for students who want to dig deeper or already have some prior knowledge from medicine, marketing, psychology or another related field we have compiled some additional readings, that will be presented each week.<\/p><div><br><\/div><\/span>","links":{}}