{"id":72,"shortName":"foodsys","name":"An Introduction to the U.S. Food System: Perspectives from Public Health","language":"en","shortDescription":"Explore how food intersects with public health and the environment as it moves from field to plate.","aboutTheCourse":"A food system encompasses the activities, people and resources involved\nin getting food from field to plate. Along the way, it intersects with\naspects of public health, equity and the environment. &nbsp;In this course,\nwe will provide a brief introduction to the U.S. food system and how food\nproduction practices and what we choose to eat impacts the world in which\nwe live. Through several case studies, we will discuss some key historical\nand political factors that have helped shape the current food system and\nconsider alternative approaches from farm to fork. The course will be led\nby a team of faculty and staff from the Johns Hopkins Center for a Livable\nFuture. &nbsp;Guest lecturers will include experts from a variety of disciplines,\nincluding public health and agriculture. <br><br>Beginning with the January 2015 session, the course will include several new lectures from Bob Lawrence, Jillian Fry and Roni Neff.&nbsp;\n<br><br>\nDeveloped in collaboration with <a href=http:\/\/www.jhsph.edu\/offices-and-services\/center-for-teaching-and-learning\/our-services\/open-education-lab\/index.html>Johns Hopkins Open Education Lab<\/a>.","targetAudience":1,"courseSyllabus":"Module 1: Is Climate Change Vindicating Malthus? Food Security and the Right to Food.<br>Module 2: An Introduction to Food Systems, Sustainability and Resilience&nbsp;<br>Module 3: Food Security, Food Production and Public Health<br>Module 4: Public Health and Environmental Implications of Industrial Models of Food Production<br>Module 5: US Agriculture Policy and the Farm Bill: Where is Health?&nbsp;<br>Module 6: Building a Healthier Food System: Two Case Studies<br>","courseFormat":"This course will be taught by a team of faculty and staff from the Johns\nHopkins Center for a Livable Future. It is based on a 4-credit online course\noffered to graduate students at the Bloomberg School of Public Health.\nThough the course will include lectures from experts in fields such as\npublic health and agriculture, not all speakers recorded for this course\nwill be available for direct student interaction.","suggestedReadings":"Optional textbook:&nbsp; <strong>Introduction to the U.S. Food System: Public Health, Environment and Equity<\/strong>. Roni Neff (editor).&nbsp; Jossey-Bass, 2014.&nbsp; <br><ul><li>Purchase on <a href=\"http:\/\/www.amazon.com\/Introduction-US-Food-System-Environment\/dp\/1118063384\/ref=sr_1_1?ie=UTF8&amp;qid=1420814950&amp;sr=8-1&amp;keywords=neff+food+system\" target=\"_blank\">Amazon<\/a><\/li><li>Purchase on <a href=\"http:\/\/www.wiley.com\/WileyCDA\/WileyTitle\/productCd-1118063384.html\" target=\"_blank\">Wiley.com<\/a><\/li><\/ul>Explore course topics by visiting:\n<br>\n<ul>\n    <li><a href=\"http:\/\/www.jhsph.edu\/research\/centers-and-institutes\/johns-hopkins-center-for-a-livable-future\/index.html\">Johns Hopkins Center for a Livable Future website<\/a>\n    <\/li>\n    <li><a href=\"http:\/\/www.livablefutureblog.com\/\">Johns Hopkins Center for a Livable Future blog<\/a>\n    <\/li>\n    <li><a href=\"http:\/\/www.jhsph.edu\/research\/centers-and-institutes\/teaching-the-food-system\/\">Teaching the Food System curriculum<\/a>\n    <\/li>\n<\/ul>\n<br>Additional links related to lecture topics include:\n<br>\n<ul>\n    <li><a href=\"http:\/\/www.meatlessmonday.com\/\">Meatless Monday campaign<\/a>\n    <\/li>\n    \n    <li><a href=\"http:\/\/www.ncifap.org\/\">Pew Commission on Industrial Farmed Animal Production<\/a><\/li><li><a href=\"http:\/\/www.iom.edu\/Activities\/Nutrition\/FoodForum\/2013-MAY-07.aspx\" target=\"_blank\">The Food Forum Workshop on Sustainable Diets: Food for Healthy People and a Healthy Planet.&nbsp; Institute of Medicine (IOM) of the National Academies. 2013.<\/a> <br><\/li>\n    <li><a href=\"http:\/\/www.apha.org\/advocacy\/policy\/policysearch\/default.htm?id=1361\">Toward a Healthy, Sustainable Food System (APHA Policy Statement, 2007)<\/a>\n    <\/li>\n<\/ul><br>","instructor":"Keeve Nachman and Robert S. Lawrence","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"An understanding of public health or nutrition is helpful but not necessary.\nAs farmer and poet Wendell Berry noted, “Eating is an agricultural act.”","links":{}}