{
    "id": 963,
    "shortName": "inf4oec",
    "name": "Informatik für Ökonomen",
    "language": "de",
    "shortDescription": "Computer haben unser Leben tiefgreifend verändert. Um die heutige Gesellschaft und Wirtschaft und deren stetigen Veränderungen zu verstehen, muss man wissen, wie Computer funktionieren. \nDas Ziel der Vorlesung Informatik für Ökonomen ist es, Ihnen eine Basis zu vermitteln, um unsere informationstechnisch gesteuerte Welt zu verstehen und darin erfolgreich zu sein.\n",
    "aboutTheCourse": "<p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUm die heutige Gesellschaft und Wirtschaft als Ganzes zu begreifen, muss\nman verstehen, wie Computer funktionieren und wie sie unser wirtschaftliches\nUmfeld verändern. Ziel der Vorlesung <i>Informatik für Ökonomen<\/i> ist es, diese\nzwei Bereiche zu beleuchten.    <br><\/p>\n\n<p>Zunächst beschäftigen wir uns also mit der Frage wie Computer und\nInformationssysteme funktionieren. Dabei werden wir ergründen\nauf welchen Prinzipien die Geräte basieren und wie diese programmiert werden können.<\/p><p><\/p><ul><li>Wie\nfunktioniert ein Computer wie z. B. mein Smartphone? <\/li><li>Was sind die technischen Grundlagen für die Vielzahl von Informationen auf dem Web?<br><\/li><\/ul><p><\/p>\n\n<p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAls weiteres wollen wir verstehen, wie sich Informationssysteme auf\nunser wirtschaftliches Umfeld auswirken.    <br><\/p>\n\n<p><\/p><ul><li>Weshalb\nlohnt es sich in Computer zu investieren? <\/li><li>Welchen Mehrwert leisten diese für eine Firma?<\/li><li>Wie,\nwo, und mit welcher Zielsetzung werden und sollen Computer demnach in Firmen und\nOrganisationen eingesetzt werden?<br><\/li><li>Warum\nhaben Supermarktketten und Warenhäuser moderne\nScannerkassen eingeführt?<br><\/li><\/ul><p><\/p>\n\n<p>Welche Besonderheiten haben Digitale Güter\n-- also Produkte, die nur aus einer Ansammlung von Daten bestehen, wie Musik,\nFilme, oder Software -- und wie wirken sich diese auf deren Handel aus? <\/p>",
    "targetAudience": 0,
    "courseSyllabus": "Die Vorlesung gliedert sich in wöchentliche Themen. Diese sind:<br><br>Woche 1: Einführung<br><br>Woche 2-4: Technische Grundlagen<br><ul><li>Programmierung<\/li><li>Hardware, Software, Infrastruktur<\/li><li>Digitalisierung, Datenformate, Datenspeicherung<\/li><\/ul>Woche 5-6: Informationssysteme im Unternehmen<br><ul><li>Arten von Informationssystemen<br><\/li><li>Wert von Informationssystemen<\/li><\/ul>Woche 7: Der Wert von Information<br><br>Woche 8-9: Digitale Güter in der Volkswirtschaft<br><ul><li>Eigenschaften und Besonderheiten digitaler Güter<br><\/li><li><span>Massnahmen gegen Marktverzerrungen<br><\/span><\/li><li><span><span>Wettbewerbsstrategien<\/span><br><\/span><\/li><\/ul><br>Danach folgen 2-3 Wochen zum lernen und anschliessen eine Abschlussprüfung.",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": "Die Vorlesung setzt kein speziales Fachwissen voraus. Allerdings wurde sie für Wirtschaftsstudierende konzipiert und verwendet Fachbegriffe aus der Betriebs- und Volkswirtschaftslehre.<br>Als Hintergrundmaterial bieten wir ein Dokument, dass die wichtigsten Begriffe der Volkswirtschaftslehre erklärt.  ",
    "links": {

    }
}