{
    "id": 760,
    "shortName": "nanosar",
    "name": "التقانة والمستشعرات النانوية",
    "language": "ar",
    "shortDescription": "هو مساق للمهتمين في التعرف على أدوات الاستشعار الحديثة التي تستعين بتقانة النانو (وهي التقانة التي تبحث في المجال بين واحد إلى مئة نانوميتر، أي في أجزاء من المليار من المتر) لفرز ومراقبة الأحداث المختلفة في حياتنا الشخصية أو العملية.  في أطار المساق، سنكتشف معا عالم النانو المذهل الذي يتعامل مع الوحدات الأساسية في بناء المادة.  وبهذا سوف نمهد الطريق لتطبيقات إبداعية لانهائية تطبق في كل جزء من حياتنا اليومية، بدءا من تشخيصات وعلاجات (في الجسم الحي أو خارجه) للأمراض، وثم نستمر في تقانة مراقبة جودة المنتوجات وما يختص بالبيئة، وننهي في تقانة مراقبة القضايا الأمنية.  سنتعلم في هذا السعي كيف نصَنع هذه الأدوات الجديدة، وكيف نميزها، وكيف نتحكم بها، وكيف ندمجها في التطبيقات المختلفة.\n",
    "aboutTheCourse": "<br>\n<br>\n<br>\n<br><strong>وصف المساق&nbsp;&nbsp;<\/strong>\n<br>\n<br>&nbsp;&nbsp;&nbsp;<span>تقانة\nومستشعرات النانو هو مجال يحوي اختصاصات عديدة ومتداخلة التي تضم\nالكيمياء\/البيوكيمياء، الفيزياء، البيولوجيا، علم المواد، هندسة الإلكترونيات\nوغيرها. سيعرض المساق الحالي بعض مبادئ تقانة ومواد النانو الاساسيّة ودورها الهام\nفي اجهزة و خواص الاستشعار. ستناقش في هذا المساق معلومات شيقة من تخصصات متعددة\nفي مجال العلوم والهندسة في المستوى النانوي, مستهدفا فهم الاختلافات الفيزيائية\nالأساسية لمستشعرات النانو. حين إنهاء هذا المساق، يكون قد تعلم الطالب تصنيع،\nتمييز، ومعالجة مواد النانو، ومستشعرات النانو، وكيف من الممكن تسخيرها لبناء\nتطبيقات جديدة.<span> وأيضا سيطبق الطالب معرفته في تقانة ومستشعرات النانو ضمن مشروع حسب\nاهتمامه الشخصي<\/span><span>.&nbsp;<\/span><\/span> \n\n\n<p><\/p>\n\n\n\n<p><\/p>\n<p>&nbsp;<span><b>محتويات<\/b><b> <\/b><b>المساق<\/b><\/span>\n<\/p>\n<p>\n\n<\/p>\n<p>\n\n<\/p><p><span><span>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n<\/span>أهمية المواد النانوية في تطبيقات\nالاستشعار.<\/span><\/p><p>\n\n<\/p><p><span><span>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n<\/span>الأساليب المستخدمة في تحديد خصائص\nالمستشعرات النانوية· <\/span><\/p><p>\n\n<\/p><p><span><span>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n<\/span>الأساليب المستخدمة لتكييف مواد\nالنانو بهدف استعمالها في تطبيقات استشعار خاصة. <\/span><\/p><p>\n\n<\/p><p><span><span>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n<\/span>جسيمات النانو الفلزية والشبه موصلة. <\/span><\/p><p>\n\n<\/p><p><span><span>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n<\/span>أنابيب النانو وأسلاك النانو العضوية\nوغير العضوية.<\/span><\/p><p>\n\n<\/p><p><span><span>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n<\/span>المستشعرات الضوئية، الميكانيكية،\nوالكيميائية المبنية من مواد النانو.<\/span><\/p><p>\n\n<\/p><p><span><span>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n<\/span>&nbsp;المستشعرات المبنية من هجين من المواد\nالنانوية.<\/span><\/p><p>\n\n<\/p>\n<p>\n\n<\/p>\n<br>\n<br>\n<p><\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<p><span><b>الأسبوع 1<\/b><b> <\/b><b>- <\/b><b>مقدمة في تقانة النانو<\/b><b>:<\/b><\/span>\n<\/p>\n\n<p>تعريف تقانة النانو؛ الصفات الرئيسية لمواد النانو؛ أنواع مبنى النانو (مبنى 0D, 1D , 2D)؛ المواد<\/p>\n\n<p>المركبة النانوية؛ الصفات الكيميائية\/الفيزيائية\/الكهربائية\/الضوئية الأساسية لمواد النانو.<\/p>\n\n<p><b> <\/b>\n<\/p>\n\n<p><span><b>الأسبوع 2<\/b><b> <\/b><b> <\/b><b>- <\/b><b>مقدمة في تقانة النانو (تكملة)<\/b><b>:<\/b><\/span>\n<\/p>\n\n<p>طرق بحث صفات مواد النانو؛ مجهر القوة الذري (AFM)؛ مجهر إلكتروني ماسِح (SEM)؛ مجهر النفوذ (التمرير) الإلكتروني (TEM)؛ طرق مجهرية ومطيافية لاستكشاف صفات سطوح المواد؛ تصنيع المستشعرات بالتوجه الصعودي (bottom-up) والتوجه النزولي (top-down)؛ تجميع ذاتي للمباني\n    النانوية؛ وأمثلة في تطبيقات التقانة النانوية.\n<\/p>\n\n<p><b> <\/b>\n<\/p>\n\n<p><span><b>الأسبوع 3<\/b><b> <\/b><b> <\/b><b>- <\/b><b>مقدمة في علوم وتقانة المستشعرات:<\/b><b> <\/b><\/span>\n<\/p>\n\n<p>تعريف المستشعرات؛ الأجزاء الأساسية للمستشعرات؛ التشابه بين الكائنات الحية والمستشعرات الاصطناعية؛ كيفيّة عمل التحسس الفيزيائي (الرؤية، السمع، والمس) والكيميائي (الشم والذوق)؛ العوامل المستعملة في تشخيص أداء المستشعرات: الدقة، الضبط، الحساسية، حد الاستشعار،\n    المجال الديناميكي، الانتقائية، الخطية، التباين، زمن الاستجابة، التلاكؤ (التخلفية)، ودورة الحياة.<\/p>\n\n<p><b> <\/b>\n<\/p>\n\n<p><span><b>الأسبوع 4<\/b><b> <\/b><b>- <\/b><b> المستشعرات المبنية من جسيمات\nالنانو الفلزية<\/b><b>:<\/b><\/span>\n<\/p>\n\n<p>تعريف جسيمات النانو؛ صفات جسيمات النانو؛ إنتاج جسيمات النانو بطرق فيزيائية (بتر ليزري) وطرق كيميائية (طريقة  Brust، نمو بواسطة بذرة، الخ.).<\/p>\n\n<p><b> <\/b>\n<\/p>\n\n<p><span><b>الأسبوع 5<\/b><b> <\/b><b>- <\/b><b>مستشعرات نقطة كمومية<\/b><b>: <\/b><\/span>\n<\/p>\n\n<p>تعريف النقطة الكمومية؛ طرق تصنيع النقاط الكمومية؛ قياسات جهرية ومجهرية ضيائية ضوئية؛ تطبيقات النقاط الكمومية كعامل تباين متعدد الوسائط في التصوير البيولوجي؛ وتطبيقات النقاط الكمومية كمستشعرات بيولوجية.<\/p>\n\n<p><b> <\/b>\n<\/p>\n\n<p><span><b>الأسبوع 6<\/b><b> - <\/b><b>المستشعرات المبنية من أسلاك نانوية<\/b><b>:<\/b><\/span>\n<\/p>\n\n<p>تعريف أسلاك النانو و خواصها؛ وسائل تصنيع الأسلاك النانوية؛ تصنيع مستشعرات مكونة من سلك نانوي مفرد  بالتوجه الصعودي (bottom-up) ) والنزولي (top-down)؛ تصنيع مصفوفات من أسلاك النانو (قنوات سوائلية، غشاء الفقاعة المنفوخة، الطبع بالتلامس، طلاء بالبخ،\n    إلخ).\n<\/p>\n\n<p><b> <\/b>\n<\/p>\n\n<p><span><b>الأسبوع 7<\/b><b> <\/b><b>-<\/b><b>\n<\/b><b>مستشعرات<\/b><b> <\/b><b>أنابيب<\/b><b> <\/b><b>الكربون<\/b><b> <\/b><b>النانوية<\/b><b>:<\/b><\/span>\n<\/p>\n\n<p>تعريف أنبوب الكربون النانوي وخواصه؛ تحضير أنبوب الكربون النانوي؛ تصنيع ومبادئ عمل المستشعرات المبنية من أنبوب كربون نانوي مفرد؛ تصنيع ومبادئ عمل المستشعرات المبنية من مصفوفة عشوائية من أنابيب الكربون النانوية.<\/p>\n\n<p><b> <\/b>\n<\/p>\n\n<p><span><b>الأسبوع 8<\/b><b> <\/b><b>- <\/b><b>م<\/b><b>ستشعرات مكونة\nمن بنيات نانوية لأكسيد الفلز<\/b><b>:<\/b><\/span>\n<\/p>\n\n<p>تحضير بنيات أكسيد الفلز بطرق جافة ورطبة؛ أنواع مستشعرات الغاز المبنية من أكسيد الفلز؛ كيمياء العيوب في مبنى سطح مستشعرات أكسيد الفلز؛ آلية التحسس في مستشعرات الغاز المبنية من أكسيد الفلز؛ وبنيات من أكسيد الفلز المسامية لتحسين تطبيقات التحسس.\n<\/p>\n\n<p><b> <\/b>\n<\/p>\n\n<p><span><b>الأسبوع 9<\/b><b> -<\/b><b> <\/b><b>مستشعرات<\/b><b> <\/b><b>نانوية حساسة للكتلة<\/b><b>:<\/b><\/span>\n<\/p>\n\n<p>مبدئ عمل المستشعرات المبنية من بوليمرات بنى نانوية؛ آلية التحسس وتطبيقات المقاومات الكيميائية النانوية والترانزستورات التأثير المجالي النانوية لبوليمرات موصلة (أو شبه موصلة)، مع\/بدون مواد غير عضوية\n<\/p>\n\n<p>.<\/p>\n\n<p><span><b>الأسبوع 10<\/b><b> <\/b><b>- <\/b><b>مصفوفة من مستشعرات مبنية من مواد نانوية<\/b><b>:<\/b><\/span>\n<\/p>\n\n<p>نموذج تمثيلي لمحدودية الحواس البشرية بواسطة تقانة النانو ومستشعرات النانو البشرة الإلكترونية المرتكزة على تقانة النانو.<\/p>",
    "estimatedClassWorkload": "3-4 hours\/week",
    "recommendedBackground": "<p><b>&nbsp;<\/b><b>الخلفية المطلوبة:<\/b>\n\n<\/p>\n<p>\n\n<span>خلفية\nفي الكيمياء، الفيزياء، البيولوجيا، أو علم المواد موصى بها.<\/span><\/p><p><span>\n\n&nbsp;&nbsp;\n <\/span>   <br>\n<\/p>",
    "links": {

    }
}