{"id":50,"shortName":"neuroethics","name":"Neuroethics","language":"en","shortDescription":"This course will examine the ethical, legal and social issues raised by neuroscience. Topics will include the implications of new knowledge of the brain for our understanding of selfhood, for the meaning of privacy, for the distinction between therapy and enhancement, and for national security.","aboutTheCourse":"“Perhaps a man really dies when his brain stops, when he loses the power to take in a new idea.” --George Orwell<br><br> Neuroethics might well be the most rapidly growing area within bioethics; indeed, in some respects neuroethics has grown as an independent field, with its own journals, professional society and institutional centers. This growth over the past decade is partly attributable to the growth of neuroscience itself and to the challenging philosophical and moral questions it inherently raises. A 2012 Royal Society report observes that “(a)n increasingly mechanistic understanding of the brain raises a host of ethical, legal, and social implications. This has laid the foundation for the emergent field of Neuroethics, which examines ethical issues governing the conceptual and practical developments of neuroscience. Irrespective of their validity, even the claims that modern neuroscience entails the re-examination of complex and sensitive topics like free will, consciousness, identity, and responsibility raises significant ethical issues. As such, neuroethics asks questions that extend beyond the usual umbrella of biomedical ethics.” This course will, therefore, consider the new knowledge and ways of learning about the brain from scientific and ethico-legal and social standpoints. We will examine the core themes of neuroethics, including cognitive enhancement, the nature of the self and personhood, neuroimaging and privacy, and the ways that all these themes are brought together in matters affecting national security.<br><br> <strong><br><\/strong>","targetAudience":1,"courseSyllabus":"","courseFormat":"The class will consist of lecture videos, which are between 8 and 20 minutes in length.  Beginning in the second week, there will be a quiz consisting of 8 to 10 questions related to that week's course content. Additionally, we encourage you to post on the discussion boards in order to further learning, generate questions, and share relevant information.","suggestedReadings":"We will post free links each week to relevant articles.  Everyone is strongly encouraged to peruse these readings.<br><br>You are not required to purchase any books.  Nonetheless, the following books will provide deeper insight into neuroethics and be helpful to students.  If one decides to purchase the books, all three are available through amazon.com<br><br>Mind Wars: Brain Science and the Military In the 21st Century by Jonathan D. Moreno<br>The Body Politic: The Battle Over Science in America by Jonathan Dr. Moreno<br>Neuroethics: An Introduction with Readings edited by Martha J. Farah","instructor":"Jonathan D. Moreno, Ph.D.","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"No background is required! All are welcome!","links":{}}