{
    "id": 1418,
    "shortName": "thehorsecourse",
    "name": "The Horse Course: Introduction to Basic Care and Management",
    "language": "en",
    "shortDescription": "There are over 100 million horses, donkeys and mules in the world today and owners of these animals can be found on almost every continent and in almost every society.  The Horse Course will cover many unique aspects of equine ownership and touch upon the science behind many of today’s management practices.",
    "aboutTheCourse": "<p>Topics in this course will begin with a basic introduction\nof the evolution of horses and donkeys and how they have made critical\ncontributions to our own history. Together, we will discover the many breeds of\nhorses and learn basic terminology such as coat color and markings up to basic\nhorse anatomy. We will then jump into unique aspects of equine behavior on how these\nanimals learn and how this can affect training. Beginning in Week 4 we will\ndiscuss how to properly care for your animals by learning about current feeding\nmanagement practices up to the basics of equine health and first aid. Finally,\nwe will round out the course with a module discussing current breeding\npractices and discover the unique aspects of equine reproduction. <\/p>\n\n<p>The Horse Course is intended for a wide audience from\nnovices interested in learning more about horses, donkeys and mules up to the\nexperienced owner who is interested in the science behind the many management\ntechniques practiced today. <\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<p>Week 1: Introduction to the history of horses and donkeys<\/p>\n\n<p>Week 2: Basic equine anatomy- coat colors, markings and hoof\ncare<\/p>\n\n<p>Week 3: Equine behavior and training<\/p>\n\n<p>Week 4: Feeding management<\/p>\n\n<p>Week 5: Maintaining equine health- first aid, parasites and\ndisease<\/p>\n\n<p>Week 6: Breeding your horse or donkey<\/p>",
    "estimatedClassWorkload": "5-10 hours\/week",
    "recommendedBackground": "<p>\n\n\n\nThere are no prerequisites for this course. An introductory\nbackground in basic anatomy may be helpful but is not required.<\/p>",
    "links": {

    }
}