{"id":2299,"shortName":"textretrieval","name":"Text Retrieval and Search Engines","language":"en","shortDescription":"Search engines are essential tools for managing and mining big text data. Learn\nhow search engines work, the major search algorithms, and how to optimize search accuracy. ","aboutTheCourse":"<p>Recent years have seen a dramatic growth of natural language text data, including web pages, news articles, scientific literature, emails, enterprise documents, and social media such as blog articles, forum posts, product reviews, and tweets. <strong>Text data are unique<\/strong> in that they are usually generated directly by humans rather than a computer system or sensors, and are thus especially valuable for discovering knowledge about people’s opinions and preferences, in addition to many other kinds of knowledge that we encode in text. <\/p>\n\n<p>This course will cover search engine technologies, which play an important role in any data mining applications involving text data for two reasons. First, while the raw data may be large for any particular problem, it is often a relatively small subset of the data that are relevant, and a search engine is an <strong>essential tool<\/strong> for quickly discovering a small subset of <strong>relevant text data<\/strong> in a large text collection. Second, search engines are needed to help analysts <strong>interpret any patterns discovered<\/strong> in the data by allowing them to examine the relevant original text data to make sense of any discovered pattern. You will learn the basic <strong>concepts, principles, and the major techniques in text retrieval<\/strong>, which is the underlying science of search engines.<\/p>","targetAudience":1,"courseSyllabus":"<p>This course will be covering the following topics:<\/p>\n<ul>\n<li>Introduction to text data mining<\/li>\n<li>Basic concepts in text retrieval<\/li>\n<li>Information retrieval models<\/li>\n<li>Implementation of a search engine<\/li>\n<li>Evaluation of search engines<\/li>\n<li>Advanced search engine technologies<\/li>\n<\/ul>","courseFormat":"<p>The course will have video lectures, accompanied by quizzes and peer graded assignments.<\/p>","suggestedReadings":"","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"Basic knowledge of data structures and proficiency in programming with either C++ or Java is recommended. Basic knowledge of probability and statistics is helpful, but not required.","links":{}}