{
    "id": 2257,
    "shortName": "philculture",
    "name": "Философия культуры (Philosophy of Culture)",
    "language": "ru",
    "shortDescription": "Курс дает представление о предмете философии культуры и ее базовом концептуальном аппарате, а также об истории философских учений о культуре от Античности до современности.\n\nThe course addresses a subject of the philosophy of culture and covers its history from Antiquity to the XXI century, and its basic conceptual framework.",
    "aboutTheCourse": "<p>Курс\nдает представление о предмете философии культуры и ее базовом концептуальном\nаппарате. Задачи курса: раскрыть специфику философии культуры как\nобъяснительной модели; рассмотреть развитие рефлексии о культуре в\nдиахроническом аспекте; научить студентов выявлять в эмпирическом материале\nкультур многоуровневые закономерности и приводить разнородные элементы культур\nк статусу обобщенных конструкций, допускающих теоретическое моделирование. Он\nтакже дает историю философских учений о культуре от античности до\nсовременности. Лекции концентрируются на морфологии различных типов культуры.\nОсобое внимание уделяется западноевропейской культуре Нового времени. Основной\nвопрос курса: «Как возможно теоретическое знание о культуре?».<\/p><p>Предполагается,\nчто в результате студент будет знать основные исторические типы философии\nкультуры, их своеобразие, и логику построения; основные методики философского\nанализа феноменов культуры; основные эпистемологические проблемы и парадоксы,\nсвязанные с опытом построения теории культуры.<\/p>\n\n<p>&nbsp;<\/p>\n\n<p>This course covers a subject area of the philosophy of culture and provides insights into its conceptual framework. The course objectives are: to reveal the distinguishing features of the philosophy of culture as an explanatory model; to consider the formation of philosophic discourse in culture over the period of time; to teach students to discern the layered patterns in the empirical material of cultures and to bring heterogenous cultural components to a common denominator to create the generalization prompting further theoretical modelling. It also provides the students with the general understanding of the historical development of the theory of culture from antiquity to the present days. The course focuses on the morphology of various types of culture. Emphasis is made on the Western European culture of the Modern Times. The underlying theme of the course is: “how is theoretical knowledge of culture possible?”<br><br>As a result, a student will be aware of the core patterns in history of the philosophy of culture, their features, and the logic of their construction; will be able to employ the basic methods of philosophical analysis of cultural phenomena; will become acquainted with the basic epistemological problems and paradoxes associated with the experience of constructing a theory of culture.<br><\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<p><span><strong>Неделя\n1.<\/strong> <i>Объект и предмет философии культуры<\/i>.&nbsp;<\/span><\/p><p>Теория культуры в исторической перспективе. Место теории культуры в системе гуманитарных\nнаук. Её соотношение с философии культуры, культурной\nантропологией, историей цивилизаций. Латентные формы философии культуры. «Культура»&nbsp;и ее основные способы\nсуществования во времени и пространстве. «Культура» и «цивилизация».<\/p>\n\n<p>&nbsp;<\/p>\n\n<p><span><strong>Неделя&nbsp;2.<\/strong>\n<i>Основные проблемы философии культуры.&nbsp;<\/i><\/span><\/p><p>Природа,\nтворчество и культура, их соотношение и взаимообусловленность. Изоморфность\nразнородных артефактов. Нормативная, аксиологическая, мнемоническая и педагогическая функции\nкультуры. Культура как знаковая система. Проблема плюрализма культур.\nХронологическая, локально-региональная и морфологическая типология культур.\nАнтиномии концепта «мировая культура». Культурные конфликты. Диалог культур.<\/p>\n\n<p>&nbsp;<\/p>\n\n<p><span><strong>Неделя\n3.<\/strong> <i>Аспекты изучения культуры<\/i>.&nbsp;<\/span><\/p><p>Морфология\nкультуры. Семиотика культуры. Социология культуры. Прагматика культуры.\nМеханизмы культуры. Социальные функции культуры. Архаические формы культуры.&nbsp; Миф и ритуал. Взаимовлияние и взаимопроникновение\nкультур. «Запад» и «Восток». Морфогенез\nв культуре&nbsp; и его стилевые типы: архаика,\nклассика, модернизм, авангард.&nbsp;<\/p>\n\n<p>&nbsp;<\/p>\n\n<p><span><strong>Неделя\n4.<\/strong> <i>Основные теоретические модели\nкультуры. Часть 1.<\/i><\/span><\/p><p>Стадии\nразвития теории культуры:&nbsp; историзм ХVIII\nвека,\n«диалектика духа»&nbsp;немецкой классической философии,\nромантическая культурфилософия, прогрессизм и детерминизм XIX века, символизм\nрубежа XIX-XX веков, неокантианство,<\/p>\n\n<p>&nbsp;<\/p>\n\n<p><span><strong>Неделя\n5. <\/strong><i>Основные теоретические модели\nкультуры. Часть 2.&nbsp;<\/i><\/span><\/p><p>Культурсоциология Г. Зиммеля. Морфология О. Шпенглера. Теория цивилизаций А. Тойнби. Перспективизм Х. Ортега-и-Гасета. Культурная антропология и этнография. &nbsp;Историческая психология. Психоанализ. Семиотика. Герменевтика. Структурализм и\nпостструктурализм. Русская религиозная культурология. Диалогизм.<\/p>\n\n<p>&nbsp;<\/p>\n\n<p><span><strong>Неделя&nbsp;6.\n<\/strong><i>Тектоника культуры<\/i>.&nbsp;<\/span><\/p><p>Артикуляция\nкультуры: типы и объективированные результаты культурной деятельности. Субъекты\nкультуры: индивидуум, группа, общество, институт, этнос. Культура и личность.\nВитальный, социальный, ментальный уровни культуры. Артефакт и способы его\nсуществования в культуре. Система артефактов как культурная целостность.<\/p><p><br><\/p>\n\n<p><span><strong>Неделя\n7. <\/strong><i>Телеология культуры<\/i>.&nbsp;<\/span><\/p><p>Культура\nкак телеологическая система. Различие каузального и целевого в культуре.\nСпецифика культурной телеологии: «целесообразность без цели». Телеология в\nисторическом времени. Телеология в морфологических структурах. Телеология в\nаксиологическом измерении. Культура как посредник «духовного»и&nbsp; «природного» принципов. Механизмы порождения,\nвосприятия, интерпретации, трансляции и сохранения артефактов.<\/p>\n\n<p>&nbsp;<\/p>\n\n<p><span><strong>Неделя\n8.<\/strong> <i>Теория истории культуры.<\/i><\/span><\/p><p>Циклы и ритмы развития культуры. Понятие&nbsp;\n«осевого времени»&nbsp;. Смена «дневных» и «ночных» эпох в европейской\nкультуре. Первобытная культура. Культура первых цивилизаций. Классическая\nантичная греко-римская культура. Эпоха эллинизма. Раннехристианская культура.\nКультура средиземноморского средневековья: византийская, арабо-исламская,\nзападнохристианская. Основные этапы культуры России. Традиционные культуры мира\nпосле «осевой эпохи». Европейская культура Нового и Новейшего времени. Мировая\nкультура Нового и Новейшего времени.<\/p>",
    "estimatedClassWorkload": "2-3 hours\/week",
    "recommendedBackground": "Для\nусвоения курса достаточно знаний, полученных в общеобразовательной школе.",
    "links": {

    }
}