{"id":589,"shortName":"sleep","name":"Sleep: Neurobiology, Medicine, and Society","language":"en","shortDescription":"Students who have successfully completed this course in-person have described it as a survey class on sleep that is team taught by experts.","aboutTheCourse":"The objective of this course is to give students the most up-to-the-date\ninformation on the biological, personal, and societal relevance of sleep.\nPersonal relevance is emphasized by the fact that the single best predictor\nof daytime performance is the quality of the previous night's sleep. The\nbrain actively generates sleep, and the first third of the course will\noverview the neurobiological basis of sleep cycle control. The course provides\na cellular-level understanding of how sleep deprivation, jet lag, and substances\nsuch as alcohol, caffeine, and nicotine alter sleep and wakefulness. The\nsecond third of the course will cover sleep-dependent changes in physiology\nand sleep disorders medicine. Particular emphasis will be placed on disorders\nof excessive sleepiness, insomnia, and sleep-dependent changes in autonomic\ncontrol. Chronic sleep deprivation impairs immune function and may promote\nobesity. Deaths due to all causes are most frequent between 4:00 and 6:00\nA.M., and the second portion of the class will highlight the relevance\nof sleep for preventive medicine. The societal relevance of sleep will\nbe considered in the final portion of the class. In an increasingly complex\nand technologically oriented society, operator-error by one individual\ncan have a disastrous negative impact on public health and safety. Fatigue-related\nperformance decrements are known to have contributed as causal factors\nto nuclear power plant failures, transportation disasters, and medical\nerrors.","targetAudience":1,"courseSyllabus":"<strong>Section I – Neurobiology<\/strong><br>Unit 01 - Course Overview - Ralph Lydic, Ph.D.<br>Unit 02 - Neurobiology of Sleep and Wakefulness - Helen Baghdoyan, Ph.D.<br>Unit 03 - Mathematical Modeling of Sleep-Wake Regulation - Victoria Booth, Ph.D.<br>Unit 04 - Molecular Biology and Genetics of Sleep - Chiara Cirelli, M.D., Ph.D.<br><br><strong>Section II – Medicine<\/strong><br>Unit 05 - Overview of Sleep Medicine - Ronald Chervin, M.D.<br>Unit 06 - Disordered Sleep and Breathing Alters Cardiovascular Health - Helena Schotland, M.D.<br>Unit 07 - Sleep and Psychiatric Disorders - Eric Nofzinger, M.D.<br>Unit 08 - Insomnia: Causes and Consequences - Christopher Drake, Ph.D.<br>Unit 09 - Treatments for Insomnia - J. Todd Arnedt, Ph.D.<br>Unit 10 - Sleep and Anesthesia - George Mashour, M.D.<br><br><strong>Section III – Society<\/strong><br>Unit 11 - Circadian Rhythms, Sleep, and Health -&nbsp;Theresa Lee, Ph.D.<br>Unit 12 - Daytime Sleepiness and Sleep Need - Thomas Roth, Ph.D.<br><br>","courseFormat":"Video format will include lecturer presentations illustrated by still\nor video images. Each lecture will begin with a list of key learning points.\nThe class content is divided into three sections, which are comprised of a total of twelve units. Units 2-12 conclude with a quiz. The material in the sleep neurobiology section of the\nclass demonstrates that sleep is not a passive process but is actively\ngenerated by the brain. The material emphasizes the excitement of efforts\nin neuroscience to understand the brain regions and neurotransmitters that\nregulate states of sleep and wakefulness and circadian rhythms. The course\nthen builds on the neurobiology section by focusing on sleep disorders\nmedicine. Particular emphasis will be placed on common sleep disorders\nsuch as sleep-disordered breathing, the relationship between sleep and\nmental health, and sleep and learning. The final lectures focus on sleep\nneed, insomnia, the genetics of sleep, and how progress in our understanding\nthat sleep is a fundamental biological need has significant social and\nlegal implications.","suggestedReadings":"Please see Course Syllabus","instructor":"","estimatedClassWorkload":"2-6 hours\/week","recommendedBackground":"The topic of sleep is an ideal vehicle for teaching neuroanatomy, neurochemistry,\npharmacology, physiology, and cognitive neuroscience. Based on more than\n10 years of experience with the traditional classroom setting, students\nwho do well in the course are up to date on basic biology, chemistry, and\nneuroscience.\n<br>","links":{}}