{"id":2300,"shortName":"clusteranalysis","name":"Cluster Analysis in Data Mining","language":"en","shortDescription":"Learn how to take scattered data and organize it into groups for use in many applications, such as market analysis and biomedical data analysis, or as a pre-processing step for many data mining tasks.","aboutTheCourse":"<p>Discover the <strong>basic concepts of cluster analysis<\/strong>, and then study a set of typical clustering methodologies, algorithms, and applications. This includes <strong>partitioning methods<\/strong> such as k-means, <strong>hierarchical methods<\/strong> such as BIRCH, <strong>density-based methods<\/strong> such as DBSCAN\/OPTICS, probabilistic models, and the EM algorithm. Learn clustering and methods for clustering high dimensional data, streaming data, graph data, and networked data. Explore concepts and methods for constraint-based clustering and semi-supervised clustering. Finally, see <strong>examples of cluster analysis in applications<\/strong>.<\/p>","targetAudience":1,"courseSyllabus":"<p>This course will be covering the following topics:<\/p>\n<ul>\n<li>Basic concept and introduction<\/li>\n<li>Partitioning methods<\/li>\n<li>Hierarchical methods<\/li>\n<li>Density-based methods<\/li>\n<li>Probabilistic models and EM algorithm<\/li>\n<li>Spectral clustering<\/li>\n<li>Clustering high dimensional data<\/li>\n<li>Clustering streaming data<\/li>\n<li>Clustering graph data and network data<\/li>\n<li>Constraint-based clustering and semi-supervised clustering<\/li>\n<li>Application examples of cluster analysis<\/li>\n<\/ul>","courseFormat":"<p>The course will have video lectures, accompanied by quizzes and peer graded assignments.<\/p>","suggestedReadings":"","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"<p>For this course you need basic computing proficiency including some programming experience in a typical programming language, such as C++, Java, or Python, and basic knowledge of database concepts, artificial intelligence, and statistics.<\/p>","links":{}}