{"id":1799,"shortName":"introtoelectronics","name":"Introduction to Electronics","language":"en","shortDescription":"This course introduces students to the basic components of electronics: diodes, transistors, and op amps.  It covers the basic operation and some common applications.  ","aboutTheCourse":"This course is a basic overview of electronic components and their common uses. &nbsp;It covers diodes, transistors, and op amps. &nbsp;Laboratory demonstrations are given to reinforce the concepts learned from the lectures and homework. The course is targeted at people with a scientific or technical background who are not electrical or computer engineers. The coverage is not as deep as an electronics course aimed at electrical or computer engineers. There are a number of physical applications demonstrated in this course that serve to motivate this topic to a wider audience.&nbsp;","targetAudience":0,"courseSyllabus":"<div>The course is broken into four modules, several have an associated homework and a quiz:<\/div><div><br><\/div><div>Module 1: Background&nbsp;<\/div><div>Review of linear circuits and frequency response fundamentals<\/div><div><br><\/div><div>Module 2: &nbsp;Op Amps<\/div><div>Ideal Behavior; common resistor circuits; common RC circuits; applications: amplifiers, and filters<\/div><div><br><\/div><div>Module 3: Diodes&nbsp;<\/div><div>pn junctions; Ideal diodes; diodes with a turn-on voltage; circuits with ideal diodes; rectifiers; limiters; regulators<\/div><div><br><\/div><div>Module 4: Transistors&nbsp;<\/div><div>Overview of the physics of MOSFETs; MOSFETS in amplifiers and in digital logic circuits<\/div><div><br><\/div><div>Grading and Certificate: Grading will be based on homework (80%) and four quizzes (20%) based on the four modules. A minimum grade of 70% is needed to earn a certificate of completion.<\/div>","courseFormat":"This class will consist of lecture videos, most of which are between 10 and 12 minutes in length. There will be required homework assignments and quizzes and optional laboratory assignments.","suggestedReadings":"This course is self contained, but there are many online sources that can used for reference. These can be found by searching key words: op amps (or operational amplifiers), diodes, transistors.","estimatedClassWorkload":"5-7 hours\/week","recommendedBackground":"Students taking this course should have a good understanding of basic circuits including resistive circuits, RLC circuits, AC behavior, and frequency analysis. A good preparation for this course is the Georgia Tech Linear Systems Coursera course.","links":{}}