{"id":487,"shortName":"physics1","name":"Physics 1 for Physical Science Majors","language":"en","shortDescription":"This is a 12 week course, currently scheduled to start on Monday, April 14, 2014 and finishing on Friday, July 11.  This introductory physics course is intended for physical science majors and others desiring a rigorous introduction to physics. It closely parallels the brick-and-mortar course given to the freshmen at the University of Colorado at Boulder. The course covers classical mechanics, including kinematics, dynamics, conservation laws, and applications. ","aboutTheCourse":"<p>This course is a rigorous introduction to classical mechanics, which is the study of forces and motion.  How does gravity control the motion of the\nplanets around the sun or the motion of a projectile fired from a cannon?  Why does a spinning skater spin faster when\nshe pulls her arms in?  Why is a\nperpetual motion machine impossible? These are the kinds of questions which can\nbe answered with classical mechanics, which was first formulated by Isaac\nNewton around 1666. Classical, or Newtonian Mechanics is the oldest branch of\nphysics, but it will never go out of style. \nIt remains the foundation of our understanding of the physical world and\nis constantly used by engineers and scientists. There is a space probe, called\nNew Horizons, that is on its way to Pluto right now, and it will arrive on July\n14, 2015, exactly on time and on target, because its path has been computed\nusing classical mechanics, and nothing\nmore.<\/p>","targetAudience":0,"courseSyllabus":"<p><\/p><p>\n\n<\/p><p>Week 1:                1D motion: speed, velocity and acceleration<\/p>\n\n<p>Week 2:               1D motion continued.  \nVector Math.<\/p>\n\n<p>Week 3:               Motion in 2D.<\/p>\n\n<p>Week 4:               Newton’s Laws.<\/p>\n\n<p>Week 5:               Applications of Newton’s Laws.  Friction.<\/p>\n\n<p>Week 6:               Work and Energy.<\/p>\n\n<p>Week 7:               Conservation of Energy. <\/p>\n\n<p>Week 8:               Gravity and orbits.<\/p>\n\n<p>Week 9:               Conservation of Momentum and Collisions.<\/p>\n\n<p>Week 10:             Rotational Motion.<\/p>\n\n<p>Week 11:             Conservation of Angular Momentum.  Static Equilibrium.<\/p>\n\n<p>Week 12:             Simple Harmonic Motion.<\/p>\n\n <p><\/p>","courseFormat":"<p>This 12-week class will consist of assigned readings, plus video\nlectures, 3 times a week, which are video captures of the actual lectures given\nto freshmen engineers  at the University\nof Colorado at Boulder (CU) in the fall semester of 2013.  During each lecture, there are several pauses\nfor in-class “Concept Test” questions.  There\nare weekly homework assignments, 2 midterm exams, and a final exam.   This\nonline course will resemble the actual course at CU as closely as possible,\nwith very similar homeworks and exams.<\/p>","suggestedReadings":"<p>Weekly reading assignments for this course will be from a\nfree, online textbook, that will be posted on this site.<\/p>","instructor":"Michael Dubson","estimatedClassWorkload":"8-12 hours\/week","recommendedBackground":"<p>This course is aimed at freshmen engineering students and\nother physical science majors at the University-level.  Students will need a good command of algebra\nand trigonometry before they start this course, and some acquaintance with\ncalculus.  Calculus is not used much in\nthis course, and we will review that calculus that we do use.  For the student taking this course for credit\nat the University of Colorado, Calculus 1 is the co-requisite for the course;\nthat is, they are required to take calc1 concurrently, if they have not already\ntaken it.  No previous knowledge of\nphysics is assumed, but this course is fast-paced and we cover a lot of\nmaterial, so any previous high-school physics course will be very useful.  <br><\/p>","links":{}}