{"id":408,"shortName":"ticyeducacion","name":"Tecnologías de información y comunicación en la educación","language":"es","previewLink":"https:\/\/class.coursera.org\/ticyeducacion-002\/lecture\/preview","shortDescription":"Analizar diferentes casos de estudio de usos educativos de las TIC y diseña un ambiente de aprendizaje que involucre herramientas digitales y tecnologías basadas en Internet. ","aboutTheCourse":"Las tecnologías de información y comunicación (TIC) han transformado la educación. Ello ocurre no sólo porque éstas han facilitado el desarrollo de algunas tareas que comúnmente realizábamos los profesores, los alumnos y los administradores sino porque también han abierto oportunidades para modificar tanto los ambientes de aprendizaje en los cuales se llevan a cabo los procesos educativos así como los métodos empleados para enseñar y aprender e incluso, cambiar los roles que anteriormente jugaba cada uno de los actores que intervenimos en el proceso educativo.<br><br> A lo largo de este curso analizaremos diferentes ambientes de aprendizaje y el papel que juegan las TIC en cada uno de ellos; reflexionando específicamente acerca de aquellos que podemos desarrollar nosotros mismos dados los contextos personales en los que nos encontramos.<br><br>El curso se imparte en español.<br><br><br><br>","targetAudience":1,"courseSyllabus":"Primera semana: Tendencias\n     y prospectiva de la educación<br><br>Segunda semana: Entornos\n     de aprendizaje apoyados por TIC<span><br><br>Tercera semana: Herramientas\n     y tecnologías para educación<\/span><br><br>Cuarta semana: Habilidades\n     digitales necesarias en la educación<br><br>Quinta semana: Diseño de ambientes de aprendizaje<br>","courseFormat":"El curso promueve fuertemente el trabajo colaborativo entre los participantes.  Si bien se sugerirá la revisión de algunas lecturas y videos semanalmente para introducir el trabajo alrededor de cada tema, se presentarán preguntas detonadoras que inviten a la investigación y reflexión personal y la discusión grupal.<br>","suggestedReadings":"<p>Chan Núñez, María Elena, “Entornos de aprendizaje digitales” <u><a href=\"http:\/\/www.revista.unam.mx\/vol.5\/num10\/art68\/int68.htm\" title=\"Link: http:\/\/www.revista.unam.mx\/vol.5\/num10\/art68\/int68.htm\">http:\/\/www.revista.unam.mx\/vol.5\/num10\/art68\/int68.htm<\/a><\/u><\/p><p>Salinas, Jesús. “Nuevos ambientes de\n aprendizaje para una sociedad de la información”. Universidad de \nAlicante. Instituto Universitario del Posgrado.<\/p>\n<p><u><a href=\"http:\/\/www.portaleducativo.hn\/pdf..\/nuevos_ambientes.pdf\" title=\"Link: http:\/\/www.portaleducativo.hn\/pdf..\/nuevos_ambientes.pdf\">http:\/\/www.portaleducativo.hn\/pdf..\/nuevos_ambientes.pdf<\/a><\/u><\/p>\n<p>Santamaría Fernando “Ecologías del aprendizaje” <u><a href=\"http:\/\/fernandosantamaria.com\/blog\/tag\/ecologia-del-aprendizaje\/\" title=\"Link: http:\/\/fernandosantamaria.com\/blog\/tag\/ecologia-del-aprendizaje\/\">http:\/\/fernandosantamaria.com\/blog\/tag\/ecologia-del-aprendizaje\/<\/a><\/u><br><\/p>","instructor":"Larisa Enríquez","estimatedClassWorkload":"6-8 hours\/week","recommendedBackground":"Si bien el curso lo puede tomar cualquier persona, es recomendable que los participantes sean profesores o futuros profesores, de cualquier nivel educativo.<br>","links":{}}