{
    "id": 2802,
    "shortName": "os",
    "name": "操作系统原理（Operating Systems）",
    "language": "zh-cn",
    "shortDescription": "《操作系统原理》是针对计算机科学技术专业三年级本科生开设的一门专业基础课程。本课程着重学生系统观的培养，通过重点讲述操作系统的内部结构、工作原理及典型技术的实现，使学生建立起对操作系统的整体及各个功能模块的认识，从而系统掌握计算机的专业知识，进一步提升学生的软件开发能力乃至系统软件开发能力。",
    "aboutTheCourse": "<p>任何计算机都必须在加载相应的操作系统之后，才能构成一个可以运转的、完整的计算机系统。操作系统的功能是否强大，决定了计算机系统的综合能力；操作系统的性能高低，决定了整个计算机系统的性能；操作系统本身的安全可靠程度，决定了整个计算机系统的安全性和可靠性。操作系统是软件技术的核心和基础运行平台。因此，计算机科学技术专业的学生需要学习和掌握操作系统的基本原理和专业知识。<\/p>\n\n<p>本课程的教学目标是：<\/p>\n\n<p>1．掌握操作系统的基本概念、功能组成、系统结构及运行环境；<\/p>\n\n<p>2．熟悉并运用操作系统工作原理、设计方法和实现技术，理解有代表性、典型的操作系统实例（如UNIX、Linux和Windows）；<\/p>\n\n3．了解操作系统的演化过程、发展研究动向、新技术以及新思想，为后续相关课程的学习打下良好基础，为后续职业发展奠定基石。<br>",
    "targetAudience": 1,
    "courseSyllabus": "<p>本课程共12周。<\/p><p><strong>第1周 操作系统概述 <\/strong><\/p><strong>\n\n<\/strong><p>主要内容：举例介绍操作系统所做的工作；操作系统的定义与特征；操作系统分类；操作系统发展中的典型技术；典型操作系统的结构。<\/p><p><strong>&nbsp;第2周 操作系统运行环境<\/strong><\/p><strong>\n\n<\/strong><p>&nbsp;主要内容：特权指令\/非特权指令、CPU状态；中断系统的作用；中断硬件工作原理；中断处理程序流程；中断处理程序举例；中断系统举例；系统调用基本概念；系统调用实现机制；系统调用实现实例。<\/p>\n\n<p><strong>第3周 进程线程模型<\/strong><\/p><p>主要内容：进程基本概念；进程状态及状态转换；进程控制块的作用和内容；进程控制操作；进程地址空间与进程映像；为什么引入线程？线程的应用场景；Web服务器的实现；线程概念、线程与进程的区别；线程实现的三种方式；Pthreads线程库及应用；几个重要的概念：原语、可再入程序。<\/p>\n\n<p><strong>第4周 处理器调度<\/strong><\/p><strong>\n\n<\/strong><p>主要内容：调度层次与调度类型；调度时机与进程切换；调度算法设计原则；调度算法设计时考虑的各种因素；基本调度算法；多级队列反馈调度算法；调度算法应用；Linux调度算法的演化；<span>\nWindows<\/span>调度算法简介。<\/p>\n\n<p><strong>第5、6周 同步机制<\/strong><\/p><strong>\n\n<\/strong><p>主要内容：进程\/线程的并发执行；竞争条件的引入；进程互斥与进程同步的概念；进程互斥的软件解法；Peterson算法；进程互斥的硬件解法；睡眠与唤醒机制；信号量及PV操作；用信号量解决互斥问题举例；用信号量解决生产者消费者问题；用信号量解决读者写者问题；信号量的问题及管程的引入；管程的基本概念；Hoare管程；管程应用举例；Mesa管程；JAVA管程解决生产者消费者问题。<\/p>\n\n<p><strong>第7、8周 存储模型<\/strong><\/p><strong>\n\n<\/strong><p>主要内容：基本概念介绍；物理内存管理方案之可变分区管理方案；物理内存管理方案之页式管理方案；虚拟存储管理基本思想；页表设计；地址转换过程；TLB引入；缺页异常处理；页面置换算法及应用；工作集模型；清除策略与页缓冲技术。<\/p>\n\n<p><strong>第9、10周 文件系统<\/strong><\/p><strong>\n\n<\/strong><p>主要内容：文件系统的功能；文件分类；文件的逻辑结构和物理结构；文件控制块的内容和作用；文件目录与目录文件；文件系统的布局；文件的基本操作；文件系统的内存结构；磁盘空间管理；FAT16\/32文件系统；UNIX文件系统；文件共享与保护机制；文件系统一致性；文件系统性能。<\/p>\n\n<p><strong>第11周<\/strong><strong> I\/O<\/strong><strong>系统<\/strong><\/p><p>主要内容：设备管理的目标和任务；I\/O设备分类；I\/O设备组成；I\/O端口地址；I\/O控制方式；I\/O软件层次；设备分配算法；设备驱动程序；缓冲技术；I\/O性能问题。<\/p>\n\n<p><strong>第12周 死锁<\/strong><\/p><strong>\n\n<\/strong><p>主要内容：死锁的基本概念；产生死锁的原因；死锁举例；用资源分配图讨论死锁问题；死锁预防方法；死锁避免方法；银行家算法；银行家算法的应用；死锁检测方法；死锁解除方法；哲学家就餐问题。<\/p>\n\n<br>",
    "estimatedClassWorkload": "2-4 hours\/week",
    "recommendedBackground": "学习本课程之前，需要具备高级语言程序设计、数据结构、计算机组成原理的基础知识。<br>",
    "links": {

    }
}