{"id":278,"shortName":"socialpsychology","name":"Social Psychology","language":"en","shortDescription":"Ever wonder why people do what they do? This course offers some answers based on the latest research from social psychology.","aboutTheCourse":"<p>Coursera's largest class is back by popular demand!<\/p><p>Scheduled to begin July 14, 2014, Social Psychology will feature a fresh line-up of special events,\nguest experts, and material intended to delight psychology lovers around the world.&nbsp;<\/p>\n\n<p><b>Course Description from\nProfessor Plous:<\/b><\/p>\n\n<p>Each of us is dealt a different hand in life, but we all face similar\nquestions when it comes to human behavior:&nbsp;What leads us to like one\nperson and dislike another? How do conflicts and prejudices develop, and\nhow can they be reduced? Can psychological research help protect the environment,\nand if so, how? This course offers an introduction to classic and contemporary\nsocial psychology, covering topics such as decision making, persuasion,\ngroup behavior, personal attraction, and factors that promote health and\nwell-being.<\/p><p>Our focus will be on surprising, entertaining, and intriguing research\nfindings that are easy to apply in daily life. As part of this focus, several\nhomework assignments will encourage you to experiment with your life, observe\nthe results, and analyze what took place. The course will also draw from\nthe web sites of <a href=\"http:\/\/www.socialpsychology.org\/\">Social Psychology Network<\/a>,\nthe world's largest online community devoted to social psychology. I hope\nyou'll join me for this course, have fun, and learn some useful information\nthat enriches your life! &nbsp; &nbsp;<\/p>","targetAudience":0,"courseSyllabus":"","courseFormat":"The class will consist of lecture videos, most of&nbsp;which are 10-20 minutes long. There will also be homework assignments and a final exam\ncovering the lectures and course readings.<br><br><b>NEW IN 2014:<\/b> To help students who have a busy\nschedule or don't speak English as their first language, the course will\ninclude a one-week break in the middle (August 4-10) so that anyone who has\nfallen behind can catch up on missed videos or readings.&nbsp; &nbsp;&nbsp;<br>","suggestedReadings":"<div>The course&nbsp;readings will include chapters drawn from two outstanding texts:\n    <p><\/p>\n    <ul>\n        <li>Myers, David G. (2012). <i>Social Psychology<\/i> (11th ed.). New York: McGraw-Hill.<\/li>\n    <\/ul>\n<\/div>\n<ul>\n    <li>Myers, David G. (2012). <i>Exploring Social Psychology<\/i> (6th ed.). New York: McGraw-Hill.<\/li>\n<\/ul>\n<div>(<b>Note:<\/b> By special arrangement with McGraw-Hill, these chapters are being made available to&nbsp;Coursera students at no cost. Students interested in learning more about social psychology may wish to buy one of these books.)\n    <br>\n    <br>\n    <div>In addition, students will be invited to read a few non-technical journal articles that are being provided at no cost by the American Psychological Association and the Association for Psychological Science. Here are two examples:\n        <p><\/p>\n        <ul>\n            <li>Burger, J. M. (2009). Replicating Milgram: Would people still obey today?&nbsp;<i>American Psychologist, 64,<\/i>&nbsp;1-11.<\/li>\n        <\/ul>\n        <ul>\n            <li>Cialdini, R. B. (2003). Crafting normative messages to protect the environment. <i>Current Directions in Psychological Science, 12,<\/i> 105-109.<\/li>\n        <\/ul>\n    <\/div>\n<\/div>","instructor":"Scott Plous","estimatedClassWorkload":"4-8 hours\/week","recommendedBackground":"No background is required; all are welcome!","links":{}}