{"id":214,"shortName":"stschina1","name":"Science, Technology, and Society in China I: Basic Concepts","language":"en","shortDescription":"What are science, technology, and innovation? How do science, technology, and innovation inform our understanding of developments in the social sphere? How have these domains evolved in the Chinese context? In this course, we will examine these issues and attempt answering these and many other questions!","aboutTheCourse":"Science and technology continue to play an increasingly central role in\nour lives, not least in countries such as China that are undergoing rapid\ntechnological, economic and social change.&nbsp;This course is the first\nof a trilogy of short courses on science, technology, and society in China.\nHere, we explore in general terms how engineering as well as scientific\nknowledge and practice are influenced by dynamic interactions between science,\ntechnology, innovation, and society.&nbsp;The course will introduce the\ninnovation systems approach, laying the groundwork for mastering the remaining\ntwo parts of the course by introducing broad concepts and ideas to provide\nstudents with a platform on which to think about the science\/technology–society\nrelationship and related policy issues with a focus on China.&nbsp;This\nunderstanding will then be applied more specifically to China in the next\ntwo courses in the series. <b><u><a href=\"https:\/\/www.coursera.org\/course\/stschina2\">Part II<\/a><\/u><\/b> will examine the impact of the Industrial\nRevolution in the West on scientific and technological progress in China.\n<b><u><a href=\"https:\/\/www.coursera.org\/course\/stschina3\">Part III<\/a><\/u><\/b> will examine science and technology in Chinese society today and\nthe basis for the policy prescriptions the Chinese government is currently\nemploying to promote innovation and technology development.\n<br>\n<br>\n<br>","targetAudience":0,"courseSyllabus":"<div>Week 1: Definitional Issues<\/div><div>Week 2: Impact of Modern Science and Technology (S&amp;T) in China<\/div><div>Week 3: Systems of Innovation and Innovation Policy<\/div>","courseFormat":"The class will consist primarily of lecture videos, which will be enriched with comprehension quizzes and discussions. There will also be short standalone written assignments that are independent of the video lectures.","suggestedReadings":"","instructor":"Naubahar Sharif","estimatedClassWorkload":"3-5 hours\/week","recommendedBackground":"No prior specialized background knowledge is required. All it takes is an enthusiasm for learning and at least a passing interest in science, technology, and\/or China.","links":{}}