{
    "id": 791,
    "shortName": "statreasoning",
    "name": "Statistical Reasoning for Public Health 1: Estimation, Inference, & Interpretation",
    "language": "en",
    "shortDescription": "A conceptual and interpretive public health approach to some of the most commonly used methods from basic statistics. ",
    "aboutTheCourse": "<p>In this data centric era, statistics has become an\nessential tool for processing information from the realm of public health and\nmedical research.&nbsp; Understanding\nboth the implications and limitations of the results from such research is essential for making informed treatment decisions, public health practice\nprotocols and policy recommendations.&nbsp;\nIn this class, a conceptual and interpretive approach is applied to some\nof the most used methods from basic statistics.&nbsp; The course will detail appropriate summary measures for\nquantifying the health of single populations, and comparing such outcomes\nbetween populations using results from representative but imperfect data\nsamples.&nbsp; Additionally, the role of\nuncertainty in sample based estimated will be covered, allowing for conclusions\nto be drawn regarding the larger populations under study while recognizing the\nimperfection in the study estimates.&nbsp;\nAll topics will be considered through a “conceptual lens” allowing\nstudents to focus on the “what”, “why”, and “so what” with regards to the\nimplications of research results.<\/p>\n<br>\nDeveloped in collaboration with <a href=http:\/\/www.jhsph.edu\/offices-and-services\/center-for-teaching-and-learning\/our-services\/open-education-lab\/index.html>Johns Hopkins Open Education Lab<\/a>.",
    "targetAudience": 1,
    "courseSyllabus": "<p><\/p><ul><li>study designs for comparing\npopulations<br><\/li><li>single sample numerical summary\nmeasures for continuous, binary and time-to-event outcomes<br><\/li><li>visual displays for continuous and\ntime-to-event outcomes<br><\/li><li>the normal (Gaussian) distribution<br><\/li><li>measures of association: mean\ndifferences, risk differences, relative risks, odds ratios and incidence rate\nratios<br><\/li><li>confidence intervals for means,\nmean differences, proportions, relative risks, odds ratios, incidence rates and\nincidence rate ratios<br><\/li><li>hypothesis testing: paired and\ntwo-sample t-tests, the chi-square test, Fisher's exact test, and the log-rank\ntest<br><\/li><li>power and sample size&nbsp; (optional)<br><\/li><\/ul><p><\/p>",
    "estimatedClassWorkload": "7-9 hours\/week",
    "recommendedBackground": "",
    "links": {

    }
}