{
    "id": 537,
    "shortName": "gtcomp",
    "name": "First-Year Composition 2.0",
    "language": "en",
    "shortDescription": "First-Year Composition 2.0 will help you to develop a better process and gain confidence in written, visual, and oral communication and to create and critique college-level documents and presentations.",
    "aboutTheCourse": "First-Year Composition 2.0 will help you to develop a better process and\ngain confidence in written, visual, and oral communication and to create\nand critique documents and presentations in college, in the workplace,\nand in your community. You will draft and revise the following assignments:\na personal essay, an image, and an oral presentation.\n<br>\n<br>You will develop confidence in the following areas:\n<br>\n<ul>\n    <li>Critical Thinking: Evaluate the effectiveness of personal essays, images,\n        and oral presentations. Assess your work and the work of your peers. Reflect\n        on your own processes and performance.\n        <br>\n    <\/li>\n    <li>Rhetoric: Analyze the ways in which you and other communicators use persuasion.\n        Think about and use context, audience, purpose, argument, genre, organization,\n        design, visuals, and conventions.\n        <br>\n    <\/li>\n    <li>Process: Apply processes (read, invent, plan, draft, design, rehearse,\n        revise, publish, present, and critique).\n        <br>\n    <\/li>\n    <li>Digital Media: Produce written, oral, and visual artifacts.\n        <br>\n    <\/li>\n<\/ul>",
    "targetAudience": 0,
    "courseSyllabus": "<b>Course Outline<\/b>\n\n<br>Week One:&nbsp;Establishing Concepts, Practices, and Learning Goals\n<br>Assignments: Self- Assessment Surveys &amp;&nbsp;Personal Benchmark Statement<br>\n<br>Weeks Two &amp; Three:&nbsp;Written Communication\n<div>Major Assignment – Personal Philosophy Essay<\/div>\n<br>Weeks Four &amp; Five: Visual Communication&nbsp;<br>Major Assignment –&nbsp;Personal Philosophy Visual&nbsp;<br>&nbsp;\n<br>Weeks Six &amp; Seven: &nbsp;Oral&nbsp;<br>Major Assignment –&nbsp;Personal Philosophy Recorded Presentation&nbsp;<br>\n<br>Week Eight:&nbsp;Reflection&nbsp;\n<br>Assignment – Re-visit the Self-Assessment Surveys and Personal Benchmark Statement",
    "estimatedClassWorkload": "5-7 hours\/week",
    "recommendedBackground": "Fluent English language literacy as well as grammatical and mechanical\nknowledge is required. You will need familiarity with a basic word-processing\nprogram (for example, Word, OpenOffice, Google Docs, Pages), basic image\nsoftware (for example, PowerPoint, iPhoto, Photoshop, Picasa) or cameras\n(for example, smartphones, digital cameras), and basic audio recording\nsoftware (for example, Audacity, GarageBand).",
    "links": {

    }
}