{
    "id": 1332,
    "shortName": "shaping1landscape",
    "name": "Shaping the Way We Teach English, 1: The Landscape of English Language Teaching",
    "language": "en",
    "shortDescription": "Learn effective approaches to English language teaching. This is the first of two teacher training courses based on the internationally-recognized Shaping the Way We Teach English videos and resources and sponsored by the U.S. Department of State and the University of Oregon. You can begin with either course.",
    "aboutTheCourse": "<p><\/p>This course is aimed at English as a Foreign Language (EFL) teachers, both those who are intending to pursue this field as a career and those already working in the field who would like to revise and refresh their methods and approaches. The materials\nand approaches presented should complement college courses such as Introduction to TEFL\/TESOL Methods.\n<p><\/p>\n<p>This five-week course explores important aspects of teaching English as a second or foreign language. The goal of this course is to help you become a better teacher. By the end of this course, you should be able to explain how the various materials and\n    approaches presented will lead to better language learning; you will be able to choose appropriate materials and apply varied classroom activities to improve your students’ study of English. You will also be able to better evaluate both your own\n    and other teachers’ practices.<\/p><p>This is the first of the two-part Shaping the Way We Teach English series. The second part is <a target=\"_blank\" href=\"https:\/\/www.coursera.org\/course\/shaping2paths\">Paths to Success in English Language Teaching<\/a>. You can begin with either course.<\/p>\n<p>\n    <br>\n<\/p><br>",
    "targetAudience": 1,
    "courseSyllabus": "<p>Topics for The Landscape of English Language Teaching include:<\/p><ul><li><p>Week 1: Authentic materials and realia that really motivate learners; project overview, introductions; initial course survey <\/p><\/li><li><p>Week 2: Using pair and group work for collaborative learning to make your class more communicative; Phase 1 lesson plan is due<\/p><\/li><li><p>Week 3: Critical and creative thinking to drive learning; Phase 1 peer and self-evaluations are due<\/p><\/li><li><p>Week 4: Learner feedback and assessment; using formative feedback to evaluate student progress; Phase 2 lesson plan is due<\/p><\/li><li><p>Week 5: Language in context; using content to structure language learning; Phase 2 peer and self-assessments are due; course evaluation<br><\/p><\/li><\/ul><br>",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": "Previous or current language teaching experience is desirable, but not necessary to take this course.<br>",
    "links": {

    }
}