{"id":1164,"shortName":"ltto","name":"Learning to Teach Online","language":"en","shortDescription":"Based upon the award winning* educational resources of same name developed by Simon McIntyre and Karin Watson, the Learning to Teach Online (LTTO) MOOC is designed to help existing educators establish or improve their own online or blended teaching practices. The target audience is primarily teachers in higher education, K-12, community college, and vocational or private education.","aboutTheCourse":"Are you an educator? Have you ever wanted to understand more about how \nto design your course to make better use of educational technology – \nwhether fully online or in blended contexts? Would you like to learn \nfrom those who have extensive practical experience with online \ntechnologies? This course is designed to help you develop a working \nunderstanding of successful online teaching strategies that you can \napply in your own practice. <br><br>Integrating online technologies into\n your teaching can be a challenging prospect, and it can be difficult to\n know how to approach it effectively for the benefit of both students \nand yourself. No one knows your own content and teaching strengths \nbetter than you, and the “one size fits all” formula doesn’t always suit\n everyone. No matter what type of technology you are interested in \nexploring or your level of experience, this course will help you draw on\n your teaching strengths and find the approach that is right for you, \nyour students and your educational context. To allow both for breadth in\n personalization and depth in key areas that interest you, this course \nwill guide you through your journey of understanding how online \ntechnologies can enhance your course design. <br><br>Watch interviews with the Course Instructors <a href=\"https:\/\/www.youtube.com\/watch?v=SIgK2cHwD_g\" target=\"_blank\">Simon McIntyre <\/a>and <a href=\"https:\/\/www.youtube.com\/watch?v=zUthQPpJ3wc\" target=\"_blank\">Negin Mirriahi<\/a> discussing the motivations behind the course.<br><p><br><\/p><p><b>Announcement for US based teachers:<\/b><\/p><p>Coursera and its partners are proud to offer eligible teachers in the United States free Verified Certificates for this course and other high-quality teacher professional development courses, through the <a href=\"http:\/\/blog.coursera.org\/post\/103050170952\/president-obama-supports-free-two-year-coursera\" target=\"_blank\">ConnectED effort announced by President Obama<\/a>.<\/p>\n<p>To participate in this opportunity, U.S. district leaders should approve Coursera MOOCs as teacher professional development by completing a brief form at:&nbsp;<a href=\"http:\/\/blog.coursera.org\/post\/103050170952\/president-obama-supports-free-two-year-coursera\">www.coursera.org\/tpd<\/a>.&nbsp;U.S. teachers who are interested in this opportunity are also encouraged to follow the link to learn more and&nbsp;<a href=\"https:\/\/docs.google.com\/forms\/d\/1t7G3eSUuWvX3arzktgyuzHhMR188D0YnVT-T_aT2pgQ\/viewform\">complete the form.<\/a><br>\n<br>\nOnce a district’s form has been verified, the district leader will be notified and teachers in the district will receive access to free verified certificates for Coursera professional development. Coursera and UNSW thank educators for the hard work they do every day and hope this opportunity will assist US teachers to continue developing their craft in a meaningful and flexible way.<\/p><p><br><\/p>","targetAudience":3,"courseSyllabus":"The course runs for <strong>6 weeks<\/strong>. However, those wishing to \nachieve a pass grade can complete the course as quickly as they wish, \nwhile those wishing to achieve a distinction grade must complete two \noptional peer reviewed assessments over the duration of the course.<br>The\n course consists of 8 modules that can be completed in any order - \nparticipants can choose which ones they engage in based on their \ninterest and experience:<br><br><strong>Module 1 What is online teaching and why is it important? <\/strong>An overview of online ethnographies and technologies and their place in contemporary education.<br><br><strong>Module 2&nbsp;Open and closed technologies:<\/strong>\n An examination of the pros and cons of the use of open web 2.0 tools \nvs. institutionally supported systems in educational contexts, and an \nexamination of relevant activities.<br><br><strong>Module 3 Planning online learning: <\/strong>Understand\n how to define your learning outcomes, develop appropriate online \nactivities and assessment strategies, and to choose the right technology\n to use. These themes are continually revisited throughout the remainder\n of the course.<br><br><strong>Module 4 Online learning activities: <\/strong>Types\n of online activities and teaching scenarios. An overview and \nexemplification of a range of fully online, blended and mobile learning \nscenarios, online resources and activities. Issues concerning \naccessibility and inclusivity are also explored.<br><br><strong>Module 5&nbsp;Online assessment strategies: <\/strong>An\n explanation of aligning assessment with learning outcomes and designing\n assessments for learning. Considerations of using technology to enhance\n assessments – benefits to the instructor and the students are \ndiscussed. Design and purpose of standards-based assessment and rubrics,\n and issues concerning assessment feedback and practical affordances \nprovided by technologies are also explored.<br><br><strong>Module 6 Online resources: <\/strong>What\n role can online resources play in effectively supporting student \nlearning? Understand how to find and use a range of Open Educational \nResources (OER) in your class, and explore options for creating and your\n own online resources. Issues of Creative Commons and Copyright in \nonline education are also discussed.<br><br><strong>Module 7 Engaging and motivating students: <\/strong>How\n to manage your time online as an instructor. Best practices are \ndiscussed and identified for building an online community of learners. <br><br><strong>Module 8 Evaluation strategies:<\/strong>\n What are some evaluation methods for determining whether your course \ndesign change has been effective? How can learning analytics from the \nuse of online technologies help you identify that your course design is \nhelping meet your intended aims and outcomes? Suggestions are offered \nfor ways of gaining feedback from students to inform your continued \nteaching practice and pedagogical decisions.","courseFormat":"This MOOC is designed to provide a flexible, reflective and personal \nlearning experience - enabling you to tailor your learning based upon \nyour own goals, requirements&nbsp;and level of commitment. Each module \nincludes a set of video case studies exploring a range of key concepts \nrelated to course design and teaching with online technologies. You may \nalso engage in discussions with your peers, and participate in formative\n activities that will help you develop your understanding of&nbsp;the \nconcepts discussed. <br><br>You can choose to obtain a pass, or a pass \nwith distinction grade in this course. Alternatively, you may not wish \nto obtain a grade at all – you can still benefit by browsing the content\n and engaging with peers.<br><br>If you wish to obtain a <strong>pass grade<\/strong>,\n you can expect to build an understanding of contemporary issues \nsurrounding the use of technology in teaching and course design by \nundertaking a series of online activities. If you wish to obtain a <strong>pass with distinction grade<\/strong>,\n you will also be expected to undertake two peer reviewed assessment \ntasks that give&nbsp;you the opportunity to progressively apply what you \nlearn to the development of your own online teaching practice or course \ndesign. No matter what your intent in undertaking the course, you can \nengage with as much content as you like and access a range of additional\n resources, assessments,&nbsp;and scholarly readings to have a deeper \nlearning experience.","suggestedReadings":"Readings and videos will be supplied as part of the course material. You will also receive personal resource recommendations if you choose to engage in the class activities.","estimatedClassWorkload":"3-6 hours\/week","recommendedBackground":"There is no requirement for participants to possess prior knowledge or \nexperience of online teaching practices or related technologies. This \ncourse is relevant for those:<br><ul><li>New to online or blended teaching or those wishing to improve their current practice<br><\/li><li>Interested in educational technology and\/or online instruction<br><\/li><li>Involved in higher education, K-12, elementary, community college, vocational or corporate training<br><\/li><li>Who wish to continue their professional development and increase their relevance and value to the contemporary workplace<br><\/li><li>Who are learning and teaching professionals (education developers, instructional designers, etc.)&nbsp;<\/li><\/ul>","links":{}}