{"id":1151,"shortName":"macroec","name":"Макроэкономика (Macroeconomics)","language":"ru","shortDescription":"Курс посвящен изучению макроэкономических вопросов, таких как долгосрочный рост, циклические колебания экономики и стабилизационная политика государства.\n\nThe course covers major macroeconomic issues, such as long-run growth, cyclical fluctuations of the economy, and stabilization policy. ","aboutTheCourse":"<p>Данный курс\nпокрывает на базовом уровне все основные темы макроэкономики. Примерно две\nтрети курса посвящены анализу общего равновесия на рынках труда, заемных\nсредств, финансовых, денежных, товарных рынках, а также международных потоков\nкапитала. Изучается долгосрочный экономический рост, идущий за счет накопления\nкапитальных мощностей и технического прогресса.&nbsp;\nВторая часть курса посвящена изучению природы краткосрочных колебаний\nвокруг долгосрочной траектории роста, таким как финансовый кризис и мировая\nрецессия 2008-2009 годов. Обсуждаются причины подобных спадов, а также\nоптимальная стабилизационная политика государства, призванная либо\nпредотвращать подобные катаклизмы, либо сглаживать последствия от них.<\/p><p><br><\/p><p>This course provides a basic introduction to the major macroeconomic issues. The first and somewhat bigger part of the course is dedicated to the description of the general equilibrium in the economy, including the labor market, market for loanable funds, financial market, money market, and the goods market, as well as international capital flows. This part also covers long-term growth, associated with accumulation of capital and technological progress. The second part of the course is dedicated to the analysis of the short-term fluctuations around the long-term growth trend, such as the world financial crisis and the global recession of 2008-2009. We will discuss causes of such recessions, and the optimal stabilization policy called to prevent and mitigate the consequences of such economic catastrophes.<\/p>","targetAudience":1,"courseSyllabus":"<p>Неделя 1: Введение в макроэкономику, история\nмакроэкономической мысли.<\/p>\n\n<p>Неделя 2: Система национальных счетов: ВВП,\nбезработица, инфляция.<\/p>\n\n<p>Неделя 3: Равновесие на рынке труда и рынке\nзаемных средств. Общее равновесие.<\/p>\n\n<p>Неделя 4: Экономический рост.<\/p>\n\n<p>Неделя 5: Международная макроэкономика:\nторговля, потоки капитала, обменные курсы.<\/p>\n\n<p>Неделя 6: Финансовые рынки.<\/p>\n\n<p>Неделя 7: Денежный рынок и инфляция.<\/p>\n\n<p>Неделя 8: Отклонения от равновесия и\nэкономический цикл.<\/p>\n\n<p>Неделя 9: Стабилизационная политика: денежная и\nбюджетная.<\/p>Неделя 10: Макроэкономическая политика в развивающихся странах и\nвалютные кризисы.","courseFormat":"Курс\nсостоит из 10 занятий, в рамках которых Вы просмотрите видеолекции ( по каждой из тем общая длительность видеолекций - 120 минут). В течение курса будут даны несколько\nзаданий для самоподготовки, а в конце курса – обязательный экзамен. ","suggestedReadings":"Рекомендуемая к ознакомлению литература:<br>Абель\nА., Бернанке Б. «Макроэкономика», Питер, 2008 г.<br>","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"Желательно иметь базовые знания по микроэкономике.","links":{}}