{
    "id": 23,
    "shortName": "soc101",
    "name": "Introduction to Sociology",
    "language": "en",
    "shortDescription": "In this class we will cover the essentials of sociology, to help you better understand your own life and situations far from your experience.",
    "aboutTheCourse": "We live in a world that is changing very quickly. Sociology gives us the tools to understand our own lives and those quite remote from us. The premise of this class is that in order to benefit from the sociological perspective, we need to learn how to ask certain basic questions. We need to know how to seek answers through methods that strive to be systematic and generalizable.We will begin with some of the essential questions: How are the things that we take to be natural socially constructed? How do we live today? How determined is social life? Does the individual make a difference? How is social order possible? Then we will ask what techniques are available to make sense of these questions.  We will review comparative, historical, demographic, experimental, and ethnographic methods. Along the way, we will study core concepts including ethnocentrism, social networks, community, unanticipated consequences, social capital, race, class, and gender. <br><br> We will strive to understand how interaction in micro-level contexts affects larger social processes and how such macro-level processes influence our day to day lives. We will learn to conceive of inequality by asking how race, class, and gender work in tandem. We will address one of the crises of recent sociology -- whether we can actually isolate the effects of social context. We will think about how social science is changing at a time when we are literally swimming in oceans of data generated by the internet.",
    "targetAudience": 0,
    "courseSyllabus": "<div><strong>Week 1:<\/strong> The Sociological Imagination<\/div>\n<div><strong>Week 2:<\/strong> Three Sociological Questions<\/div>\n<div><strong>Week 3:<\/strong> Methods of Sociological Research<\/div>\n<div><strong>Week 4:<\/strong> Us and Them<\/div>\n<div><strong>Week 5:<\/strong> Isolation, Groups, and Networks<\/div>\n<div><strong>Week 6:<\/strong> Cities<\/div>\n<div><strong>Week 7:<\/strong> Social Interaction and Everyday Life<\/div>",
    "estimatedClassWorkload": "5-7 hours\/week",
    "recommendedBackground": "None; all are welcome.",
    "links": {}
}