{"id":2823,"shortName":"hacommunication","name":"Humanitarian communication : Addressing key challenges","language":"en","shortDescription":"Learn how to address the main challenges of communication in humanitarian settings and how to implement a communication plan in the midst of humanitarian action.","aboutTheCourse":"<p>Communication in humanitarian settings is central to all\nactivities before, during and when closing a humanitarian programme as it is\nthe main medium of interaction between the different actors: the population\naffected, the humanitarian actors and local stakeholders. It is essential to\nimplementing programmes efficiently. <\/p>\n\n<p>Although communication is a daily practice, professional\ncommunication requires specific competencies, particularly for people working\nin humanitarian contexts. Taking part in the humanitarian response means to be\nable to adapt one’s communication to a specific context and to adopt\nappropriate behaviours with the ultimate aim to benefit of the affected population.<\/p>\n\n<p>This introductory course focuses on the main challenges\nlinked to communication in humanitarian settings and the main means to address\nthose challenges. It allows participants\nto understand the objectives and issues of communication in humanitarian settings,\nto learn about best practices and provides them with tips and tools to\nimplement adapted communication strategies in the field.<\/p>\n\n<p>This course is coordinated by Prof Doris Schopper, professor\nat the medical faculty of the University of Geneva and director of <a href=\"http:\/\/www.cerahgeneve.ch\/\" target=\"_blank\">CERAH<\/a> since\nJuly 2011.<\/p>","targetAudience":0,"courseSyllabus":"<p>Week 1 (May 18): Introduction to communication in\nhumanitarian settings<\/p>\n\n<p>Week 2 (May 25): Understanding the components of\ncommunication in humanitarian settings<\/p>\n\n<p>Week 3 (June 1st): Understanding the main challenges of\ncommunication in humanitarian settings <\/p>\n\n<p>Week 4 (June 8): Understanding the communication project\ncycle in humanitarian settings (Part1)<\/p>\n\n<p>Week 5 (June 15): Understanding the communication project\ncycle in humanitarian settings (Part 2)<\/p>","courseFormat":"<p>The programme consists of a set of courses over a period of\n5 weeks. Courses are based on a series of lecture videos, which are between 5\nand 15 minutes in length and other multimedia material. Optional questions will\nbe shared on the forum. Standalone homework (not optional) is integrated at the\nend of the first three weeks via quiz questions and during week 4 and 5 through\na case study. Homework serves to recap and strengthen your learning process.&nbsp;<\/p>","suggestedReadings":"<p>Articles and online resources are assigned per module in the\ncourse.<\/p>","estimatedClassWorkload":"3-5 hours\/week","recommendedBackground":"<p>No background is required, all are welcome!<\/p>","links":{}}