{"id":3460,"shortName":"fin4devmooc","name":"Financing for Development","language":"en","shortDescription":"An ambitious global development agenda was adopted at a UN Summit on September 25, 2015. The new global goals, called the Sustainable Development Goals (SDGs), will require trillions of dollars to accomplish over the next 15 years. This magnitude of financing will surpass the current capacities of governments and international donors. The World Bank Group and its partners recognize the need to leverage the “billions” in Official Development Assistance (ODA) to attract and mobilize “trillions” in investments of all kinds: public and private, national and global, in both capital and capacity.","aboutTheCourse":"<img title=\"Image: https:\/\/d396qusza40orc.cloudfront.net\/fin4devmooc\/images\/about-us.jpg\" alt=\"\" style=\"float:left; margin:0 10px 0 0px; width:265px;\" src=\"https:\/\/d396qusza40orc.cloudfront.net\/fin4devmooc\/images\/about-us.jpg\">To facilitate increased awareness, the World Bank Group is launching a <a title=\"Link: https:\/\/www.class-central.com\/mooc\/4076\/coursera-financing-for-development\" target=\"_blank\" href=\"https:\/\/www.class-central.com\/mooc\/4076\/coursera-financing-for-development\">Financing for Development Massive Open Online Course<\/a> (MOOC) on November 16. The objective is to familiarize more people with the new development agenda, the critical role of the private sector and the use of finance, including innovative solutions, to fund the SDGs and meet the <a title=\"Link: http:\/\/www.worldbank.org\/en\/news\/feature\/2013\/04\/17\/ending_extreme_poverty_and_promoting_shared_prosperity\" target=\"_blank\" href=\"http:\/\/www.worldbank.org\/en\/news\/feature\/2013\/04\/17\/ending_extreme_poverty_and_promoting_shared_prosperity\">Bank Group goals<\/a> of ending poverty and boosting shared prosperity by 2030. <br>\n<br>\n\n\nJoin the growing numbers of those who understand the importance of combining public resources with private and commercial finance for the common good to implement the 17 <a target=\"_blank\" href=\"http:\/\/www.un.org\/sustainabledevelopment\/sustainable-development-goals\/\">SDGs<\/a>. Over the four-week course, participants will hear from prominent government, international organization and private sector leaders who have considerable first-hand experience in preparing and implementing development projects and forging public-private collaborations globally and regionally. The challenges and successes of mobilizing billions to generate the <a target=\"_blank\" href=\"https:\/\/www.linkedin.com\/pulse\/billions-trillions-bertrand-badr%C3%A9?trk=mp-reader-card\">trillions <\/a>needed will also be outlined. <br>\n<br>\n\n\nThis course includes terminology, key concepts, sources of development finance, public, private and commercial, and multilateral, and the need for increased use of ODA and innovative financing solutions to mobilize and leverage domestic and official development resources alongside private funds. Participants learn through video presentations, core reading materials and links to additional videos and readings. Join the conversation through discussion boards, two Google Hangouts, Twitter chats and other interactive features that encourage active learning.<br>\n<br>\n\nThis course will familiarize participants with the approaches currently under discussion among global leaders on financing the new development agenda.<br>","targetAudience":0,"courseSyllabus":"<img alt=\"\" style=\"float:right; margin:0 0 0 10px; width:265px;\" src=\"https:\/\/d396qusza40orc.cloudfront.net\/fin4devmooc\/images\/course-syllabus.jpg\">\n<strong>Overview <\/strong><br>\nThis overview presents the main topics the course will cover:<br>\n<br>\n<strong>Week 1: Introduction to Financing for Development<\/strong><br>\n \nThe first Module defines financing for development and its purpose, describes the main sources of finance and the principal actors involved in financing for development projects, discusses the trends in development finance and outlines why a paradigm shift is needed to mobilize the necessary financing resources to achieve the SDGs. reach the global goals. The Module also touches upon the outgoing general framework for development , the MDGs of 2000-2015, and the successor SDGs covering the period 2016-2030 adopted in September.\n<br>\n\n<br>\n<strong>Week 2: Public Finance<\/strong><br>\nThe second Module introduces and explains domestic and international public finance resources.  It highlights issues such as improving domestic resource mobilization, increasing the efficiency of public expenditure measures such as reducing illicit financial flows, and better leveraging Official Development Assistance to enhance its ability to mobilize other sources of public and private finance , particularly for low-income and fragile economies. The Module also discusses the importance for countries  to improve the investment climate for greater private investment and to foster development of domestic capital markets to facilitate the tapping of domestic savings for development uses.<br>\n<br>\n<strong>Week 3: Private and Commercial Finance<\/strong><br>\nThe third Module focuses on sources of domestic and international private and commercial finance. It includes the substantial growth of foreign direct and portfolio investments and of domestic capital markets in select developing countries. It emphasizes the growth and potential of newer sources of private and commercial finance, such as philanthropic funds, sovereign wealth funds, pension funds, and private equity, to be “crowded in” by more targeted use of public resources. It highlights challenges and obstacles the private sector sees to greater mobilization of private sector funding, including needed incentives such as greater risk-sharing and a more hospitable regulatory environment. This Module spotlights infrastructure finance, as one of the most resource-intensive and pervasive development sectors across the developing world, discussing the needs and the current impediments to attracting the capital projected to be required to meet those needs.<br>\n<br>\n<strong>Week 4: Multilateral Development Banks (MDBs), other multilateral, and Wrap-up<\/strong><br>\nThe fourth Module provides an overview of the MDBs, explaining their business models that have allowed them to leverage their capital and equity to support a vastly greater portfolio of development projects worldwide. It also discusses innovative financing solutions used in recent years to mobilize and generate new financing flows and improve the efficient use of available funds. This Module also highlights the role of MDBs in financing global public goods (GPGs), with climate finance spotlighted as a prime example of innovative techniques and financing vehicles used to ramp up funding deployed in this critical and global area. This Module concludes with a wrap-up of the key learnings the course has attempted to convey.<br>\n<br>\n \n\n<h2>Course Tracks<\/h2>\n<img alt=\"\" style=\"float:right; margin:0 0px 0 10px; width:275px;\" src=\"https:\/\/d396qusza40orc.cloudfront.net\/fin4devmooc\/images\/course-tracks.jpg\">\nParticipants can participate in one of two tracks:<br><br>\n\n\n<ul>\n<li>General Awareness<\/li>\n<li>Development Specialist<\/li>\n<\/ul>\nParticipants can move from the General Awareness to the Development Specialist Track at any time during the course.<br>\n<br>\n<strong>Track 1 – General Awareness<\/strong><br><br>\n \n\n<ul><strong>Target Audience<\/strong><br>\nThis Track is suitable for anyone with a general interest in and desire to increase understanding of development finance, in particular the need to scale up to meet the financing needs supporting achievement of the SDGs and development more generally.<br>\n <br>\n<strong>Common Objective<\/strong><br>\nTo describe the fundamental concepts of development finance, the sources of funding, and the role of finance in supporting the new Sustainable Development Agenda and development generally. This includes, in particular, the increasing need for public resources to be used innovatively to mobilize and leverage the growing pools of private and commercial finance to meet the 17 SDGs.&nbsp;<br><br>\n\n<strong>Assignments<\/strong>\n<br>\nAssignments focus multiple-choice questions on subjects that reinforce learning that should be derived from watching the required video talks and doing the core readings. A reflective assignment (500 words) is designed to encourage active learning by requiring participants to select a topic of importance to them and to write an opinion piece that is then peer-reviewed and posted for review and discussion by other participants.<\/ul>\n<br>\n<strong>Track 2 – Development Specialist<\/strong><br><br>\n \n\n<ul><strong>Target Audience<\/strong><br>\nThis Track is suitable for anyone who works in the development field or considers development a special area of interest. That would include: official development partners (including officials of the MDBs, IMF, UN and its agencies, donor and client government ministries of finance, foreign affairs and development, and central banks), the private sector, foundations, civil society organizations, and academics, students and other experts concentrating on development issues. It is designed to delve more deeply into the Module subjects, as well as to allow participants to create networks of common interest with counterparts from around the world.<br>\n \n<br>\n<strong>Common Objective<\/strong> <br>\nTo describe the fundamental concepts of development finance, the sources of funding, and the role of finance in supporting the Sustainable Development Agenda and development generally. This includes, in particular, the increasing need for public resources to be used innovatively to mobilize and leverage the growing pools of private and commercial finance to meet the global goals.&nbsp;<br>\n\n<br>\n<strong>Assignments<\/strong><br>\nAssignments focus multiple-choice questions on subjects that reinforce learning that should be derived from watching the required video talks and doing the core readings. A Digital Artifact assignment relevant to their context or work, either (i) describing a situation or issue of importance, or (ii) designing a financing solution or plan, using multimedia (anything but text), is meant to deepen the discussion and collective learning. The digital artifact will be peer-reviewed and posted for discussion by other participants. Participants will be encouraged to translate complicated concepts into simple or actionable ideas, in a style that could be understood by laypeople in their community.<\/ul>\n <h2>Connect<\/h2>\n\nCommunicate and share resources via the course hash tag on Twitter <a target=\"_blank\" href=\"https:\/\/twitter.com\/search\/?q=Fin4DevMOOC\">#Fin4DevMOOC<\/a>.  Other hash tags you may want to monitor are <a target=\"_blank\" href=\"https:\/\/twitter.com\/search\/?q=Fin4Dev\">#Fin4Dev<\/a>, <a target=\"_blank\" href=\"https:\/\/twitter.com\/search\/?q=SDGs\">#SDGs<\/a>, <a target=\"_blank\" href=\"https:\/\/twitter.com\/search\/?q=post2015\">#post2015<\/a>, <a target=\"_blank\" href=\"https:\/\/twitter.com\/search\/?q=developmentfinance\">#developmentfinance<\/a>.<br>\n<br>\nRelated Twitter accounts to follow and\/or monitor are:  <a target=\"_blank\" href=\"https:\/\/www.twitter.com\/SDgoals\">@SDgoals<\/a>, <a target=\"_blank\" href=\"https:\/\/www.twitter.com\/SustDev\">@SustDev<\/a>, <a target=\"_blank\" href=\"https:\/\/www.twitter.com\/devfinancenews\">@devfinancenews<\/a>","courseFormat":"<img alt=\"\" style=\"float:right; margin:0 0 0 10px; width:275px;\" src=\"https:\/\/d396qusza40orc.cloudfront.net\/fin4devmooc\/images\/course-format.jpg\"> \n This MOOC has a week-by-week structure, with resources, activities and exercises for you to engage in during each of the four weeks of the course. Each week, you will find a variety of course material, including: <br> <br>\n\n\n<ul>\n\n                 <li><strong>Videos<\/strong> on key topics by renowned practitioners.<br>\n<br>\n<\/li>\n\n           <li><strong>Resources:<\/strong> Core and optional (deep dive) on the week’s theme.<br>\n<br>\n<\/li>\n              <li><strong>Quizzes<\/strong> that check your knowledge, reinforce the lesson’s material and provide immediate feedback.<br>\n<br>\n<\/li>\n               <li><strong>Assignments<\/strong> that will sharpen your skills of analysis, reflection and communication.<br>\n<br>\n<\/li>\n               <li><strong>Discussion forums and social media<\/strong> that support collaboration with others from around the world, enriching interaction among participants.<br>\n<br>\n<\/li>\n               <li>Two live interactive <strong>Google Hangouts on Air<\/strong> <strong>and<\/strong> <strong>Twitter Chats, in weeks 2 and 4<\/strong>, with international experts, who will engage in a Q&amp;A session on Financing for Development.<\/li><br>\n\n  <li> As a final project, you will have a short written assignment if on the General Awareness Track and creation of a Digital Artifact if on the Development Specialist Track.<\/li>\n             <\/ul>  \nIf you successfully complete the course requirements, you will receive a Coursera Certificate.  Course requirements include gaining a cumulative score of 45 out of 60 points for the relevant required assignments if on the General Awareness Track and 65 out of 85 points if on the Development Specialist Track.   The core resources and assignments will take around three to five hours per week to complete if on the General Awareness Track, and two to three hours longer if on the Development Specialist Track. More details will be provided after the course begins. <br>\n<br>\n\n\nYou can also go much further than this, engaging in networking, discussion fora and diving deeper into our rich selection of additional resources. We also will use e-discussions, the Google Hangout and Twitter Chats and other tools to facilitate dialogue between the learners and experts.","suggestedReadings":"<p>›&nbsp;&nbsp;&nbsp;<a target=\"_blank\" href=\"http:\/\/www.worldbank.org\/mdgs\/post2015.html\">MDB Joint Note on Financing the post-2015 Development Agenda, including From<br>\n &nbsp;&nbsp;&nbsp;&nbsp;Billions to Trillions; Transforming Development Finance---post-2015<\/a><br>\n<br>\n›&nbsp;&nbsp;&nbsp;<a target=\"_blank\" href=\"http:\/\/www.worldbank.org\/content\/dam\/Worldbank\/gmr\/gmr2014\/GMR_2014_Full_Report.pdf\">WBG Global Monitoring Report 2014<\/a>\n<br>\n<br>\n›&nbsp;&nbsp;&nbsp;<a target=\"_blank\" href=\"http:\/\/www.un.org\/esa\/ffd\/ffd3\/wp-content\/uploads\/sites\/2\/2015\/07\/Addis-Ababa-Action-Agenda-Draft-Outcome-Document-7-July-2015.pdf\">Addis Ababa outcome document – zero draft<\/a>\n\n\n\n<br>\n<br>\n›&nbsp;&nbsp;&nbsp;<a target=\"_blank\" href=\"http:\/\/www.brookings.edu\/~\/media\/Research\/Files\/Papers\/2015\/02\/united-nations-financing-for-development-kharas-mcarthur\/GlobalViews12015v2.pdf?la=en\">Homi Kharas and John McArthur: Nine Priority Commitments to be made at <br>\n&nbsp;&nbsp;&nbsp;&nbsp;the UN's\n July 2015 Financing for Development Conference in Addis Ababa, Ethiopia<\/a>\n\n\n<br>\n<br>\n›&nbsp;&nbsp;&nbsp;<a target=\"_blank\" href=\"http:\/\/www.cgdev.org\/topics\/road-addis\">Center for Global Development - Publications and blog posts by Scott Morris<\/a>\n\n\n<br>\n<br>\n›&nbsp;&nbsp;&nbsp;<a target=\"_blank\" href=\"http:\/\/erd-report.com\/erd\/report_2015\/ERD5_Report_EN_Web_Def.pdf\">European Report on Development 2015: Combining finance and policies <br>\n&nbsp;&nbsp;&nbsp;&nbsp;to implement \n a transformative post-2015 development agenda<\/a>\n\n<br>\n<br>\n›&nbsp;&nbsp;&nbsp;<a target=\"_blank\" href=\"http:\/\/www.un.org\/esa\/ffd\/wp-content\/uploads\/2014\/12\/ICESDF.pdf\">Report of the Intergovernmental Committee of Experts on Sustainable Development<br>\n &nbsp;&nbsp;&nbsp;&nbsp;Financing<\/a>\n\n\n<br>\n<br>\n›&nbsp;&nbsp;&nbsp;<a target=\"_blank\" href=\"http:\/\/www.un.org\/ga\/search\/view_doc.asp?symbol=A\/69\/700&amp;Lang=E\">UN report - The road to dignity by 2030: ending poverty, transforming <br>\n&nbsp;&nbsp;&nbsp;&nbsp;all lives and  protecting the planet<\/a>\n\n<br>\n\n\n\n\n<\/p>","estimatedClassWorkload":"4-8 hours\/week","recommendedBackground":"","links":{}}