{"id":105,"shortName":"comnetworks","name":"Computer Networks","language":"en","shortDescription":"The Internet is a computer network that millions of people use every day. Understand the design strategies used to solve computer networking problems while you learn how the Internet works.","aboutTheCourse":"Computer networks from ISPs to WiFi and cellular networks are a key part\nof the information economy. These networks are the foundation for the Web,\nand they enable companies such as Google, Facebook and Amazon. This course\nintroduces the fundamental problems of computer networking, from sending\nbits over wires to running distributed applications. For each problem,\nwe explore the design strategies that have proven valuable in practice.\nTopics include error detection and correction, multiple-access, bandwidth\nallocation, routing, internetworking, reliability, quality of service,\nnaming, content delivery, and security. As we cover these topics, you will\nlearn how the internals of the Internet work to support the Web and other\nnetworked applications. You will develop a detailed understanding of widely-used\nnetworking technologies such as TCP\/IP, HTTP, 802.11, Ethernet, and DNS.","targetAudience":0,"courseSyllabus":"<ul>\n    <li>Introduction, Protocols and Layering<\/li>\n    <li>Physical and Link layers<\/li>\n    <li>Retransmissions, Multiple access, Switching<\/li>\n    <li>Network layer, Internetworking<\/li>\n    <li>Intra- and Inter-domain Routing<\/li>\n    <li>Transport layer, Reliability<\/li>\n    <li>Congestion Control<\/li>\n    <li>DNS, Web\/HTTP, Content Distribution<\/li>\n    <li>Quality of Service and Real-time Apps<\/li>\n    <li>Network Security<\/li>\n<\/ul>","courseFormat":"The course consists of two to three hours of video lectures per week, presented\nin short segments. For those seeking to pass the course, there will be regular, required homeworks of textbook-style\nproblems and optional hands-on exercises to cover the basics of the material.\nThe course has a midterm and final exam.","suggestedReadings":"There is an optional textbook: <a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=comnetworks&isbn_ean=9780132126953\" title=\"Link: http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=comnetworks&isbn_ean=9780132126953\">Computer Networks (5th Edition, either U.S. or International version)<\/a>, by Tanenbaum and Wetherall. We recommend (but do not require) the text if you are serious about mastering the material, as it provides accompanying explanations in greater detail and more\n    depth, as well as extra topics and a reference.","instructor":"David Wetherall, Arvind Krishnamurthy and John Zahorjan","estimatedClassWorkload":"4–12 hours\/week","recommendedBackground":"We assume a rudimentary understanding of probability (such as the likelihood\nof an event) and computer system organization (such as binary representations\nand arithmetic). You should be comfortable with simple calculations and\nmanipulations using scientific notation. We teach the course at the upper-undergraduate\nlevel. To do the optional, hands-on exercises you should be comfortable\nwith installing systems software and running command-line programs.","links":{}}