{"id":706,"shortName":"sciframework","name":"Using The Next Generation Science Standards for Students’ Deeper Understanding ","language":"en","shortDescription":"This course is designed to guide science educators towards an understanding of the  Framework for K-12 Science Education and how, when integrated with the Scientific and Engineering Design Practices and Crosscutting Concepts are the basis for classroom instruction using the Next Generation Science Standards.","aboutTheCourse":"<span>\n <span><span>\n  <span>\n  <p><span>The Scientific and\n  Engineering Practices as outlined in <i>A\n  Framework for K-12 Science Education<\/i>, provide the basis for students to gain a deeper understanding\n  science content through the use of hands-on science investigations and\n  engineering design activities.&nbsp; Often investigations remain as engaging activities without adding depth to the students’\n  understanding of the science core ideas. Research-based instructional\n  strategies utilized in STEM programs require a more rigorous approach to\n  describing the scientific ideas that underlie the activity.&nbsp; <\/span><b><\/b><\/p>\n  <\/span>\n  \n  \n  \n <\/span>\n \n  \n  \n \n \n  \n  \n \n <span>\n  <span>\n  <p>The question becomes: <\/p>\n  <p><b>As\n  teachers begin to address the Science Core Disciplinary Ideas through the\n  lens of STEM (Science, Engineering, Technology and Mathematics), how and why should the Scientific and Engineering Design\n  Practices be integrated into investigations?<\/b><\/p>\n  <\/span>\n  \n  \n  \n <\/span>\n <span>\n  <span>\n  <p>Using the Framework for K-12\n  Science Education can be the basis for this depth of understanding by:<\/p>\n  <p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Providing\n  research-based science core disciplinary ideas<\/p>\n  <p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Connecting\n  the ideas with Cross-cutting concepts<\/p>\n  <p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Utilizing\n  scientific and engineering practices and <\/p>\n  <p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Providing\n  guidance in the assessment of the depth of knowledge gained by students and a\n  measure of achievement in understanding the core disciplinary ideas in\n  science.<\/p>\n  <\/span>\n  \n  \n  \n <\/span>\n<\/span><\/span>","targetAudience":3,"courseSyllabus":"<p><b>Week\n1:<\/b>\nLearn about the Framework for K-12 Science Education and how it is organized by\nPractices, Crosscutting Concepts and Core Ideas for one specific grade level or\ncontent strand.&nbsp; Understand how the\norganization of the Framework will guide teachers in the development of deeper\nstudent understanding in science. Analyze a Performance Expectation (PE) for one of the NGSS and determine how the three strands are embedded in the PE.<br><\/p>\n\n<p><b>Week\n2:<\/b>\nExplore the Disciplinary Core Ideas as outlined in the K-12 Framework for Science Education by the NRC. Based on your understanding of how these are vertically alinged from K-6, and for secondary science, compare the alignment to a set of education standards used in your community. <br><\/p><p><strong>Week 3:<\/strong> Scientific and Engineering Practices to understand how they are\nsimilar processes with very different outcomes.&nbsp;\nBased on an understanding of how these practices are utilized by the STEM\nWorkforce, analyze how each practice is used in a relevant, real-world\nproblem-based situation.<\/p>\n\n<p><b>Week 4:<\/b> Explore the Crosscutting Concepts as outlined in the K-12 Framework for Science Education by the NRC.&nbsp; Determine how they are used within the Framework to build a deeper understanding of the DCI to which it is attached.&nbsp; Compare the use of the CCC within the NGSS compared to the education standards of your community.<br><\/p>\n\n<b>Comprehensive Assignment:&nbsp;<\/b><span> Using the alignment of the components of the NGSS and your local science education standards for one specific grade level and concept, compare and contrast the comprehensive nature of both standards in meeting the needs of your school system now and in the future, for the instruction of science education.<\/span>","courseFormat":"This course will have four highly interactive 90\nminutes sessions that are a mix of short lectures, videos, reading, and\nanalytical written activities usually organized into graphic organizers.&nbsp; Peer feedback is required for short answer\nwriting prompts that are submitted by students as reflections about learning\nand understanding for each week’s key topics. Weekly quizzes will provide feedback at the knowledge level, to ensure a baseline understanding of the NGSS.<br>","suggestedReadings":"<p><b><i>A Framework for K-12 Science Education<\/i><\/b>, National Research\n    Council, Available through NSTA Book Store, <a title=\"Link: http:\/\/www.nsta.org\" target=\"_blank\" href=\"http:\/\/www.nsta.org\">www.nsta.org<\/a> and\n    the National Academies Press as a book or download as a PDF Document for\n    free at <a title=\"Link: http:\/\/www.nap.edu\" target=\"_blank\" href=\"http:\/\/www.nap.edu\">www.nap.edu<\/a>.&nbsp;<\/p>ISBN – 13:978-0-309-21742-2","estimatedClassWorkload":"2-4 hours\/week","recommendedBackground":"This\ncourse is recommended for any educator who is interested in the cutting-edge of\nscience education.&nbsp; No previous\ncoursework is recommended, but the course will be most helpful to science teachers\nwith 3 or more years of teaching experience that are willing to directly apply\nexperiences in their schools","links":{}}