{
    "id": 526,
    "shortName": "humanresearch",
    "name": "Guinea Pigs, Heroes & Desperate Patients: The History & Ethics of Human Research",
    "language": "en",
    "shortDescription": "Learn about the ethical issues that arise when conducting human subjects research, as well as the history that grounds policies and debates in this area of biomedicine.",
    "aboutTheCourse": "The objective of this course is to increase participants’ awareness and\nunderstanding of ethical issues that arise in the conduct of research on\nhuman subjects. The course will explore the history and future of ethical\nand policy&nbsp;challenges using a multi-disciplinary approach. Leading\nscholars in the ethics of human subject research will serve as course faculty.\n&nbsp;This course will introduce participants to the history that grounds\npolicies and debates regarding the use of humans in research. It will continue\nwith&nbsp;discussion of&nbsp;how current international and US policies\ngoverning research are applied, how ethical norms and concepts have evolved,\nand how, in some cases, changes in research have outpaced changes in policy,\nleading to an often complicated mismatch between the two.\n<br>\n<br>The lead instructor is&nbsp;Jeffrey Kahn, who&nbsp;is the Robert Henry\nLevi and Ryda Hecht Levi Professor of Bioethics and Public Policy at the\nJohns Hopkins University Berman Institute of Bioethics. &nbsp;He will be\njoined by colleagues who are all among the leading scholars in aspects\nof the ethical and policy issues related to research on human subjects,\nincluding Profs. Ruth Faden (history and theory of informed consent),&nbsp;Nancy\nKass (public health research, research in international settings), Jeremy\nSugarman (empirical approaches to research ethics, US research policy),\nDebra Mathews (US and international science and research policy), Gail\nGeller (participants' perspectives on research participation),&nbsp;Joseph\nAli (law and research oversight in US and international settings), and\nDan O'Connor (medical history, ethics and social media-based research).\n<br>",
    "targetAudience": 1,
    "courseSyllabus": "",
    "estimatedClassWorkload": "3-4 hours\/week",
    "recommendedBackground": "<p>No background required--all materials are in English, so English reading\n    and speaking proficiency is necessary.<\/p>",
    "links": {

    }
}