{"id":44,"shortName":"genomescience","name":"Experimental Genome Science","language":"en","shortDescription":"Each of our cells contains nearly identical copies of our genome, which provides instructions that allow us to develop and function. This course serves as an introduction to the main laboratory and theoretical aspects of genomics and is divided into themes: genomes, genetics, functional genomics, systems biology, single cell approaches, proteomics, and applications.","aboutTheCourse":"<p>Each of our cells contains nearly identical copies of our genome, which provides instructions that allow us to develop and function. The field of Genomics focuses on the structure and function of genomes and plays a major and increasing role in both medicine and research. This course serves as an introduction to the main laboratory and theoretical aspects of genomics and is divided into themes: genomes, genetics, functional genomics, systems biology, single cell approaches, proteomics, and applications. We start with the basics, DNA sequencing and the genome project, then move to high throughput sequencing methods and applications. Next we introduce principles of genetics and then apply them in clinical genetics and other large-scale sequencing projects. In the functional genomics unit, we start with RNA expression dynamics, analysis of alternative splicing, epigenomics and ChIP-seq, and metagenomics. Model organisms and forward and reverse genetics screens are then discussed, along with quantitative trait locus (QTL) and eQTL analysis. After that, we introduce integrative and single cell genomics approaches and systems biology. Finally, we conclude by introducing in applying proteomic approaches.<\/p><div><br><\/div>","targetAudience":1,"courseSyllabus":"","courseFormat":"The class will consist of lecture videos, which are between 45 and 60 minutes in length.  Each lecture contains several integrated quiz questions.  There will be assigned readings, written assignments based on those readings, and three exams.<br>","suggestedReadings":"","instructor":"John Hogenesch, John Isaac Murray","estimatedClassWorkload":"6-8 hours\/week","recommendedBackground":"","links":{}}