{"id":727,"shortName":"advancedvirtual","name":"Advanced Instructional Strategies in the Virtual Classroom","language":"en","shortDescription":"Learn how to elevate your teaching by studying what some of the most successful  virtual teachers are doing to propel their students forward. We will investigate what teaching strategies make the biggest impact in virtual education, connect with innovative and experienced teachers, and apply core strategies to the key areas of K-12 virtual instruction.","aboutTheCourse":"This course will help you ‘up’ your game and develop the advanced level skills and techniques that eludes even some of the most experienced virtual teachers. We will examine the pitfalls beginning teachers run into and learn how to overcome them by focusing on the fundamentals that have the greatest impact on student learning in a blended or online environment. Throughout the course you will have the opportunity to hear from a variety of experienced K-12 teachers and be challenged to assess your own skills and apply what you are learning by creating a guide, assignment or resource that you will be able to use in a class that you teach or hope to teach someday soon. By the end of the course you’ll not only have a better understanding of the basics; you’ll be able to put them together like a pro and empower your future students to be voracious learners who are ready to go out and make the world a better place to live.","targetAudience":1,"courseSyllabus":"This course is made up of five modules (see below). All modules will be available at the start of the course.&nbsp;<br><strong>Module 1<\/strong>: Handling Direct Instruction<br><strong>Module 2<\/strong>: Passing with Communication and Building Relationships<br><strong>Module 3<\/strong>: Swishing Assignments and Assessments<br><strong>Module 4<\/strong>: Rebounding for At-Risk and Under performing Students<br><strong>Module 5<\/strong>: Your Best Defense is a Good Community<br>","courseFormat":"This class will consist of short weekly lecture videos and live panel discussions (archived on YouTube), totaling approximately 1 hour of viewing per week. There will also be weekly quizzes, 1 peer-graded assignment, and a final exam.<br>","suggestedReadings":"Free,&nbsp;publicly&nbsp;available&nbsp;articles&nbsp;and resources will be provided \nthroughout the course.<br>Additionally the texts below are recommended but not required:<br><ul><li><a href=\"http:\/\/amzn.com\/B00FOVKN2U\" target=\"_blank\">Teaching in Zero Gravity<\/a>&nbsp;by Michelle Stephens (2013)<\/li><li><a href=\"http:\/\/amzn.com\/0415899397\" target=\"_blank\">Best Practices for Teaching with Emerging Technologies<\/a> by Michelle Pacansky-Brock (2013)<\/li><\/ul><br><br><br><br>","estimatedClassWorkload":"2-4 hours\/week","recommendedBackground":"<p>The course is primarily for:<\/p><ul><li>Teachers working with children ages 5 - 18<\/li><li>Educators who are already familiar with the basics of virtual education<\/li><li>Faculty working with further education, community college, or vocational        students<\/li><li>Continuing education or in-service facilitators supporting teachers and        faculty<\/li><li>Educators interested in educational technology and\/or online instruction<\/li><li>Please note that although this program is offered to participants from        around the world, many of the examples and experiences shared will be based        on the education structure and processes of the&nbsp;United States. Participants        will be encouraged&nbsp;to discuss their own country-based experiences        in the forums.<\/li><\/ul>","links":{}}