{
    "id": 380,
    "shortName": "socialepi",
    "name": "Social Epidemiology",
    "language": "en",
    "shortDescription": "Social epidemiology is about how a society makes people sick and\/or healthy. We address not only the identification of new disease risk factors (e.g., deficient social capital) but also how well-known exposures (e.g., cigarette smoking, lead paint, health insurance) emerge and are maintained by the social system.",
    "aboutTheCourse": "This course is about understanding the determinants of health from a broad\nperspective. We focus on how social relationships and institutions -- such\nas familial relationships, national policies, and global economic forces\n-- promote or undermine the health of populations. The course covers existing\nevidence of health disparities, research methods, and theories relevant\nto the topic.\n<br>\n<br>The course is interesting because it reveals the so-called fundamental\ncauses of disease and health disparities recognizable within social groups.\nFor example, we examine why a flu germ can affect whole groups of people\ndifferently. In short, the course challenges the notion that health is\na narrowly defined medical problem.\n<br>\n<br>Students in the course will listen to lectures, read provided materials,\nand complete quizzes and tests that examine comprehension and one's ability\nto synthesize ideas.\n<br>\n<br><span>Upon completion of the course students should:<br><\/span>\n\n<ul>\n    <li>have a deep appreciation for how social arrangements impact the health\n        of populations,<\/li>\n    <li>be able to critically evaluate the scientific and popular health literature\n        that address the causes of disease,<\/li>\n    <li>be able to measure key social drivers such as race and socioeconomic status,\n        and&nbsp;<\/li>\n    <li>be able to conceive of research strategies that can answer questions critical\n        for policy making.<\/li>\n<\/ul>",
    "targetAudience": 1,
    "courseSyllabus": "Week 1: &nbsp;Background and History\n<br>What is social epidemiology and where did it come from? What is different\nabout it?\n<br>\n<br>Week 2: Issues\n<br>What are the fundamental issues (e.g., environment, race, genetics) in\/for\nsocial epidemiology?\n<br>\n<br>Week 3: Health Disparities&nbsp;\n<br>How can social epidemiology improve our understanding of the identification\nand analysis of, if not remedies for, health disparities?\n<br>\n<br>Week 4: Theories and Constructs\n<br>What theories and\/or constructs are fundamental to social epidemiology?\n<br>\n<br>Week 5: Measurement\n<br>What are some fundamental measurement issues in social epidemiology?\n<br>\n<br>Week 6: Design &amp; Inference\n<br>What are some fundamental design and analysis tools in social epidemiology?\n<br>\n<br>Week 7: Doing Things\n<br>What social epidemiological interventions work and fail, and why?\n<br>",
    "estimatedClassWorkload": "2-4 hours\/week",
    "recommendedBackground": "Students should be curious, enthusiastic&nbsp;readers, with undergraduate-level&nbsp;analytical\nand critical thinking&nbsp;skills; and&nbsp;have an interest in&nbsp;policy\nimplications surrounding social and societal&nbsp;health issues. A basic\nunderstanding of statistics would also be&nbsp;useful.&nbsp;&nbsp;",
    "links": {}
}