{"id":978,"shortName":"peopleandnetworks","name":"人群与网络 People & Networks","language":"zh-cn","shortDescription":"学习运用计算思维分析社会学、经济学问题的方法，加深对某些生活现象的理解，体会计算与社会科学的互动。\n\n\nLearn to analyze and reason about problems in social sciences with computational thinking, appreciate interactions between computing and social sciences, as well as gain deeper understanding of some common phenomena in life and society  \n\n","aboutTheCourse":"<p>课程介绍视频可以访问<a href=\"http:\/\/video.study.163.com\/edu-video\/nos\/mp4\/2013\/11\/20\/303423_hd.mp4\" target=\"_blank\">这里<\/a>。<\/p>\n<p><\/p>\n<p>以社会学与经济学若干经典问题为载体，以计算机科学的典型思维方法为工具，学习与体会两类学科知识的交叉与互动。涉及的话题包括社会网络、关系平衡、匹配市场、中介市场、拍卖市场、信息级联、网络效应、流行性、新事物的传播、小世界现象、表决制度等。本课程的学习目标，一是加深我们对某些生活现象的理解，二是初步掌握一套分析研究那些现象与问题的思路与方法。<\/p>\n\n<p>这是一门入门性质的课程，适合计算机类专业，社会学、经济学等社会科学专业的低年级本科生；同时也可供其他背景和程度的人们开阔视野。<\/p>\n\n<p>课程的内容主要基于教材《网络、群体与市场》（译），同时在互联网上也有公开免费的英文版本（<a href=\"http:\/\/www.cs.cornell.edu\/home\/kleinber\/networks-book\/networks-book.pdf\">http:\/\/www.cs.cornell.edu\/home\/kleinber\/networks-book\/networks-book.pdf<\/a>）。<\/p><p>该课程是“北大-德稻网络公开课程”中的一门，由北京大学与德稻教育联合提供。<br><\/p>","targetAudience":0,"courseSyllabus":"第一周：社会网络基础<br>第二周：同质性及其对社会网络形成的影响<br>第三周：小世界<br>第四周：博弈论基本概念<br>第五周：布雷斯悖论，次价拍卖，匹配市场<br>第六周：GSP与VCG<br>第七周：HITS与PageRank<br>第八周：“随大流”的理性<br>第九周：新生事物的网络扩散<br>第十周：人际关系的均衡<br>第十一周：幂律、长尾与齐普夫定律<br>第十二周：劣币驱逐良币的原因<br>第十三周：孔多塞悖论与阿罗不可能定理<br>","courseFormat":"<ul><li>本课程由讲课视频组成，每周的学习内容大约由4－8段视频组成，每段视频的长度一般不超过12分钟。<br><\/li><li>视频之间会穿插一些嵌入的概念测验题（供学生自我测试，不计入成绩）。<br><\/li><li>教学团队每周回答论坛上的前10个问题，并且每周六晚上7-9点（北京时间）在线参与论坛讨论。鼓励学习者在论坛上互相帮助，释疑解惑。<br><\/li><li>与学生成绩直接有关的要求包括：课后作业题，期末考试。<\/li><\/ul>","suggestedReadings":"<a href=\"http:\/\/www.cs.cornell.edu\/home\/kleinber\/networks-book\/networks-book.pdf\" target=\"_blank\">Networks, Crowds, and Markets: Reasoning about a Highly Connected World<\/a> (free online)<br>《网络、群体与市场：揭示高度互联世界的行为原理与效应机制》（译），清华大学出版社，2011。","estimatedClassWorkload":"3-6 hours\/week","recommendedBackground":"高中毕业程度的数学知识，喜欢逻辑思维，喜欢思考生活中的现象。","links":{}}