{
    "id": 1171,
    "shortName": "sjtuma153",
    "name": "数学之旅 The Journey of Mathematics",
    "language": "zh-cn",
    "shortDescription": "课程从问题开始揭示一些数学思想形成的过程，和听众一起从思想上重走一遍前辈们走过的路，体会数学抽象的魅力。\n\nIn this course I share the processes which formed the core concepts of mathematical philosophy, walking with students as they experience, learn and enjoy mathematical abstraction.",
    "aboutTheCourse": "<p>    数学的重要特征是它的抽象性，这一特征是令人生畏的。但也正是这一特征可以使人们在繁杂的世界中逐步懂得宇宙深处伟大设计图的语言；可以用理性的思维达到超出人类感官所及的宇宙的根本。而这一切正是数学的魅力所在，也是数学在人类历史上起着其它科学不可替代作用的重要原因。但这也是很多学生畏惧数学或学习数学的困难所在。<\/p><p>Abstraction in mathematics, one of its most important features, can often \nseem forbidding. However, this abstract thinking also reveals the great mystery \nof the Universe and demonstrates fundamentally why mathematics is both charming \nand irreplaceable. Unfortunately, it makes too many students afraid of \nmathematics and causes trouble for the study of mathematics.<\/p><p> 本课程针对这一情况，试图和学生一起从思想上重走一遍前辈们走过的路，作一次轻松的数学之旅。在这一旅途中我们不断揭示一些概念和数学思想形成的过程和历史，理解数学抽象的必要性和魅力，真实体会数学抽象所表现出的人类心智的荣耀，潜移默化地从中培养数学抽象的能力。并试图就一些简单的数学例子介绍数学抽象的一些特点，并试图就学习数学时，如何克服抽象带来的困难谈一些看法。主讲人有信心使这门课程成为一次轻松的“抽象”旅游。并希望对学生的数学课程的学习和数学思维的形成，在心理和心智上都有所帮助。<\/p>\n\n<p>In this course, I try to walk along its history together with students to \ncreate a relaxed tour of mathematical concepts and thinking. This course will \nshare the history and process of the formation of some mathematical concepts and \nphilosophy, help students to understand the need for abstraction in mathematics, \nand teach students how to enjoy what is behind these abstract concepts so that \nthey may handle them more confidently. We also try to show certain features of \nabstraction in mathematics through some simple examples that will teach students \nhow to overcome common difficulties. I am confident this course will be \nenjoyable and helpful for those studying mathematics and the formation of \nmathematical thinking.<br><\/p>\n\n<p>好的旅游不是旅游点的累积，而是心与自然、心与心的交流。我们的“数学之旅”不期待你知道了多少数学概念，而期待你开始对数学的抽象有了体会，意识到数学的抽象其实不“抽象”，感受到数学思维所表现出的人类心智的荣耀。<\/p>\n\n<p>In this journey, the important thing is the interaction between heart and \nnature and heart and heart, instead of the number of viewpoints. We do not \nexpect that you will master many mathematical concepts but hope you will learn \nabout and develop an appreciation for the abstraction of \nmathematics.<br><\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<span>\n <span><span>\n  <span>\n  <p>第1周<\/p>\n  <\/span>\n  <span>\n  <p>第一章数学是什么<\/p>\n  <p>第一章数学思维（上）<\/p><\/span><\/span><span>\n  <span>\n  <p>第一章数学思维（下）<br><\/p><p>第一章 数学学习<\/p>\n  <\/span>\n <\/span>\n <span>\n  <span>\n  <p>第2周<\/p>\n  <\/span>\n  <span>\n  <p>第二章从圆的面积谈起<\/p>\n  <p>第二章牛顿和莱布尼兹的微积分（上）<\/p><\/span><\/span><\/span><\/span><span><span><span><p>第二章牛顿和莱布尼兹的微积分（下）<\/p><p>第二章分析的严格化（上）<\/p><p>第二章分析的严格化（下）<br><\/p>\n  <p>第3周<br><\/p><\/span><\/span><span>\n  <span>\n  <p>第三章距离与范数<\/p>\n  <p>第三章线性结构<\/p><\/span><\/span><span>\n  <span>\n  <p>第三章空间种种<\/p>\n  <p>第三章知识点复习、作业、习题等<\/p>\n  <\/span>\n <\/span>\n <span>\n  <span>\n  <p>第4周<\/p>\n  <\/span>\n  <span>\n  <p>第四章布劳威尔不动点原理<\/p>\n  <p>第四章无穷维的不动点原理<\/p><\/span><\/span><span>\n  <span>\n  <p>第四章经济学的应用<\/p>\n  <p>第四章知识点复习、作业、习题等<\/p>\n  <\/span>\n <\/span>\n <span>\n  <span>\n  <p>第5周<\/p>\n  <\/span>\n  <span>\n  <p>第五章 Fourier定理<\/p>\n  <p>第五章 Fourier分析的应用<\/p><\/span><\/span><span>\n  <span>\n  <p>第五章 Fourier分析的发展<\/p>\n  <p>第五章知识点复习、作业、习题等<\/p>\n  <\/span>\n <\/span>\n <span>\n  <span>\n  <p>第6周<\/p>\n  <\/span>\n  <span>\n  <p>第六章混沌<\/p>\n  <p>第六章分形<\/p><\/span><\/span><span>\n  <span>\n  <p>第六章“混沌的游戏”<\/p>\n  <p>第六章 知识点复习、作业、习题等<\/p>\n  <\/span>\n <\/span>\n<\/span>",
    "estimatedClassWorkload": "3-5 hours\/week",
    "recommendedBackground": "<p><span>有一定的微积分和线性代数基础的大学生。<\/span><\/p>",
    "links": {

    }
}