{
    "id": 2876,
    "shortName": "ushealthcarereform",
    "name": "American Health Policy: The Affordable Care Act and the Future of Health Care Reform (Part II of II)",
    "language": "en",
    "shortDescription": "This course will explore the Affordable Care Act in depth and then turn towards future health reform efforts and the future of the American health care system. Part II of II.",
    "aboutTheCourse": "<p>The American health care system has many problems. 50 million people are uninsured. Quality is extremely uneven, with peaks of greatness at leading academic centers but overall poor quality in both process measures and outcomes such as asthma deaths. Finally, the U.S. health care system spends over $8000 per patient per year, nearly double the next highest country. In March 2010, the Affordable Care Act was enacted. Over the next decade or more, the Act will dramatically re-structure the American health care system.<\/p><p>This course will explore the challenges that were overcome to achieve health reform in America. We will delineate the specific ways that the Affordable Care Act improves access and quality, and will control costs. It will conclude with predictions about further reforms and about the future of health care in America.&nbsp;<\/p><p>This class is open to anyone interested in gaining a better understanding of the Affordable Care Act and possible future health care reforms. While not required, we recommend you first take <a href=\"https:\/\/www.coursera.org\/course\/americanhealthsystem\" target=\"_blank\">Part I<\/a> of this course for background knowledge about the American health care system. Students who feel as though they have a strong grasp of the structure of the current US health system and the history of health care reform in the US may start with Part II.<\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<p><i>Week 1: Passing the\nAffordable Care Act<\/i><\/p>\n\n<p><i>Week 2: Expanding\nAccess<\/i><\/p>\n\n<p><i>Week 3: Cost Control\nand Quality Reform<\/i><\/p>\n\n<p><i>Week 4: Implementation\nProblems and Health Care Reform 2.0<\/i><\/p>\n\n<p><i>Week 5: Megatrends I<\/i><\/p>\n\n<p><i>Week 6: Megatrends II<\/i><\/p>\n\n<p><br><\/p>",
    "estimatedClassWorkload": "3-6 hours\/week",
    "recommendedBackground": "No background is required; all are welcome.",
    "links": {}
}