{"id":246,"shortName":"onlinegames","name":"Online Games: Literature, New Media, and Narrative","language":"en","shortDescription":"Focused on Tolkien and The Lord of the Rings Online, this course explores what happens to stories and films when they are turned into online games.","aboutTheCourse":"<p><span>Intended for both newcomers who are\ncurious about video games and experienced gamers who want to reflect on their\npassion, this course will explore what happens to stories, paintings, and films\nwhen they become the basis of massively multiplayer online games.&nbsp; <i>The\nLord of the Rings <\/i>trilogy—the novels, films, and video game—are our central\nexample of how “remediation” transforms familiar stories as they move across\nmedia.&nbsp; <\/span><\/p><p><span>The course is\ndesigned as a university-level English literature class—a multi-genre,\nmultimedia tour of how literature, film, and games engage in the basic human\nactivity of storytelling.&nbsp; Our journey\nwill enable us to learn something about narrative theory, introduce us to some\nkey topics in media studies and cover some of the history and theory of video\ngames.&nbsp; It will also take us to some\nlandmarks of romance literature, the neverending story that lies behind most\nfantasy games: J.R.R. Tolkien’s <i>The\nFellowship of the Ring<\/i>, a bit of Edmund Spenser’s <i>Faerie Queene<\/i>, and poems by Keats, Tennyson, Browning, and others.<\/span><\/p>\n\n<p>Drawing on centuries\nof romance narrative conventions, the twenty-first century gaming industry has\nbecome a creative and economic powerhouse.&nbsp;\nIt engages the talents of some of our brightest writers, artists,\ncomposers, computer engineers, game theorists, video producers, and marketing\nprofessionals, and in 2012, it generated an estimated $64 billion in revenue.&nbsp; Anyone interested in today’s culture needs to\nbe conversant with the ways this new medium is altering our understanding of\nstories.&nbsp; Join me as we set out on an\nintellectual adventure, the quest to discover the cultural heritage of online\ngames.<\/p><p>Reviews of the last offering:<br><ul><li><a href=\"http:\/\/penny-arcade.com\/report\/article\/why-40000-students-from-around-the-world-have-signed-up-to-study-lord-of-th\">http:\/\/penny-arcade.com\/report\/article\/why-40000-students-from-around-the-world-have-signed-up-to-st...<\/a><br><\/li><li><a href=\"http:\/\/inventorspot.com\/articles\/gaming_lotr_and_new_media_interview_professor_jay_clayton\">http:\/\/inventorspot.com\/articles\/gaming_lotr_and_new_media_interview_professor_jay_clayton<\/a><br><\/li><\/ul><\/p>","targetAudience":0,"courseSyllabus":"<span> <p><span><b>Week 1<\/b>: Game on!&nbsp; The history and theory of MMOs<\/span><\/p><p><span><b>Week 2: <\/b>LOTRO and Tolkien<\/span><\/p><p><span><strong>Week 3:&nbsp;<\/strong>Romance and realism<\/span><\/p><p><span><strong>Week 4: <\/strong>Space and time in three\nmedia: novel, film, game<\/span><\/p><p><span><strong>Week 5: <\/strong>Pwning Spenser’s<i> Faerie Queene <\/i><\/span><\/p><p><span><strong>Week 6: <\/strong>The Holy Grail: A good end game<\/span><\/p><p>For more details, go to&nbsp;<a href=\"http:\/\/gamemooc.wordpress.com\/2014\/06\/20\/syllabus-summer-2014\/\" target=\"_blank\" title=\"Link: http:\/\/gamemooc.wordpress.com\/2014\/06\/20\/syllabus-summer-2014\/\">http:\/\/gamemooc.wordpress.com\/2014\/06\/20\/syllabus-summer-2014\/<\/a>.<\/p><\/span>","courseFormat":"<p>The course is presented through three different kinds of\nvideos:<\/p>\n\n<p><span><span>1.     \n<\/span><span><b>Short\nlectures by the instructor<\/b>.  We use\nthis mode to convey key concepts, history, and theory.<\/span><\/span><\/p>\n\n<p><span><span>2.     \n<\/span><span><b>Small\nseminars<\/b>.  In these sessions, which\nmake up the majority of the course, I am joined by five wonderful Vanderbilt\nstudents to talk about their encounter with gaming.  Some of them are new to gaming; others have\nbeen gaming since childhood.<\/span><\/span><\/p>\n\n<p><span><span>3.     \n<\/span><span><b>In-game\nsessions<\/b>.  These videos plunge you\ninto the action of <i>Lord of the Rings\nOnline<\/i>.  They combine in-game footage\nwith analysis of narrative and game theory.<\/span><\/span><\/p><span>\n\n<\/span>There will in-game, interactive assignments and written assignments, with the option of student video projects and game design projects.","suggestedReadings":"J. R. R. Tolkien's <i>The Fellowship of the Ring,<\/i>&nbsp;Peter Jackson's movie <i>The Fellowship of the Ring, <\/i><i>&nbsp;<\/i>and six short poems are the required works.&nbsp; Students are encouraged to read the other two books in&nbsp;<i>The Lord of the Rings<\/i>--and to watch the movies--but the later&nbsp;volumes&nbsp;and films in the trilogy are not required.","instructor":"Jay Clayton","estimatedClassWorkload":"6-7 hours\/week","recommendedBackground":"<p>No\nbackground in gaming is required. \nWhether you are non-gamer who is interested in understanding what video games are all about, a person who loves both popular culture and\nserious literature, or a guild leader who runs large raids three nights a week,\nthis course will challenge you to think more deeply about important issues\nconfronting our culture.<\/p>\n\nYou do not have to play The Lord of the Rings\nOnline™ (LOTRO) to enroll in this class because we will have two tracks, one for those who are able to play LOTRO and the other for people who would like to learn about video games, Tolkien, and the romance tradition but choose not to play themselves.  <br><br>LOTRO is free to play.  There is no cost to download or play in the\nShire, Bree, Lone Lands, and the other regions we will be studying.  Most people who continue playing for longer\nthan a few months choose to pay for what Turbine calls VIP status, but the\nfree-to-play content will provide you with months of game time.  Those students who want to play LOTRO will need access to a computer\ncapable of running the game. The computer requirements for LOTRO are detailed on\nthe Turbine web site: <a href=\"http:\/\/www.lotro.com\/free.php\">http:\/\/www.lotro.com\/free.php<\/a>.","links":{}}