{"id":2904,"shortName":"capitalmarkets","name":"The Role of Global Capital Markets","language":"en","shortDescription":"In this course, participants will learn about how different markets around the world can interact to create value for, and effectively manage the risk of, corporations and their stakeholders. This is part of a Specialization in corporate finance created in partnership between the University of Melbourne and Bank of New York Mellon (BNY Mellon).","aboutTheCourse":"<p>This course is the second\nin the four-course Specialization <i>Essentials of Corporate Financial Analysis\nand Decision-Making.<\/i>&nbsp;<\/p><p>In this course you will develop an understanding of the\nkey financial markets commonly available to CFOs and investors looking to\nmaximize value while managing risk, their role in facilitating business\ndevelopment and growth, and&nbsp;identification of the key players in these\nmarkets.&nbsp;<\/p><p>Instructors from the University of Melbourne, together with their\npartners at BNY Mellon, move beyond the textbook approach to financial markets\nby providing&nbsp;you with an appreciation of the opportunities, constraints\nand challenges that practitioners face when solving real-world financing\nproblems in global capital markets.<\/p>\n<p>Courses created in partnership with:<br>\n<img src=\"https:\/\/d396qusza40orc.cloudfront.net\/financialanalysis\/images\/bnym-logo-small.png\"><\/p>","targetAudience":0,"courseSyllabus":"<p><strong>Module 1:<\/strong> An introduction to key global markets <\/p><p><\/p><ul><li>Understand the financial market environment in which corporations operate<br><\/li><li>Explain which financial markets are reflected in the financial statements of a corporation and how the corporation interacts with specific financial markets<br><\/li><li>Define the financial intermediation role of global capital markets<br><\/li><li>Distinguish primary from secondary financial markets, wholesale from retail financial markets, and different trading platforms<br><\/li><\/ul><p><\/p>\n\n<p><strong>Module 2:<\/strong> Market functions and the key players<\/p><p><\/p><ul><li>Understand the role of financial intermediation to facilitate the flow of funds either through direct or indirect financing<br><\/li><li>Understand the importance of trading volume and liquidity in providing continuous, transparent and fair price discovery<br><\/li><li>Explain the drivers behind changes in demand and supply of financial assets<br><\/li><li>Explain how efficient markets prioritise investment opportunities and allocate capital optimally<br><\/li><li>Explain how markets allow investors (and corporations) to diversify and manage risk<br><\/li><\/ul><p><\/p>\n\n<p><strong>Module 3: <\/strong>Opportunities and constraints in global markets<\/p><p><\/p><ul><li>Define liquidity as a concept, and explain how it can be measured<br><\/li><li>Explain how insider trading, exploiting non-public material information, and manipulation, undermines market fairness and integrity<br><\/li><li>Understand how markets ‘discipline’ corporations and thereby resolve an agency problem between shareholders and management<br><\/li><li>Explain how rating agencies (can) contribute to the efficiency of financial markets<br><\/li><\/ul><p><\/p>\n\n<p><strong>Module 4:<\/strong> Identifying links between global markets<\/p><p><\/p><ul><li>Understand that domestic financial markets are connected in price discovery, liquidity and risk<br><\/li><li>Understand spillovers and contagion between global financial markets<br><\/li><li>Explain how globalization of capital markets contributed to unexpected market, liquidity and transparency risks underpinning the global financial crisis<br><\/li><li>Explain the regulatory response to the global financial crisis<br><\/li><li>Identify new developments in global capital markets<br><\/li><\/ul><p><\/p>","courseFormat":"<p>This course will run for 4 weeks, and consist\nof 4 modules each with a series of lecture videos between 5 to 8 minutes long.\nEach video will contain a range of integrated quiz questions or reflection\nquestions. Assessment will be multiple-choice questions, and a final peer\nreviewed assessment.<\/p><p><br><\/p><p>Course hero image reproduced with permission from BNY Mellon.<br><\/p>","suggestedReadings":"<p>Graham, J.R &amp; Smart, S.B. (2012) Introduction\nto corporate finance: what companies do (3rd ed.). Australia: South-Western\/Cengage Learning.<\/p><p>Mishkin, F.S. &amp; Eakins, S. (2015) Financial markets and institutions (8th ed.). Boston: Pearson.<\/p>","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"<ul>\n <li>A basic\n     knowledge of statistics and an ability to employ simple algebra to solve\n     straightforward problems<\/li>\n <li>Familiarity with\n     Microsoft Excel (or a functionally-equivalent spreadsheet program).\n     Specifically participants should possess the ability to summarise data\n     using the graphical tools contained within that program.<\/li>\n <li>Apart from that,\n     a natural curiosity&nbsp;about not only how markets operate, but also how\n     participants in those markets gather and then transform information so as\n     to make financial decisions that maximise firm value<\/li>\n<\/ul>","links":{}}