{
    "id": 161,
    "shortName": "accountabletalk",
    "name": "Accountable Talk®: Conversation that Works",
    "language": "en",
    "shortDescription": "Designed for teachers and learners in every setting - in school and out, in formal learning environments or at home - this course is an introduction to the theory and practice of well-structured talk that builds the mind.",
    "aboutTheCourse": "Designed for teachers and learners in every setting - in school and out,\nin formal learning environments or at home - Introduction to <i>Accountable Talk <\/i>is\nan introduction to the theory and practice of well-structured talk that\nbuilds the mind. You will learn from the growing body of research and from\neducators who put it into practice, why intentionally structured talk promotes\nlearning and how educators can design talk situations that promote learning.\nThe course includes video examples of children and adults engaging in <i>Accountable Talk<\/i> in\na variety of settings and will enable you to begin to build <i>Accountable Talk<\/i> in\nyour own learning community. While the <i>Accountable Talk<\/i> program was\noriginally developed for K-12 classrooms, its structures and practices\nare readily and productively applicable to any situation in which people\nget together and talk in order to learn. The course was developed by the\nSchool of Education and the Institute for Learning at the University of\nPittsburgh. The Institute for Learning was founded by Lauren Resnick, an\ninternationally renowned cognitive psychologist, in 1995. Since then, under\nResnick’s leadership, the Institute for Learning has worked to support the\nimprovement of education and achievement of all students in more than 70\nschool districts in 23 different states.\n<br>",
    "targetAudience": 3,
    "courseSyllabus": "The course syllabus will be refined as the course is developed. Below\nis a tentative list, though incomplete, of topics to be covered.\n<br>\n<br>\n<ul>\n    <li>What is Intelligence and How Does It Develop?<\/li>\n    <li>Socializing Intelligence<\/li>\n    <li>Introduction to <i>Accountable Talk<\/i> — Research Base<\/li>\n    <li>Norms for the <i>Accountable Talk<\/i> Community<\/li>\n    <li>Tools for <i>Accountable Talk<\/i>\n\n    <\/li>\n    <li>Organizing Groups for <i>Accountable Talk<\/i>\n\n    <\/li>\n    <li>Designing Discussions for <i>Accountable Talk<\/i>\n\n    <\/li>\n    <li>Implementing <i>Accountable Talk<\/i>\n\n        <br>\n    <\/li>\n<\/ul>",
    "estimatedClassWorkload": "3-5 hours\/week",
    "recommendedBackground": "No background is required. Anyone interested in learning the research\nand proven techniques about how to build structured conversations to get\nsmarter or to help others get smarter is welcome.\n<br>",
    "links": {

    }
}