{
    "id": 3050,
    "shortName": "mutations",
    "name": "Finding Mutations in DNA and Proteins (Bioinformatics VI)",
    "language": "en",
    "shortDescription": "In this class, we will compare DNA from an individual against a reference human genome to find potentially disease-causing mutations. We will also learn how to identify the function of a protein even if it has been bombarded by so many mutations compared to similar proteins with known functions that it has become barely recognizable.",
    "aboutTheCourse": "Although biologists assembled a reference human genomes in 2001, your own genome differs from this reference genome by millions of mutations. In this chapter, we will learn about&nbsp;<strong>combinatorial pattern matching<\/strong> algorithms for finding these mutations, a task that doctors will eventually be able to carry out within minutes in order to find disease genes.<strong><br><\/strong><br>We will then examine the problem of detecting subtle similarities that evade the traditional sequence comparison algorithms that we studied in \"<a href=\"http:\/\/coursera.org\/course\/comparinggenomes\" target=\"_blank\">Comparing Genes, Genomes, and Proteins<\/a>\".&nbsp;Having efficient algorithms for comparing highly diverged sequences is important, since a single misaligned nucleotide can misclassify a protein and prevent biologists from inferring its function. &nbsp;We will consider a popular approach to sequence comparison based on an abstract machine called a <strong>Hidden Markov Model<\/strong>.<br><strong><br><\/strong>In the end of the course, a Bioinformatics Application Challenge will let you apply real bioinformatics software to see how Hidden Markov Models are used for finding CG-islands, identifying the junctions between exons and introns, and for high-powered sequence alignment.<strong><br><\/strong><strong><\/strong>",
    "targetAudience": 1,
    "courseSyllabus": "<strong>How Do We Locate Disease-Causing Mutations?&nbsp;<\/strong>(Combinatorial Pattern Matching)<br><ul><li>What Causes Ohdo Syndrome?<\/li><li>Introduction to Multiple Pattern Matching<\/li><li>Herding Patterns into a Trie<\/li><li>Preprocessing the Genome Instead<\/li><li>Suffix Trees<\/li><li>Suffix Arrays<br><\/li><li>The Burrows-Wheeler Transform<\/li><li>Inverting the Burrows-Wheeler Transform<\/li><li>Pattern Matching with the Burrows-Wheeler Transform<\/li><li>Speeding Up Burrows-Wheeler Pattern Matching<\/li><li>Where are the Matched Patterns?<br><\/li><li>Burrows and Wheeler Set Up Checkpoints<br><\/li><li>Epilogue: Mismatch-Tolerant Read Mapping<br><\/li><\/ul><strong>Why Have Biologists Still Not Developed an HIV Vaccine?<\/strong>&nbsp;(Hidden Markov Models)<br><ul><li>Classifying the HIV Phenotype<\/li><li>Gambling with Yakuza<br><\/li><li>Two Coins up the Dealer's Sleeve<br><\/li><li>Finding CG-Islands<br><\/li><li>Hidden Markov Models<br><\/li><li>The Viterbi Algorithm<br><\/li><li>Finding the Most Likely Outcome of an HMM<br><\/li><li>Profile HMMs for Sequence Alignment<br><\/li><li>Classifying proteins with profile HMMs<br><\/li><li>Learning the Parameters of an HMM<br><\/li><li>Soft Decisions in Parameter Estimation<br><\/li><li>The Many Faces of HMMs<br><\/li><li>Epilogue: Nature is a Tinkerer and not an Inventor<br><\/li><\/ul><strong><\/strong><strong>Bioinformatics Application Challenge:<\/strong>&nbsp;Biological Applications of Hidden Markov Models",
    "estimatedClassWorkload": "4-10 hours\/week",
    "recommendedBackground": "\"<a href=\"http:\/\/coursera.org\/course\/clustering\" target=\"_blank\">Clustering Biological Data<\/a>\" is the suggested prerequisite for taking this course, but it is not a strict prerequisite.<br><br>If you are aiming at earning a standard certificate in this class, then you do not need to have any experience in biology or programming. &nbsp;The only prerequisite is the enthusiasm to learn about how computational approaches are used in modern biology :)<br><br>If you are aiming at earning a certificate with distinction, then you should either know the basics of programming in the language of your choice (there is no required language for this course) or be willing to learn about programming before the course begins. In this case, in addition to the first three courses in this series, we have the following suggestions for resources that will help you learn programming.<br><ul><li>The language tracks on&nbsp;<a href=\"http:\/\/codecademy.com\/\" target=\"_blank\">Codecademy<\/a>, particularly the Python track.<\/li><li><a href=\"https:\/\/www.coursera.org\/course\/interactivepython\" target=\"_blank\" title=\"Link: https:\/\/www.coursera.org\/course\/interactivepython\">An Introduction to Interactive Programming with Python<\/a>, the acclaimed Coursera course.<\/li><li>Introductory problems on&nbsp;<a href=\"http:\/\/rosalind.info\/\" target=\"_blank\">Rosalind<\/a>, a resource for learning bioinformatics created by the course instructors.<\/li><\/ul>",
    "links": {

    }
}