{
    "id": 2643,
    "shortName": "genintro",
    "name": "Introduction to Genomic Technologies",
    "language": "en",
    "shortDescription": "The basic biology of modern genomics and the experimental tools used for measurement. This is the first course in the Genomic Big Data Science Specialization. ",
    "aboutTheCourse": "This course introduces you to the basic biology of modern genomics and the experimental tools used to measure this biology. The course will introduce the Central Dogma of Molecular Biology and cover how next generation sequencing can be used to measure DNA, RNA, and epigenetics. The course will also give a brief introduction to the key concepts in computing and statistics that you will need to understand how data from next generation sequencing are generated and analyzed.",
    "targetAudience": 1,
    "courseSyllabus": "<ol><li>The Central Dogma of Molecular Biology<\/li><li>How next generation sequencing works<\/li><li>Applications of next generation sequencing to measure<\/li><ul><li>DNA<\/li><li>RNA<\/li><li>Epigenetics (e.g. DNA methylation)<\/li><\/ul><li>Basic concepts in computing on next generation sequencing data<\/li><ul><li>What is an algorithm?&nbsp;<\/li><li>What is a data structure?<\/li><li>How to share data?&nbsp;<\/li><\/ul><li>Basic concepts in statistics for next generation sequencing<\/li><ul><li>Types of variation (biological, technological)<\/li><li>Experimental design<\/li><li>Signal and noise<\/li><\/ul><\/ol>",
    "estimatedClassWorkload": "3-5 hours\/week",
    "recommendedBackground": "The target audience of this course are individuals in the molecular or computational sciences who need a basic introduction to biology, statistics, computation, and how they relate. It would be a useful supplement to the education of undergraduates, graduate students, or postdocs in molecular biology. It is also a highly conceptual class that would be useful for biological, statistical or computational investigators who are new to genomic technologies.",
    "links": {

    }
}