{
    "id": 148,
    "shortName": "compfinance",
    "name": "Introduction to Computational Finance and Financial Econometrics",
    "language": "en",
    "shortDescription": "Learn mathematical and statistical tools and techniques used in quantitative and computational finance. Use the open source R statistical programming language to analyze financial data, estimate statistical models, and construct optimized portfolios. Analyze real world data and solve real world problems.",
    "aboutTheCourse": "<p>Learn mathematical, programming and statistical tools used in the real world analysis and modeling of financial data. Apply these tools to model asset returns, measure risk, and construct optimized portfolios using the open source R programming language\n    and Microsoft Excel.  Learn how to build probability models for asset returns, to apply statistical techniques to evaluate if asset returns are normally distributed, to use Monte Carlo simulation and bootstrapping techniques to evaluate statistical\n    models, and to use optimization methods to construct efficient portfolios.<\/p>\n\n<p>You'll do the R assignments for this course on <a target=\"_blank\" href=\"https:\/\/www.datacamp.com\/?utm_source=Coursera%20Syllabus%20Zivot&utm_medium=link&utm_campaign=Syllabus\" title=\"Link: https:\/\/www.datacamp.com\/?utm_source=Coursera%20Syllabus%20Zivot&utm_medium=link&utm_campaign=Syllabus\">DataCamp.com<\/a>, an online interactive learning platform that offers free <a href=\"https:\/\/www.datacamp.com\/courses\/introduction-to-r?utm_source=Coursera%20Zivot%20Syllabus&utm_medium=link&utm_campaign=Coursera%20Zivot%20Syllabus%3A%20Introduction%20to%20R\" target=\"_blank\">R tutorials<\/a> through learning-by-doing.\n    The platform provides you with hints and instant feedback on how to perform even better. Every week, new labs will be posted.  <\/p>",
    "targetAudience": 0,
    "courseSyllabus": "Topics covered include:\n<ul>\n    <li>Computing asset returns<\/li>\n    <li>Univariate random variables and distributions<\/li>\n    <ul>\n        <li>Characteristics of distributions, the normal distribution, linear function of random variables, quantiles of a distribution, Value-at-Risk<\/li>\n    <\/ul>\n    <li>Bivariate distributions<\/li>\n    <ul>\n        <li>Covariance, correlation, autocorrelation, linear combinations of random variables<\/li>\n    <\/ul>\n    <li>Time Series concepts<\/li>\n    <ul>\n        <li>Covariance stationarity, autocorrelations, MA(1) and AR(1) models<\/li>\n    <\/ul>\n    <li>Matrix algebra<\/li>\n    <li>Descriptive statistics<\/li>\n    <ul>\n        <li>histograms, sample means, variances, covariances and autocorrelations<\/li>\n    <\/ul>\n    <li>The constant expected return model<\/li>\n    <ul>\n        <li>Monte Carlo simulation, standard errors of estimates, confidence intervals, bootstrapping standard errors and confidence intervals, hypothesis testing , Maximum likelihood estimation, review of unconstrained optimization methods<\/li>\n    <\/ul>\n    <li>Introduction to portfolio theory<\/li>\n    <li>Portfolio theory with matrix algebra<\/li>\n    <ul>\n        <li>Review of constrained optimization methods, Markowitz algorithm, Markowitz Algorithm using the solver and matrix algebra<\/li>\n    <\/ul>\n    <li>Statistical Analysis of Efficient Portfolios<\/li>\n    <li>Risk budgeting<\/li>\n    <ul>\n        <li>Euler’s theorem, asset contributions to volatility, beta as a measure of portfolio risk<\/li>\n    <\/ul>\n    <li>The Single Index Model<\/li>\n    <ul>\n        <li>Estimation  using simple linear regression<\/li>\n    <\/ul>\n<\/ul>",
    "estimatedClassWorkload": "",
    "recommendedBackground": "",
    "links": {

    }
}