{
    "id": 1166,
    "shortName": "clinicalpsych",
    "name": "The Clinical Psychology of Children and Young People",
    "language": "en",
    "shortDescription": "The course will cover the basic guiding principles of the Clinical Psychology of Children and Young People and illustrate how theories of psychological development can be applied in understanding children and young people's mental health and well being within a wider societal and cultural context. We will also discuss current psychological models of prevention and treatment for Children and Young People.",
    "aboutTheCourse": "This course will offer a broad\nintroduction to the core models of psychological development and current debates in Applied Developmental Psychology and the practice of\nthe Clinical Psychology of Children and Young People.<br><br>By the end of the course you will be able to:<br><ul><li>Understand essential developmental processes and how they relate to child and adolescent mental health and well being<\/li><li>Understand key mental health difficulties that affect children and young people<\/li><li>Develop a critical reflection on the nature and perception of typical and atypical development and psychological difficulties&nbsp;<\/li><li>Understand and to\ncritically examine the cultural and societal context for child and adolescent development and developmental psychopathology.<\/li><\/ul>\n\n\n\n\n\nThroughout the course we will invite you to reflect on how childhood is defined and perceived from a developmental and clinical psychology perspective. &nbsp;We want to examine the risks of pathologising the range of human experiences and in underestimating the active role that children play in shaping their development. &nbsp;A key perspective that we will adopt throughout the course is that of individual adaptation and an understanding of the psychological processes that allow individuals to respond to past events and circumstances as well as others around them in their physical, emotional and psychological development. &nbsp;&nbsp;<br><br>We will further look at current models of prevention and psychological intervention for Children and Young people who present with mental health difficulties and how these are implemented and evaluated within public and mental heath settings.&nbsp;",
    "targetAudience": 0,
    "courseSyllabus": "<p><strong>Introduction<\/strong><\/p><p>Matthias Schwannauer<\/p><p><b><br><\/b><\/p><p><b>Week 1:\nWhat is Development<\/b> <br><\/p><p>Jo Williams\n\n<\/p><p>In this week we will consider psychological theories of child development and factors that influence child development. We will then introduce you to developmental psychopathology theories that try to explain the emergence of mental health difficulties.<\/p><p><br><\/p>\n\n<p><b>Week 2: Attachment&nbsp;<\/b><br><\/p><p>Emily Taylor<\/p>\n\n<p>In this week we will discuss Attachment Theory and current models of attachment. &nbsp;We will investigate how early experiences shape our development and mental well being, and in which way emotional attachment and mental health interact throughout childhood and adolescence.&nbsp;<\/p><p><b><br><\/b><\/p><p><b>Week 3:\nRisk and&nbsp;Resilience &nbsp;<\/b><br><\/p><p>Emily Taylor<\/p>\n\n<p>In this week we will examine how factors of risk, reliance and vulnerability interact throughout the child and young person's development. We examine the effect of trauma and maltreatment on the mental health and well being of children and which factors protect against the negative impact of such significant negative life events. &nbsp;Past and current conceptualisations will be considered within applied settings to question how these conceptualisations help assessment and intervention for children and young people.<\/p>\n\n<p>&nbsp;<\/p>\n\n<p><b>Week 4:\nThe Psychology of Adolescence&nbsp;<\/b><br><\/p><p>Stella Chan<\/p>\n\n<p>In week four we will examine the psychology of adolescence and why adolescent development is a key period for individual transition, but also a period in which major mental health difficulties emerge. &nbsp;We will also take a look at how adolescents are perceived and the role society plays in their development.&nbsp;We will examine what makes adolescents vulnerable to emotional health problems and approaches of psychological interventions. &nbsp; &nbsp;&nbsp;<\/p>\n\n<p>&nbsp;<\/p>\n\n<p><b>Week 5:\nApplied Developmental Psychopathology part I<\/b><br><\/p><p>Matthias Schwannauer <\/p>\n\n<p>In this final week we will look at models of psychological development and approaches to developmental psychopathology. How can we better understand mental health difficulties in children and young people and what can we learn from their adaptability and resilience in the face of stressors and difficult contexts. &nbsp;<\/p>\n\n\n\n\n\n<br><p><b>Week 6: Applied Developmental Psychopathology part II<\/b><br><\/p><p>Matthias Schwannauer&nbsp;<\/p><p>In this second part of Applied Developmental Psychopathology we will have a closer look at psychological models of prevention and intervention of mental health difficulties and their implementation in health care systems and mental health services in particular. We will use the mental health and well being of our children and young people as a mirror to look at the psychological resilience of our societies.&nbsp;<\/p>",
    "estimatedClassWorkload": "1-3 hours\/week",
    "recommendedBackground": "No background required.<br><br>",
    "links": {}
}