{
    "id": 964,
    "shortName": "hwts",
    "name": "Introduction to Household Water Treatment and Safe Storage",
    "language": "en",
    "shortDescription": "Learn about the most important water treatment methods at household level, successful implementation strategies and about assessing the impact of Household Water Treatment and Safe Storage (HWTS). ",
    "aboutTheCourse": "<p>It is well known that water treatment at the household\nlevel can lead to dramatic improvements in drinking water quality. But does\nHousehold Water Treatment and Safe Storage (HWTS) also have global relevance?\nWhat are the potential treatment solutions and how do they function? Is there a\nstandard strategy for successful HWTS implementation, or can we identify key\ncomponents which make programs more likely to succeed? <\/p>\n\n<p>In this course, you will learn about the public health\nimpacts of unsafe drinking water and about different methods for treating water\nat the household level. The course takes a closer look at the roles of\ndifferent stakeholders, such as governments, businesses, and NGOs. Can HWTS\nreach the most vulnerable populations at scale? How can drinking water quality\nbe cost effectively monitored? What are the health impacts of safe drinking\nwater? The MOOC “Introduction to Household Water Treatment and Safe Storage”\nwill answer these questions with a series of modules and case studies from\nAfrica, Asia and Latin America.<\/p><p><\/p><p>\n\n<\/p><p>The course will be in English with French\nand Spanish subtitles.<\/p>\n\n<p><\/p><a target=\"_blank\" href=\"https:\/\/d396qusza40orc.cloudfront.net\/hwts\/Landing%20page\/HWTS-MOOC_espa%C3%B1ol.pdf\"><\/a><p>\n\n<\/p>\n\n<p>The course was first launched in April 2014. In this\nsecond round we’ve made the following updates: <\/p>\n\n<ul><li>Recent facts and\nfigures regarding the role of safe drinking water in lessening the global\nburden of disease<\/li><li>New modules on the\nproposed water supply targets in the post-2015 period, including case studies\nfeaturing field-robust monitoring methods<\/li><li>The latest from the\nWorld Health Organization’s HWTS Network<\/li><li>A new lecture on\nbusiness models for HWTS<\/li><\/ul>\n\n<p>“Introduction to Household Water Treatment and\nSafe Storage” is a course in the series\n“<a title=\"Link: http:\/\/www.eawag.ch\/mooc\" target=\"_blank\" href=\"http:\/\/www.eawag.ch\/mooc\">Sanitation, Water and Solid Waste for Development<\/a>”. The next MOOC of the series has the topic “Municipal Solid Waste Management in\nDeveloping Countries”.<\/p><p><strong>Factsheets<\/strong><br>English:&nbsp;<a target=\"_blank\" href=\"https:\/\/d396qusza40orc.cloudfront.net\/hwts\/Landing%20page\/MOOC%20-%20Introduction%20to%20HWTS.pdf\">Introduction to HWTS [pdf]<\/a><br>Français: <a target=\"_blank\" href=\"https:\/\/d396qusza40orc.cloudfront.net\/hwts\/Landing%20page\/MOOC%20-%20Introduction%20au%20traitement%20et%20stockage%20s%C3%BBr%20de%20l%27eau%20%C3%A0%20domicile.pdf\">Introduction au traitement et stockage sûr de l'eau à domicile [pdf] <\/a>Español:&nbsp;<a target=\"_blank\" href=\"https:\/\/d396qusza40orc.cloudfront.net\/hwts\/Landing%20page\/MOOC%20-%20Introducci%C3%B3n%20al%20tratamiento%20dom%C3%A9stico%20y%20almacenamiento%20seguro%20de%20agua.pdf\">Introducción al tratamiento doméstico y almacenamiento seguro de agua [pdf]<\/a><br><\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<p><b>WEEK 1: Introduction to Household Water Treatment and\nSafe Storage <\/b><span><br>\nThe course begins with a review of the public health impacts of unsafe drinking\nwater. We define physical, chemical, and microbial aspects of drinking water\nquality and present the major classes of pathogens. Information about pathways\nfor fecal contamination of drinking water are followed by an introduction to\nthe concept of HWTS and the principal technologies. We discuss the global\nrelevance of HWTS with focus on the post-2015 development agenda.<\/span><\/p>\n\n<p><b>WEEK 2&amp;3: HWTS treatment options<\/b><span><br>\n<\/span>During\nweek 2 and 3 we focus on potential treatment methods. We refer first to the\nstandards of safe drinking water and improved drinking water. Week 2 focuses on\nsedimentation and different kinds of filtration.&nbsp; Week 3 focuses on heat, ultraviolet\nradiation, chemical disinfection. Specific modules are provided to cover safe\nstorage and combined methods of water treatment.<\/p>\n\n<p><b>WEEK 4: Implementation strategies for HWTS<\/b><span><br>\n<\/span>During\nweek 4 we analyze different approaches that have been successfully applied. We\nhighlight key components which make programs more likely to succeed. We ask the\nquestions, what is required that the most vulnerable populations use HWTS\ncorrectly and consistently over the long-term? In separate modules we consider\nthe special case of HWTS in emergency response and provide information about\nthe role of government bodies.<\/p>\n\n<p><b>WEEK 5: Monitoring and Evaluating HWTS<\/b><span><br>\nDuring the last week, we present different approaches for monitoring and\nevaluating HWTS. Case studies and guest lecturers, we highlight several key\nchallenges, including the need for consistent use and field-robust measurements.\nThe course ends with a wrap-up module, which serves as preparation for the\nfinal exam.&nbsp;&nbsp; <\/span><\/p>",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": "<p>This course is an introduction – there is no\nparticular technical or scientific background required. We are mainly targeting\nstudents at the graduate or post-graduate level, but the only course\nrequirement is an interest in drinking water quality.\n\n<\/p>",
    "links": {

    }
}