{
    "id": 2095,
    "shortName": "waterwestus",
    "name": "Water in the Western United States",
    "language": "en",
    "shortDescription": "This course combines an overview of the science behind water and climate in the Western United States with a survey of the major legal, political, and cultural issues focused on this precious resource.  ",
    "aboutTheCourse": "<p dir=\"ltr\">Why is water at the heart of so much conflict in the American West? How have major cities and extensive agricultural systems been able to thrive despite most of the region being either a desert or semi-desert environment? How will a warming climate affect the availability and use of water in a region populated by tens of millions of people?&nbsp;<br><\/p><p dir=\"ltr\">We begin our journey with an overview of the geography of the Interior West and its extreme contrasts, from snow-capped high mountain peaks to bone-dry deserts. We will then look at how humans have learned to adapt to the peculiarities of life in such a dry place as we examine the history of water development in the region and the main legal, political, and cultural issues at stake.&nbsp;We’ll explore the primary role of snow as a water source as we discuss the physical science of water in the west—where it comes from, how it gets used, and how a warming climate could affect its availability.&nbsp;<\/p>We’ll use the Colorado River, often referred to as the most controlled and most litigated river in the world, as an in-depth case study. A 1922 agreement over sharing the water among seven states set the stage for conflict among states, tribes, the federal government, and others. We’ll see how scientific research into the climatic variability of the River is informing these conflicts and other policy questions, and who is tackling the big issue of what to do if a mega-drought—or a warming climate—were to lead to a reduction in supply in this critical lifeline for much of the American Southwest. Finally, we’ll explore some critical issues in depth and give you the chance to compare management of water supplies in your area—wherever you are located in the world—to that of the arid West.<br><br>For those living in the region, we hope to make this a fascinating look at how water gets to your tap; for those from elsewhere in the world we believe the Interior West makes for a fascinating case study in management of a scarce resource. <br>",
    "targetAudience": 0,
    "courseSyllabus": "<b>MODULE 0. Course Introduction and Course\nBasics &nbsp;<\/b>\n\n<br>Lecture 1:\nHow the Class Works<br>Lecture 2:\nWhy Study Water in the Western US? <br>Lecture 3:\nOverview of the Water Cycle <br>Lecture 4: Major Physical Geography and\nSocial Characteristics of River Basins in the Western US<br><b><br>MODULE 1. History, Politics, and\nCulture of Water Development in the Western US<\/b>\n\n<br>Lecture 1:\nHistory of Water Development in the West <br>Lecture 2:\nNative American Tribes and Water <br>Lecture 3:\nWater Storage and Delivery Infrastructure <br>Lecture 4:\nThe Prior Appropriation System <br>Lecture 5:\nInterstate Water Conflicts and Agreements <br>Lecture 6:\nEnvironmental Flows; Water and the Endangered Species Act <b><br><br>MODULE 2. Hydrology, Water Demand,\nand Climate in the Western US<\/b>\n\n<br>Lecture 1:\nClimate in the Western US and Its Impact on Water Resources <br>Lecture 2:\nWater Quality, Aquatic Habitat, and Drinking Water<br>Lecture 3:\nGroundwater Resources <br>Lecture 4:\nWatershed Impacts <br>Lecture 5:\nRiver and Flash Flooding <br>Lecture 6:\nWater Demand for Agriculture <br>Lecture 7:\nWater Demand for Urban Areas <br>Lecture 8:\nImpacts of Climate Change in the Interior West <br>\n\n\n\n\n\n<br>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<b>MODULE 3. Case Study: The Colorado\nRiver Basin<\/b><br>Lecture 1: Geographic and Physical\nOverview of the Colorado River Basin <br>Lecture 2: History of Development of\nthe Colorado River Basin: The Era of Big Dams <br>Lecture 3: Climate and the Colorado\nRiver Basin: Past, Present, and Future <br>Lecture 4: The Colorado River Basin\nWater Supply and Demand Study <br>Lecture 5: Human Control vs. Natural\nVariability: The Grand Canyon Experimental Flows Program <br>\n\n\n\n\n\n<br>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<b>MODULE 4. Controversial Water Issues\nin Depth and Course Conclusion<\/b><br>Lecture 1:\nScience, Management, and Reality: The Story of the California Bay Delta <br>Lecture 2:\nDoing More With Less: Water Conservation and New Supplies in Las Vegas<br>Lecture 3:\nA Growing Controversy: Hydraulic Fracturing and Water Supplies <br>Lecture 4:\nUnderstanding Water Quality Impacts: Boulder Creek Case Study <br>Lecture 5: The Water-Energy Nexus <br>Lecture 6:\nWhat Does the Future Hold? Climate Change, Growing Populations, and Solutions\nfor the Future<br>Lecture 7: Course Conclusion<br>",
    "estimatedClassWorkload": "2-3 hours\/week",
    "recommendedBackground": "There are no prerequisites for this course, and no prior knowledge is assumed.<br>",
    "links": {

    }
}