{
    "id": 1577,
    "shortName": "futureeducation",
    "name": "What future for education?",
    "language": "en",
    "shortDescription": "Everyone has experienced education as a learner: these experiences shape how we view and value education, and how we think it should develop in the future. In this course we critically examine a range of ideas around education: including learning, teaching and schooling. Our aim is to consider what our preferred future for education might look like.",
    "aboutTheCourse": "<span>The course aims to get you to\ncritically examine your own ideas about education, teaching and learning. The\ncritique will be developed through engagement with&nbsp;theories\nand ideas developed through educational research. You will be encouraged to use these ideas to challenge or support your own ideas about education.&nbsp; &nbsp;<br><\/span><p>Each week we will focus on one key question, using video lectures, key readings and challenges to explore some commonplace notions about education. With the guidance of the course team, you will be asked to use these ideas to critically reflect on your own understandings and experience. By the end of the course, you will have developed a personal response\nto the main question: what is your preferred future for education?<\/p><p><br><\/p><p><strong>Announcement for US based teachers:<\/strong><br><\/p><p><em>Coursera and its partners are proud to offer eligible teachers&nbsp;<\/em><b><u><em>free verified certificates<\/em><\/u><\/b><em>&nbsp;for this course and other high-quality teacher professional development courses, through the ConnectED effort announced by President Obama.<\/em><\/p><p><em>To participate in this opportunity, district leaders simply need to approve Coursera teacher professional development by completing a brief form at:&nbsp;<\/em><a href=\"http:\/\/www.coursera.org\/tpd\"><em>www.coursera.org\/tpd<\/em><\/a><u><em>.<\/em><\/u><\/p><p><em>Teachers interested in this opportunity are also encouraged to follow the link to learn more and<\/em><a href=\"https:\/\/docs.google.com\/forms\/d\/1t7G3eSUuWvX3arzktgyuzHhMR188D0YnVT-T_aT2pgQ\/viewform\"><em>&nbsp;complete the form<\/em><\/a><em>. &nbsp;<\/em><\/p><p><em>Once a district’s form has been verified, the district leader will be notified and teachers in the district will receive access to free verified certificates for Coursera professional development.<\/em><\/p><p><em>Coursera and its partners thank educators for the hard work they do every day and hope this opportunity will allow them to continue developing their craft in a meaningful and flexible way.<\/em><\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<p><b>Week 1&nbsp;<\/b><b>-<\/b><b>&nbsp;How do we learn? &nbsp;<\/b>This week we explore the&nbsp;learning approach of the\n  course, and start to question what \"learning\" means. &nbsp;Through exploring different models of learning you will gain an understanding of different approaches to, and perspectives on learning.<\/p>\n   <span>\n  <p><b>Week 2 - What is intelligence and does it matter?&nbsp;<\/b>The focus this week is to challenge popular ideas around intelligence. We will consider what is meant by IQ, fixed intelligence, multiple intelligences and emotional intelligence, and&nbsp;the role that ideas about intelligence can play in encouraging or dissuading\n  learning.<\/p>\n <span>\n  <p><b>Week 3 - What makes a good teacher?&nbsp;<\/b>This week we challenge images of teachers, and “good”  teaching. We will be considering how teachers can support the learning process.<\/p>\n <span>\n  <p><b>Week   4 - Can schools make a difference? &nbsp;<\/b>The focus this week is to consider what roles schools play. &nbsp;We will explore assumptions that&nbsp;school improvement initiatives, and evidence on what makes a “good” school.\n  Consideration will also be given to informal learning settings and other\n  institutions of learning.<\/p>\n<\/span>\n<p><b>Week 5 - Why do governments fund education? <\/b>This week the emphasis is on the relationship between education   and schooling, and we shall explore neo-liberal ideas about education and economic   prosperity, social justice and individual development and fulfilment.<\/p>\n  <\/span>\n<p><b>Week 6 - What future for education? <\/b>In this last week of the course we will consider&nbsp;the main challenges are for education\n  and schooling into the future. By exploring different utopian visions for education, you will consider you own views on how education should develop into the future.<\/p><p><b><\/b><\/p><\/span>",
    "estimatedClassWorkload": "6-8 hours\/week",
    "recommendedBackground": "<p><span>The course\nwill be suitable for anyone with an interest in education (teachers, educators,\nparents, or interested individuals), and no prior experience or expertise in\neducation is assumed (except for the experience of having been a\nlearner).&nbsp;&nbsp;<\/span><b><\/b><\/p>",
    "links": {

    }
}