{"id":2184,"shortName":"assetpricing2","name":"Asset Pricing, Part 2","language":"en","shortDescription":"This course is part two of an introduction to graduate-level academic asset pricing. This second part uses the theory and elaborates empirical understanding. It explores some classic applications including the Fama-French three-factor model, consumption and the equity premium, and extends the theory to cover options, bonds, and portfolios. ","aboutTheCourse":"Are you curious about quantitative academic finance? Have you considered graduate study in finance? Are you working in an investment bank, money-management firm or hedge fund and you want to understand models better? Would you like to know what buzzwords like beta, risk premium, risk-neutral price, arbitrage, equity premium, and discount factor mean? This class is for you.&nbsp;<span><br><br>We will see how one basic idea, price equals expected discounted payoff, unites everything - models that describe stocks, bonds, options, real investments, discrete time, continuous time, asset pricing, portfolio theory, and so forth.&nbsp;<br><\/span><br><div>This second part follows&nbsp;<a href=\"https:\/\/www.coursera.org\/course\/assetpricing\" target=\"_blank\">Asset Pricing, Part I<\/a>. However, students somewhat familiar with the material in that class will be able to take this class independently. &nbsp;<br><br>We start by seeing classic factor pricing models in action, first by studying the Fama French three factor model and then by studying the question whether portfolio managers have skill or not. We’ll look in depth at the time-series predictability of returns, “bubbles,” and volatility. We will study the equity premium and the link between asset pricing and macroeconomics. We’ll extend the theory to cover options, then bonds, and study the facts about the term structure of interest rates. The course closes with portfolio theory, how should investors structure their investment portfolios.&nbsp;<\/div><div dir=\"ltr\"><div><div dir=\"ltr\"><div><br><\/div><div>The math in real, academic, &nbsp;finance is not actually that hard. Understanding how to use the equations, and see what they really mean about the world... that's hard, and that's what I hope will be uniquely rewarding about this class.<\/div><\/div><\/div><\/div>","targetAudience":1,"courseSyllabus":"<strong>Week 1: Factor Pricing Models in Action<\/strong><br><br><strong>Week 2: Time Series Predictability, Volatility and Bubbles<\/strong><br><br><strong>Week 3: Macroeconomics and Asset Pricing<\/strong><br><br><strong>Week 4: Option Pricing<\/strong><br><br><strong>Week 5: Term Structure Models and Facts<\/strong><br><br><strong>Week 6: Portfolio Theory<\/strong>","courseFormat":"<div>• Reading assignments for each week, deriving the theory in detail and also giving intuition and applications. &nbsp;<\/div><div>• Short lecture videos, emphaszing intuition and interpretation of the results rather than algebraic drudgery. The videos will incorporate integrated quiz questions.&nbsp;<\/div><div>• Quizzes and weekly problem sets.&nbsp;<\/div><div>• Forum discussions and regular Google hangouts.&nbsp;<\/div><div>• A final exam.<\/div>","suggestedReadings":"The&nbsp;<a href=\"http:\/\/press.princeton.edu\/chapters\/p7836.pdf\" target=\"_blank\">Preface&nbsp;<\/a>and&nbsp;<a href=\"http:\/\/press.princeton.edu\/chapters\/s7836.pdf\" target=\"_blank\">Chapter 1<\/a>&nbsp;of&nbsp;<i>Asset Pricing<\/i>&nbsp;(<a href=\"http:\/\/press.princeton.edu\/titles\/7836.html\" target=\"_blank\" title=\"Link: http:\/\/press.princeton.edu\/titles\/7836.html\">Princeton University Press<\/a>) give a good feel for the class, the range of topics, and the mathematical level. We recommend purchasing the textbook to supplement your study in this class.","estimatedClassWorkload":"10-15 hours\/week","recommendedBackground":"This course uses concepts from finance, undergraduate applied mathematics, advanced undergraduate \/ beginning graduate level economics, and time-series econometrics. You should be able to use single and multivariable calculus, simple differential equations, matrix algebra, and basic statistics. You should be able to program simple simulations in a matrix programming language like Matlab, Octave, R, Python, etc. You should have some background in economics, including utility functions and maximization, and have worked with basic time-series econometrics, such as AR(1) models.<br><br>Students who have not taken Part I of this class should be somewhat familiar with the topics of that class. You should not be scared by simple dz and dt mechanics, the basic consumption model $$ u'(c_t) p_t = \\beta E_t u'(c_{t+1} x_{t+1}) $$ and regression-based factor pricing models such as the CAPM. Watching some of the videos might be a good brush up.&nbsp;","links":{}}