{
    "id": 3049,
    "shortName": "clustering",
    "name": "Genomic Data Science and Clustering (Bioinformatics V)",
    "language": "en",
    "shortDescription": "How do we infer which genes orchestrate various processes in the cell?  How did humans migrate out of Africa and spread around the world? In this class, we will see that these two seemingly different questions can be addressed using similar algorithmic and machine learning techniques arising from the general problem of dividing data points into distinct clusters.",
    "aboutTheCourse": "One of the first organisms to be domesticated by humans was yeast. <i>Saccharomyces<\/i>&nbsp;yeast is remarkable because it can not only convert the glucose in grapes into ethanol (which we then consume as wine), but it can also <i>invert<\/i> its own metabolism, consuming the ethanol it just produced in a process called the diauxic shift. &nbsp;To find genes implicated in the diauxic shift, we will learn about&nbsp;<strong>clustering algorithms <\/strong>that will divide&nbsp;yeast genes into distinct groups based on their patterns of regulatory behavior.&nbsp;A similar method can be applied to distinguish normal and tumor cells, an approach that led to diagnostic tests like MammaPrint for predicting the return of cancer after chemotherapy.<br><br>We can also apply clustering algorithms to identify the genetic foundation of human population structure and discover which populations have contributed to your own genome. To do so, we will need to power up clustering algorithms using a powerful computational approach called&nbsp;<strong>principal component analysis<\/strong>.<div><br>In the end of the course, a Bioinformatics Application Challenge will let you apply real bioinformatics software to cluster a biological Big Data.<\/div>",
    "targetAudience": 1,
    "courseSyllabus": "<strong>How Did Yeast Become a Wine Maker?&nbsp;<\/strong>(Clustering Algorithms)<br><ul><li>An Evolutionary History of Wine Making<\/li><li>Identifying Genes Responsible for the Diauxic Shift<\/li><li>Introduction to Clustering<\/li><li>k-Means Clustering<\/li><li>The Lloyd Algorithm<\/li><li>Clustering Genes Implicated in the Diauxic Shift<br><\/li><li>Limitations of k-Means Clustering<\/li><li>From Coin Flipping to k-Means Clustering<\/li><li>Making Soft Decisions in Coin Flipping<\/li><li>Soft k-Means Clustering<\/li><li>Hierarchical Clustering<br><\/li><li>Epilogue: Clustering Tumor Samples<br><\/li><\/ul><strong>What Genetic Characteristics Do Human Populations Share?<\/strong>&nbsp;(Principal Components Analysis)<br><ul><li>Specific Content TBA<\/li><\/ul><strong><\/strong><strong>Bioinformatics Application Challenge:<\/strong> Clustering Biological Big Data (RNA-seq)&nbsp;",
    "estimatedClassWorkload": "4-10 hours\/week",
    "recommendedBackground": "\"<a href=\"http:\/\/coursera.org\/course\/molecularevolution\" target=\"_blank\" title=\"Link: http:\/\/coursera.org\/course\/molecularevolution\">Deciphering Molecular Evolution<\/a>\" is the suggested prerequisite for taking this course, but it is not a strict prerequisite.<br><br>If you are aiming at earning a standard certificate in this class, then you do not need to have any experience in biology or programming. &nbsp;The only prerequisite is the enthusiasm to learn about how computational approaches are used in modern biology :)<br><br>If you are aiming at earning a certificate with distinction, then you should either know the basics of programming in the language of your choice (there is no required language for this course) or be willing to learn about programming before the course begins. In this case, in addition to the first three courses in this series, we have the following suggestions for resources that will help you learn programming.<br><ul><li>The language tracks on&nbsp;<a href=\"http:\/\/codecademy.com\/\" target=\"_blank\">Codecademy<\/a>, particularly the Python track.<\/li><li><a href=\"https:\/\/www.coursera.org\/course\/interactivepython\" target=\"_blank\" title=\"Link: https:\/\/www.coursera.org\/course\/interactivepython\">An Introduction to Interactive Programming with Python<\/a>, the acclaimed Coursera course.<\/li><li>Introductory problems on&nbsp;<a href=\"http:\/\/rosalind.info\/\" target=\"_blank\">Rosalind<\/a>, a resource for learning bioinformatics created by the course instructors.<\/li><\/ul>",
    "links": {

    }
}