{
    "id": 2001,
    "shortName": "legalresearch",
    "name": "论文写作与检索（Academic Writing and Research）",
    "language": "zh-cn",
    "shortDescription": "本课面向有志于学术研究和具有论文写作需求的高年级本科生和研究生同学，适合人文社会科学、特别是法学专业的学生学习，也欢迎理工科学生选修。教学内容主要集中于学术研究的基本方法与一般理念，既包括学术论文的提问、选题、谋篇、布局和实际写作，也包括学术资源特别是综合性与专业性数据库的检索和使用。",
    "aboutTheCourse": "<p>本课主要面向有毕业论文写作需求的研究生和高年级本科生。适合人文社会科学、特别是法学专业的学生学习，也欢迎理工科学生选修。<\/p><p>论文写作与资源检索，是学术训练旨在培养的基本技能。以法学为例，不仅是法律学生的课程论文和毕业论文，就是律师职业的法律意见，法官判案的司法判决，乃至出国读书的申请材料，都离不开这一基本能力的运用。法学学位论文写作，是所有法律写作的基础。法律意见，司法判决，以及其他各类的法律写作，都需要法学研究的基本功。这也是法学院为什么要以“毕业论文”作为学生培养的最终考核标准。这也适用于其他人文社会科学领域，乃至理工科也有颇多的相同之处。<br><br>对于一个初学者来说，首要难题就是“巧妇难为无米之炊”。资源检索就是一门“帮助巧妇找米下锅”的学问，而论文写作要解决的则是“巧妇是如何炼成的”这个问题。本课将兼顾“如何找米下锅”和“如何炼成巧妇”两方面内容。<br><br>学术研究有道有术。只布道，不授术，难免是“听过很多道理，依然过不好这一生”。只习术，不修道，却也颠倒了学术本末，终究是另一种版本的马基雅维利主义。本课希望道术兼顾，寓道于术，以术明道。&nbsp;<\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<h2>&nbsp; 基本信息<\/h2><p>本课教师：凌斌、刘雅琼、游越<br><\/p><p>助教电邮：pkudog@263.net.cn<\/p><h2>&nbsp; 教学内容<\/h2><p>本课的教学特点，是从初学者的角度出发，结合具体的研究实例，从写作和检索两方面教授和培养学生的基本能力。按照学术研究的一般步骤，教学内容分成了从导论、提问、选题到到谋篇、布局，从开头结尾到文献综述再到学术论证，一共八讲内容。各讲同时包含了资源检索内容，既有电子学术资源的一般介绍，也有具体数据库的重点讲解，特别是综合型数据库以及专业数据库的系统培训。在整个教学过程中，学生都可以边听讲边操作，即学即练。<br><\/p><h2>&nbsp; 考核方式<\/h2><p>本课成绩由平时考核（总计70分）与期末考试（总计30分）两部分组成。<\/p><p>平时考核包含五个部分，包含“课前预习”、“随堂测试”、“上机练习”、“写作训练”和“小班讨论”。“课前预习”是考察教材内容。“随堂测试”是考察对教学视频中的知识点的掌握情况，旨在督促学生观看视频和及时复习。“上机练习”是数据库检索的习题课，需要到教室和老师一起上机操作。“写作训练”是写作一篇5000字以内的小论文，并完成对其他同学文章的同伴互评。“小班讨论”是在助教的组织下，围绕写作训练所提交的小论文，进行分组讨论。<\/p><p>期末考试包含两个部分，完成全部课程学习后进行：一是“在线答题”，考核全部预习和学习内容，形式和难度与平时作业的“课前预习”、“随堂测试”类似。二是“课程论文”，按照要求写作一篇论文，并完成同伴互评。<\/p><p>所有选课同学均需完成“课前预习”和“随堂测试”。此外，北京大学的选课同学还需完成“上机练习”、“写作训练”和“小班讨论”。校外的选课同学自动获得相应成绩。学习过程中遇到的疑问，请发信到助教邮箱，助教将会尽快给予答复。<\/p>【特别提醒】北京大学的选课同学：开学第一次课，仍需按照“学生网上选课系统”中显示的上课时间和地点，到教室与助教见面，了解分组情况和教学要求。开学第一周后，将由助教将选课同学分为若干小组，组织小班讨论。<br><br>【特别提醒】北京大学的选课同学：本课在“学生网上选课系统”中显示的上课时间和地点，除第一次课和两次上机练习外，不再具有实际意义，只是为了方便不同年级的学生选课。<br>",
    "estimatedClassWorkload": "4-10 hours\/week",
    "recommendedBackground": "原则上没有先修要求。推荐高年级本科生和研究生学习。",
    "links": {

    }
}