{"id":1355,"shortName":"waterandenvironment","name":"Water: The Essential Resource","language":"en","shortDescription":"Using water as the unifying theme, explore ocean and freshwater topics and instructional strategies to integrate environmental content in your teaching practice.","aboutTheCourse":"Water is an essential theme in social studies, science, and geography. Whether teaching about natural or human systems, water is part of the story. This course, framed around California's Education and the Environment Initiative (EEI), focuses on ocean and freshwater topics, and instructional strategies for teaching environmental content in Grades 4-8. Resources and support are provided for how to use EEI to implement Common Core State Standards for English Language Arts and Literacy.<br><br>The goal of this course is to increase environmental education in classrooms. The course aims to provide support for teachers to integrate this content into their teaching. Teachers taking this course will:<br><ul><li>increase environmental science content knowledge<\/li><li>increase environmental literacy around issues of water<\/li><li>prepare to implement environmental content in their classroom using engaging, and effective instructional strategies <\/li><li>share and reflect about their practices in a collaborative online environment<\/li><\/ul><br><br><br>","targetAudience":3,"courseSyllabus":"<strong>Session 1: Water: Earth’s Essential Resource<\/strong><br><strong>Session 2: Aquatic and Marine Ecosystems<\/strong><br><strong>Session 3: From Mountain to Ocean<\/strong><br><strong>Session 4: Water Quality<\/strong><br><strong>Session 5: Consequences of Human Water Use<\/strong><br><strong>Session 6: The Ocean<\/strong><br><strong>Session 7: Water Stewardship: Adaptation and Mitigation<\/strong><br><strong>Session 8: Water Reflection<\/strong><br><br>","courseFormat":"This course consists of videos, readings and interactive resources. &nbsp;Each session has a learning component in the form of a quiz called Checking for Understanding. You will work on a course project throughout the course which after submission, will be reviewed by your peers. The richest experience of this course is the collaboration and interaction in the discussion boards. It is your opportunity to learn from others. There is no final exam.<br><br><br>","suggestedReadings":"","estimatedClassWorkload":"5-6 hours\/week","recommendedBackground":"","links":{}}