{"id":484,"shortName":"extrasolarplanets","name":"The Diversity of Exoplanets","language":"en","shortDescription":"The course will provide an overview of the knowledge acquired during the past 20 years in the domain of exoplanets. It will review the different detection methods, their limitations, and the information provided on the orbital system and the planet itself, and how this information is helping our understanding of planet formation.","aboutTheCourse":"The discovery of extra-solar planets orbiting other stars has been one of the major breakthroughs in astronomy of the past decades, changing our view on the formation of planetary systems, mainly drawn from the observation of the Solar System.&nbsp;Today, over 860 exoplanets are known and the Kepler satellite has recently identified over 2700 additional candidates, most of them awaiting for confirmation. We have learned that exoplanets are extremely common objects in the Universe and&nbsp;that planetary systems are much more diverse than originally predicted. <br><br>Our knowledge about exoplanets has dramatically increased thanks to the systematic monitoring of stars in the solar&nbsp;neighborhood by radial velocities, photometry, microlensing,&nbsp;and recently direct imaging, bringing valuable constraints to planet formation theories,&nbsp;as well as to models of planet interior structure, and atmosphere physics. In this course, we will review the main discoveries, describe the different approaches to detect exoplanets and&nbsp;characterise&nbsp;their orbital and physical properties.<br>","targetAudience":1,"courseSyllabus":"Week 1 - Introduction: History and context &nbsp;<br>Week 2 - Planet detection I: the mass and orbital characterisation of systems<br>Week 3 - Planet detection II: the power of transit &nbsp;<br>Week 4 - Statistical results I: mass‐separation‐radius &nbsp;<br>Week 5 - Statistical results II: orbital characteristics and architecture of systems &nbsp;<br>Week 6 - Observational approach to planetary atmospheres<br>","courseFormat":"The class will consist of lecture videos, \nwhich are between 8 and 12 minutes in length. <br>These contain 1-2 \nintegrated quiz questions per video. <br>There will also be standalone \nhomeworks that are not part of video lectures.<br>","suggestedReadings":"","instructor":"Stéphane Udry","estimatedClassWorkload":"2-3 hours\/week","recommendedBackground":"Basic course in astronomy.<br>","links":{}}