{"id":3383,"shortName":"timevalueofmoney","name":"Principles of Valuation: Time Value of Money","language":"en","shortDescription":"This course is an introduction to time value of money and decision-making and will help the learner understand the basics of finance. Although introductory, it will enable you to understand and analyze many personal and professional decisions we confront on a daily basis.","aboutTheCourse":"<p>The strength of finance is that it takes a very structured approach to decision-making, with two key building blocks underlying all decisions. In this course we will develop the first building block: the foundational framework of time value of money (TVM). The main focus in this building block will be on individual\/personal decisions because (a) we learn when we see value to us as individuals, and (b) the beauty of finance is that the building blocks of finance are applicable to any decision, personal or corporate.<\/p><p>This course is the first in a sequence of four courses, followed by a Capstone Project, that comprise a Specialization on Valuation &amp; Investing.&nbsp;<\/p>","targetAudience":1,"courseSyllabus":"The course is comprised of four modules of content (videos, readings, and assignments) and a typical learner should be able to cover each module in about a week if she devotes 5-10 hours a week. Each module has a rigorous assignment and we provide one week of assimilation time and one week to attempt the final exam. The assimilation time helps learners think through what they have been exposed to and finish the assignments, which is the best preparation for the final exam.&nbsp;&nbsp;<br><br>Module One: In module one, we will introduce the framework of time value of money (TVM) in a carefully structured way, using relatively simple applications. &nbsp;&nbsp;<br><br>Module Two: We will move quickly to more advanced applications of TVM focusing on situations we confront on a daily basis.<br><br>Module Three: In this module, we will spend some time on developing an understanding of alternative decision criteria - Net Present Value (NPV), Internal Rate of Return (IRR), Profitability, etc. - that are commonly used in the real world, with a focus on a critical evaluation of their strengths and weaknesses.<br><br>Module Four:&nbsp;We will wrap up the course by exposing the learner to the key determinants of cash flows using accounting principles.&nbsp;<br><br>See <a href=\"https:\/\/d396qusza40orc.cloudfront.net\/timevalueofmoney\/documents\/pdf\/Course%201%20-%20Syllabus.pdf\" target=\"_blank\">Syllabus<\/a>&nbsp;for more details.","courseFormat":"The course consists of videos, broken up into bite-size pieces with their lengths varying based on the topic. Almost every video segment will have opportunities for you to assess your knowledge. You are strongly encouraged to take every opportunity to work on the problems\/examples before you view the analysis presented in the videos. There will also be stand-alone assignments for every module and a mandatory final exam. Doing the assignments is the way you will learn the material.","suggestedReadings":"The videos and assignments are meant to be sufficient to get you started and make good progress. It is highly recommended that you access excellent resources available on finance. The detailed course syllabus provides many suggested readings and textbooks.","estimatedClassWorkload":"5-10 hours\/week","recommendedBackground":"This is a tough issue. &nbsp;I do not believe in prerequisites, except for a sense of curiosity and an attitude. Having said that, a comfort level with algebra and numbers and an understanding of accounting (the language of business) will clearly help. &nbsp;I will, however, try and cover everything starting with fundamentals and will highlight when there is a need for you to do some further work in specific subjects. &nbsp;In fact, I hope the class will motivate you to learn more. &nbsp;I believe that learning usually happens when you are motivated by a curiosity to understand something.","links":{}}