{
    "id": 182,
    "shortName": "tissue101",
    "name": "Introduction to Tissue Engineering",
    "language": "en",
    "shortDescription": "Step into the world of Tissue Engineering, a rapidly expanding field of applied biology aiming to create artificial organs for transplantation, basic research, or drug development.",
    "aboutTheCourse": "<p>Tissue Engineering is a rapidly expanding field of applied biology and\n    biomedical engineering that aims to create artificial organs for transplantation,\n    basic research, or drug development. A fascinating aspect of the field\n    is the fundamental need to integrate knowledge of organic chemistry, cell\n    biology, genetics, mechanics and transport processes to create functional\n    organs. The process uncovers the fascinating complexity of living tissues,\n    and the joy of creation. &nbsp;<\/p>\n<p>This course will review basic cell culture techniques, structure function\n    relationships, cellular communication, natural and artificial biomaterials,\n    and the basic equations governing cell survival and tissue organization.&nbsp;<\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<span>\n <span><span>\n  <span>\n  <p>Week One:&nbsp;Introduction. definitions, basic principles, structure-function relationships<\/p><p>Week Two:&nbsp;Biomaterials. metals, ceramics, polymers (synthetic and natural). Biodegradable materials,\n  native matrix<\/p><\/span><\/span> <span>\n  <span>\n  <p>Week Three:&nbsp;Tissue culture\n  basics: primary cells vs. cell lines, sterile techniques, plastics, enzymes,\n  reactors and cryopreservation <\/p>\n  <\/span>\n<\/span> <span>\n  <span>\n  <p>Week Four:&nbsp;Oxygen transport.&nbsp;diffusion,\n  Michalies-Menten kinetics, oxygen uptake rates, limits of diffusion <\/p>\n  <\/span>\n<\/span> <span>\n  <span>\n  <p>Week Five:&nbsp;Principals of self\n  assembly. cell migration, 3D organization and angiogenesis <\/p>\n  <\/span>\n<\/span> <span>\n  <span>\n  <p>Week Six:&nbsp;Skin tissue\n  engineering. introduction, scar vs. regeneration, split skin graft, apligraf <\/p>\n  <\/span>\n<\/span> <span>\n  <span>\n  <p>Week Seven:&nbsp;Cardiovascular\n  tissue engineering. introduction, blood vessels structure, vascular grafts<\/p><\/span><\/span> <span>\n  <span>\n  <p>Week Eight:&nbsp;Liver tissue\n  engineering. bioartificial liver (BAL) assist device, shear forces , oxygen\n  transport, plasma effects&nbsp;&nbsp; <\/p>\n  <\/span>\n<\/span> <span>\n  <span>\n  <p>Week Nine:&nbsp;Liver tissue\n  engineering. self-assembled organoids, decelluarized whole livers <\/p>\n  <\/span>\n<\/span> <span>\n  <span>\n  <p>Week Ten:&nbsp;Stem cells. basic\n  principles, embryonic stem cells, induced pluripotent stem cells<\/p>\n  <\/span>\n<\/span>\n<\/span>\n<\/span>",
    "estimatedClassWorkload": "2-5 hours\/week",
    "recommendedBackground": "Students are required to have a good knowledge of cell biology.",
    "links": {

    }
}