{
    "id": 2609,
    "shortName": "gestionpersonas",
    "name": "Claves para Gestionar Personas",
    "language": "es",
    "shortDescription": "¿Te has preguntado alguna vez qué criterios utilizan las empresas para contratar o retribuir a las personas? ¿Por qué no siempre entendemos los planes de promoción?. El objetivo de este curso es conocer algunas herramientas prácticas en materia de Recursos Humanos y aprender a gestionar personas y liderar el talento con la mayor eficacia posible. ",
    "aboutTheCourse": "<p><span>Aunque el contenido de este curso se refiere a la\ngestión de recursos humanos, su enfoque apunta a los conocimientos del que, sin\nser un técnico en esa especialidad, tiene que tomar decisiones sobre personas. Y\nes que, en el actual entorno empresarial, los directivos de línea se ven cada\nvez más directamente involucrados en la aplicación de prácticas procedentes del\nárea de dirección de personas. <br>\n<br>\nEvaluación de desempeño, planificación de sucesiones, gestión por competencias,\n<i>feedback<\/i> 360º y conceptos similares están dejando de ser ajenos a los\ndirectivos funcionales y se convierten en una faceta esencial de su\nresponsabilidad de dirección: la de liderar los equipos a su cargo. <br>\n<br>\nEl curso se propone concienciar a los alumnos de que no cabe una dirección\nneutral de las personas, sino que estas solo pueden estar bien o mal dirigidas.<\/span><\/p>",
    "targetAudience": 3,
    "courseSyllabus": "<p><b>Semana 1:&nbsp;<\/b><b>Gestión por competencias<\/b><\/p><p>En esta sesión aprenderemos a usar\neste modelo tan extendido en las organizaciones que busca el desarrollo de las\npersonas. Estudiaremos como a través de la observación directa esta herramienta\nes muy útil para proporcionar a los directivos información de cada una de las\npersonas de su equipo.<\/p><p><strong>Semana 2:&nbsp;<\/strong><b>Selección y\nContratación<\/b><\/p><p>En esta sesión analizaremos el peso\nestratégico que tienen hoy en día el reclutamiento y los procesos de selección\nen la mayoría de las empresas. Daremos a conocer de forma objetiva cuáles son\nlas necesidades de plantilla a corto y medio plazo y a diferenciar algunos\nerrores habituales que se cometen en esta política de Recursos Humanos. <\/p><p><b>Semana 3:&nbsp;<\/b><b>Evaluación<\/b><\/p><p><b><\/b><\/p><p><span>En esta sesión\naprenderemos las prácticas necesarias relativas a los procesos de valoración de\nla actuación de los profesionales que trabajan en la empresa y de manera\nderivada, de los procesos de estimación de la capacidad de su actuación futura.\nAnalizaremos la relación que tienen dichos procesos con decisiones críticas\ncomo retribuciones, rotaciones y promociones.<b><\/b><\/span><\/p><p><strong>Semana 4: <\/strong><b>Promoción<\/b><\/p><p><b><\/b><\/p><p>En esta sesión aprenderemos\nqué criterios se siguen en la empresa para ir ascendiendo con normalidad. De\nesos criterios veremos cuáles están escritos en la política de recursos humanos\nde la compañía y qué otros forman parte de los criterios no hablados.\nAprenderemos a manejarlos con eficacia. <\/p><p><b>Semana 5:&nbsp;<\/b><b>Retribución<\/b><\/p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEn\nesta sesión discutiremos sobre la complejidad de los diferentes sistemas de\nretribución existentes. Veremos porque se trata de una piedra angular sobre la\nque se deben asentar otros sistemas de recursos humanos, y por qué ha pasado a\nser un concepto que opera dentro de un mercado. Aprenderemos conceptos como\nbandas salariales, retribución variable y retribución fija.<br><\/p>",
    "estimatedClassWorkload": "2-3 hours\/week",
    "recommendedBackground": "<p>No son necesarios conocimientos\nprevios si bien, es recomendable tener cierto interés por el área de Recursos\nHumanos así como conocer algunos conceptos básicos de Administración de\nEmpresas.<\/p>",
    "links": {

    }
}