{"id":1881,"shortName":"instec","name":"Институциональная экономика (Institutional economics)","language":"ru","shortDescription":"В ходе курса слушатели узнают, что такое институты, какова роль институтов в экономических взаимодействиях, как они влияют на благосостояние индивидов, организаций и стран, и познакомятся с инструментами, доступными для их изучения.","aboutTheCourse":"<p>Этот курс – первый шаг к пониманию институтов и их роли в экономике и\nобществе, первый взгляд на богатую идеями и результатами область экономического\nанализа, которую мы называем институциональной экономикой. Мы покажем, что в\nмире, где осуществление трансакций связано с издержками, а люди склонны к\nоппортунизму, необходимо создавать правила и следить за соблюдением этих\nправил. Такие правила, дополненные механизмами принуждения к следованию\nправилам, мы и будем называть институтами. Основная задача курса состоит в том,\nчтобы показать, как институты работают в различных сферах, и что происходит,\nесли институты являются слабыми или неэффективными. Мы поговорим об институте\nправ собственности и о контрактах, будем приводить исторические примеры и\nразбирать современные кейсы, покажем, что институты важны для процветания целых\nстран, но в то же время необходимы для осуществления даже самых простых\nтрансакций между двумя их гражданами. И это всего лишь неполный перечень\nвопросов, на которые мы ответим в течение курса.&nbsp;<\/p>\n\nThis course is a first step to\nunderstanding institutions and their role in society and economy, a first look\nat the broad and interesting field of institutional economics. We will show\nthat in the world where transactions are costly and people are opportunistic we\nhave to create rules to govern our decisions and supplement them with\nenforcement mechanisms to make people follow the rules. That is what we mean by\ninstitutions – rules with enforcement mechanisms. Our goal during this course\nis to show how these institutions work in various fields and what happens if\ninstitutions are weak or inefficient. We will speak about property rights and\ncontracts, refer to historical events and present day examples, show how\ninstitutions are important for the prosperity of the countries and vital for\nsupporting transactions between any two citizens of these countries. And that\nis just the short list of questions we will cover during the course.&nbsp;","targetAudience":1,"courseSyllabus":"<p><span><strong>Неделя 1.<\/strong> Институты в экономическом анализе: <i>Введение в институциональный анализ; определение, виды и функции\nинститутов<\/i><\/span><\/p>\n\n<p><strong>Неделя 2.<\/strong> Права собственности: издержки спецификации и защиты прав\nсобственности: <i>Что такое права\nсобственности? Почему важно, чтобы права собственности были специфицированы и\nзащищены? Внешние эффекты и теорема Коуза.<\/i><\/p>\n\n<p><strong>Неделя 3.<\/strong> Режимы прав собственности: <i>Как могут быть распределены права собственности и почему это важно?\nПочему государственная собственность часто бывает неэффективной?<\/i><\/p>\n\n<p><strong>Неделя 4.<\/strong> Формы управления трансакциями: <i>Что такое трансакционные издержки и почему существуют разные формы\nуправления трансакциями? Какие характеристики трансакции важно учитывать при\nосуществлении выбора формы управления?<\/i><\/p>\n\n<p><strong>Неделя 5. <\/strong>Теория агентства: неблагоприятный отбор: <i>Что такое неблагоприятный отбор? Каковы\nпричины его возникновения? К каким последствиям может привести? Каким образом\nинституты могут решить проблему неблагоприятного отбора?<\/i><\/p>\n\n<p><span><strong>Неделя 6.<\/strong> Теория агентства: моральный риск: <i>Что такое моральный риск? Каковы факторы его возникновения? Каковы\nпоследствия возникновения морального риска и как можно их оценить и ограничить?<\/i><\/span><\/p>\n\n<span><strong>Неделя 7.<\/strong> Институты и развитие: <i>Как объяснить такое большое неравенство в\nуровне экономического развития между странами в современном мире? Какова роль\nинститутов – формальных и неформальных – в создании и поддержания неравенства?<\/i><\/span>","courseFormat":"Курс состоит из видео лекций продолжительностью от 7 до 15 минут, с\nвключенными в лекцию тестовыми вопросами. В конце каждой из пяти тем будет\nпубликоваться задание с тестами, которые надо будет сдать в течение одной\nнедели, а в конце курса будет экзамен, который надо будет сдать в\nтечение двух недель.","suggestedReadings":"Кузьминов Я.И., Бендукидзе К.А., Юдкевич М.М. <a href=\"http:\/\/id.hse.ru\/books\/25247265.html\" target=\"_blank\">Курс институциональной экономики: институты, сети, транзакционный издержки, контракты.<\/a> - М. : Изд. дом Высшей школы экономики, 2006&nbsp;<br>\n\n<p>Кузьминов Я.И., Юдкевич М.М. Курс институциональной экономики: Права\nсобственности \/\/ неопубликованные методические материалы.<\/p>\n\n<p>Норт Д. «Институты и экономический рост: историческое введение», THESIS, 1993, 2.<\/p>\n\n<p>Асемоглу Д., Джонсон С., Робинсон Дж. «Институты как\nфундаментальная причина долгосрочного экономического роста», Эковест, 2006, 5,\nс. 1-43.<\/p>","estimatedClassWorkload":"3-4 hours\/week","recommendedBackground":"<p>Знание базовой микроэкономики упростит понимание\nнекоторых понятий, но не является обязательным.<\/p>","links":{}}