{"id":1052,"shortName":"techethics","name":"Technology and Ethics","language":"en","shortDescription":"The meteoric rise of technologies used in our everyday life for profit, power, or improvement of an individual's life can, on occasion, cause cultural stress as well as ethical challenges.  In this course, we will explore how these multifaceted impacts might be understood, controlled and mitigated.","aboutTheCourse":"<div>When everyone begins pursuing their rights to life, liberty and pursuit of happiness we are bound to step on each other’s toes.  This begs the need for regulations.  And this leads to the question as to “what is moral behavior”; and what are\n    the ethics that emanate from the selected definitions of moral behavior. There is no dearth of defined moral behavior created by religions and their leaders, business persons, politicians, philosophers, and in some cases “the everyday person on the\n    street”.\n    <br>\n    <br>\n<\/div>\n<div>Example technologies at play today include nuclear energy; biological manipulations for warfare; robots for taking care of the elderly, and enhancing human capability; the use of technology for surveillance; the cultural changing power of the media which\n    can create unlimited arrays of images real and virtual to support a point of view; and the internet with its world wide connectivity.\n    <br>\n    <br>We need to look into social\/technology assessment, the transfer of the technology as it is placed into practice, and the techniques\/processes that are available for control within the legal, political, institutional and attitudinal environment within\n    which the technology is placed as a way of protecting our rights to life, liberty and pursuit of happiness. \n    <br>\n    <br><br>\n<\/div>","targetAudience":0,"courseSyllabus":"<div>Week One: Introduction to Technology, Ethics, and Culture<\/div><div>Week Two: Expressing Your Ethic<\/div><div>Week Three: Technology Impact Assessment<\/div><div>Week Four: Social Impact Assessment<\/div><div>Week Five: Technology Diffusion and Transfer<br>Week Six:&nbsp;Controlling Technology Diffusion and Transfer<\/div><div>Week Seven: Course Reflection<\/div>","courseFormat":"The class will consist of brief lecture videos. &nbsp;There will 2 small peer review writing projects along with 4 quizzes throughout the course.<br>","suggestedReadings":"Professor Bailey will share online resources here and there throughout the course. &nbsp;<br><br>To get you started, here are a few articles<br><ul><li><a href=\"http:\/\/unesdoc.unesco.org\/images\/0018\/001881\/188198e.pdf\" target=\"_blank\" title=\"Link: http:\/\/unesdoc.unesco.org\/images\/0018\/001881\/188198e.pdf\">The Ethical Implications of Global Climate Change<\/a><\/li><li><a href=\"http:\/\/www.cyberorient.net\/article.do?articleId=6239\" target=\"_blank\">The Islam-Online Crisis: A Battle of Wasatiyya vs. Salafi Ideologies?<\/a><\/li><li><a href=\"http:\/\/hinduonline.co\/HinduReligion\/AllAboutHinduism3.html#_VPID_31\" target=\"_blank\">Hindu Ethics<\/a><\/li><li><a href=\"http:\/\/frontpagemag.com\/2013\/dgreenfield\/islamic-law-allows-husbands-to-divorce-their-wives-on-facebook\/\" target=\"_blank\">Islamic Law Allows Husbands to Divorce Their Wives on Facebook<\/a><\/li><li><a href=\"http:\/\/epub.uni-regensburg.de\/19515\/2\/Science_in_Christian_Perspective.pdf\" target=\"_blank\">Good and Evil in Technology as a Question of Christian Values<\/a><\/li><\/ul><br>","estimatedClassWorkload":"3-5 hours\/week","recommendedBackground":"No background is required, all are welcome.<br><br>Successful students will approach this course with an open mind, a respect for all cultures, and an interest in how technology impacts and challenges our lives.","links":{}}