{"id":709,"shortName":"money2","name":"Economics of Money and Banking, Part Two","language":"en","shortDescription":"Introduction to a “money view” of economic activity for modern times, building on the intellectual traditions of British central banking and American institutionalism. Part One explores the economics of payment systems and money markets. Part Two explores connections with foreign exchange and capital markets.  NOTE:  The first week of Part Two reviews Part One, so you can take Part Two even if you missed Part One.","aboutTheCourse":"This is Part Two of a two-part course; you can find Part One <a href=\"https:\/\/class.coursera.org\/money-001\/class\" target=\"_blank\">here<\/a>.  The description below pertains to the course as a whole, both parts.<br><br>The last three or four decades have seen a remarkable evolution in the institutions that comprise the modern monetary system. The financial crisis of 2007-2009 is a wakeup call that we need a similar evolution in the analytical apparatus and theories that we use to understand that system. Produced and sponsored by the Institute for New Economic Thinking, this course is an attempt to begin the process of new economic thinking by reviving and updating some forgotten traditions in monetary thought that have become newly relevant.<br><br>Three features of the new system are central.<br><br>Most important, the intertwining of previously separate capital markets and money markets has produced a system with new dynamics as well as new vulnerabilities. The financial crisis revealed those vulnerabilities for all to see. The result was two years of desperate innovation by central banking authorities as they tried first this, and then that, in an effort to stem the collapse.  <br><br>Second, the global character of the crisis has revealed the global character of the system, which is something new in postwar history but not at all new from a longer time perspective.  Central bank cooperation was key to stemming the collapse, and the details of that cooperation hint at the outlines of an emerging new international monetary order. <br><br>Third, absolutely central to the crisis was the operation of key derivative contracts, most importantly credit default swaps and foreign exchange swaps. Modern money cannot be understood separately from modern finance, nor can modern monetary theory be constructed separately from modern financial theory. That's the reason this course places dealers, in both capital markets and money markets, at the very center of the picture, as profit-seeking suppliers of market liquidity to the new system of market-based credit.","targetAudience":1,"courseSyllabus":"<b>International Money and Banking<\/b><br>  13:  Chartalism, Metallism and Key Currencies<br>  14:  Money and the State:  International<br>  15:  Banks and Global Liquidity<br>  16:  Foreign Exchange<br><b>Banking as Advance Clearing<\/b><br>  17:<b> <\/b> Direct and Indirect Finance<br>  18:  Forwards and Futures<br>  19:  Interest Rate Swaps<br>  20:  Credit Derivatives<br><b>Banking and the Real World<\/b><br>  21:  Shadow Banking, Central Banking, and Global Finance<br>  22:  Touching the Elephant: Three Views","courseFormat":"The class will consist of lecture videos, shot live in the classroom but then edited down into digestible segments, with integrated quiz questions and animated slide videos added. There will also be weekly quizzes and a final exam.","suggestedReadings":"The lectures are meant to be complete in themselves, and there is no assigned textbook for the course. Weekly readings by a variety of different authors will be posted to introduce students to the range of discourse on money. Students may wish to purchase my book <a href=\"http:\/\/press.princeton.edu\/class_use\/courses\/mehrling\/\" target=\"_blank\">The New Lombard Street, How the Fed Became the Dealer of Last Resort<\/a> (Princeton 2011), which is also meant to be complete in itself, as a backstop for the videos.  ","estimatedClassWorkload":"5-7 hours\/week","recommendedBackground":"The on-campus version of this course requires Intermediate Microeconomics and Intermediate Macroeconomics as prerequisites for economics majors, but non-economics majors (such as engineers and historians) without those prerequisites have taken the course and done fine. The important thing is some familiarity with economic reasoning and concepts and perhaps some familiarity with the subject matter (such as through job experience or an internship).<br><br>The best background for Part Two is Part One, but the first week of Part Two is a high-level review of Part One in case you missed it. &nbsp;","links":{}}