{"id":1133,"shortName":"respondingto911","name":"Responding to 9\/11: Counterterrorism Policy in the 21st Century","language":"en","shortDescription":"9\/11 was a devastating attack that required a comprehensive response from the United States. This course will examine post-9\/11 U.S. counterterrorism policies regarding the use of military force, law enforcement and intelligence collection, and domestic security. We will trace these policies to the current day and assess their legality, ethics, and efficacy in counteracting terrorism.","aboutTheCourse":"This course will examine and evaluate the counterterrorism policies pursued by the United States in response to the 9\/11 terrorist attacks.&nbsp; The core learning goal will be for student to learn how to think strategically – that is, to determine what the key objectives the U.S. has been pursuing, critically evaluate whether the policies that have been put in place are achieving these objectives, and consider whether and how these policies should be modified to better meet the U.S.'s strategic goals.&nbsp; Students will have the opportunity to examine counterterrorism policies in three different areas: the use of military force (Afghanistan, Iraq and drones), intelligence and law enforcement authorities (interrogation of enemy combatants, electronic surveillance and government access to data), and homeland security (aviation security and countering violent extremism policy).&nbsp; Each of these topics will require students to grapple with not only questions of efficacy, but also legality and morality. <br>","targetAudience":0,"courseSyllabus":"<b>Course Topics<\/b><br><br>Week One:&nbsp; The Strategic Challenge of 9\/11<br>Week Two:&nbsp; The Use of Force – Legal and Policy Framework<br>Week Three:&nbsp; Drone Strikes:&nbsp; Morality, Legality, and Efficacy<br>Week Four:&nbsp; Detention, Interrogation and Prosecution of Enemy Combatants (Guantanamo)<br>Week Five:&nbsp; Surveillance and Its Impact on Privacy and Civil Liberties<br>Week Six: &nbsp;&nbsp;Domestic Security: Body Scans, Profiling, and \"Homegrown\" Terrorism<br>Week Seven:&nbsp; The Post 9\/11 World:&nbsp; An Assessment<br>","courseFormat":"Each week will consist of lecture videos, readings, and an assessment. \nAlong with content lectures by Professor Schanzer, there will be videos \nof student discussions and interviews with various experts. There will \nbe multiple opportunities for engagement with fellow students\n and Professor Schanzer through Google Hangouts and the discussion \nforums.<br><br>Students are invited to submit weekly posts commenting on an aspect\n of the materials. In addition, students will be writing three policy memos. Students will be asked to think critically \nabout the subject matter and form their own opinions -- this is not a \ncourse with right and wrong answers. Rather, it is designed to provide \nthe information necessary to engage in informed debate about difficult \nissues, think critically, assess tradeoffs, and express your own \nopinions. <br>","suggestedReadings":"","estimatedClassWorkload":"3-4 hours\/week","recommendedBackground":"Completion of 9\/11 &amp; Its Aftermath -- Part I is recommended but not required.<br>&nbsp;<br>This course will require some background understanding of the U.S. constitutional framework, the functions of the different branches of the U.S. government, and some basic understanding of concepts like civil rights and civil liberties. <br>&nbsp;<br>","links":{}}