{
    "id": 445,
    "shortName": "sem",
    "name": "Structural Equation Model and its Applications | 结构方程模型及其应用",
    "language": "zh-cn",
    "shortDescription": "在社会学、心理学、教育学、经济学、管理学、市场学等研究领域的数据分析中，结构方程建模是当前最前沿的统计方法中应用最广、研究最多的一个。它包含了方差分析、回归分析、路径分析和因子分析，弥补了传统回归分析和因子分析的不足，可以分析多因多果的联系、潜变量的关系，还可以处理多水平数据和纵向数据，是非常重要的多元数据分析工具。本课程系统地介绍结构方程模型和LISREL软件的应用，内容包括：结构方程分析（包括验证性因子分析）的基本概念、统计原理、在社会科学研究中的应用、常用模型及其LISREL程序、结果的解释和模型评价。学员应具备基本的统计知识（如：标准差、t-检验、相关系数），理解回归分析和因子分析的概念。 注：本课程配套教材为《结构方程模型及其应用》（以LISREL软件为例）。",
    "aboutTheCourse": "自 1995十多年以来，我已在大陆不同地方，举办近百次大型结构方程研习班。大陆学生勤奋、进取的学习态度，令我甚为感动。不过，中国地域甚为广阔， 就算我到一些偏远地方辦免費班，頗多学生仍难以支付旅费前往参加研习班。为此，我将在香港中文大学内自行制作的网上课程公开，方便学生们用這网上課程及大量的練習去修读。課程內容著重理論的解釋及應用，適合使用LISREL及其他软件者選讀。\n<br><br>Since 1995, I have conducted close to a hundred large-scale structural equation workshops and am moved by Mainland Chinese students’ diligence and eagerness to learn.  However, China is geographically too large.  Even if I conduct free workshops at remote cities, a lot of students still cannot pay for the travel expenses to attend.  Therefore, I am now making publicly available an original web course that is used by our own students. I hope all Chinese students can now enjoy this course with plenty of exercises to monitor their learning. As most of the course content concentrates on the explanation and applications of theories, the course should be useful for students who intend to use LISREL or other software.",
    "targetAudience": 2,
    "courseSyllabus": "<div>Lesson 1 Introduction 简介<\/div><div>Lesson 2 Exploratory vs. Confirmatory Factor Analysis 探索性与验证性因子分析Lesson 3 Basic Concepts 原理<\/div><div>Lesson 4 CFA overview 验证性因子分析(概述)<\/div><div>Lesson 4 CFA in details 验证性因子分析<\/div><div>Lesson 5 Multitrait-Multimethod Model 多质多法模型<\/div><div>Lesson 6 Full Model 全模型<br>Lesson 7 High-Order Factor Analysis 高阶因子分析<\/div><div>Lesson 8 Simplex Model 单纯形模型<\/div><div>Lesson 9 Multiple-Group SEM 多组SEM分析<\/div><div>Lesson 10 Issues in Model Specification and Analysis 结构方程建模和分析步骤<\/div><div>Lesson 11 Issues on Data 涉及数据的问题<\/div><div>Lesson 12 How to Read SPSS.sav into LISREL 读取SPSS数据<\/div>",
    "estimatedClassWorkload": "2-3 hours\/week",
    "recommendedBackground": "<ul><li>讲学语言：普通话及广东话 \/ 简体中文<br><\/li><li><span>这是一个艰深的高阶课程，学员应有下述的知识及训练：(i)&nbsp;使用SPSS, SAS或其他类似软件包；(ii)&nbsp;回归；和(iii)&nbsp;因子分析(探索性因子分析)。<br><\/span><\/li><li>Medium of Instruction:&nbsp;Putonghua \/ Simplified Chinese<\/li><li>As this\nis an extremely difficult and advanced course, you should have knowledge and training\nin: (i) using SPSS, SAS or other similar statistical packages, (ii) regression,\nand (iii) factor analysis (exploratory factor analysis).<br><\/li><\/ul>",
    "links": {

    }
}