{"id":3385,"shortName":"valuationmethods","name":"Valuation: Alternative Methods","language":"en","shortDescription":"This course is a rigorous introduction to alternative methods of valuation and will enable the learner to conduct analysis of most projects and companies. This course will also serve useful to anyone interested in, or required to, critically evaluating project and company analyses conducted by experts. ","aboutTheCourse":"The strength of finance is that it takes a very structured approach to decision-making, with two key building blocks underlying all decisions:&nbsp;time value of money, and risk and return.&nbsp;<span>This\ncourse will integrate the two building blocks (developed in the first two\ncourses offered as part of a Specialization) and we will “put it all\ntogether.” We will also enrich our approach to valuation with important features of the real world to expose the learner to advanced methods of Valuation.<br><br><\/span>This course is the third in a sequence of four courses, followed by a Capstone Project, that comprise a Specialization on Valuation &amp; Investing.&nbsp;<br>","targetAudience":1,"courseSyllabus":"The course is comprised of four modules of content (videos, readings, and assignments) and a typical learner should be able to cover each module in about a week if she devotes 5-10 hours a week. Each module has a rigorous assignment and we provide one week of assimilation time and one week to attempt the final exam. The assimilation time helps learners think through what they have been exposed to and finish the assignments, which is the best preparation for the final exam.&nbsp;&nbsp;<br><br>Module One: &nbsp;We\nwill first introduce a simple valuation approach using an example and highlighting the effects of\nleverage. We will intentionally exclude real world frictions (like taxes) to focus on the main drivers of value.<br><br>Module Two: We will take the highlights of the example introduced in the first module to&nbsp;develop a framework to generalize and help internalize the\nmain drivers of valuation.<br><br>Module Three: &nbsp;In the third module, we\nwill then introduce major frictions, namely taxes and the special treatment of leverage, to\nhighlight effects of the real world on valuation.&nbsp;<br>&nbsp; &nbsp;&nbsp;<br>Module Four: &nbsp;We will wrap up the course by introducing more advanced frameworks of valuation necessitated by\nthe complexities of life and the availability of information, though our main focus will be on the tax code and the\nimplications of potential bankruptcy for valuation.","courseFormat":"The course consists of videos, broken up into bite-size pieces with their lengths varying based on the topic. Almost every video segment will have opportunities for you to assess your knowledge. You are strongly encouraged to take every opportunity to work on the problems\/examples before you view the analysis presented in the videos. There will also be stand-alone assignments for every module and a mandatory final exam. Doing the assignments is the way you will learn the material.","suggestedReadings":"The videos and assignments are meant to be sufficient to get you started and make good progress. Since this is a more advanced course, it is highly recommended that you increasingly access excellent resources available on finance outside the structure of this course. The detailed course syllabus provides many suggested readings and textbooks.","estimatedClassWorkload":"5-10 hours\/week","recommendedBackground":"This is a tough issue. &nbsp;I do not believe in prerequisites, except for a sense of curiosity and an attitude. Having said that, a comfort level with algebra and numbers and an exposure to Accounting and Statistics will help.&nbsp;This course is an advanced course and the third in a sequence of four courses. You will therefore benefit greatly from taking the first two courses of the Specialization. In fact, I hope the class will motivate you to learn more outside the structure of the class. &nbsp;I believe that learning usually happens when you are motivated by a curiosity to understand something.","links":{}}