{"id":3384,"shortName":"riskandreturn","name":"Principles of Valuation: Risk and Return","language":"en","shortDescription":"This course is an introduction risk and return and a study of bonds and stocks. Although introductory, it will enable college students and working professionals to understand and analyze many personal and professional decisions they confront on a daily basis.","aboutTheCourse":"<p>The strength of finance is that it takes a very structured approach to decision-making, with two key building blocks underlying all decisions. In this course we will develop the second building block: risk and return. The main focus in this building block will be on individual\/personal decisions because (a) we learn when we see value to us as individuals and (b) the beauty of finance is that the building blocks of finance are applicable to any decision, personal or corporate.<\/p><p>This course is the second in a sequence of four courses, followed by a Capstone Project that comprise a Specialization on Valuation &amp; Investing.&nbsp;<\/p>","targetAudience":1,"courseSyllabus":"The course is comprised of four modules of content (videos, readings, and assignments) and a typical learner should be able to cover each module in about a week if she devotes 5-10 hours a week. Each module has a rigorous assignment and we provide one week of assimilation time and one week to attempt the final exam. The assimilation time helps learners think through what they have been exposed to and finish the assignments, which is the best preparation for the final exam.&nbsp;&nbsp;<br><br>Module One:&nbsp;\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRisk\nand return is best understood in a real context; we will therefore spend the first module on understanding the most common vehicle of investment: bonds. &nbsp;&nbsp;<br><br>Module Two: The second module will be spent understanding the features and valuation of stocks.<br><br>Module Three:&nbsp;\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWe\nwill then develop a theory of risk based on the intuitive concept of\ndiversification. Since knowledge of Statistics is key to understanding risk, we will\nintroduce some important concepts of applications.<br>\n\n&nbsp; &nbsp;&nbsp;<br>Module Four: We will wrap up the course by introducing one of the most widely known models called CAPM (Capital Asset Pricing Model), which provides a simple and powerful relation between risk and return.&nbsp;<br><br>See <a href=\"https:\/\/d396qusza40orc.cloudfront.net\/riskandreturn\/documents\/pdf\/Course%202%20-%20Syllabus.pdf\" target=\"_blank\">Syllabus<\/a>&nbsp;for more details.","courseFormat":"The course consists of videos, broken up into bite-size pieces with their lengths varying based on the topic. Almost every video segment will have opportunities for you to assess your knowledge. You are strongly encouraged to take every opportunity to work on the problems\/examples before you view the analysis presented in the videos. There will also be stand-alone assignments for every module and a mandatory final exam. Doing the assignments is how you will learn the material.","suggestedReadings":"The videos and assignments are meant to be sufficient to get you started and make good progress. It is highly recommended that you access excellent resources available on finance. The detailed course syllabus provides many suggested readings and textbooks.","estimatedClassWorkload":"5-10 hours\/week","recommendedBackground":"This is a tough issue. &nbsp;I do not believe in prerequisites, except for a sense of curiosity and an attitude. Having said that, a comfort level with algebra and numbers and an understanding of Statistics will clearly help. &nbsp;You will also benefit greatly from taking the first course of the Specialization. I will, however, try and cover everything starting with fundamentals and will highlight when there is a need for you to do some further work in specific subjects. In fact, I hope the class will motivate you to learn more. &nbsp;I believe that learning usually happens when you are motivated by a curiosity to understand something.","links":{}}