{"id":438,"shortName":"distributions","name":"Initiation à la théorie des distributions","language":"fr","shortDescription":"Une fonction discontinue peut-elle être solution d'une équation différentielle? Comment définir rigoureusement la masse de Dirac (une \"fonction\" d'intégrale un, nulle partout sauf en un point) et ses dérivées? Peut-on définir une notion de \"dérivée d'ordre fractionnaire\"?  Cette initiation aux distributions répond à ces questions - et à bien d'autres.","aboutTheCourse":"Dans plusieurs domaines des sciences (physique, mécanique, analyse numérique, etc.) apparaît la nécessité de développer un calcul différentiel \"généralisé\" pour des fonctions peu régulières, par exemple discontinues. La première leçon présente une situation de ce genre. L'objet de ce cours est d'introduire la théorie des distributions qui fournit une réponse élégante à ce problème.<br><br>Dans un premier temps, nous présentons la notion de distribution, généralisant la notion de fonction, et les premières propriétés de ces objets mathématiques. <br><br>On montre ensuite comment certaines opérations bien connues sur les fonctions, en particulier la dérivation, se prolongent naturellement au cadre des distributions. <br><br>Le cours s'achève sur quelques applications à des exemples classiques d'équations aux dérivées partielles linéaires.<br><br>","targetAudience":1,"courseSyllabus":"<div>Semaine 1 :<\/div><div>EDP d'ordre 1 et méthode des caractéristiques<br>L'équation de Hopf<span><br>Fonctions test<br><br><\/span><\/div><div><span>Semaine 2 :<br><\/span>Définition des distributions&nbsp;<br>Dérivation des distributions&nbsp;<span><br><br>Semaine 3 :<br><\/span>Autres opérations sur les distributions<br>Formule des sauts en dimension 1<\/div><div><span>Intégration sur les courbes et les surfaces&nbsp;<br><br>Semaine 4 :<br><\/span>Formule des sauts en dimension &gt;1 et applications&nbsp;<br>Distributions à support compact<span><br>Convolution des distributions par des fonctions régulières&nbsp;<br><br>Semaine 5 :<br><\/span>Régularisation des distributions&nbsp;<br>Convolution des distributions&nbsp;<br>Distributions tempérées&nbsp;<span><br><br>Semaine 6 :<br><\/span><span>Transformation de Fourier sur la classe de Schwartz<br>Transformation de Fourier pour les distributions tempérées<\/span><\/div><div><br><\/div><div><span>Semaine 7 :<br><\/span>Introduction à l'étude des EDP<span><br>Exemples de solutions élémentaires<br>Détermination de quelques solutions élémentaires&nbsp;<br><br>Semaine 8 :<br><\/span>Fonctions harmoniques&nbsp;<br>Equation de Poisson<span><br><br>Semaine 9 :<br><\/span>Problème de Cauchy au sens des distributions<br>Exemples d'EDP d'évolution d'ordre 1<span><br>Un exemple d'EDP d'évolution d'ordre 2&nbsp;<\/span><\/div>","courseFormat":"","suggestedReadings":"","instructor":"François  Golse and Yvan Martel","estimatedClassWorkload":"3-5 hours\/week","recommendedBackground":"Calcul différentiel à plusieurs variables.<br>Notions élémentaires de topologie.<br>Connaissance de l'intégrale de Lebesgue.<br>","links":{}}