{"id":2183,"shortName":"histcontabilidade","name":"História da Contabilidade","language":"pt-br","shortDescription":"Este curso visa analisar a relação entre a Contabilidade e a sociedade através do tempo e oferecer um contexto para o conteúdo técnico que os estudantes costumam aprender em cursos de graduação, apresentando as situações em que se desenvolveram conceitos utilizados atualmente na Contabilidade. ","aboutTheCourse":"<div>O curso é desenhado para auxiliar estudantes com pouco ou nenhum conhecimento em História da Contabilidade e que tenham interesse em aprender sobre momentos importantes e cruciais na História da Contabilidade e seu papel na sociedade. O curso também é destinado a professores de Contabilidade Introdutória que desejem complementar o currículo inicial de seus estudantes com este conteúdo.<br><br>Ao desenvolver uma visão crítica sobre a relação entre a contabilidade e a sociedade através do tempo, os estudantes serão estimulados a exercitar habilidades cognitivas de compreensão de fatos históricos relacionados à área contábil, e de análise das práticas atuais à luz de acontecimentos passados. Também serão encorajados a avaliar criticamente convenções contábeis atuais.&nbsp;<\/div><div><br><\/div>","targetAudience":0,"courseSyllabus":"<p><b>SEMANA 1:&nbsp;<\/b><b>“Introdução à História da Contabilidade”<\/b><\/p><p><\/p><p><\/p><p><\/p><p><\/p><p><span>Na sessão inicial participantes serão apoiados para construção de contexto com a ambientação na Mesopotâmia (características, contribuição e contabilidade). Discussão sobre práticas administrativas em Uruk (3500 a 2900 a.C.) será estabelecida pelo Prof. Grof (convidado). Aspectos de troca, estoque e empréstimo serão objeto de reflexão. Por fim, participantes serão convidados a jogar a primeira fase do DEBORAH Game, atuando como um escriba na Mesopotâmia. Na&nbsp;segunda&nbsp;parte desta sessão, os estudantes serão levados à reflexão sobre os sete elementos apontados por Littleton como antecedentes das partidas dobradas. Ainda nesta sessão, teremos a participação especial do Prof. Schmidt (autor de tese pioneira sobre História da Contabilidade aqui no Brasil). Haverá indicação de leituras opcionais para a complementação dos estudos.<\/span><\/p><p><\/p><p><\/p><p><\/p><p><b>SEMANA 2:<\/b>&nbsp;<b>“Sistema de Contabilização por Carga e Descarga”<\/b><br><\/p><p><\/p><p><\/p><p><\/p><p><\/p><p>Na sessão, será apresentado o método de Carga e Descarga, pouco conhecido entre os próprios contadores. As professoras Rodrigues e Gomes (Universidade do Minho - Portugal) farão participação especial compartilhando seus conhecimentos a respeito do tema, notadamente o sistema, suas características e regiões em que foi utilizado. Participantes serão convidados a jogar outro míni-jogo do DEBORAH Game, com base em contabilidade por Carga e Descarga, que se passa em um monastério feminino português do final do século XVIII e início do XIX. O Professor Oliveira (Universidade do Porto - Portugal) participará como convidado destacando aspectos da ligação histórica entre Contabilidade e Religião. Exemplos serão apresentados sobre este método. Materiais de apoio e leitura serão indicados para complementar estudos.<\/p><p><\/p><p><\/p><p><\/p><p><b>SEMANA 3:&nbsp;<\/b><b>“As Partidas Dobradas (Pré-Pacioli)”<\/b><br><\/p><p><\/p><p><\/p><p><\/p><p><\/p><p><span>Na terceira sessão, sistemas alternativos às partidas dobradas serão discutidos. Aspectos sobre o desenvolvimento das partidas dobradas na Roma Antiga e no Antigo Egito serão expostos. Também será abordado o seu desenvolvimento em outras regiões, como Itália no período renascentista, China, além de comentários sobre a Índia. Reflexão sobre os Templários será feita. Tendo por base o artigo de Littleton (1927) –&nbsp;<i>The antecedents of double-entry<\/i>&nbsp;– serão retomados os sete elementos necessários para o surgimento das partidas dobradas. Participantes irão jogar o míni-jogo do DEBORAH Game ambientado em Florença do século XIV, em que o objetivo do jogador é explorar o cenário da época tentando localizar os sete elementos mencionados no texto de Littleton. Será abordado desenvolvimento da contabilidade nas cidades italianas de Milão, Gênova e Florença, assim como referência a Luca Pacioli e a&nbsp;<i>Summa de Arithmetica, Geometria, Proportioni et Propornalità.<\/i>&nbsp;Materiais de apoio e leitura serão indicados para complementar os estudos.<\/span><\/p><p><\/p><p><b>SEMANA 4:&nbsp;<\/b><b>“Luca Pacioli e a&nbsp;<i>Summa de Arithmetica, Geometria, Proportioni et Propornalità”<\/i><\/b><br><\/p><p><\/p><p><\/p><p><\/p><p><\/p><p><span>Na&nbsp;quarta&nbsp;sessão do curso, atenção será dada a Luca Pacioli e a&nbsp;<i>Summa de Arithmetica, Geometria, Proportioni et Propornalità.&nbsp;<\/i>Será estabelecida reflexão sobre como o registro da descrição do sistema contábil por partidas dobradas em um livro possibilitou a padronização de um modelo passível de ser reproduzido em vários países, colaborando para sua adoção por toda a Europa, até o século XIX. Será apresentado também tópico sobre as escolas de comércio em Portugal pela Prof.ª Rodrigues (Universidade do Minho - Portugal). A Professora Vasconcelos (Doutoranda - FEA-USP) irá compartilhar o caso das Companhias Pombalinas e seu papel na disseminação das partidas dobradas no Brasil. Materiais de apoio e leitura serão indicados para complementar estudos.<\/span><\/p><p><\/p><p><\/p><p><b>SEMANA 5:&nbsp;<\/b><b>“Contabilidade Contemporânea<i>”<\/i><\/b><br><\/p><p><\/p><p><\/p><p><\/p><p><\/p><p><\/p><p><span>A&nbsp;quinta&nbsp;sessão versará sobre a Contabilidade no mundo contemporâneo. Reflexões sobre a evolução do papel da contabilidade na sociedade, com ênfase para informação contábil, decisões, regulação, auditoria, riscos e consequências desejadas e indesejadas do estágio atual de desenvolvimento. Será disponibilizada aos participantes o míni-jogo do DEBORAH Game que aborda o papel do contador na sociedade, ambientado na Austrália, e desenvolvido com base no artigo de Hines (1988) –&nbsp;<i>Financial accounting: In communicating reality, we construct reality<\/i>. Materiais de apoio e leitura serão indicados para complementar estudos.<\/span><\/p>","courseFormat":"<div>O curso de História da Contabilidade é composto por 5 sessões semanais de cerca de duas horas. Cada sessão inclui uma série de vídeos curtos (7 minutos, em média), em que os professores farão a exposição do conteúdo, contando com convidados de universidades de outros países. Recursos didáticos adicionais serão disponibilizados para os estudantes, assim como indicação de outras fontes de informação.&nbsp;<\/div><div><br><\/div>","suggestedReadings":"","estimatedClassWorkload":"3-4 hours\/week","recommendedBackground":"Não é necessário conhecimento prévio da área. O curso está aberto a todos os interessados.","links":{}}