{"id":1354,"shortName":"pythonlearn","name":"Programming for Everybody (Python)","language":"en","shortDescription":"This course aims to teach everyone to learn the basics of programming computers using Python. The course has no pre-requisites and avoids all but the simplest mathematics. Anyone with moderate computer experience should be able to master the materials in this course.","aboutTheCourse":"This course is specifically designed to be a first programming course using the popular Python programming language. The pace of the course is designed to lead to mastery of each of the topics in the class. We will use simple data analysis as the programming exercises through the course. Understanding how to process data is valuable for everyone regardless of your career. This course might kindle an interest in more advanced programming courses or courses in web design and development or just provide skills when you are faced with a bunch of data that you need to analyze.&nbsp;You can do the programming assignments for the class using a web browser or using your personal computer. All required software for the course is free.&nbsp;","targetAudience":0,"courseSyllabus":"Week One: Introduction - Why we program?<br>Week Two: Variables and Expressions<br>Week Three: Conditional code<br>Week Four: Functions<br>Week Five: Loops and Iteration<br>Week Six: Strings<br>Week Seven: Files<br>Week Eight: Lists<br>Week Nine: Dictionaries<br>Week Ten: Tuples<br>Optional Topic: Regular Expressions<br><br><br>","courseFormat":"Each week there will be about an hour of lecture material. The ten weeks of the course match the first ten chapters of the book - we cover one chapter per week. Each week there will be some combination of a quiz, programming assignment, and\/or an optional extra credit assignment.&nbsp;","suggestedReadings":"The textbook is titled <a href=\"http:\/\/www.pythonlearn.com\/book.php\" target=\"_blank\" title=\"Link: http:\/\/www.pythonlearn.com\/book.php\">Python for Informatics: Exploring Information<\/a>. The book is free to download in all major electronic formats including: PDF, EPUB, MOBI, HTML, and Apple's iBooks. The free iBooks version of the book contains enhanced video materials and exercises built into the book. You can purchase a <a href=\"http:\/\/www.amazon.com\/gp\/product\/1492339245\/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=1492339245&amp;linkCode=as2&amp;tag=drchu02-20\" target=\"_blank\" title=\"Link: http:\/\/www.amazon.com\/gp\/product\/1492339245\/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=1492339245&amp;linkCode=as2&amp;tag=drchu02-20\">printed copy of the book<\/a> from Amazon for $8.99. It is not necessary to purchase the printed book. All of the book materials are&nbsp;available under a <a href=\"http:\/\/creativecommons.org\/licenses\/by-nc\/3.0\/\" target=\"_blank\"><img src=\"http:\/\/i.creativecommons.org\/l\/by-nc\/3.0\/88x31.png\" style=\"float:right\" alt=\"Creative Commons License\"><\/a> Creative Commons Attribution-NonCommercial 3.0 Unported License.","estimatedClassWorkload":"2-4 hours\/week","recommendedBackground":"There are no pre-requisites for this course. We avoid any advanced mathematics. You can do the entire class using a web browser. If you are going to do the programming exercises on your own computer (optional), you should know how to download and install software and be able to make folders and organize files on your computer. We will have detailed instructional videos for both Windows and Macintosh computers for all software installation and file management tasks for those who want to do software development on their computers. All required software for this class is free.","links":{}}