{"id":1180,"shortName":"pregnancychildbirth","name":"Childbirth: A Global Perspective","language":"en","shortDescription":"This course will review challenges for maternal and newborn health in the developing world, where a great many women and babies are suffering from complications during pregnancy, childbirth, and the days following birth. Themes covered include the epidemiology of maternal and newborn mortality and morbidity, relevant issues for the global health workforce, community-based interventions to improve maternal and newborn health and survival, and sociocultural dynamics surrounding birth.","aboutTheCourse":"<p>This course provides a broad\noverview of maternal and newborn health issues facing low-income and\ntransitional countries, where more than 2.6 million babies are stillborn and\nnearly 500,000 women die during childbirth or from pregnancy-related\ncomplications each year. In the developing world, many women deliver at home\nwithout a skilled care provider, drugs, or technological supports. Maternal and\nnewborn survival can be improved by mobilizing communities and improving access\nto skilled care.<\/p><p>&nbsp;Through lectures, case studies\nand readings, course participants will learn about delivery challenges for\nmaternal and newborn health services and how to utilize community-based\nstrategies to improve the health and survival of mothers and babies.<\/p>","targetAudience":0,"courseSyllabus":"<p><b>Week One:&nbsp;<\/b><b>Introduction to Maternal Mortality and Morbidity in the\nGlobal Context<\/b><\/p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p><p>Child\nmortality has decreased rapidly in recent decades, while maternal mortality has\ndeclined at a much slower pace; in some places, little improvement has been\nmade at all. In this module, we’ll explore the scope of the maternal health\ncrisis, the timing and major physiological causes of death and disability and the\ninequalities and inequities between and within countries.<\/p>\n\n\n\n<p><b>Week Two:&nbsp;<\/b><b>Introduction to Maternal Mortality and Morbidity in the\nUS Context<\/b><\/p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p><p>While\nmaternal in the United States is relatively low compared with that in the\ndeveloping countries, it is much higher than it should be. In this module,\nwe’ll explore the scope of the maternal mortality and morbidity in the United\nStates, the inequalities and inequities between and within subpopulations of\nthe country. <\/p>\n\n\n\n<p><b>Week Three:&nbsp;<\/b><b>The Impact\nof the Health Care Workforce Shortage on Maternal and Newborn Care<\/b><\/p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p><p>The global health care\nworkforce shortage is leading to understaffed hospitals and shuttered health\nclinics across the world. Because of this dangerous shortage, patients are left without the\ncritical care they need for survival. This shortage is exceptionally acute in\ndeveloping countries such as Sub-Saharan Africa, which carries nearly 25% of\nthe world’s disease burden but only 3% of the world’s health care workforce.\nThis module will cover strategies to alleviate the shortage and maldistribution\nof the health care workforce in developing countries—particularly among nurses,\nmidwives, and other skilled providers of maternal and newborn care. <\/p>\n\n\n\n<p><b>Week Four:&nbsp;<\/b><b>Emergency Obstetric Care: Health Facility Services\nthat Support Maternal Health and Survival<\/b><\/p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<\/p><p>In\nconjunction with increasing the global maternal health workforce, health\nsystems must be strengthened to enable the provision of life-saving\ninterventions that cannot be delivered at the community level. The primary\nmeans of achieving this goal is through the implementation of emergency\nobstetric care (EmOC) in health facilities. The main objectives of this lecture\nare to: review the rationale for EmOC, identify its “signal functions,”\nunderstand the United Nations process indicators for monitoring EmOC, describe\nmonitoring and quality improvement approaches, and recognize key challenges to\neffective implementation of EmOC in developing country contexts.<\/p>\n\n\n\n<p><b>Week Five:&nbsp;<\/b><b>Improving\nMaternal and Newborn Care through Community-Based Interventions<\/b><\/p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><span>Community mobilization is a promising strategy for\nimproving access to\/use of maternal and newborn health services. This module provides\nan understanding of how delivery of maternal and newborn care might be improved\nthrough community-based interventions that effectively include and engage the\ncommunity in identifying and implementing sustainable solutions.&nbsp;<b><\/b><\/span><\/p><p><b>Week Six:&nbsp;<\/b><b>Case Study\nin Ethiopia: Educating the Community and Training Front-Line Community Health\nWorkers to Deliver Maternal and Newborn Care<\/b><\/p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In Ethiopia about 90% of births occur at home, and\nan estimated 22,000 women and 100,000 newborns die annually from childbirth-related\ncomplications. This module describes a project\nthat uses an innovative community-based strategy to ensure that more women and\nnewborns in this country receive effective and timely care. The Maternal and\nNewborn Health in Ethiopia Partnership (MaNHEP) educates pregnant women and families\non safe birth and postnatal care practices, and trains frontline health workers\nto deliver a basic package of life-saving maternal and newborn care that can\nsignificantly improve health and survival (including referral to higher levels\nof the health care system).&nbsp;<\/p>","courseFormat":"","suggestedReadings":"","estimatedClassWorkload":"2-4 hours\/week","recommendedBackground":"","links":{}}