{
    "id": 1143,
    "shortName": "introse",
    "name": "Introduction to Systems Engineering",
    "language": "en",
    "shortDescription": "Learn how the discipline of systems engineering can lead to the successful development of complex systems.",
    "aboutTheCourse": "Systems engineering is an interdisciplinary approach to design, implementation and evaluation that holds the key to the successful development of complex human-made systems. This course explores a framework encapsulating the entire systems engineering discipline, clearly showing where the multitude of associated activities fits within the overall effort and how the activities relate to one another.&nbsp; Systems engineering is a very broad discipline, so we also discuss how the concepts and procedures could be applied to individual projects. A new theme will be explored each week using presentations to introduce and synthesise key concepts, examples to simulate authentic contexts, and structured activities to guide your learning. <br><br>The course is relevant to all professions associated with the introduction of complex human-made systems: project managers, engineers, quality assurance representatives, integrated logistic support practitioners, operators, managers, maintainers, and so on, from students to professionals, from novices to experienced practitioners, from technical to non-technical people. <br><br>",
    "targetAudience": 1,
    "courseSyllabus": "<b>Week One: <\/b>We begin by addressing the nature of systems and the concept of a system life cycle.<br><br><b>Week Two:<\/b> We describe the discipline of systems engineering and outline its relevance and benefits.<br><br><b>Week Three: <\/b>We examine the needs and requirements views developed by business management, business operations, and systems designers.<br><br><b>Week Four:<\/b> We explore requirements engineering and the processes by which requirements are elicited and defined formally.<br><br><b>Week Five:<\/b> We examine Conceptual Design, in which we define business needs and requirements as well as stakeholder needs and requirements.<br><br><b>Week Six:<\/b>&nbsp;We investigate Preliminary Design, in which logical design is translated into physical design and detailed design.<br><br><b>Week Seven:<\/b> We investigate Construction, Production (in which we complete the design of individual system elements that are then constructed\/produced), Utilisation and Disposal of the system.<br><br><b>Week Eight:<\/b> We discuss the need for control and balance in the management of systems engineering activities, and we identify the relationship between systems engineering and the related disciplines of project management, software engineering, and integrated logistic support.<br><br><b>Week Nine:<\/b>&nbsp;Course wrap-up.<br>",
    "estimatedClassWorkload": "4-5 hours\/week",
    "recommendedBackground": "<p>No particular background is required. All are welcome.<\/p>",
    "links": {}
}