{"id":655,"shortName":"cooperativelearning","name":"Engaging Students through Cooperative Learning","language":"en","shortDescription":"Founded in more than 25 years of research, this course will engage students in various forms of cooperative learning including STAD (Student-Teams Achievement-Divisions) which continues to empower students to work together to improve their understanding of mathematics concepts through a collaborative learning approach.","aboutTheCourse":"<p>Some of the\nmost powerful and widely applicable research-proven instructional practices are\nthose of cooperative learning, which are highly effective in engaging and\nmotivating students. When implemented correctly, such practices have been\nproven to increase students’ achievement in a wide range of content areas at\nall grade levels. Cooperative learning models will be explored to understand\nthe variables that differentiate group work from true cooperative learning,\nincluding individual accountability and group rewards. The effectiveness of\nstudent teams to support learning through peer motivation, peer assessment and\nreteaching will be examined in depth.<\/p>\n\n<p><b>Course Objectives<\/b><\/p><p><\/p><ul><li>Define the concept of cooperative learning and how it relates to\ntoday’s learner.<br><\/li><li>Describe how cooperative learning works when there is individual\naccountability, equal opportunities for success and team recognition built into\na task.<br><\/li><li>Describe the four theoretical perspectives of cooperative\nlearning.<br><\/li><li>Consider the impact of cooperative learning on 21st\ncentury skills and meeting the cognitive demands of the Common Core State\nStandards.<br><\/li><\/ul><p><\/p>","courseSyllabus":"<p><b>Week 1:<\/b> Learn about\nvarious models of cooperative learning and their relevance in today’s classroom.\nUnderstand how they can help meet the needs of all students when three central\nconcepts are present (individual accountability, equal opportunities for\nsuccess, and team recognition).<\/p><p><b>Week 2:<\/b> Explore the four theoretical\nperspectives of cooperative on the achievement effects of cooperative learning:\nmotivationalist, social cohesion, cognitive-developmental, and cognitive elaboration,\nas identified by Dr. Robert Slavin at the Johns Hopkins University.<\/p><p><b>Week 3:<\/b> Identify the\npotential impact of cooperative learning on meeting the needs of the 21st\ncentury learning and how it can help students meet the cognitive demands of the\nCommon Core State Standards.&nbsp;<\/p>","courseFormat":"<p>This course provides a brief introduction to cooperative learning\nand how it can be used effectively in the classroom to create a\nstudent-centered classroom. Participants will leave with real strategies that\ncan be utilized in their classroom to engage, empower and motivate students as\nthey strive for their personal best.&nbsp;<\/p>","suggestedReadings":"Dr. Robert Slavin’s book, <a href=\"http:\/\/chggtrx.com\/click.track?CID=267582&AFID=301076&ADID=1088031&SID=cooperativelearning&isbn_ean=9780137034352\" title=\"Link: http:\/\/www.amazon.com\/Educational-Psychology-Theory-Practice-Edition\/dp\/0137034350\/ref=dp_ob_title_bk\/184-8284297-9907910\">Educational\nPsychology: Theory and Practice (10th Edition)<\/a>","estimatedClassWorkload":"3-5 hours\/week","recommendedBackground":"<p>Participants should have an understanding of group work and how it\ncan have a positive effect of students’ interactions and academic achievement.<\/p>","links":{}}