{"id":755,"shortName":"nanosensors","name":"Nanotechnology and Nanosensors","language":"en","shortDescription":"Learn about novel sensing tools that make use of nanotechnology to screen, detect and monitor various events in personal or professional life. Together, we will lay the groundwork for infinite innovative applications, starting from diagnosis and treatments of diseases, continuing with quality control of goods and environmental aspects, and ending with monitoring security issues. ","aboutTheCourse":"<p>Nanotechnology and nanosensors are broad, interdisciplinary areas\nthat encompass (bio)chemistry, physics, biology, materials science, electrical\nengineering and more. The present course will provide a survey on some of the\nfundamental principles behind nanotechnology and nanomaterials and their vital\nrole in novel sensing properties and applications. The course will discuss interesting interdisciplinary\nscientific and engineering knowledge at the nanoscale to understand fundamental\nphysical differences at the nanosensors. By the end of the course, students\nwill understand the fabrication, characterization, and manipulation of\nnanomaterials, nanosensors, and how they can be exploited for new applications.\nAlso, students will apply their knowledge of nanotechnology and nanosensors to\na topic of personal interest in this course.<\/p>","targetAudience":0,"courseSyllabus":"<p><b>Week 1: Introduction to Nanotechnology:<\/b>\nDefinition of nanotechnology; main features of nanomaterials; types of\nnanostructures (0D, 1D, and 2D structures); nanocomposites; and main\nchemical\/physical\/electrical\/optical properties of nanomaterials.<\/p>\n\n<p><b>Week 2: Introduction to Nanotechnology - continue:<\/b>\nMethods for characterizing the nanomaterials: Atomic Force Microscopy (AFM),\nScanning Electron Microscopy (SEM), Transmission Electron Microscopy (TEM), and\nspectroscopy- and spectrometry-based surface analysis techniques. Fabrication\nof sensors by bottom-up and top-down approaches; self-assembly of\nnanostructures; and examples for nanotechnology application<\/p>\n\n<p><b>Week 3: Introduction to Sensors' Science and Technology:<\/b>\nDefinition of sensors; main elements of sensors; similarities between living\norganisms and artificial sensors; working mechanism of physical sensation\n(seeing, hearing, and feeling) and chemical sensation (smelling and tasting); the\nparameters used for characterizing the performance of sensors: accuracy,\nprecision, sensitivity, detection limit, dynamic range, selectivity, linearity,\nresolution, response time, hysteresis, and life cycle.<\/p>\n\n<p><b>Week 4: Metal nanoparticle-based Sensors:<\/b>\nDefinition of nanoparticle; features of nanoparticles; and production of\nnanoparticles by physical approach (laser ablation) and chemical approaches\n(Brust method, seed-mediated growth, etc.).<\/p>\n\n<p><b>Week 5: Quantum Dot Sensors: <\/b>Definition of\nquantum dot; fabrication techniques of quantum dots; Macroscopic and\nmicroscopic photoluminescence measurements; applications of quantum dots as\nmultimodal contrast agents in bioimaging; and application of quantum dots as\nbiosensors.<\/p>\n\n<p><b>Week 6:<\/b><span> <b>Nanowire-based Sensors:<\/b> Definition of nanowires; features\nof nanowires; fabrication of individual nanowire by top-down approaches and\nbottom-up approaches; and fabrication of nanowire arrays (fluidic channel,\nblown bubble film, contact printing, spray coating, etc.).<\/span><\/p>\n\n<p><b>Week 7:<\/b><span> <b>Carbon Nanotubes-based Sensors:<\/b> Definition of carbon\nnanotube; features of carbon nanotubes; synthesis of carbon nanotubes;\nfabrication and working principles of sensors based on individual carbon\nnanotube; fabrication and working principles of sensors based on random array\nof carbon nanotubes.<\/span><\/p>\n\n<p><b>Week 8: Sensors Based on Nanostructures of Metal Oxide: <\/b>Synthesis\nof metal oxide structures by dry and wet methods; types of metal oxide gas\nsensors (0D, 1D, and 2D); defect chemistry of the metal oxide sensors; sensing\nmechanism of metal-oxide gas sensors; and porous metal-oxide structures for\nimproved sensing applications. <\/p>\n\n<p><b>Week 9: Mass-Sensitive Nanosensors<\/b>: Working\nprinciple of sensors based on polymeric nanostructures; sensing mechanism and\napplications of nanomaterial-based of chemiresistors and field effect\ntransistors of (semi-)conductive polymers, w\/o inorganic materials.<\/p>\n\n<p><b>Week 10: Arrays of Nanomaterial-based Sensors: <\/b>A\nrepresentative example for the imitation of human senses by means of nanotechnology\nand nanosensors: electronic skin based on nanotechnology.<\/p>","courseFormat":"<p>This course will have three types of graded\nactivities that will be included in your overall course grade. These include:<\/p>\n\n<p><b>Weekly Quizzes:&nbsp;<\/b>You will be asked to answer ten weekly quizzes that account for 30% of the course total grade (3 points for each quiz). Each quiz includes 7 to 13 multiple choice questions that examines your understanding of the learning materials. You may take each quiz up to three times, and you will receive credit for the highest of the three scores. The regular Due date for taking a weekly quiz will be 12:00 PM (Pacific Time) on the Monday following that week’s video assignments. For example, Due date for the Week 1 quiz will be the Monday of Week 2. You may take the quiz for one week following this Due date (though still only three times total), but there will be a 10% penalty applied. The purpose of the penalty is to encourage you not to fall too far behind in the assignments.<\/p><p>Each Quiz includes three important dates: Opening time, Due date (for full credit), and Hard deadline (10% penalty). The exact dates are posted in the 'Schedule' section. It is important to keep track of these dates.<\/p><p><b>Open-ended Questions:<\/b>&nbsp;You will be asked to answer two open-ended questions that account for 20% of the course total grade . The questions encourage creative thinking, and their answers are based on the knowledge you gained in the course, as well as, on your own imagination and experience. The questions will be presented in Weeks &nbsp;4 and 7. Providing thorough answers to the open-ended questions will help you generate innovative ideas for your final project. Your&nbsp;will write your answers&nbsp;in a textbox, limited to 500. You can also write your answers on a document and attach it. You are welcome to explain your ideas via drawings, photos, and\/or a short video of up to 1.5 minute (as a link). The deadline for submitting your answers will be 12:00 PM (Pacific Time)on Friday , two weeks after the question was first opened. For example, the Week 4 open-ended question will be due on Friday of Week 6. The exact dates for submission will be announced during the course; late submissions will not be counted.<\/p><p>Since this is a peer graded task, your answers will be graded by peers, according to a grading rubric.&nbsp;After submitting your own answer, you will be asked to read and grade&nbsp;four&nbsp;<b>&nbsp;<\/b>answers of your peers.<\/p><p>The grading task includes two stages: a. ranking each evaluation category according to the grading rubric, b. providing written comments in the Overall Evaluation textbox. The written comments should include at least 1 paragraph of information for each evaluation category. They should be critical as well as positive. If you give low ratings, you need to explain to your peer how s\/he can improve their ideas. It is always good practice to refer to the lecture contents when you are making critical comments.<\/p><p>Each open-ended question task includes three important dates: Opening time, Submission deadline, and Evaluation&nbsp;deadline. The exact dates are posted in the 'Schedule' section. It is important to keep track of these dates.<\/p><p>Grades for the open-ended questions task will be assigned to you only after you review the work of your peers and submit your comments.s.<br><\/p>\n\n<p><b>Final project:<\/b><span> At the end of the course you will be asked to\ncomplete a final project. The final project will be conducted in groups of\n3-to4 students. It will consist of a written report that focuses on the\nutilization of nanotechnology and nanosensors to imitate a specific sense that\nrelates to <b>human senses: <\/b>vision, hearing, taste<\/span><span>,\nsmell, or touch. Other non-specific senses such as balance and pains can be\nincluded as well. <i><\/i><\/span><\/p>\n\n<p><span>The final project should include, but not\nconfined to: <b>(a)<\/b> multidisciplinary presentation and discussion of the\noverall design approach; <b>(b)<\/b> fabrication; <b>(c)<\/b> characterization;\nand <b>(d)<\/b> application of the targeted artificial sense.<i> <\/i>The report\nshall NOT exceed 10 pages, written in 11-12 font size, 1.5 line spacing, and\n2.5 cm margins from each side of the document. The final project will be graded\nby your peers, according to a grading rubric, accounting for <i>50% of your\noverall course grade.<\/i><\/span><\/p>","suggestedReadings":"<p>The lectures are designed to be self-contained. For additional information, you are welcome (but do not require) to refer to:<\/p><p>Jiří Janata, <a href=\"http:\/\/www.amazon.com\/Principles-Chemical-Sensors-Jiri-Janata\/dp\/0387699309\/ref=sr_1_fkmr0_1?s=books&ie=UTF8&qid=1371400243&sr=1-1-fkmr0&keywords=Ji%C5%99%C3%AD+Janata%2C+Principles+of+Chemical+Sensors%2C+Springer%2C+2d+Edition+%281989%29.#_\" target=\"_blank\">Principles of Chemical\nSensors, Springer<\/a>, 2d Edition (1989).<\/p>\n\n<p>Roger George Jackson, Novel Sensors\nand Sensing, CRC Press (2004).<\/p><p>Florinel-Gabriel Banica, <a href=\"http:\/\/www.amazon.com\/Chemical-Sensors-Biosensors-Fundamentals-Applications\/dp\/0470710675\/ref=sr_1_1?ie=UTF8&qid=1371359802&sr=8-1&keywords=chemical+sensors# \" target=\"_blank\">Chemical\nSensors and Biosensors<\/a>: Fundamentals and Applications, John\nWiley and Sons (2012).<\/p><p>\n\n<\/p><p>Ramsden Jeremy, <a href=\"http:\/\/www.amazon.com\/Nanotechnology-Introduction-Micro-Nano-Technologies\/dp\/0080964478\/ref=sr_1_6?s=books&ie=UTF8&qid=1371360275&sr=1-6&keywords=introduction+to+nanotechnology#\" target=\"_blank\">Nanotechnology,\nan Introduction<\/a>. Elsevier (2011).<\/p>","estimatedClassWorkload":"6-10 hours\/week","recommendedBackground":"<p>Any\nbackground is science (chemistry, biology, physics), technology and\/or engineering would fit the course.<\/p>","links":{}}