{"id":2925,"shortName":"magicmiddleages","name":"Magic in the Middle Ages","language":"en","shortDescription":"Want to learn about magic in the Middle Ages? Witches, heretics, inquisitors, the Holy Grail, alchemy, relics and much more are waiting for you in this course!","aboutTheCourse":"<p dir=\"ltr\">Magical thought has always attracted human imagination. In this course we will introduce you to the Middle Ages through a wide conception of magic. Students will have an approach to medieval culture, beliefs and practices from the perspective of different areas of knowledge (History, Literature, Art History and History of Science). Popular magic, as well as magie savante (alchemy, geomancy and necromancy) will be addressed and we will also deal with artistic manifestations, such as relics, art objects, the Saint Grail and Arthurian literature. Magic in the Middle Ages offers a captivating overview of medieval society and promotes reflection about certain stereotypes associated with this period.<\/p><p dir=\"ltr\"><br><\/p><br>","targetAudience":1,"courseSyllabus":"<span><p dir=\"ltr\"><strong>Week 1.<\/strong> <em>Introduction to medieval magic <\/em>(Pau Castell).<\/p><p dir=\"ltr\"><strong>Week 2. <\/strong><em>Magic &amp; Heresy<\/em> (Delfi I. Nieto-Isabel).<\/p><p dir=\"ltr\"><strong>Week 3.<\/strong> <em>From Magic to Witchcraft<\/em> (Pau Castell).<\/p><p dir=\"ltr\"><strong>Week 4.<\/strong> <em>Magic in Islam<\/em> (Godefroid de Callataÿ and Sébastien Moureau).<\/p><p dir=\"ltr\"><strong>Week 5.<\/strong> <em>The Magical World of Celtic Culture<\/em> (Gemma Pellissa Prades).<\/p><p dir=\"ltr\"><strong>Week 6. <\/strong><em>The Magic of Objects<\/em> (Noemi Álvarez da Silva).<\/p><\/span>","courseFormat":"Each module contains from five to six videos about its main topic. The videos last 7 minutes approximately and you will be asked to answer a test at the end of each video. There are also scheduled activities in the forum as well as complementary materials. There is a short and straightforward peer-to-peer assignment in unit 5, which we strongly encourage you to take as an opportunity to reflect about Arthurian literature and to exchange your opinion with your peers.","suggestedReadings":"There is only one required reading, <em>The Knight of the Cart<\/em> or <em>Lancelot<\/em> by Chrétien de Troyes. You can read it in any language. Optional bibliography will be provided in each unit of the course to enhance your experience.","estimatedClassWorkload":"2-3 hours\/week","recommendedBackground":"There are no pre-requirements for taking this course. You are welcome to join us!","links":{}}