{
    "id": 1675,
    "shortName": "corpfinance",
    "name": "Corporate Finance Essentials",
    "language": "en",
    "shortDescription": "Corporate Finance Essentials will enable you to understand key financial issues related to companies, investors, and the interaction between them in the capital markets. By the end of this course you should be able to understand most of what you read in the financial press and use the essential financial vocabulary of companies and finance professionals.",
    "aboutTheCourse": "<p>This course explores several key&nbsp;issues related to companies, investors, and the interaction between them in the capital markets. As an illustration of the questions we will raise (and hopefully answer) during the course, consider the following:<\/p>\n<div><ul>\n<li>What are mean returns, volatility, and beta? These essential concepts, widely used in the financial press, are the very first step in your journey into the financial world. We will discuss them in our first session, <strong>Risk and Return.<\/strong><\/li><\/ul><ul><li>What is a correlation? How is correlation related to diversification? Why is diversification at the heart of portfolio construction? This is a critical issue for investors and portfolio managers, and you simply cannot build a proper portfolio if you ignore them. We will discuss these and related issues in our second session, <strong>Correlation and Diversification.<\/strong><\/li><br>\n<li>How does a company estimate the required return on its debt? And the required return on its equity? And, ultimately, its cost of capital? What is the usefulness of these concepts? We will discuss these and related issues in our third session, <strong>The CAPM and the Cost of Capital.<\/strong><\/li><\/ul><ul>\n<li>Understanding the cost of capital and its components is essential, but can you put theory into practice? Can you estimate the cost of capital for a specific company? You can and we will discuss how in our fourth session, <strong>Estimating the Cost of Capital – An Application.<\/strong><\/li><\/ul><ul>\n<li>How do companies separate the projects on which they should invest from those on which they should not? What are the essential tools for this task? We will discuss them, and apply them to a specific project, in our fifth session, <strong>Project Evaluation.<\/strong><\/li><\/ul><ul>\n<li>How does a company assess whether it is creating or destroying shareholder value? What is the relationship between tools to measure value creation and managerial compensation? We will discuss these and related issues in our sixth and last session, <strong>Corporate Value Creation.<\/strong><\/li>\n<\/ul><\/div>",
    "targetAudience": 3,
    "courseSyllabus": "<p><strong>1. Risk and Return<\/strong><\/p>\n<p>In this session we will discuss some basic but essential financial concepts such as mean return, volatility, and beta. We will also apply them to assess the performance of some equity markets over the last few years.<\/p>\n<p><strong>2. Diversification and Correlation<\/strong><\/p>\n<p>In this session we will discuss correlation, another essential financial tool, and its relationship to diversification, one of the bedrocks of modern finance. We will also apply them and assess the benefits of combining two specific equity markets into a portfolio.<\/p>\n<p><strong>3. The CAPM and the Cost of Capital<\/strong><\/p>\n<p>In this session we will discuss how companies assess their cost of debt, their cost of equity, and ultimately their cost of capital. We will also discuss why this last concept is at the heart of many of the most important corporate decisions.<\/p>\n<p><strong>4. Estimating the Cost of Capital – An Application<\/strong><\/p>\n<p>In this session we will put to work all the concepts discussed in the previous session \nby estimating the cost of capital of a company. As usual, when putting theory into practice a few complications arise and we will discuss how to deal with them.<\/p>\n<p><strong>5. Project Evaluation<\/strong><\/p>\n<p>In this session we will discuss how companies routinely decide whether or not to engage in investment opportunities. We will discuss the two tools most widely used for this purpose, NPV and IRR, and apply them to the evaluation of a specific project.<\/p>\n<p><strong>6. Corporate Value Creation<\/strong><\/p>\n<p>In this session we will discuss EVA, a tool widely used to assess whether a company is creating or destroying shareholder value. We will also put this tool into practice by estimating the EVA of two companies.<\/p>",
    "estimatedClassWorkload": "2-3 hours\/week",
    "recommendedBackground": "No previous background or knowledge of the subject is necessary.",
    "links": {

    }
}