{"id":1161,"shortName":"musictheory","name":"Fundamentals of Music Theory","language":"en","shortDescription":"This course will introduce students to the theory of music, providing them with the skills needed to read and write Western music notation, as well as to understand, analyse, and listen informedly. It will cover material such as pitches and scales, intervals, clefs, rhythm, form, meter, phrases and cadences, and basic harmony. ","aboutTheCourse":"This\ncourse,&nbsp;<span>from the University of Edinburgh's Reid School of Music (recently <a href=\"http:\/\/www.theguardian.com\/education\/ng-interactive\/2014\/jun\/03\/university-guide-2015-league-table-for-music\" target=\"_blank\">ranked first in the UK<\/a>),<\/span><span>&nbsp;is suitable for those who have never studied music academically. It will&nbsp;introduce you to the theory of Western music, providing you with the skills needed to&nbsp;read and write Western music notation, as well as to understand, analyse, and listen informedly. &nbsp;<br><br>It will provide the\nbasis for the further study of music both from a theoretical and practical\npoint of view: musicology, pastiche and free composition, analysis,\nperformance, and aural skills.&nbsp; <br><br>It will\nalso be useful to experienced musicians without music notation skills who wish\nto extend their practice through a grounding in the tools of Western music\ntheory and notation.<\/span>\n\n\n\n<br><br><strong><\/strong><br><strong><a href=\"https:\/\/twitter.com\/musictheorymooc\">Follow us on twitter<\/a><\/strong> <br>@musictheorymooc <br><strong>#edmusictheory<\/strong><br>","targetAudience":0,"courseSyllabus":"<p><b>W<\/b><b>eek-by-Week\nbreakdown<\/b>\n\n<\/p><ol><li>Pitches, scales, modes, and chords<\/li><li>Keys and intervals<\/li><li>Rhythm and form<\/li><li>Harmony 1: functional harmony<\/li><li>Harmony 2: inversions, cadences, and\nsequences<\/li><li>Final Assignment<\/li><li>Peer Review<\/li><\/ol>","courseFormat":"The class will consist of lecture videos.&nbsp;These contain 1-2 integrated quiz questions per video. Multiple-choice tests will cover each week's video. &nbsp;The final exam will be an optional peer-reviewed harmony assignment.","suggestedReadings":"<p>Although not required to participate in the course, an excellent text\/reference\nbook for the course would be:<\/p><p> <span>S. M. Kostka, D. Payne. <i>Tonal Harmony<\/i>. McGraw-Hill Education, 2008.&nbsp;<\/span><\/p><p><span><br>We understand that this might be hard to find or prohibitively expensive where you're living, so it really is just a suggestion. A good and cheaper substitution would be:<\/span><\/p><p>E. Taylor. The AB Guide to Music Theory Vol 1. Associated Board of the Royal Schools of Music, 1989.<\/p><p><\/p><p><br><\/p><p><br><\/p><h1><br><\/h1>","estimatedClassWorkload":"5-8 hours\/week","recommendedBackground":"No background required.<br>","links":{}}