{"id":2609,"shortName":"gestionpersonas","name":"Claves para Gestionar Personas","language":"es","shortDescription":"¿Te has preguntado alguna vez qué criterios utilizan las empresas para contratar o retribuir a las personas? ¿Por qué no siempre entendemos los planes de promoción?. El objetivo de este curso es conocer algunas herramientas prácticas en materia de Recursos Humanos y aprender a gestionar personas y liderar el talento con la mayor eficacia posible. ","aboutTheCourse":"<p><span>Aunque el contenido de este curso se refiere a la\ngestión de recursos humanos, su enfoque apunta a los conocimientos del que, sin\nser un técnico en esa especialidad, tiene que tomar decisiones sobre personas. Y\nes que, en el actual entorno empresarial, los directivos de línea se ven cada\nvez más directamente involucrados en la aplicación de prácticas procedentes del\nárea de dirección de personas. <br>\n<br>\nEvaluación de desempeño, planificación de sucesiones, gestión por competencias,\n<i>feedback<\/i> 360º y conceptos similares están dejando de ser ajenos a los\ndirectivos funcionales y se convierten en una faceta esencial de su\nresponsabilidad de dirección: la de liderar los equipos a su cargo. <br>\n<br>\nEl curso se propone concienciar a los alumnos de que no cabe una dirección\nneutral de las personas, sino que estas solo pueden estar bien o mal dirigidas.<\/span><\/p>","targetAudience":3,"courseSyllabus":"<p><b>Semana 1:&nbsp;<\/b><b>Gestión por competencias<\/b><\/p><p>En esta sesión aprenderemos a usar\neste modelo tan extendido en las organizaciones que busca el desarrollo de las\npersonas. Estudiaremos como a través de la observación directa esta herramienta\nes muy útil para proporcionar a los directivos información de cada una de las\npersonas de su equipo.<\/p><p><strong>Semana 2:&nbsp;<\/strong><b>Selección y\nContratación<\/b><\/p><p>En esta sesión analizaremos el peso\nestratégico que tienen hoy en día el reclutamiento y los procesos de selección\nen la mayoría de las empresas. Daremos a conocer de forma objetiva cuáles son\nlas necesidades de plantilla a corto y medio plazo y a diferenciar algunos\nerrores habituales que se cometen en esta política de Recursos Humanos. <\/p><p><b>Semana 3:&nbsp;<\/b><b>Evaluación<\/b><\/p><p><b><\/b><\/p><p><span>En esta sesión\naprenderemos las prácticas necesarias relativas a los procesos de valoración de\nla actuación de los profesionales que trabajan en la empresa y de manera\nderivada, de los procesos de estimación de la capacidad de su actuación futura.\nAnalizaremos la relación que tienen dichos procesos con decisiones críticas\ncomo retribuciones, rotaciones y promociones.<b><\/b><\/span><\/p><p><strong>Semana 4: <\/strong><b>Promoción<\/b><\/p><p><b><\/b><\/p><p>En esta sesión aprenderemos\nqué criterios se siguen en la empresa para ir ascendiendo con normalidad. De\nesos criterios veremos cuáles están escritos en la política de recursos humanos\nde la compañía y qué otros forman parte de los criterios no hablados.\nAprenderemos a manejarlos con eficacia. <\/p><p><b>Semana 5:&nbsp;<\/b><b>Retribución<\/b><\/p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEn\nesta sesión discutiremos sobre la complejidad de los diferentes sistemas de\nretribución existentes. Veremos porque se trata de una piedra angular sobre la\nque se deben asentar otros sistemas de recursos humanos, y por qué ha pasado a\nser un concepto que opera dentro de un mercado. Aprenderemos conceptos como\nbandas salariales, retribución variable y retribución fija.<br><\/p>","courseFormat":"<p>El curso se divide en 5 sesiones compuestas de varios elementos descritos anteriormente. Estimamos una dedicación de 3 horas semanales para seguir de manera completa cada sesión. Como nos referíamos arriba, te recomendaremos semanalmente materiales adicionales para que si lo deseas puedas profundizar en los temas principales que veremos a lo largo de cada semana.<\/p><p>Cada sesión está formada por diferentes videos cortos. En algunos aparecen pequeñas entrevistas realizadas a varios\ndirectores de Recursos Humanos en los que relatan su experiencia en el el\nmanejo de estas políticas en el día a día de sus empresas. Durante algunas\nsesiones se te pedirán rellenar encuestas y unos sencillos test teóricos para\ncomprobar que has entendido los conocimientos de cada semana. \n\n<\/p><p>Al inicio de cada sesión recibirás varias sugerencias sobre qué otras lecturas adicionales puedes consultar si deseas profundizar en los conceptos vistos durante los videos.<\/p><p>En algunas sesiones se abrirán foros para discutir con el resto de participantes casos de negocio. Estos casos están orientados a que sirvan a los alumnos en su día a día profesional, por ello te animamos a que participes de manera activa en los debates.<\/p><p>Para finalizar el curso se realizará un ejercicio analítico sobre las diferentes políticas de Recursos Humanos que existen en una empresa que conozcas.<\/p><br>","suggestedReadings":"<p>Todas las lecturas necesarias para\nseguir el curso se pondrán a tu disposición gratuitamente al inicio del\nprograma. Para cada sesión recomendaremos una o dos lecturas obligatorias que\ncomplementen el contenido de los videos semanales de diferente extensión y\ncomplejidad, de manera que puedas organizar tu estudio de acuerdo a tus\nconocimientos, intereses y tiempo.<\/p>\n\n<p><span>Para obtener una mejor comprensión y\naprendizaje del curso, puede serte útil el libro: <br><\/span><\/p><p><span><i>Dirigir Personas: la madurez del talento<\/i>, Guido Stein,\nEduardo Rábago, Pearson, 2014<\/span><\/p>\n\n<p>Aunque no es un material obligatorio para completar el\ncurso, te permitirá profundizar en la materia a través ejemplos prácticos sobre\nlos principales temas del curso. <\/p>\n\n<p>En caso de que desees comprarlo podrás hacerlo de\nforma online. Al inicio del curso recibirás instrucciones sobre cómo acceder a\nsu compra.<\/p>","estimatedClassWorkload":"2-3 hours\/week","recommendedBackground":"<p>No son necesarios conocimientos\nprevios si bien, es recomendable tener cierto interés por el área de Recursos\nHumanos así como conocer algunos conceptos básicos de Administración de\nEmpresas.<\/p>","links":{}}