{"id":498,"shortName":"innovacion","name":"Desarrollo rápido de productos innovadores para mercados emergentes","language":"es","shortDescription":"Entender las metodologías para la innovación de productos para mercados emergentes.  Las metodologías son:  1) megatendencias sociales, tecnológicas y del comportamiento del consumidor 2) JTBD y 3) Matriz Morfológica.","aboutTheCourse":"<p>El objetivo del curso es aprender el proceso para el\nDesarrollo Rápido de Productos Innovadores para mercados emergentes a través de la\naplicación de 3 metodologías.&nbsp; Las\nmetodologías que abordaremos en el curso son: <\/p>\n\n<p>&nbsp;<b><span>1) Megatendencias sociales,\ntecnologías y del comportamiento del consumidor:&nbsp;<br><\/span><\/b>Las megatendencias sociales describen\ncomportamientos de la sociedad y hábitos de consumo. Las megatendencias\ntecnológicas identifican el uso potencial de tecnologías para desarrollar\nproductos. Finalmente, la megatendencias del comportamiento del consumidor\ndescriben características funcionales de productos que son deseables por el\ncliente.&nbsp;&nbsp;<b><br><\/b><\/p>\n\n<p><b>2) Jobs To Be\nDone (JTBD):<br><\/b><b>&nbsp;<\/b>Jobs To Be Done (JTBD) es un conjunto de técnicas que permiten describir las actividades\nde los consumidores, sus hábitos en el uso de productos y la evaluación de cada\nactividad en términos de su carácter crítico en una matriz de necesidades y\nsatisfactores.&nbsp; Esto permite identificar\naquellas actividades en donde el desarrollo productos innovadores tiene más\nprobabilidades de éxito.&nbsp;<\/p>\n\n\n\n<p><b><span>3) Matriz Morfológica:&nbsp;<br><\/span><\/b>La última metodología es la matriz morfológica que\npermite evaluar opciones de tecnologías para desarrollar los productos\nconceptualizados por las técnicas anteriores.&nbsp;<\/p>\n\n\n\n<span>En este curso\npresentaremos desarrollos de productos innovadores que están siendo\ncomercializados en mercados emergentes, así como, casos de estudio desarrollados\npor los profesores que ofrecen el curso sobre productos que <b>no<\/b> han sido exitosos.<\/span>","targetAudience":0,"courseSyllabus":"<p>Megatendencias Sociales.<\/p>\n\n<p>Megatendencias Tecnológicas.<\/p>\n\n<p>Megatendencias del comportamiento del consumidor.<\/p>\n\n<p>Jobs To Be Done (JTBD).<\/p>\n\n<p>Matriz Morfológica.<\/p><p>Storyboards.<\/p>","courseFormat":"<p>Este curso son 8 semanas, con 2 sesiones semanales.&nbsp; Cada sesión incluye videos de 3 – 5 minutos, con una o dos lecturas obligatorias, revisión de las 3 metodologías con casos de estudio y la aplicación de la metodologías a un producto que será desarrollado\n    por el participante.&nbsp;<\/p>\n\n<p>Se evaluará el concepto de producto innovador al final del curso por los participantes a través de un sistema de voto al producto más innovador y de mayor potencial de comercialización.<\/p>","suggestedReadings":"El Mundo Futuro – Arturo Molina – Revista Alto\nNivel","instructor":"Arturo Molina Gutiérrez , David  Romero Díaz and Pedro Ponce Cruz","estimatedClassWorkload":"5-6 hours\/week","recommendedBackground":"No se requieren conocimiento previos.","links":{}}