{"id":1302,"shortName":"repdata","name":"Reproducible Research","language":"en","shortDescription":"Learn the concepts and tools behind reporting modern data analyses in a reproducible manner. This is the fifth course in the Johns Hopkins Data Science Specialization.","aboutTheCourse":"This course focuses on the concepts and tools behind reporting modern data analyses in a reproducible manner. Reproducible research is the idea that data analyses, and more generally, scientific claims, are published with their data and software code so that others may verify the findings and build upon them.  The need for reproducibility is increasing dramatically as data analyses become more complex, involving larger datasets and more sophisticated computations. Reproducibility allows for people to focus on the actual content of a data analysis, rather than on superficial details reported in a written summary. In addition, reproducibility makes an analysis more useful to others because the data and code that actually conducted the analysis are available. This course will focus on literate statistical analysis tools which allow one to publish data analyses in a single document that allows others to easily execute the same analysis to obtain the same results.","targetAudience":1,"courseSyllabus":"In this course you will learn to write a document using R markdown, integrate live R code into a literate statistical program, compile R markdown documents using knitr and related tools, and organize a data analysis so that it is reproducible and accessible to others.<br>","courseFormat":"There will be weekly video lectures, &nbsp;quizzes, peer assessments.<br><br>As part of this class you will be required to set up a&nbsp;<a href=\"https:\/\/github.com\/\" target=\"_blank\" title=\"Link: https:\/\/github.com\/\">GitHub<\/a>&nbsp;and an <a href=\"http:\/\/rpubs.com\" target=\"_blank\">RPubs<\/a> account. GitHub is a tool for collaborative code sharing and editing. RPubs is a web site for publishing data analyses from R. During this course and other courses in the Specialization you will be submitting links to files you publicly place in your GitHub account as part of peer evaluation. If you are concerned about preserving your anonymity you will need to set up an anonymous GitHub and RPubs accounts and be careful not to include any information you do not want made available to peer evaluators.<br>","suggestedReadings":"","estimatedClassWorkload":"4-9 hours\/week","recommendedBackground":"<a href=\"https:\/\/www.coursera.org\/course\/rprog\" target=\"_blank\">R Programming<\/a>, <a href=\"https:\/\/www.coursera.org\/course\/datascitoolbox\" target=\"_blank\">Data Scientist's Toolbox<\/a>","links":{}}