{
    "id": 2559,
    "shortName": "humanlanguage",
    "name": "Miracles of Human Language: An Introduction to Linguistics",
    "language": "en",
    "shortDescription": "Everywhere, every day, everybody uses language. There is no human society, no matter how small or how isolated, which does not employ a language that is rich and diverse. This course introduces you to linguistics, featuring interviews with well-known linguists and with speakers of many different languages. Join us to explore the miracles of human language!",
    "aboutTheCourse": "<p><i>The Miracles of Human Language<\/i>&nbsp;introduces you to the many-faceted study of\nlanguages, which has amazed humans since the beginning of history. Together with speakers of many other\nlanguages around the world, as well as with famous linguists such as Noam Chomsky and Adele Goldberg, you will learn to understand and analyse how your\nnative tongue is at the same time similar and different from many other\nlanguages. You will learn the basic concepts of linguistics, get to know some\nof the key features of big and small languages and get insight into what\nlinguists do. <\/p>\n\n<p>This course gives an introduction into the\nstudy of languages, the field of linguistics. With the support of the basic linguistic terminology that is offered in the\ncourse, you will soon be able to comment both on variety between languages, as\nwell as on a single language’s internal structure. Anyone who wishes to\nunderstand how languages work, and how they can give us insight into the human\nmind is very welcome to join.<\/p>\n\n<p>The course is useful if you\nwant to get a fairly quick introduction into linguistics, for instance because\nyou are considering studying it further, or because you are interested in a\nneighbouring discipline such as psychology, computer science or anthropology.\nFurthermore, the course will help you develop analytical skills. <\/p>\n\n<p>If you are curious to understand how language works and how it gives insight\ninto the human mind, this course is definitely for you!<br><\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<p>Week 1: Introduction to Linguistics<\/p>\n\n<p>Week 2: Phonology and Phonetics<\/p>\n\n<p>Week 3: Morphology and Syntax<\/p>\n\n<p>Week 4: Pragmatics and Semantics<\/p>\n\n<p>Week 5: Language in the Brain<\/p><p>Week 6: Language in Society<\/p>",
    "estimatedClassWorkload": "4-6 hours\/week",
    "recommendedBackground": "<p>For participating in this course, no\nspecific background is required.<\/p>\n\n<p>Anyone with an interest in language is welcome\nto take a peek around the corner, and to join us during this basic exploration\nof the field of linguistics.&nbsp;<\/p>",
    "links": {

    }
}