{"id":773,"shortName":"afp21stcentury","name":"21st Century American Foreign Policy","language":"en","previewLink":"https:\/\/class.coursera.org\/afp21stcentury-001\/lecture\/preview","shortDescription":"What is American foreign policy? Who makes it? Why is it the way it is? How does it affect the rest of the world? Professor Bruce Jentleson has taught the subject for over 30 years, written one of the leading books on it, and has served in numerous U.S. foreign policy positions.","aboutTheCourse":"<p>U.S. foreign policy has a huge impact on the world. That impact is widely debated among Americans and by people in many countries. Our goal in this course is to gain more understanding of what U.S. foreign policy is, who makes it, why is it the way it\n    is, and how it affects the rest of the world. Through lectures, readings, and other course elements we build on the information available from the media and other such sources while delving deeper into the issues, their history, their broader context\n    and major debates. We seek to do so as a community of learning committed not only to the curricular objectives for our course, but seeking to demonstrate to the world how to conduct informed and respectful discourse on subjects which have plenty of\n    room for disagreement.<\/p>The first week of the course provides an overview and analytic framework, and focuses in on the process and politics by which U.S. foreign policy is made. Each of the next five weeks is geared to U.S. foreign policy in different\nregions: Asia with a particular focus on U.S.-China relations; the Middle East and such issues as Iran, Arab-Israeli peace, Syria, and the Arab uprisings; relations with Western Europe and Russia; relations in the Western Hemisphere with Latin America\nand Canada; and key issues in U.S.-Africa relations. While we cannot cover all issues, we do try for a balance of breadth and depth.","targetAudience":1,"courseSyllabus":"<p>Six weeks organized into six units:<\/p>\n<ol>\n    <li>Course Overview, Analytic Framework and the Making of U.S. Foreign Policy<\/li>\n    <li>Asia’s Rising Strategic Importance: U.S. Relations with China and in the Asia-Pacific Region<\/li>\n    <li>War, Peace, Terrorism, Democracy:  Old and New Challenges in the Middle East<\/li>\n    <li>Old Friends, Old Enemy: 21st Century Relations with Europe and Russia<\/li>\n    <li>The Americas: Relations with Latin America and Canada<\/li>\n    <li>Africa: Persisting Old Issues, Pressing Newer Ones<\/li>\n<\/ol>","courseFormat":"Each week is structured as a unit on one of the topics listed on the syllabus. Each of these units will have four or five components consisting of a video lecture, background readings, quizzes and other learning reinforcement exercises. We also will use\nthe message board and other mechanisms for dialogue among the students and with the professor and teaching team.","suggestedReadings":"The course draws extensively on my book <a title=\"null\" href=\" http:\/\/books.wwnorton.com\/books\/Political_Science\/International_Relations\/Foreign_Policy\/978-0-393-91943-1\/\" target=\"_blank\">American Foreign Policy: The Dynamics\nof Choice in the 21st Century (New York: W.W. Norton and Company, 5th edition 2013)<\/a>, just published in its 5th edition. Two chapters are available on our course website; if interested, the book can be purchased from W.W. Norton or various others. Selected articles\nand other relevant readings will also be assigned.","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"Strong interest in world politics and international affairs is the most important requirement. Prior relevant knowledge from one’s own education and any professional work experience would be great, both for you and for our community of learning.","links":{}}