{
    "id": 189,
    "shortName": "intropharma",
    "name": "Introduction to Pharmacy",
    "language": "en",
    "shortDescription": "This course is a survey of the profession of pharmacy including its history, evolving scope of practice, ethical foundations, regulation, educational and career opportunities, and more. We will also explore topics relating to medication use and drug development.",
    "aboutTheCourse": "<b><\/b>\n\n<p>Man has always used external materials to help prevent, cure, or alleviate\n    the symptoms of disease. In fact, Gregory Higby of the American Institute\n    of the History of Pharmacy has written&nbsp;that, “...the very concept\n    of influencing bodily functions via an outside force must be considered\n    one of humanity’s greatest advances.” Since its independent&nbsp;origins\n    in ancient Arabic civilizations, pharmacy has evolved from a craft dedicated\n    to the compounding of drugs to a profession focusing on helping patients\n    get the best outcomes from medication therapies.<\/p>\n<p>So what is pharmacy? How has it changed and where is it headed?<\/p>\n<p>This course will answer these questions and provide a comprehensive introduction\n    to this profession. We will explore the history of pharmacy and its evolving\n    scope of practice; examine educational and career pathways; tackle issues\n    relating to medication safety and adverse drug events; gain insight into\n    the regulatory and ethical considerations in pharmacy practice; and more.<\/p>\n<p>As we explore these topics together, we will hear from practicing pharmacists\n    throughout the course and ultimately gain a better understanding of what\n    they do and how they help us get the best results from our medications.\n    Maybe you will decide that the dynamic profession of pharmacy is a career\n    path that you want to pursue! &nbsp;Whether student or healthcare consumer,\n    you’re sure to find the material we cover in this course to be invaluable.<\/p><p><br><br><br>All lectures and instructional materials developed for this course by the Ohio State University are licensed under the Creative Commons AttributionNonCommercial-ShareAlike 4.0 International License. To view a copy of this license, visit&nbsp;<a href=\"http:\/\/creativecommons.org\/licenses\/by-nc-sa\/4.0\/\">http:\/\/creativecommons.org\/licenses\/by-nc-sa\/4.0\/<\/a><br><\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<b>Week One:<\/b> The history of pharmacy and its evolving scope of practice\n<br><b>Week Two:<\/b> Educational pathways in pharmacy\n<br><b>Week Three:<\/b> Career pathways for pharmacists & their role in the healthcare\nsystem\n<br><b>Week Four:<\/b> The medication experience\n<br><b>Week Five:<\/b> Drug discovery and development \n<br><b>Week Six:<\/b> Regulatory and ethical considerations in pharmacy\n<br><b>Week Seven:<\/b> Contemporary issues and the future of pharmacy\n<br>",
    "estimatedClassWorkload": "2-5 hours\/week",
    "recommendedBackground": "There are no prerequisites to taking this course. All you need is an interest\nin the subject and a commitment to engage in all instructional activities.",
    "links": {}
}