{"id":3048,"shortName":"molecularevolution","name":"Deciphering Molecular Evolution (Bioinformatics IV)","language":"en","shortDescription":"In this course, we will see how evolutionary trees resolve quandaries from finding the origin of a deadly virus to locating the birthplace of modern humans. We will then use methods from computational proteomics to test whether we can reconstruct Tyrannosaurus rex proteins and prove that birds evolved from dinosaurs.","aboutTheCourse":"In 2003, the deadly Severe Acute Respiratory Syndrome (SARS) virus caused panic as it swept around the globe in a few weeks. But where did SARS come from? By constructing an <strong>evolutionary tree<\/strong> of the unknown virus as well as viruses taken from other species, we can not only understand which animal gave us SARS, but also reconstruct its path around the globe. This is just one of many problems in modern biology related to constructing evolutionary trees.<br><div><br><\/div><div>In 2007, a team of biologists announced that some proteins had miraculously survived within a 68 million year old dinosaur fossil. Moreover, they concluded that the amino acid sequences of these dinosaur proteins were nearly identical to sequences in modern-day chickens. Based on this discovery, famed paleontologist Jack Horner (who inspired the character of Dr. Grant from Jurassic Park) hopes to resurrect dinosaurs by genetically re-engineering a chicken. &nbsp;But did these peptides really come from T. rex? To answer this question, we will need to explore the field of <strong>computational proteomics<\/strong>.<br><br>In the end of the course, a Bioinformatics Application Challenge&nbsp;will let you apply popular bioinformatics software tools to construct an evolutionary tree of different Ebola viruses and hypothesize where the 2014 Ebola outbreak came from.<br><\/div>","targetAudience":1,"courseSyllabus":"<strong>Which Animal Gave Us SARS?&nbsp;<\/strong>(Evolutionary Tree Reconstruction)<br><ul><li>The Fastest Outbreak<\/li><li>Transforming Distance Matrices into Evolutionary Trees<\/li><li>Toward An Algorithm for Distance-Based Phylogeny Construction<\/li><li>Additive Phylogeny<\/li><li>Using Least Squares to Construct Approximate Distance-Based Phylogenies<\/li><li>Ultrametric Evolutionary Trees<br><\/li><li>The Neighbor-Joining Algorithm<\/li><li>Character-Based Tree Reconstruction<\/li><li>The Small Parsimony Problem<br><\/li><li>The Large Parsimony Problem<\/li><li>Epilogue: Evolutionary Trees Fight Crime<\/li><\/ul><strong>Was T. rex Just a Big Chicken?<\/strong>&nbsp;(Computational Proteomics)<br><ul><li>Paleontology Meets Computing<\/li><li>What Proteins Are Present in This Sample?<\/li><li>Decoding an Ideal Spectrum<\/li><li>From Ideal to Real Spectra<\/li><li>Peptide Sequencing<\/li><li>Peptide Identification<\/li><li>Peptide Identification Meets the Infinite Monkey Theorem<\/li><li>Spectral Dictionaries<\/li><li>T. rex Peptides: Treasure Trove of Ancient Proteins or Artifact of Contamination?<\/li><li>Epilogue: From Unmodified to Modified Peptides<\/li><\/ul><strong><\/strong><strong>Bioinformatics Application Challenge:<\/strong> Identifying the Origin of the Latest Ebola Outbreak","courseFormat":"This course covers two chapters from&nbsp;<a href=\"http:\/\/bioinformaticsalgorithms.org\/\" target=\"_blank\">Bioinformatics Algorithms: An Active Learning Approach<\/a>, by Compeau &amp; Pevzner. &nbsp;&nbsp;The course also contains summary quizzes and lecture videos.<br><br>To earn a standard certificate in the class, you must complete weekly quizzes in addition to&nbsp;a Bioinformatics&nbsp;Application Challenge in which you apply popular bioinformatics&nbsp;software tools to a&nbsp;real experimental dataset. If you are eager&nbsp;to&nbsp;learn about bioinformatics, you&nbsp;should be able to&nbsp;complete the Application Challenge and earn the course&nbsp;certificate&nbsp;even if you&nbsp;do not know how to program.<br><br>To earn a certificate with&nbsp;distinction, rather than complete the Application Challenge, you&nbsp;must complete some programming assignments found in the course's interactive text. The distinction is a \"hacker track\" that is&nbsp;aimed at learners who know how to program (or willing to learn before the class starts) and would like to explore the nuts and bolts of bioinformatics algorithms.<br>","suggestedReadings":"The printed course companion is<i>&nbsp;<a href=\"http:\/\/bioinformaticsalgorithms.org\/\" target=\"_blank\" title=\"Link: http:\/\/bioinformaticsalgorithms.org\/\">Bioinformatics Algorithms: An Active-Learning Approach<\/a><\/i>&nbsp;(2nd edition), by Compeau &amp; Pevzner.<br>","estimatedClassWorkload":"4-10 hours\/week","recommendedBackground":"\"<a href=\"http:\/\/coursera.org\/course\/comparinggenomes\" target=\"_blank\" title=\"Link: http:\/\/coursera.org\/course\/comparinggenomes\">Comparing Genes, Genomes, and Proteins<\/a>\" is the suggested prerequisite for taking this course, but it is not a strict prerequisite.<br><br>If you are aiming at earning a standard certificate in this class, then you do not need to have any experience in biology or programming. &nbsp;The only prerequisite is the enthusiasm to learn about how computational approaches are used in modern biology :)<br><br>If you are aiming at earning a certificate with distinction, then you should either know the basics of programming in the language of your choice (there is no required language for this course) or be willing to learn about programming before the course begins. In this case, in addition to the first three courses in this series, we have the following suggestions for resources that will help you learn programming.<br><ul><li>The language tracks on&nbsp;<a href=\"http:\/\/codecademy.com\/\" target=\"_blank\">Codecademy<\/a>, particularly the Python track.<\/li><li><a href=\"https:\/\/www.coursera.org\/course\/interactivepython\" target=\"_blank\">An Introduction to Interactive Programming with Python<\/a>, the acclaimed Coursera course.<\/li><li>Introductory problems on&nbsp;<a href=\"http:\/\/rosalind.info\/\" target=\"_blank\">Rosalind<\/a>, a resource for learning bioinformatics created by the course instructors.<\/li><\/ul>","links":{}}