{"id":1187,"shortName":"sjtujxdepw","name":"粒子世界探秘 Exploring Particle World","language":"zh-cn","shortDescription":"本课程以通俗的语言介绍粒子物理的主要内容和最前沿的研究。课程涉及的主要内容包括： 物质和反物质， 夸克和强相互作用，中微子和弱相互作用，对称性和它的作用， 粒子物理的标准模型，粒子天文学， 暗物质。\n\nThis course gives an brief introduction of the main content and the frontier of particle physics in popular language. It includes: matter and antimatter, quark and strong interaction, neutrino and weak interaction, symmetry and its applications, standard model of particle physics, particle astronomy, dark matter etc.\n\n","aboutTheCourse":"<p>粒子物理探秘是物理与天文系开设的一门面向大学本科的前沿基础课。粒子物理是研究构成物质世界的基本单位和它们之间的相互作用的学科，属于物理研究的最为基础和前沿的领域。在过去的一个世纪中，粒子物理的发展让我们对这个世界的本源的认识更加深刻。粒子物理导论将对粒子物理学科的发展历程、重要概念和最新研究结果进行一般性质的介绍。本课程是为了解粒子物理方向有兴趣的本科学生开设的入门选修课程，也是那些学过普通物理学并希望能够对世界的本源有更深入的理解的爱好者的入门钥匙。<\/p><p>课程片花：<a href=\"http:\/\/v.youku.com\/v_show\/id_XNjQxOTc5NjQ4.html\">http:\/\/v.youku.com\/v_show\/id_XNjQxOTc5NjQ4.html<\/a><\/p>\n\n<p>Exploring particle\nworld is a introductory course offered by the department of physics and\nastronomy. The goal of particle physics is to study the elementary particles\nmaking up the world and their interactions. The development of particle physics\nchanged our view of nature greatly in the past century. In this course, we will\nintroduce the history of particle physics, main ideas and the most recent\nresults of this subject. This course is an elective course for those students\nwho might be interested in research in particle physics. It can also be useful\nfor any undergraduate who have taken general physics courses and want to get an\ninsight into the nature deeply.<\/p>","targetAudience":0,"courseSyllabus":"<p>第一周\n物质与反物质<\/p>\n\n<p>第二周\n夸克和强相互作用<\/p>\n\n<p>第三周\n弱相互作用和中微子<\/p>\n\n<p>第四周\n对称性<\/p>\n\n<p>第五周\n粒子的质量和希格斯粒子<\/p>\n\n<p>第六周\n标准模型<\/p>\n\n<p>第七周\n粒子天体物理<\/p>\n\n<p>第八周\n<span>暗物质和暗能量<\/span><\/p>","courseFormat":"<p><span>利用微视频课程进行翻转课堂模式教学，要求学生在课前观看课程视频，并进行文献阅读。课堂上以小组和班级讨论的形式对相应课程内容进行讨论。<\/span><\/p>","suggestedReadings":"<p>《夸克:基本粒子物理前沿》\n南部阳一郎著，陈宏芳译，中国科学技术大学出版社<\/p>\n\n<p>《神奇的粒子世界》\n马丁纽斯•韦尔特曼著，陈佳洱、乔从丰、丁亦兵译，科学出版社<\/p>\n\n<p>《粒子物理概念(第3版)(英文)》\n考夫兰 (Guy D.Coughlan)、James E.Dodd、 Ben M.Gripaios <span>世界图书出版公司<\/span><\/p>","estimatedClassWorkload":"3-5 hours\/week","recommendedBackground":"<span>学习过大学普通物理的理工科大学二、三年级的学生。<\/span>","links":{}}