{
    "id": 1542,
    "shortName": "digitalaccessibility",
    "name": "Information and Communication Technology (ICT) Accessibility ",
    "language": "en",
    "shortDescription": "Learn to address Information and Communication Technology (ICT) accessibility in this course covering challenges and strategies for organizations and individuals.  Whether corporate, governmental, or nonprofit, this course will enable you to identify ICT accessibility issues, analyze needs, and evaluate solutions for both employees and customers with disabilities.\n\n\n",
    "aboutTheCourse": "In\nthis introductory course, learn how to measure an organization’s ICT accessibility and assess the importance of\nmaintaining an inclusive workplace for both employees and customers with\ndisabilities. This six-week course consists of modules detailing some of the\nprimary ICT accessibility obstacles facing organizations today. Each module is\ntaught by a subject matter expert through content-rich videos, activities, and discussion forums. \n<p>Whether\nyou work in the corporate, governmental or nonprofit sector, this course will\nenable you to identify ICT accessibility issues, analyze specific needs, and\nevaluate possible solutions. As the world becomes more technology-driven,\norganizations of all sizes and sectors touch ICT accessibility, whether through\nwebsite design, document creation, or multimedia utilization. Start outlining a\nplan to establish and maintain an accessible enterprise operation today. <\/p>\n<p>Join\nour instructors as we explore why, what, and how to integrate\naccessibility design elements into your ICT organizational roadmap to support\nequal access for all.<\/p>",
    "targetAudience": 1,
    "courseSyllabus": "<p>This course includes six modules, each having associated activities and a quiz:<\/p>\n\n<p><strong>Module 1<\/strong>: ICT\nAccessibility <br>\nThis module will provide an introduction to ICT accessibility as well as an overview of  the relevance the five subsequent modules in this course.<\/p>\n\n<p><strong>Module 2<\/strong>: ICT\nAccessibility Design<br>\nThis module will provide instruction on the importance of ICT accessibility in designing and procuring workplace applications.<\/p>\n\n<p><strong>Module 3<\/strong>: Assistive\nTechnology<br>\nThis module will provide instruction on the impact of assistive technology (AT) and mainstream technology on individuals with disabilities.<\/p>\n\n<p><strong>Module 4<\/strong>: Accessible Documents and Multimedia<br>\nThis module will provide instruction on the elements of an accessible document, accessibility standards, tools to check accessibility, multimedia captioning and audio description standards and guidelines.<\/p>\n\n<p><strong>Module 5<\/strong>: Web\nAccessibility Evaluation and Design <br>\nThis module will provide instruction on web accessibility through utilizing online evaluation and remediation tools using HTML5 and ARIA.<\/p>\n\n<p><strong>Module 6<\/strong>: ICT Accessibility Operations <br>This module will provide an overview of ICT accessibility\nmarket forces and organization challenges, and will outline how an ICT\nAccessibility Operation Model can help organizations address their challenges.<\/p>",
    "estimatedClassWorkload": "2-4 hours\/week",
    "recommendedBackground": "<p>No previous knowledge is required. Participants are\nexpected to have a working knowledge of computer-based applications such as Microsoft\nOffice.<\/p>",
    "links": {}
}