{"id":3400,"shortName":"valuingcompanies","name":"Valuing Projects and Companies","language":"en","shortDescription":"This course is a theoretically sound and practical exposure to valuation. As the final course of the Specialization, it will be useful to anyone in understanding, conducting or critically evaluating project and company analyses conducted by experts. ","aboutTheCourse":"The strength of finance is that it takes a very structured approach to decision-making.&nbsp;This course uses a framework based on the two building blocks of finance (time value of money and risk and return), enriched by real world regulations and tax codes, to enable the learner to value both projects and companies. This course is very applied in nature with most of the content crafted to address real world issues confronted in companies and our personal lives.<br><br>This course is the fourth and last in a sequence of four courses that comprise a Specialization on Valuation &amp; Investing. It will prepare you for the capstone project if you qualify by obtaining Course Certificates in all four courses.","targetAudience":1,"courseSyllabus":"The course is comprised of three modules of content (videos, readings, and assignments) and a typical learner should be able to cover each module in about a week if she devotes 5-10 hours a week. Each module has a rigorous assignment. Due to the applied and comprehensive nature of all parts of the course, we provide two weeks of assimilation time that will allow the learner to internalize the content and do all the assignments. This allows for the best preparation for the final exam, with&nbsp;one week allocated to attempting the final.<br><br>Apart from being the most applied and challenging course in the specialization, this course is also set up to be capstone-like. It puts all the pieces together.&nbsp;<br><br>Module One: &nbsp;In the first module we will focus on the analyses involved in making the most\ncommon decision confronted by anyone: a choice between alternative projects. To enable the learner to make such choices, we will build on the\ndecision criteria developed in the first course in the specialization and\nexpose the learner to some classic types of projects we all confront in life.&nbsp;<br><br>Module Two: &nbsp;We&nbsp;will\nmodify the framework introduced in module 1 to value companies, where a company is\nessentially a complex collection of “projects.” This module will address all the steps involved in valuing a company, from identifying an appropriate set of comparable companies to determining the cost of capital critical to valuing any company.&nbsp;<br><br>Module Three: &nbsp;In the third module, we will do a mega example applying alternative\nmethods of valuation in a practical setting. &nbsp; &nbsp;<br>&nbsp; &nbsp;&nbsp;<br>One\nof the main purposes of this rich and complex course is to enable the learner\nto apply the knowledge gained to conduct a deep analysis of any project or company. This course will also prepare students interested in obtaining a Verified Certificate for the Specialization to submit an analysis on a Capstone Project that involves the valuation of a company or a complex project and is designed to capture the commonly witnessed\ncomplexities of the real world.","courseFormat":"The course consists of videos, broken up into bite-size pieces with their lengths varying based on the topic. Almost every video segment will have opportunities for you to assess your knowledge. You are strongly encouraged to take every opportunity to work on the problems\/examples before you view the analysis presented in the videos. There will also be stand-alone assignments for every module and a mandatory final exam. Doing the assignments is the way you will learn the material. This course is \"capstone-like\" in nature and prepares you to value a company or a complex project.","suggestedReadings":"The videos and assignments are meant to be sufficient to get you started and make good progress. Since this is a more advanced course, it is highly recommended that you increasingly access excellent resources available on finance outside the structure of this course. The detailed course syllabus provides many suggested readings and textbooks.","estimatedClassWorkload":"5-10 hours\/week","recommendedBackground":"This is a tough issue. &nbsp;I do not believe in prerequisites, except for a sense of curiosity and an attitude. Having said that, a comfort level with algebra and numbers and an exposure to Accounting and Statistics will help. This course is an advanced course and the last in a sequence of four courses. You will therefore benefit greatly from taking the first three courses of the Specialization. In fact, I hope the class will motivate you to learn more outside the structure of the class. &nbsp;I believe that learning usually happens when you are motivated by a curiosity to understand something.","links":{}}