{"id":3420,"shortName":"valuationproject","name":"Valuation Capstone","language":"en","shortDescription":"This is Capstone Project that is the natural culmination of the Specialization and offers qualified learners to apply their knowledge to analyze a real company or complex project. It will reflect the most salient features of the real world that you are likely to confront.","aboutTheCourse":"This Capstone Project is designed with the specific purpose of showcasing both the science and the art of financial analysis. It is the natural end to a Specialization that is designed to start with the building blocks of finance, followed by a modification of the framework to incorporate the complexity of regulations and the tax code and ending with a capstone-like experience in the last course with rich applications to complex projects and companies. The Capstone Project is therefore a natural end to the Specialization and will involve a detailed valuation analysis of a project or a company.","targetAudience":1,"courseSyllabus":"<p>There is no syllabus for the Capstone Project.\nIt will however require the learner to have a thorough knowledge of all four\ncourses that form part of the Specialization. In fact, the project is\naccessible to only those learners who have obtained Course Certificates in all four courses to ensure that they are well prepared to\nattempt the project. As they&nbsp;work their way through the four courses, learners will also be expected to develop the ability to seek out resources\nbeyond those provided in the Specialization.<\/p>","courseFormat":"The Capstone Project has an open-ended format, with the content of the four courses in the Specialization, combined by individual initiative and creativity, forming the foundation for addressing the issues presented in the project.","suggestedReadings":"The content of all four courses of the Specialization and other resources suggested in them.","estimatedClassWorkload":"5-10 hours\/week","recommendedBackground":"All learners are required to have successfully completed, and obtained Course Certificates in, all four courses in the Specialization.","links":{}}