{
    "id": 2336,
    "shortName": "contempindia",
    "name": "Contemporary India ",
    "language": "en",
    "shortDescription": "This course provides a sophisticated and intellectually challenging examination of the complexities of a modern and changing India in the twenty-first century.",
    "aboutTheCourse": "This course presents some important vignettes of a complex, highly diverse India that is also witnessing unprecedented changes since its formal independence in 1947 from Great Britain. The lectures revolve around social dimensions of change, the continuing influence of ancient texts on contemporary India, political democracy, economic transition from the state to the market, gender relations, India's economic globalisation and changing world view.<div><br>While one of the objectives is to capture the multifaceted process of change, the course also critically examines some of the tensions inherent in these changes. For example, how does gender inequality play itself out in a changing Indian society, how do the modernist conceptions of art entailing market valuation challenge the more socio-centric values found in South India, what are the politics linguistic identities, and how might India address its myriad development challenges such as poverty and unemployment.<br><\/div>",
    "targetAudience": 0,
    "courseSyllabus": "<strong>Week 1 - Modern India's History<\/strong><br><ul><li>Introduction<\/li><li>British Empire<\/li><li>Partition<\/li><li>India in 1947<\/li><\/ul><strong>Week 2 - Politics in India<\/strong><br><ul><li>Democracy in multi-ethnic setting<\/li><li>The successes<\/li><li>The conflicts<\/li><\/ul><strong>Week 3 - The Long Transition of India's Economy<\/strong><br><ul><li>State-led development<\/li><li>The orientation towards the market<\/li><li>Poverty<\/li><li>Unemployment and jobless growth<\/li><\/ul><strong>Week 4 - India's Foreign Policy<\/strong><br><ul><li>The power of ideas and nonalignment<\/li><li>The reality of power<\/li><li>Multi-alignment and capacity building<\/li><\/ul><strong>Week 5 - Feminist Politics in Contemporary India<\/strong><br><ul><li>Diverse and vibrant women's movement<\/li><li>The possibilities and paradoxes<\/li><li>Women's rights and gender inequalities<\/li><\/ul><strong>Week 6 - The Ramayana: Life of an Ancient Text in Modern India<\/strong><br><ul><li>Narratives, themes, traditions<\/li><li>Moral dilemmas<\/li><li>Contemporary relevance<\/li><\/ul><strong>Week 7 - Myths, Metaphors and Art in Contemporary India<\/strong><br><ul><li>Ethnography and artistic agency<\/li><li>Salience of myths on the political-economic culture<\/li><li>Existence of non-modern domains and its reflection in universalised capitalist ontology<\/li><\/ul>",
    "estimatedClassWorkload": "5-7 hours\/week",
    "recommendedBackground": "No specific prior knowledge is required. However, it would be helpful if students are aware of the socio political dynamics at play in contemporary India and keep themselves abreast with current affairs and debates in the country to fully appreciate the various dimensions and contours if the subject matter in the course.",
    "links": {

    }
}