{
    "id": 500,
    "shortName": "classicalcomp",
    "name": "Write Like Mozart: An Introduction to Classical Music Composition",
    "language": "en",
    "shortDescription": "This course introduces students to strategies for style writing of common practice European art music.  The issues of harmonic progression, voice leading, and texture are addressed in addition to relevant compositional concepts like repetition, variation, and elaboration.  The course aims to offer a creative space even within the restrictions of stylistic emulation.",
    "aboutTheCourse": "<div>This course aims to give students a set of approaches for composition in the style of Classical and Romantic era European art music.  The principles and skills in this course engage one as much as possible in the thinking of composers from those eras, giving the student compositional freedoms that composers of that era enjoyed.  The issues of harmonic progression, voice leading, and texture are addressed in addition to relevant compositional concepts such as common tones, leading tones, repetition, variation, and elaboration.<\/div><div><br><\/div><div>The course offers presentations, demonstrations, and exercises for self-<\/div><div>evaluation.  Assessment involves a variety of short compositions in common textures found during the 18th and 19th centuries.<\/div><div><br><\/div><div>This course assumes that the student has had exposure to the basic principles of tonal harmony, musicianship, and\/or some similar music theory introductory course.  Students should be fairly comfortable with roman numeral analysis or, at least, chord symbols and common harmonic progressions.  This course is not aimed exclusively at musicians with a classical music background.  Rock, pop, and jazz musicians might find this course interesting as a stylistic contrast to the genres they usually work in.<\/div>",
    "targetAudience": 0,
    "courseSyllabus": "Week 1: Chords in Classical Music, Voicing Chords, Basic Harmony Progressions, Voice Leading, Introduction to Texture<br><br>Week 2: Basic Progressions with Inversions, Voice Leading 2, Keyboard Voicing, Creating Accompaniment, Textural Reduction<br><br>Week 3: Sequential Progressions, Non-chord Tones<br><br>Week 4: Diatonic chord substitution, Cadences, Parallel Period Form, Melodic Writing Techniques<br><br>Week 5: Chromatic Substitution, 2-voice counterpoint<br><br>Week 6: Progressions within Progressions, Alberti Bass, Rounded Binary Form",
    "estimatedClassWorkload": "5-8 hours\/week",
    "recommendedBackground": "A background in basic music theory is needed.  This should include familiarity with the following:<br>1. key signatures;<br>2. meter, time signature;<br>3. reading treble and bass clefs;<br>4. rhythmic note value names and meanings (eighth, quarter, half, etc.)<br>5. reading of intervals (melodic and harmonic) up to a 10th.<br>6. Chord types: major, minor, diminished, 7th chords (Mm7, m7, diminished 7, etc.)<br>7. Basic roman numeral analysis: I-IV-V, etc.<br><br>",
    "links": {

    }
}