{"id":170,"shortName":"eqp","name":"Exploring Quantum Physics","language":"en","previewLink":"https:\/\/class.coursera.org\/eqp-003\/lecture\/preview","shortDescription":"An introduction to quantum physics with emphasis on topics at the frontiers of research, and developing understanding through exercise.","aboutTheCourse":"<p>Quantum\nphysics is the foundation for much of modern technology, provides the framework\nfor understanding light and matter from the subatomic to macroscopic domains,\nand makes possible the most precise measurements ever made.&nbsp; More than just a theory, it offers a way of\nlooking at the world that grows richer with experience and practice.&nbsp; Our course will provide some of that practice and teach \nyou \"tricks of the trade\" (not found in textbooks) that will enable you \nto solve quantum-mechanical problems yourself and understand the subject\n at a deeper level.<\/p>\n\n<p>The\nbasic principles of quantum physics are actually quite simple, but they lead to\nastonishing outcomes. &nbsp;Two examples that\nwe will look at from various perspectives are the prediction of the laser by\nAlbert Einstein in 1917 and the prediction of antimatter by Paul Dirac in 1928.&nbsp; Both of these predictions came from very\nsimple arguments in quantum theory, and led to results that transformed science\nand society.&nbsp; Another familiar\nphenomenon, magnetism, had been known since antiquity, but only with the advent\nof quantum physics was it understood how magnets worked, to a degree that made\npossible the discovery in the 1980’s of ultrastrong rare-earth magnets.&nbsp; However, lasers, antimatter and magnets are\nareas of vibrant research, and they are all encountered in the new field of\nultracold atomic physics that will provide much of the material of “Exploring\nQuantum Physics”.<\/p>\n\n<p>Richard\nFeynman once said, “I think I can safely say that nobody understands quantum\nmechanics.”&nbsp; We say, that’s no reason not\nto try! What Feynman was referring to are some of the “spooky” phenomena like quantum entanglement, which are incomprehensible from the standpoint of classical physics. Even though they have been thoroughly tested by experiment, and are even being exploited for applications such as cryptography and logic processing, they still seem so counterintuitive that they give rise to extraordinary ideas such as the many-world theory. Quantum physics combines\na spectacular record of discovery and predictive success, with foundational\nperplexities so severe that even Albert Einstein came to believe that it was\nwrong.&nbsp; This is what makes it such an\nexciting area of science!<\/p><br>","targetAudience":1,"courseSyllabus":"<br>Lecture 1: Introduction to quantum mechanics. Early experiments. Plane waves and wave-packets<br>\n\nLecture 2: Interpretation and foundational principles of quantum mechanics<br>Lecture 3: Feynman formulation of quantum theory.&nbsp;<br>\n\nLecture 4: Using Feynman path integral. Quantum-to-classical correspondence<br>Lecture 5: Back to the Schrödinger picture: bound states in quantum potential wells<br>\n\nLecture 6: Cooper pairing in the theory of superconductivity&nbsp;<br>Lecture 7: Harmonic oscillator. Solution using creation and annihilation operators<br>\n\nLecture 8: Classical and quantum crystals. Collective excitations in crystals - phonons<br>Lecture 9: Atomic spectra<br>Lecture 10:&nbsp;<span>Quantum theory: old and new&nbsp;&nbsp;<br><\/span>Lecture 11:&nbsp;Solving the Schrödinger equation<br>Lecture 12:&nbsp;Angular momentum and the Runge-Lenz vector<br>Lecture 13:&nbsp;Electrical properties of matter\n<br>Lecture 14:&nbsp;Gauge potentials, spin and magnetism<br>Lecture 15:&nbsp;Quantum gases, quantum cryptography and quantum games&nbsp;<br>Lecture 16: Topological states of quantum matter<br>","courseFormat":"<span>\n <span><span>\n  <span>\n  <p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n  \n  <\/p><p>The\n  class will consist of lecture videos, individually between 8 and 20 minutes\n  in length, with approximately two hours of lectures per week. These contain\n  1-2 integrated quiz questions per video. There will also be standalone\n  homework assignments that are not part of video lectures.<\/p>\n  <\/span>\n <\/span>\n<\/span><\/span>\n\n<p><\/p>","suggestedReadings":"<i> <a href=\"http:\/\/ukcatalogue.oup.com\/product\/9780199232710.do\" target=\"_blank\" title=\"Link: http:\/\/www.amazon.com\/Exploring-Quantum-Mechanics-Collection-Researchers\/dp\/0199232725\">Exploring Quantum Mechanics:<\/a><a href=\"http:\/\/ukcatalogue.oup.com\/product\/9780199232710.do\" target=\"_blank\"> <\/a><\/i><a href=\"http:\/\/ukcatalogue.oup.com\/product\/9780199232710.do\" target=\"_blank\" title=\"Link: http:\/\/www.amazon.com\/Exploring-Quantum-Mechanics-Collection-Researchers\/dp\/0199232725\"> A Collection of 700+ Solved \nProblems for Students, Lecturers, and Researcher<\/a><a href=\"http:\/\/ukcatalogue.oup.com\/product\/9780199232710.do\" target=\"_blank\">s<\/a>, by Victor Galitski, \nBoris Karnakov, Vladimir Kogan and Victor Galitski, Jr. (Oxford \nUniversity Press, 2013) ISBN-13:&nbsp;978-0199232727<br><br>A number of other readings of original scientific papers are encouraged during the course. Copies of those papers are provided in the online course materials, courtesy of the publishers. &nbsp;We thank the American Association for the Advancement of Science, the American Institute of Physics and the American Physical Society for giving free access to their copyright materials to students of \"Exploring Quantum Physics\". &nbsp;","instructor":"Charles W. Clark and Victor Galitski","estimatedClassWorkload":"5-7 hours\/week","recommendedBackground":"The purpose of this course is to provide a \ngraduate\/advanced undergraduate level introduction to&nbsp; quantum \nmechanics.&nbsp; The emphasis throughout the course will be on applications \nof general techniques to specific quantum-mechanical problems and \nphenomena. Basic understanding of calculus and linear algebra is \nessential for completing this course, and knowledge of differential \nequations and Fourier transforms is valuable. Previous exposure to \nquantum mechanics would be helpful, but is not assumed. The course will \nbe self-contained and an introduction will be provided.<br>","links":{}}