{"id":2258,"shortName":"etem","name":"Economics of Transition and Emerging Markets","language":"en","shortDescription":"Key economic and political challenges related to transition from the centrally planned economy to market system, history of market reforms in Central and Eastern Europe, former Soviet Union, Asia, Middle East, Africa and Latin America, the contemporary role of emerging-market economies in the global economy. ","aboutTheCourse":"<p>This course\nconcentrates on challenges faced by transition and emerging-market economies,\ni.e. middle- and low-income countries. It starts from a brief history of communist\neconomic system based on central planning in the former Soviet Union and Central\nand Eastern Europe, its evolution and collapse at the end of 1980s\/ early 1990s\nand subsequent transition to a market system in 1990s and 2000s. Then it\nanalyzes experience of market reforms in China, India, other Asian countries,\nMiddle East and North Africa, Sub-Saharan Africa and Latin America at the same\nperiod. Finally, it discusses the problems of contemporary global economy and\nglobal and regional economic governance with the special focus given to\nemerging-market economies and their role.&nbsp;<\/p>\n\n<span>Предмет курса\nконцентрируется на проблемах т.н. переходных экономик и формирующихся рынков.\nКурс начинается с краткой истории командной экономической системы основанной на\nцентральном планировании в СССР и странах Центральной и Восточной Европы, ее\nэволюции и распаде в конце 1980-тых и начале 1990-тых годов. Потом мы\nанализируем опыт рыночных реформ в Китае, Индии и других странах Азии, на\nБлижнем Востоке, Африке и Латинской Америке в тот же самый период. Наконец мы\nобсуждаем проблемы глобальной экономики и глобального и экономического\nуправления, с особым вниманием для экономик с формирующимися рынками и их роли.\n&nbsp;<\/span>&nbsp; &nbsp;&nbsp;","targetAudience":1,"courseSyllabus":"<p><strong>Week One: <\/strong>Introduction, origins of a centrally planned economy, its\nmajor characteristics, evolution, attempts of its reform and history of its\ncollapse, agenda of market transition in 1990s and its major components such as\nmacroeconomic stabilization, domestic and external liberalization, and\nprivatization (Parts 1-7)<\/p><p><strong>Week Two: <\/strong>Political economy of transition, controversies over a\ntransition strategy, and first results of transition (at the end of 1990s),\nmarket and democracy, interrelations between economic and political transition\nand the role of external actors in transition process (Parts 8-12)<\/p><p><strong>Week Three:<\/strong> The role of EU integration process in transition of\ncountries of Central and Eastern Europe, transition economies in early 2010s,\nspecifics of Chinese transition and its major stages, market reforms in other\nAsian countries (Vietnam, Laos, Cambodia, Myanmar, Mongolia, India) (Parts 13-17)<\/p><p><strong>Week Four: <\/strong>Market reforms in the Arab world (including the period of Arab\nSpring), Sub-Saharan Africa, Latin America, summary of emerging-market reforms\nsince 1980s (Parts 18-22)<\/p><p><strong>Week Five: <\/strong>Causes and consequences of emerging market-crises in 1980s\nand 1990s, impact of the global financial crisis of 2008-2009 on\nemerging-market economies, the increasing role of emerging-market economies in\nthe global economy (Parts 23-27)&nbsp;<\/p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<strong>Week\nSix: <\/strong>Consequences of globalization, changes in international financial\ninstitutions, emerging-market economies and global and regional trade systems\n(Parts 28-32)&nbsp; &nbsp;&nbsp;<br><\/p>","courseFormat":"The course consists of six video lectures, each of them divided into 5-7 video clips of 7-25 minutes length.&nbsp;Apart from watching\nvideo lectures participants are expected to read the recommended literature,\nfill the control tests and write one essay.&nbsp;","suggestedReadings":"","estimatedClassWorkload":"2-9 hours\/week","recommendedBackground":"Basic knowledge in Economics (both Macro- and\nMicroeconomics) and Political Science on the undergraduate level","links":{}}