{
    "id": 1953,
    "shortName": "sids",
    "name": "Pathways to climate change adaptation: the case of Small Island Developing States",
    "language": "en",
    "shortDescription": "This course provides an overview of climate change adaptation for the Small Island Developing States (SIDS) with a focus on the environmental perspective. It will present the key concepts regarding the issues of adaptation to climate change and the methodological tools needed to analyse challenges faced by SIDS, in order to propose sustainable solutions.",
    "aboutTheCourse": "<p>Climate change has already taken place, and it will continue to do for the foreseeable future. These changes present important challenges, but also opportunities, for humanity.&nbsp;<\/p><p>The focus of this\ncourse will be on adaptation. In other words, we will look at how each country\nmust assess their specific vulnerabilities to climate change, and the tools at\ntheir disposal for protecting the well-being, economy, and environment of its citizens.<\/p><p>\n\n<\/p><p>We will base our\nexamples on Small Island Developing States (SIDS). In such countries economic\nassets and population density occur primarily in coastal areas. As such, SIDS\ncountries are particularly vulnerable to two of the main predicted changes to\noccur with climate change: rising sea levels and increased intensity of storms.\nIn some cases, the combination of rising sea levels and exceptional storms can\nlead to the disappearance of high quality farmlands and the destruction of wetlands\nand human infrastructure that provide important ecosystem services.&nbsp;<\/p>\n\n<p><\/p><p>\n  At the end of this course launched by the United Nations Environment Programme (UNEP) and the University of Geneva (UNIGE) in collaboration with the joint UNDP\/UNEP National Adaptation Planning Global Support Programme (NAP-GSP), you will be able to:<\/p>\n<ol>\n  <li>Explain why countries will have to adapt to climate change and provide examples of what this could look like.<\/li>\n  <li>Explain why Small Island Developing States (SIDS) are particularly vulnerable to climate change.<\/li>\n  <li>Outline how to analyse climate risks and discuss why some countries are more vulnerable than others.<\/li>\n  <li>Discuss how adaptation can contribute to sustainable development goals.<\/li>\n<\/ol>\n<p>And last but not least, you will have the opportunity to create a network and exchange experiences and practices on the SIDS problematic and more largely on climate change adaptation topics.<\/p>\n<p><br>\n  Our speakers are experts coming from the academic world, international and non-governmental organisations. Among them are:<\/p>\n<ul>\n  <li>Prof. <strong>Martin Beniston<\/strong>: Climatologist, member of IPCC, director of the Institute for Environmental Sciences;<\/li>\n  <li>Dr. <strong>Arthur Dahl<\/strong>: Consulting ecologist, board of directors of Global Islands Network, retired Deputy Assistant Executive Director of UNEP;<\/li>\n  <li>Dr. <strong>Alexander Sandy Bisaro<\/strong>: Researcher at the Global Climate Forum in Berlin working on climate change vulnerability and adaptation, he is the co-author of PROVIA guidance;<\/li><li>Dr. <strong>Pradeep Kurukulasuriya<\/strong>: Head, Climate Change Adaptation, UN Development Programme (UNDP) - Global Environment Facility (GEF)<\/li><li>Mr. <strong>Angus Mackay<\/strong>: Head, Climate Change Programme, United Nations Institute for Training and Research (UNITAR);<br><\/li>\n  <li>Dr. <strong>Pascal Peduzzi<\/strong>: Director, UNEP\/GRID-Geneva, specialist in remote sensing and GIS.<\/li>\n<\/ul><br>Teaching staff (UNIGE\/UNEP) : Hy Dao,&nbsp;Martin Schlaepfer,&nbsp;Julien Forbat,&nbsp;Joris Zufferey,&nbsp;Nicole Efrancey Dao,&nbsp;Stéphanie Piffeteau, Mila Lomarda, Jibril Sijelmassi,&nbsp;Paula Daiana Ribeiro Ramos,&nbsp;Guillaume Rohat, Sergio Alameda<br><br>Teaching staff (UNITAR): Ilaria Gallo, Amrei Horstbrink<br>",
    "targetAudience": 0,
    "courseSyllabus": "<p><strong>Week 1.<\/strong> Introduction to climate change (Martin Beniston) <br>\n  <strong>Week 2.<\/strong> Focus on Small Island Developing States (SIDS) (Arthur Dahl) <br>\n  <strong>Week 3.<\/strong> How to identify vulnerabilities and solutions to climate change (Alexander Sandy Bisaro) <br>\n  <strong>Week 4.<\/strong> Integrating climate change adaptation in policy planning (Pradeep Kurukulasuriya &amp; Angus Mackay) <br>\n<strong>Week 5.<\/strong> Specific case studies related to RiVamp (Pascal Peduzzi) <br><\/p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><\/p><br><br><br>",
    "estimatedClassWorkload": "3-4 hours\/week",
    "recommendedBackground": "<p>This course does not require any prerequisites\nor special skills.&nbsp;<\/p>",
    "links": {}
}