{
    "id": 639,
    "shortName": "ccss-literacy1",
    "name": "Common Core in Action: Literacy in the Content Areas- Exploring Literacy Design Collaborative Template Tasks",
    "language": "en",
    "shortDescription": "Learn how to apply some of the tools from the Literacy Design Collaborative to incorporate Common Core literacy standards into your content area. In this course you will explore Literacy Design Collaborative Resources, create a teaching task, and develop a plan to use the task within classroom instruction.",
    "aboutTheCourse": "The Common Core State Standards are new and will challenge our students to show evidence of learning in new ways.  Instructional shifts are required, especially for teachers who must now incorporate literacy into content areas. Integrating the literacy standards can be difficult to do well. In this course you will have the support of a community and harness the power of collaboratively exchanging ideas with colleagues, as you design a teaching task (writing prompt) aligned with the Common Core.<br> <br>You will use a template from the Literacy Design Collaborative (LDC) to design a task that incorporates literacy into your content area and then create a brief plan for its use. These template tasks are a part of a much more in-depth LDC Module design and will serve to introduce you to the model and process.   <br><br>",
    "targetAudience": 3,
    "courseSyllabus": "<p>In the\nfirst section of this course, you will review the Common Core shifts and\nbe introduced to the Literacy Design Collaborative model. Then you will examine\nthe template tasks. Next you will learn what makes a quality task and design\none of your own. You'll also have opportunities to explore Literacy Design\nCollaborative resources to support your learning of the model. Finally you will\neither revise the task you previously wrote or design a new one, based on\nfeedback from your peers, and then create a brief plan of how you could use\nyour task.<\/p>\n\n<p> <\/p>\n\n<p>Throughout\nthis course you will explore resources and watch video excerpts that describe\nthe Literacy Design Collaborative model and teachers' experiences with its\nimplementation.<\/p>\n\n\n\n\n\n<br>",
    "estimatedClassWorkload": "2-4 hours\/week",
    "recommendedBackground": "4-12 grade classroom teachers in the United States interested in implementing strategies aligned to the Common Core State Standards in their content areas.<br>",
    "links": {

    }
}