{"id":290,"shortName":"analysenumerique","name":"Analyse numérique pour ingénieurs","language":"fr","shortDescription":"Ce cours contient les 7 premiers chapitres d'un cours donné aux étudiants bachelor de l'EPFL. Il est basé sur le livre \"Introduction à l'analyse numérique\", J. Rappaz M. Picasso, Ed. PPUR. Des outils de base sont décrits dans les 5 premiers chapitres. Les deux derniers chapitres abordent la question de la résolution numérique d'équations différentielles. \n","aboutTheCourse":"L'analyse numérique fait partie de ce que l'on appelle aujourd'hui \"Scientific Computing\" ou encore \"Computational Sciences\". Il s'agit de faire des simulations numériques de phénomènes complexes, par exemple l'écoulement autour d'un avion, le retrait passé ou futur d'un glacier, ou encore des effets spéciaux pour l'industrie du cinéma. <br><br>Le cheminement permettant d'obtenir une simulation numérique est le suivant.<br><span><br>\n\n<ul><li>Dérivation d'un modèle mathématique. Par exemple, dans le cas de la chute d'un corps, les équations de Newton \"masse x accéleration = forces\" permettent d'obtenir une équation différentielle, à laquelle il faut ajouter une condition initiale sur la position et sur la vitesse du corps.<\/li>\n<br>\n<li>Analyse mathématique : le modèle mathématique obtenu est-il bien posé ? Par exemple, l'existence d'une solution unique de l'équation différentielle demande que certaines conditions sur les forces soient satisfaites.<br><\/li>\n<br>\n<li>Analyse numérique : en général, la solution du modèle mathématique ne peut pas être obtenue de manière explicite. Il convient d'utiliser un algorithme permettant d'approcher la solution grâce à un ordinateur. Dans la mesure du possible on souhaite quantifier l'erreur entre la solution du modèle mathématique (que l'on ne connait pas) et son approximation numérique (que l'on va calculer sur un ordinateur). Pour le choix de l'algorithme, on tiendra compte du nombre d'opérations nécessaire au calcul de la solution approchée.<\/li>\n<br>\n<li>Implémentation sur ordinateur (programmation).<\/li>\n<br>\n<li>Tests, validation et comparaison avec l'expérience ou d'autres résultats numériques.<br><\/li><\/ul><\/span>","targetAudience":0,"courseSyllabus":"Nous allons étudier les chapitres suivants du livre  \"Introduction à l'analyse numérique\", J. Rappaz M. Picasso, Ed. <a href=\"http:\/\/www.ppur.com\/en\/product\/340\/9782880748517\/Introduction%20a%20lanalyse%20numerique\"> PPUR<\/a> :<br><span><br><ul><li>Chapitre 1 : interpolation, comment approcher une fonction par un polynôme ?<\/li><li>Chapitre 2 : comment approcher numériquement des dérivées par des formules de différences finies ?<\/li><li>Chapitre 3 : comment approcher numériquement des intégrales par des formules de quadrature ?<\/li><li>Chapitres 4,5,6 : comment résoudre des (grands) systèmes linéaires ? Seules les méthodes directes seront abordées.<\/li><li>Chapitre 8 : comment résoudre des équations et systèmes d’équations nonlinéaires ?<\/li><li>Chapitre 9 : comment approcher numériquement la solution d’une équation différentielle (problème à valeur initiale) ?<\/li><li>Chapitre 10 : comment approcher numériquement la solution d’un \nproblème aux limites unidimensionnel par une méthode de différences \nfinies ?<\/li><\/ul><\/span><br><br>","courseFormat":"Chaque chapitre correspond à 6-8 vidéos de 5-10 minutes suivies de quiz, ainsi que d'un \"assignment\" (exercice théorique et\/ou expérience numérique avec matlab\/octave) qui sera corrigé. Un examen sous forme de Questionnaire a Choix Multiple clôturera le cours.<br>","suggestedReadings":" \"Introduction a l'analyse numérique\", J. Rappaz M. Picasso, Ed.<a href=\"http:\/\/www.ppur.com\/en\/product\/340\/9782880748517\/Introduction%20a%20lanalyse%20numerique\"> PPUR<\/a>","instructor":"Marco Picasso","estimatedClassWorkload":"4-6 hours\/week","recommendedBackground":"<ul>\n<li>Cours d'analyse et d'algèbre linéaire de première année.<\/li>\n<li>Installer <a href=\"http:\/\/www.mathworks.com\/products\/matlab\"> matlab <\/a> ou <a href=\"http:\/\/wiki.octave.org\"> octave <\/a> sur son ordinateur. La compagnie Mathworks fournira un lien pour installer gratuitement matlab pendant la durée du MOOC.\nVous pouvez cliquez <a href=\"http:\/\/sourceforge.net\/projects\/octave\/files\/Octave%20Windows%20binaries\/Octave%203.4.3%20for%20Windows%20MinGW%20Installer\/Octave3.4.3_gcc4.5.2-install.exe\/download\"> ici <\/a> pour installer octave sous windows).<\/li>\n<\/ul>","links":{}}