{
    "id": 1980,
    "shortName": "personalfinance",
    "name": "Financial Planning for Young Adults",
    "language": "en",
    "shortDescription": "This course provides an introduction to basic financial planning topics and is targeted towards young adults. General topics include financial goal setting, saving and investing, budgeting, financial risk, borrowing, and credit. In addition, the course includes content which introduces students to career opportunities in financial planning.",
    "aboutTheCourse": "<p>Financial Planning for Young Adults (FPYA), developed in partnership with the CFP Board, is designed to provide an introduction to basic financial planning concepts for young adults. The FPYA course is organized across seven separate modules, which are intended to be completed at a rate of approximately one week per module. Topics covered include financial goal setting, saving and investing, budgeting, financial risk, borrowing and credit. Because financial planning is such a personal topic, you will be encouraged to define your own financial goals and objectives while we discuss concepts and provide tools which can be applied in helping you reach those goals.  <\/p>\n\n<p>Within each module, you will view a combination of traditional lecture style videos along with video vignettes that introduce financial topics for discussion among participants. The video vignettes provide a unique and exciting component to this course. Each vignette introduces a real-world scenario where financial decisions must be made and financial planning concepts can be applied. You will be challenged to think critically about each scenario and decide how you might come to a resolution if ever faced with a similar situation.<\/p>\n\n<p>Finally, the course also includes material throughout which is focused on career opportunities in financial planning, including video interviews with actual CFP® professionals and other professionals working in this exciting and growing career area. The final module in the class is devoted to the topic of financial planning as a career.<\/p>",
    "targetAudience": 0,
    "courseSyllabus": "<p>This course includes seven modules, designed to be completed at a rate of one week per module. The topics for each module are as follows:<\/p>\n\n<p><b>Module 1: <\/b>Setting Financial Goals and Assessing Your Situation<\/p>\n<p><b>Module 2: <\/b>Saving Strategies<\/p>\n<p><b>Module 3: <\/b>Long-term Savings and Investment<\/p>\n<p><b>Module 4: <\/b>Budgeting and Cash Flow Management<\/p>\n<p><b>Module 5: <\/b>Risk Management<\/p>\n<p><b>Module 6: <\/b>Borrowing and Credit<\/p>\n<p><b>Module 7: <\/b>Financial Planning as a Career<\/p>",
    "estimatedClassWorkload": "5-6 hours\/week",
    "recommendedBackground": "None—all are welcome!",
    "links": {}
}